#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьЗапросДинамическогоСписка();	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ТекущийОбъект.Завершен Тогда
		Элементы.ДекорацияСтатус.Заголовок = "Завершен";
	Иначе
		Элементы.ДекорацияСтатус.Заголовок = "Активен";
	КонецЕсли;
	
	ПараметрыАвтоматическогоСценария = ТекущийОбъект.ДополнительныеПараметры.Получить();
	ПараметрыАвтоматическогоСценария.Свойство("Основание", ЭтаФорма.Основание);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьЗапросДинамическогоСписка()
	ЭтаФорма.Действия.ТекстЗапроса = ТекстЗапросаДинамическогоСписка();
	ЭтаФорма.Действия.Параметры.УстановитьЗначениеПараметра("АвтоматическийСценарий", Запись.АвтоматическийСценарий);
	ЭтаФорма.Действия.Параметры.УстановитьЗначениеПараметра("ID", Запись.ID);	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаДинамическогоСписка()
	// BSLLS:QueryParseError-off
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЖурналВыполненияАвтоматическихСценариев.Период КАК Период,
		|	ЖурналВыполненияАвтоматическихСценариев.Действие КАК Действие,
		|	ЖурналВыполненияАвтоматическихСценариев.Статус КАК Статус
		|ИЗ
		|	РегистрСведений." + МодульКода("РегистрыСведений.АвтоматическиеСценарииЖурнал").ИмяОбъекта() + " КАК ЖурналВыполненияАвтоматическихСценариев
		|ГДЕ
		|	ЖурналВыполненияАвтоматическихСценариев.АвтоматическийСценарий = &АвтоматическийСценарий	
		|  	И ЖурналВыполненияАвтоматическихСценариев.ID = &ID
		|";
	// BSLLS:QueryParseError-on
    Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода // &НаСервереБезКонтекста
#КонецОбласти
