
Процедура ESD_ПриНачалеРаботы(Кеш = Неопределено) Экспорт
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ESD_ПриНачалеРаботыСервер(Кеш);
	Если Не Кеш["ЕстьДоступКФункционалуESD"] Тогда
		Возврат;
	КонецЕсли;
	
	ПриАвторизацииПользователя(Кеш);
КонецПроцедуры

Процедура ESD_ПослеАвторизацииПользователя(Кеш = Неопределено) Экспорт
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ESD_ПослеАвторизацииПользователя(Кеш);
	ПриАвторизацииПользователя(Кеш);
КонецПроцедуры

Функция ESD_ПередОткрытиемФормы(ПараметрыПроверки = Неопределено) Экспорт
	ПараметрыПроверки_ = Новый Структура("ПроверитьДоступ, ПроверитьПервичнуюИнициализацию", 
		Истина, Истина);
	Если ТипЗнч(ПараметрыПроверки) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПроверки_, ПараметрыПроверки);
	КонецЕсли;

	Результат = Истина;
	
	Если ПараметрыПроверки_.ПроверитьДоступ Тогда
		Результат = ESD_ФункционалДоступен(Истина);
	КонецЕсли;

	Если Результат И ПараметрыПроверки_.ПроверитьПервичнуюИнициализацию Тогда
		Результат = ESD_ПервичнаяИнициализацияПройдена(Истина);
	КонецЕсли;

	Возврат Результат;
КонецФункции

Функция ESD_ФункционалДоступен(ВызыватьИсключение = Ложь) Экспорт
	Результат = ESD_ТНОбщегоНазначенияСервер.ESD_ЕстьДоступКФункционалу();
	Если ВызыватьИсключение И Не Результат Тогда
		ВызватьИсключение "Для работы с функционалом Saby ESD требуется наличие как минимум одной из следующих ролей:
			| - Администратор системы
			| - Полные права
			| - ESD_ПолныеПрава
			| - ESD_СтандартныеПрава
			| - ESD_ЭкспортныеКоманды";
	КонецЕсли;

	Возврат Результат;
КонецФункции

Функция ESD_ПервичнаяИнициализацияПройдена(ПройтиПриОтсутствии = Ложь) Экспорт 
	Результат = ESD_ТНОбщегоНазначенияСервер.ЗначениеКонстанты("ESD_ПройденаПервичнаяИнициализация", Ложь);
	Если Не Результат И ПройтиПриОтсутствии Тогда
		ПроверкаДанныхАутентификации = Новый ОписаниеОповещения("ESD_ОбработкаРезультатаЗакрытияФормыАвторизации", 
			ESD_ТНОбщегоНазначенияКлиент);
		АвторизацияSaby(Неопределено, Неопределено, ПроверкаДанныхАутентификации);
	КонецЕсли;

	Возврат Результат;
КонецФункции  

Процедура ESD_ОбработкаРезультатаЗакрытияФормыАвторизации(Результат, Параметры) Экспорт	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	ESD_ТНОбщегоНазначенияСервер.ESD_ПослеПервичнойИнициализации();
	ESD_ПослеАвторизацииПользователя();		
КонецПроцедуры

