
// Заполнение строки табличной части "Дополнительные поля" из полученных данных
//
// Параметры:
//	ТекущаяСтрока - Произвольно - коллекция полей заполнения
//	ДанныеЗаполнения - Произвольно - коллекция данных заполнения
//
Процедура ДополнительныеПоля_ЗаполнитьСтрокуТаблицы(ТекущаяСтрока, ДанныеЗаполнения) Экспорт
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ДанныеЗаполнения, "Наименование,Направление,Идентификатор,Тип,ПроверятьЗаполнение");
	ТекущаяСтрока.СписокВыбора.Очистить();
	Для Каждого Строка_ Из ДанныеЗаполнения.СписокВыбора Цикл	
		НоваяСтрокаСпискаВыбора = ТекущаяСтрока.СписокВыбора.Добавить();
		НоваяСтрокаСпискаВыбора.Значение = Строка_.Значение;
	КонецЦикла;	
КонецПроцедуры 

