
// Возвращает имя добавленной страницы для работы с функционалом "Дополнительные поля"
//
// Возвращаемое значение:
//	Строка - имя страницы
Функция ДополнительныеПоля_ИмяСтраницы() Экспорт
	Возврат "ESD_ДополнительныеПоля_Страница";
КонецФункции

// Возвращает имя основного реквизита для работы с функционалом "Дополнительные поля"
//
// Возвращаемое значение:
//	Строка - имя реквизита
Функция ДополнительныеПоля_ИмяРеквизита() Экспорт
	Возврат "ESD_ДополнительныеПоля_ТабличнаяЧасть";
КонецФункции

// Возвращает описание под выбранный тип "доп. поля"
//
// Параметры:
//	СтрТип - Строка - выбранный тип
//
// Возвращаемое значение:
//	ОписаниеТипов - описание типа
//
Функция ДополнительныеПоля_ОписаниеТипа(Знач СтрТип) Экспорт
	СтрТип = НРег(СокрЛП(СтрТип));
	Если СтрТип = "строка" Тогда
		Результат = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000));
	ИначеЕсли СтрТип = "число" Тогда
		Результат = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой));
	ИначеЕсли СтрТип = "булево" Тогда
		Результат = Новый ОписаниеТипов("Булево");
	ИначеЕсли СтрТип = "дата" Тогда
		Результат = Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

