
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Переопределяемый_ПриСозданииНаСервере();
	НастройкаВидимостиЭлементовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ЗагрузитьАктуальныйСтатусВерсии();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ОбработатьОповещенияДляФормы(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДинСписокДокументов_ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ESD_ТНОбщегоНазначенияКлиент.ОткрытьДокументРасширенияЭПД(
				ВыбраннаяСтрока, "ESD_ПутевойЛист", Найти(Нрег(Элемент.ТекущиеДанные.Комментарий), "форматно-логический контроль")>0);
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Тип,
		"Направление");
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновлениеНажатие(Элемент)
	
	ПроцедураПослеЗапускаПриложения = Новый ОписаниеОповещения("ПослеЗапускаПриложения", ЭтаФорма);
	НачатьЗапускПриложения(ПроцедураПослеЗапускаПриложения, Элемент.Подсказка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Просмотрено(Команда)
	
	МассивДокументов = МодульКода("ESD_ТНОбщегоНазначенияКлиент").ДокументыДляОбработки(ЭтаФорма);
	ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.СбросСтатусаНеПросмотрено", МассивДокументов);
	ОповеститьОбИзменении(Тип("ДокументСсылка." + ПутевойЛист()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИзмененныхДокументов(Команда)
	
	УстановленОтборИзмененныхДокументов = Не УстановленОтборИзмененныхДокументов;
	Если УстановленОтборИзмененныхДокументов Тогда		
		Значение = Ложь;		
	Иначе		
		Значение = Неопределено;		
	КонецЕсли;
		
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Значение,
		"Просмотрен");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДокументовСОшибками(Команда)
	
	УстановленОтборДокументовСОшибками = Не УстановленОтборДокументовСОшибками;
	Если УстановленОтборДокументовСОшибками Тогда		
		Значение = Истина;		
	Иначе		
		Значение = Неопределено;		
	КонецЕсли;
		
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Значение,
		"ЕстьОшибки");
	
КонецПроцедуры
	
&НаКлиенте
Процедура ВыгрузитьВСбис(Команда)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, Команда.Имя + "ИзСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументИзСбис(Команда)
			
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ОбновитьДокументыСБИС(ЭтаФорма, Команда.Имя, ПутевойЛист());
			
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументИзСбисЗаПериод(Команда)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ОбновитьДокументыЗаПериод(ЭтаФорма, "ОбновитьДокументИзСбис", Истина);

КонецПроцедуры

#Область Печать

&НаКлиенте
Процедура Печать(Команда)
	ПечатьДокумента(Команда);
КонецПроцедуры

&НаКлиенте
Процедура Печать_ВыборПечатнойФормы(Команда)
	ПечатьДокумента(Команда, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВложенияВ1С(Команда)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ЗагрузитьАрхивДокумента(ЭтаФорма, Истина);
	ОповеститьОбИзменении(ЭтаФорма.Элементы.Список.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура МассовоеСоздание(Команда)
	
	// Типы основания
	ЗаполнитьСписокОснованийПутевогоЛиста();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДокумента",          "ESD_ПутевойЛист");
	ПараметрыФормы.Вставить("МножественноеСоздание", Истина);
	
    МодульКода("ESD_ТНОбщегоНазначенияКлиент").ВыбратьТипДокументаОснования(ЭтаФорма, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаОповещений

&НаКлиенте
Процедура ОбработатьОповещениеВыполнитьПереходНаФорме(ПараметрыПерехода = Неопределено) Экспорт
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, "ОбновитьАктивныйЭтап");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОповещениеВыход() Экспорт
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДинСписокДокументов_УстановитьНастройки(ЭтаФорма);
КонецПроцедуры

#КонецОбласти // ОбработкаОповещений

&НаКлиенте
Процедура ПослеЗапускаПриложения(Результат, ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОснованийПутевогоЛиста()

	// Заполнить список оснований для Путевого листа
	Если ЭтоУниверсальноеРасширение() Тогда
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ОграничитьТипыДокументовОснований(ЭтаФорма);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДокумента(Команда, ВыборПечатнойФормы = Ложь)
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ПечатьДокумента(ЭтаФорма, Команда.Имя, "", Истина, ВыборПечатнойФормы);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПрименитьДополнительныеПрава(Результат) Экспорт
	
	ЭтаФорма.Элементы.ГруппаОбновление.Видимость = Результат.СкачиваниеОбновления;
	
КонецПроцедуры

&НаСервере
Процедура НастройкаВидимостиЭлементовНаСервере()
	ЭлементДоступен = ПравоДоступа("Редактирование", Метаданные.Документы.ESD_ПутевойЛист);
	Элементы.ФормаЗагрузитьВСбис.Видимость = ЭлементДоступен;
	Элементы.ФормаОбновитьДокументИзСбис.Видимость = ЭлементДоступен;
	Элементы.ФормаОбновитьДокументИзСбисЗаПериод.Видимость = ЭлементДоступен;
	Элементы.ФормаЗагрузитьВложенияВ1С.Видимость = ЭлементДоступен;
	Элементы.ФормаМассовоеСоздание.Видимость = ЭлементДоступен;
КонецПроцедуры

#Область include_etrn_base_Document_ОбщийФункционал_ФормаСписка_ЗагрузитьАктуальныйСтатусВерсии
#КонецОбласти

#Область include_etrn_base_Document_ОбщийФункционал_ФормаСписка_Переопределяемый_ПриСозданииНаСервере
#КонецОбласти

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_etrn_base_Document_ОбщийФункционал_Подключаемые_ДлительныеОперации
#КонецОбласти

#Область include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере //&НаСервере
#КонецОбласти // include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // include_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область include_etrn_base_CommonModule_ОпределениеМодуляКода //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_etrn_base_CommonModule_Метаданные //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти // include_etrn_base_CommonModule_Метаданные
