#Область include_etrn_base_Document_ОбщийФункционал_ФормаСписка_ПеременныеФормы
#КонецОбласти // include_etrn_base_Document_ОбщийФункционал_ФормаСписка_ПеременныеФормы

#Область include_etrn_base_Document_ОбщийФункционал_ФормаСписка_ОбработчикиСобытийФормы
#КонецОбласти // include_etrn_base_Document_ОбщийФункционал_ФормаСписка_ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	ESD_ОбщийФункционалСервер.ДинСписокДокументов_ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ESD_ТНОбщегоНазначенияКлиент.ОткрытьДокументРасширенияЭПД(
		ВыбраннаяСтрока, 
		"ESD_ПутевойЛист");
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Тип,
		"Направление");
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновлениеНажатие(Элемент)
	
	ПроцедураПослеЗапускаПриложения = Новый ОписаниеОповещения("ПослеЗапускаПриложения", ЭтаФорма);
	НачатьЗапускПриложения(ПроцедураПослеЗапускаПриложения, Элемент.Подсказка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Просмотрено(Команда)
	МассивДокументов = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ДокументыДляОбработки(ЭтаФорма);
	ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.СбросСтатусаНеПросмотрено", МассивДокументов);
	ОповеститьОбИзменении(Тип("ДокументСсылка." + ПутевойЛист()));
КонецПроцедуры

&НаКлиенте
Процедура ОтборИзмененныхДокументов(Команда)
	
	УстановленОтборИзмененныхДокументов = Не УстановленОтборИзмененныхДокументов;
	Если УстановленОтборИзмененныхДокументов Тогда		
		Значение = Ложь;		
	Иначе		
		Значение = Неопределено;		
	КонецЕсли;
		
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Значение,
		"Просмотрен");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДокументовСОшибками(Команда)
	
	УстановленОтборДокументовСОшибками = Не УстановленОтборДокументовСОшибками;
	Если УстановленОтборДокументовСОшибками Тогда		
		Значение = Истина;		
	Иначе		
		Значение = Неопределено;		
	КонецЕсли;
		
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Значение,
		"ЕстьОшибки");
	
КонецПроцедуры
	
&НаКлиенте
Процедура ВыгрузитьВСбис(Команда)
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, Команда.Имя + "ИзСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументИзСбис(Команда)
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ОбновитьДокументыСБИС(ЭтаФорма, Команда.Имя, ПутевойЛист());		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументИзСбисЗаПериод(Команда)
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ОбновитьДокументыЗаПериод(ЭтаФорма, "ОбновитьДокументИзСбис", Истина);
КонецПроцедуры

&НаКлиенте
Процедура МассовоеСоздание(Команда)
	ПараметрыСоздания = ESD_ТНОбщегоНазначенияКлиент
		.ЗаполнениеНаОсновании_Параметры("Документ.ESD_ПутевойЛист", Истина);
	ESD_ТНОбщегоНазначенияКлиент.ЗаполнениеНаОсновании_ВыбратьТипОснования(ЭтаФорма, ПараметрыСоздания);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область include_etrn_base_Document_ПутевойЛист_DocumentForm_ФормаСписка_ДополнительныеКомандыSaby
#КонецОбласти // include_etrn_base_Document_ПутевойЛист_DocumentForm_ФормаСписка_ДополнительныеКомандыSaby

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаОповещений

&НаКлиенте
Процедура ОбработатьОповещениеВыполнитьПереходНаФорме(ПараметрыПерехода = Неопределено) Экспорт
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, "ОбновитьАктивныйЭтап");
КонецПроцедуры

&НаСервере
Процедура ОбработатьОповещениеВыход() Экспорт
	ESD_ОбщийФункционалСервер.ДинСписокДокументов_УстановитьНастройки(ЭтаФорма);
	SabyАккаунт_УстановитьЗаголовокНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработкаОповещений

&НаКлиенте
Процедура ПослеЗапускаПриложения(Результат, ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДокумента(Команда, ВыборПечатнойФормы = Ложь)
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ПечатьДокумента(ЭтаФорма, Команда.Имя, "", Истина, ВыборПечатнойФормы);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПрименитьДополнительныеПрава(Результат) Экспорт
	ЭтаФорма.Элементы.ГруппаОбновление.Видимость = Результат.СкачиваниеОбновления;
КонецПроцедуры

&НаСервере
Процедура НастройкаВидимостиЭлементовНаСервере()
	ЭлементДоступен = ПравоДоступа("Редактирование", Метаданные.Документы.ESD_ПутевойЛист);
	Элементы.ФормаЗагрузитьВСбис.Видимость = ЭлементДоступен;
	Элементы.ФормаОбновитьДокументИзСбис.Видимость = ЭлементДоступен;
	Элементы.ФормаОбновитьДокументИзСбисЗаПериод.Видимость = ЭлементДоступен;
	Элементы.ФормаЗагрузитьВложенияВ1С.Видимость = ЭлементДоступен;
	Элементы.ФормаМассовоеСоздание.Видимость = ЭлементДоступен;
КонецПроцедуры

#Область include_etrn_base_Document_ОбщийФункционал_ФормаСписка_ЗагрузитьАктуальныйСтатусВерсии
#КонецОбласти

#Область include_etrn_base_Document_ОбщийФункционал_ФормаСписка_Переопределяемый_ПриСозданииНаСервере
#КонецОбласти

Процедура SabyКоманды_ДобавитьНаФормуНаСервере()
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_etrn_base_Document_ОбщийФункционал_Подключаемые_ДлительныеОперации
#КонецОбласти

#Область include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере //&НаСервере
#КонецОбласти // include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // include_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область include_etrn_base_CommonModule_ОпределениеМодуляКода //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_etrn_base_CommonModule_Метаданные //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти // include_etrn_base_CommonModule_Метаданные

#Область SabyАккаунт

&НаСервере
Процедура SabyАккаунт_ПослеСменыНаСервере()
КонецПроцедуры

&НаСервере
Процедура ВыйтиНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьАктуальностьВерсии()
КонецПроцедуры

#КонецОбласти // SabyАккаунт

#Область include_etrn_base_Modules_ДополнительныйФункционал_SabyАккаунт_Форма_ОбработчикиЭлементовФормы
#КонецОбласти // include_etrn_base_Modules_ДополнительныйФункционал_SabyАккаунт_Форма_ОбработчикиЭлементовФормы

#Область include_etrn_base_Modules_ДополнительныйФункционал_SabyАккаунт_Форма_ОбработчикиОповещений
#КонецОбласти // include_etrn_base_Modules_ДополнительныйФункционал_SabyАккаунт_Форма_ОбработчикиОповещений

#Область include_etrn_base_Modules_ДополнительныйФункционал_SabyАккаунт_Форма_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_Modules_ДополнительныйФункционал_SabyАккаунт_Форма_СлужебныеПроцедурыИФункции

#Область includr_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ОтображениеОповещенийПользователя
#КонецОбласти // includr_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ОтображениеОповещенийПользователя

#Область includr_core_base_Авторизация_СменаАккаунта
#КонецОбласти // includr_core_base_Авторизация_СменаАккаунта

#Область includr_core_base_Helpers_ОписаниеОповещения
#КонецОбласти // includr_core_base_Helpers_ОписаниеОповещения

#Область includr_core_base_Helpers_ExtException //&НаКлиенте
#КонецОбласти // includr_core_base_Helpers_ExtException

#Область includr_core_base_Helpers_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти // includr_core_base_Helpers_ЛокализацияНазваниеПродукта

#Область includr_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти // includr_core_base_Helpers_РаботаСоСвойствамиСтруктуры

#Область includr_core_base_Helpers_ЗначениеВСтроку //&НаСервереБезКонтекста
#КонецОбласти // includr_core_base_Helpers_ЗначениеВСтроку

#Область includr_core_base_Helpers_КартинкиУспешноОшибка
#КонецОбласти // includr_core_base_Helpers_КартинкиУспешноОшибка

#Область includr_core_base_Helpers_ПрефиксПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти // includr_core_base_Helpers_ПрефиксПродукта

#Область includr_base_НазваниеПродукта
#КонецОбласти // includr_base_НазваниеПродукта

#Область include_base_Document_ОбщийФункционал_ФормаСписка_ОбработчикиКоманд
#КонецОбласти // include_base_Document_ОбщийФункционал_ФормаСписка_ОбработчикиКоманд 
