
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").УстановитьПараметрАккаунтаВСписке(Список);
	МодульКода("ESD_ТНОбщегоНазначенияСервер").УстановитьУсловноеОформлениеПоляДата(ЭтаФорма, "Список.Дата", "Дата");
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// обновление статуса версии в фоне
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДвоичныеДанныеОбработки", Неопределено);
	ДополнительныеПараметры.Вставить("НаКлиенте",               Ложь);
	ДополнительныеПараметры.Вставить("ОтветНаКлиенте",          Неопределено);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ВыполнитьКомандуСбис(
		ЭтаФорма, "АктуальныйСтатусВерсии", Неопределено, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбработатьОповещенияДляФормы(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Просмотрено(Команда)
	
	МассивДокументов = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ДокументыДляОбработки(ЭтаФорма);
	ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.СбросСтатусаНеПросмотрено", МассивДокументов);
	ОповеститьОбИзменении(Тип("ДокументСсылка." + ПутевойЛист()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИзмененныхДокументов(Команда)
	
	УстановленОтборИзмененныхДокументов = Не УстановленОтборИзмененныхДокументов;
	Если УстановленОтборИзмененныхДокументов Тогда		
		Значение = Ложь;		
	Иначе		
		Значение = Неопределено;		
	КонецЕсли;
		
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Значение,
		"Просмотрен");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВСбис(Команда)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументИзСбис(Команда)
			
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбновитьДокументыСБИС(ЭтаФорма, Команда.Имя, ПутевойЛистКлиент());
			
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументИзСбисЗаПериод(Команда)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбновитьДокументыЗаПериод(ЭтаФорма, "ОбновитьДокументИзСбис", Истина);

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПечатьДокумента(ЭтаФорма, Команда.Имя, "", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Тип,
		"Направление");
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновлениеНажатие(Элемент)
	
	ПроцедураПослеЗапускаПриложения = Новый ОписаниеОповещения("ПослеЗапускаПриложения", ЭтаФорма);
	НачатьЗапускПриложения(ПроцедураПослеЗапускаПриложения, Элемент.Подсказка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаОповещений

&НаКлиенте
Процедура ОбработатьОповещениеВыполнитьПереходНаФорме() Экспорт
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, "ОбновитьАктивныйЭтап");
	
КонецПроцедуры

#КонецОбласти // ОбработкаОповещений

&НаКлиенте
Процедура ПослеЗапускаПриложения(Результат, ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере 
#КонецОбласти // include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область include_etrn_base_CommonModule_Метаданные
#КонецОбласти // include_etrn_base_CommonModule_Метаданные

#Область include_etrn_base_CommonModule_МетаданныеКлиент
#КонецОбласти // include_etrn_base_CommonModule_МетаданныеКлиент
