
// Формирование структуры параметров загрузки архива вложений
//
// Параметры:
//  УникальныйИдентификатор 	- УникальныйИдентификатор	- уникальный идентификатор формы
//  ЭтоФормаСписка 				- Булево 					- если печать из формы списка
//
// Возвращаемое значение:
//   Структура - Параметры загрузки архива вложений
//
Функция ПараметрыЗагрузкиАрхиваВложений(УникальныйИдентификатор, 
	ЭтоФормаСписка = Ложь
) Экспорт
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	РезультатФункции.Вставить("ЭтоФормаСписка",          ЭтоФормаСписка);
	
	Возврат РезультатФункции;
КонецФункции

