
&НаСервере
Процедура ЗаполнитьДополнительныеДанныеЮрЛица(ИмяРоли)
	ОбновитьАдресаПогрузкиВыгрузкиНаСервере(ИмяРоли);
	ЗаполнитьИныхПолучателейНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИныхПолучателейНаСервере()
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ДанныеЮрЛиц.Роль КАК Роль,
	|	ДанныеЮрЛиц.ИНН КАК ИНН,
	|	ДанныеЮрЛиц.КПП КАК КПП
	|ПОМЕСТИТЬ ДанныеЮрЛицДокумента
	|ИЗ
	|	&ДанныеЮрЛиц КАК ДанныеЮрЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ESD_ТранспортнаяНакладная.Ссылка КАК Ссылка,
	|	ESD_ТранспортнаяНакладная.МоментВремени КАК МоментВремени,
	|	ESD_ТранспортнаяНакладная.Дата КАК Дата	
	|ПОМЕСТИТЬ ОтправленныеДокументыЗаПериод
	|ИЗ
	|	РегистрСведений.ESD_Состояние КАК ESD_Состояние
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ESD_ТранспортнаяНакладная КАК ESD_ТранспортнаяНакладная
	|		ПО ESD_Состояние.Объект = ESD_ТранспортнаяНакладная.Ссылка
	|			И (ESD_ТранспортнаяНакладная.МоментВремени < &МоментВремениДокумента)
	|			И (ESD_ТранспортнаяНакладная.Дата >= &ДатаОграниченияПолученияДокументов)
	|			И (ESD_Состояние.UID <> """""""")
	|			И (ESD_ТранспортнаяНакладная.Направление = ЗНАЧЕНИЕ(Перечисление.ESD_Направление.Исходящий))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтправленныеДокументыЗаПериод.Ссылка КАК Ссылка,
	|	ОтправленныеДокументыЗаПериод.МоментВремени КАК МоментВремени,
	|	ОтправленныеДокументыЗаПериод.Дата КАК Дата,
	|	ДанныеЮрЛицДокумента.Роль КАК Роль,
	|	ДанныеЮрЛицДокумента.ИНН КАК ИНН,
	|	ДанныеЮрЛицДокумента.КПП КАК КПП
	|ПОМЕСТИТЬ ESD_ТранспортнаяНакладнаяДанныеЮрЛиц
	|ИЗ
	|	ДанныеЮрЛицДокумента КАК ДанныеЮрЛицДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтправленныеДокументыЗаПериод КАК ОтправленныеДокументыЗаПериод
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ESD_ТранспортнаяНакладная.ДанныеЮрЛиц КАК ESD_ТранспортнаяНакладнаяДанныеЮрЛиц
	|			ПО ОтправленныеДокументыЗаПериод.Ссылка = ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.Ссылка
	|		ПО ДанныеЮрЛицДокумента.Роль = ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.Роль
	|			И ДанныеЮрЛицДокумента.ИНН = ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.ИНН
	|			И ДанныеЮрЛицДокумента.КПП = ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.КПП 	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.МоментВремени КАК МоментВремени,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.Ссылка КАК Ссылка,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.Дата КАК Дата
	|ПОМЕСТИТЬ ДокументыОтправителя
	|ИЗ
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц КАК ESD_ТранспортнаяНакладнаяДанныеЮрЛиц	
	|ГДЕ
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.Роль = ЗНАЧЕНИЕ(Перечисление.ESD_РолиКонтрагентов.Отправитель)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.МоментВремени КАК МоментВремени
	|ПОМЕСТИТЬ ДокументыПолучателя
	|ИЗ
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц КАК ESD_ТранспортнаяНакладнаяДанныеЮрЛиц
	|ГДЕ
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.Роль = ЗНАЧЕНИЕ(Перечисление.ESD_РолиКонтрагентов.Получатель)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыОтправителя.Ссылка КАК Ссылка,
	|	ДокументыОтправителя.Дата КАК Дата
	|ПОМЕСТИТЬ ДокументыОтправителяИПолучателя
	|ИЗ
	|	ДокументыОтправителя КАК ДокументыОтправителя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПолучателя КАК ДокументыПолучателя
	|		ПО ДокументыОтправителя.МоментВремени = ДокументыПолучателя.МоментВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ДокументыОтправителяИПолучателя.Дата) КАК Дата
	|ПОМЕСТИТЬ МаксДатаДокумента
	|ИЗ
	|	ДокументыОтправителяИПолучателя КАК ДокументыОтправителяИПолучателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ДокументыОтправителяИПолучателя.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ПоследнийДокументОтправителяИПолучателя 
	|ИЗ
	|	МаксДатаДокумента КАК МаксДатаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОтправителяИПолучателя КАК ДокументыОтправителяИПолучателя
	|		ПО МаксДатаДокумента.Дата = ДокументыОтправителяИПолучателя.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.Роль КАК Роль,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.ИНН КАК ИНН,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.КПП КАК КПП,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.ОГРН КАК ОГРН,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.СтруктураФИО КАК СтруктураФИО,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.Адрес КАК Адрес,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.АдресСтруктура КАК АдресСтруктура,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.СтранаРегистрации КАК СтранаРегистрации,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.КодФилиала КАК КодФилиала,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.Основание КАК Основание,
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.ИдентификаторЭДО КАК ИдентификаторЭДО
	|ИЗ
	|	Документ.ESD_ТранспортнаяНакладная.ДанныеЮрЛиц КАК ESD_ТранспортнаяНакладнаяДанныеЮрЛиц
	|ГДЕ
	|	ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.Ссылка В
	|			(ВЫБРАТЬ
	|				ПоследнийДокументОтправителяИПолучателя.Ссылка КАК Ссылка
	|			ИЗ
	|				ПоследнийДокументОтправителяИПолучателя КАК ПоследнийДокументОтправителяИПолучателя)
	|	И ESD_ТранспортнаяНакладнаяДанныеЮрЛиц.Роль = ЗНАЧЕНИЕ(Перечисление.ESD_РолиКонтрагентов.ИнойПолучатель)
	|";
	Если СостоянияОбъектов() = "" Тогда
		ЗапросДанных.Текст = СтрЗаменить(
			ЗапросДанных.Текст,
			"ESD_Состояние.Объект = ESD_ТранспортнаяНакладная.Ссылка",
			"ESD_Состояние.ОбъектРасширения = ESD_ТранспортнаяНакладная.Ссылка");
		ЗапросДанных.Текст = СтрЗаменить(
			ЗапросДанных.Текст,
			"ESD_Состояние.UID <> """"",
			"ESD_Состояние.Идентификатор <> """"");
	КонецЕсли;
		
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ТранспортнаяНакладная", ТранспортнаяНакладная());
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_Направление",           Направление());
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_РолиКонтрагентов",      РолиКонтрагентов());
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_Состояние",             РегистрСостояний());
	
	СсылкаНаДокумент = Неопределено;
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Ссылка) Тогда
		СсылкаНаДокумент = ЭтаФорма.Объект.Ссылка;
	КонецЕсли;
	
	ДатаДокумента = ЭтаФорма.Объект.Дата;
	Если Не ЗначениеЗаполнено(ДатаДокумента) Или НачалоДня(ДатаДокумента) = ДатаДокумента Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЗапросДанных.УстановитьПараметр("ДанныеЮрЛиц",                        ЭтаФорма.Объект.ДанныеЮрЛиц.Выгрузить());
	ЗапросДанных.УстановитьПараметр("МоментВремениДокумента",             Новый МоментВремени(ДатаДокумента, СсылкаНаДокумент));
	// Дата ограничения нужна для того, чтобы не росло время выполнения запроса при росте количества документов.
	ЗапросДанных.УстановитьПараметр("ДатаОграниченияПолученияДокументов", ДобавитьМесяц(ТекущаяДатаСеанса(), - 3));
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ОтборИныхПолучателей = Новый Структура("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.ИнойПолучатель"));
	ИныеПолучатели = МодульТНОбщегоНазначенияКлиентСервер.НайтиСтрокиУниверсально(
		ЭтаФорма.Объект.ДанныеЮрЛиц, ОтборИныхПолучателей);
	
	Для Каждого СтрокаДляУдаления Из ИныеПолучатели Цикл
		ЭтаФорма.Объект.ДанныеЮрЛиц.Удалить(СтрокаДляУдаления);
	КонецЦикла;
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	Пока ВыборкаДанных.Следующий() Цикл
		СтрокаЮрЛица = ЭтаФорма.Объект.ДанныеЮрЛиц.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЮрЛица, ВыборкаДанных);
		СтрокаЮрЛица.КлючСтроки = МодульТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(ЭтаФорма.Объект, "ДанныеЮрЛиц");
	КонецЦикла;
	
	МодульТНОбщегоНазначенияКлиентСервер.ОбновитьЭлементыИныхПолучателей(ЭтаФорма);
КонецПроцедуры

