
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДобавитьПоляПредставления(Поля);
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление_ = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПредставлениеДокумента(Данные);
	Если ЗначениеЗаполнено(Представление_) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Представление_;
	КонецЕсли;
КонецПроцедуры

