
ДемоПродукт = Новый Структура();
ДемоПродукт.Вставить("Name", "tms");
ДемоПродукт.Вставить("App", "tms-carrier");
ДемоПродукт.Вставить("Caption", "Перевозчик");
ДемоПродукт.Вставить("Description", "Управление автопарком предприятия и перевозками");
ДемоПродукты.Добавить(ДемоПродукт);

ДемоПродукт = Новый Структура();
ДемоПродукт.Вставить("Name", "tms");
ДемоПродукт.Вставить("App", "tms-customer");
ДемоПродукт.Вставить("Caption", "Заказчик");
ДемоПродукт.Вставить("Description", "Все для обмена юридически значимыми документами с перевозчиком");
ДемоПродукты.Добавить(ДемоПродукт);

