
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок      = Параметры.Наименование;
	ЭтаФорма.ТолькоПросмотр = Параметры.ТолькоПросмотр;
	ЭтаФорма.Тип            = Параметры.Тип;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	Текст = СтрШаблон("%1 №%2 от %3",
				ЭтаФорма.Заголовок,
				ЭтаФорма.Номер,
				Формат(ЭтаФорма.Дата, "ДФ=dd.MM.yyyy"));
	
	ЭтаФорма.Наименование = Текст;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции