
&НаКлиенте
Функция ПроверитьНаличиеПараметровПодключенияНаСервере() Экспорт
	Возврат ESD_КомандыОбменаДляФормыКлиент.ПроверитьНаличиеПараметровПодключенияНаСервере();
КонецФункции

&НаКлиенте
Процедура ОткрытьВыборИзСписка(СписокВыбора, ОписаниеОповещения, ЭлементФормы = Неопределено, 
	ЗаголовокОкнаВыбора = "Выберите значение", 
	ТекЭлемСписка = 0
)
	#Если ВебКлиент Тогда
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, ЭлементФормы, ТекЭлемСписка);
	#ИначеЕсли ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
		ВыбранныйЭлемент = ВыбратьИзСписка(СписокВыбора, ЭлементФормы, ТекЭлемСписка); 
		ВыполнитьSabyОписаниеОповещения(ОписаниеОповещения, ВыбранныйЭлемент);	
	#Иначе
		СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, ЗаголовокОкнаВыбора, ТекЭлемСписка);		
	#КонецЕсли
КонецПроцедуры

&НаСервере
Функция SabyАккаунт_ОбработатьПараметрыПодключенияНаСервере(Знач ПараметрыАвторизации = Неопределено)
	РезультатФункции = Новый Структура("АвторизацияВыполнена", Ложь);
	РезультатФункции.Вставить("ФИО", "");
	РезультатФункции.Вставить("Сервис", "");
	РезультатФункции.Вставить("Аккаунт", "");
	
	Если ПараметрыАвторизации = Неопределено Тогда
		ПараметрыАвторизации = ESD_ТНОбщегоНазначенияСервер.ESD_ПараметрыАвторизацииПользователя();
	КонецЕсли;
	
	РезультатФункции.АвторизацияВыполнена = ESD_ТНОбщегоНазначенияСервер.ESD_АвторизацияПройдена(ПараметрыАвторизации.Сессия);			
	Если РезультатФункции.АвторизацияВыполнена Тогда
		Если ПараметрыАвторизации.Сессия.Свойство("UserFio") Тогда
			РезультатФункции.ФИО    = ПараметрыАвторизации.Сессия.UserFio;
			РезультатФункции.Сервис = ПараметрыАвторизации.Подключение.ApiUrl;	
		КонецЕсли;
		
		ПараметрыАвторизации.Сессия.Свойство("AccountTitle", РезультатФункции.Аккаунт);
	КонецЕсли;
	
	Возврат РезультатФункции;	
КонецФункции

&НаСервере
Процедура SabyАккаунт_УстановитьЗаголовокНаСервере(ДанныеПодключения = Неопределено, ПараметрыПодключения = Неопределено)
	Если ДанныеПодключения = Неопределено Тогда	
		ДанныеПодключения = SabyАккаунт_ОбработатьПараметрыПодключенияНаСервере(ПараметрыПодключения);
	КонецЕсли;
	Элементы.ДекорацияSabyАккаунт.Заголовок = ДанныеПодключения.Аккаунт;	
КонецПроцедуры

