
#Область ПеременныеФормы

// BSLLS:UnusedLocalVariable-off
&НаКлиенте
Перем ТранспортИнтеграции;
// BSLLS:UnusedLocalVariable-on

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ЭтоESD = ЭтоУниверсальноеРасширение();
	
	Если ПройденаПервичнаяИнициализация() Тогда
		ЗаполнитьИнтерфейсНастроек();
		АвторизацияРасширенияНаСервере();
	КонецЕсли;
	
	ЗаполнитьПоддерживаемыеКонфигурации();
	
	МодульКода("РегистрыСведений.ESD_НастройкаПравРасширения").НастроитьИнтерфейсФормы(ЭтаФорма);
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

#Область include_base_CommonForm_НастройкиЭПД_ОбновлениеВерсииОбработчикиСобытийФормы
#КонецОбласти // include_base_CommonForm_НастройкиЭПД_ОбновлениеВерсииОбработчикиСобытийФормы

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыгружатьАрхивВложенийПриИзменении(Элемент)
	
	ВыгружатьАрхивВложений();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьТоварыИзДокументовОснованийПриИзменении(Элемент)
	
	Если Не ЭтаФорма.ГруппироватьТоварыИзДокументовОснований Тогда
		ЭтаФорма.ГруппироватьВОднуПозицию            = Ложь;
		ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьПоРеквизитуНоменклатурыПриИзменении(Элемент)
	
	Если ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры Тогда
		ЭтаФорма.ГруппироватьВОднуПозицию = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитНоменклатурыПриИзменении(Элемент)
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьВОднуПозициюПриИзменении(Элемент)
	
	Если ЭтаФорма.ГруппироватьВОднуПозицию Тогда
		ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбщейПозицииПриИзменении(Элемент)
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСНИЛСПриИзменении(Элемент)
	
	СохранитьИспользованиеСНИЛС();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвторизацию(Элемент)
	
	Если Элементы.ДекорацияАвторизация.Заголовок = "Войти" Тогда
		ОткрытьФормуАвторизации();
	Иначе		
		ESD_ВыйтиНаСервере();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сессия и пароль сброшены";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновлениеНажатие(Элемент)
    // BSLLS:UsingSynchronousCalls-off
    ЗапуститьПриложение(Элемент.Подсказка);
    // BSLLS:UsingSynchronousCalls-on
КонецПроцедуры 

&НаКлиенте
Процедура ИспользоватьТранспортнаяНакладнаяПриИзменении(Элемент)
	ОбновитьЗначениеФункциональнойОпции(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПутевойЛистПриИзменении(Элемент)
	ОбновитьЗначениеФункциональнойОпции(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗаказНаПеревозкуПриИзменении(Элемент)
	ОбновитьЗначениеФункциональнойОпции(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТабельныйНомерПриИзменении(Элемент)
	
	СохранитьИспользованиеТабельногоНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНовыйРедакторПриИзменении(Элемент)
	
	ПроцедураПослеИзмененияИспользованияНовогоРедактора = Новый ОписаниеОповещения(
		"ПослеИзмененияИспользованияНовогоРедактора", ЭтаФорма);
	
	ПоказатьВопрос(
		ПроцедураПослеИзмененияИспользованияНовогоРедактора,
		"При переключении редактора все настройки сопоставлений будут сброшены к стандартным. Продолжить?",
		РежимДиалогаВопрос.ДаНет, ,
		КодВозвратаДиалога.Да,
		"Вы уверены, что хотите переключить редактор?");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтаКонфигурацияПриИзменении(Элемент)
	ПроверкаВозможностиЗагрузкиНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ЭтаКонфигурацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПроцедураПослеВопросаООчистке = Новый ОписаниеОповещения(
			"ПослеВопросаООчисткеНастроек", ЭтаФорма);
		
		ПоказатьВопрос(
			ПроцедураПослеВопросаООчистке,
			"Будут очищены все имеющиеся настройки сопоставлений, продолжить?",
			РежимДиалогаВопрос.ДаНет,
			120,
			КодВозвратаДиалога.Нет,
			"Очистить настройки сопоставлений?",
			КодВозвратаДиалога.Нет);
			
КонецПроцедуры

&НаКлиенте
Процедура ХранитьСтатусыВДопСведенияхПриИзменении(Элемент)
	
	СохранитьХранитьСтатусыВДопСведениях(ЭтаФорма.ХранитьСтатусыВДопСведениях);

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАккаунтНажатие(Элемент)
	СменитьАккаунтВВыпадающемСписке(Элемент);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкиДокументовОснований(Команда)
	
	ТекущаяКнопка = ЭтаФорма.ТекущийЭлемент;
	
	НастройкаВсехДокументовОснований(ТекущаяКнопка.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеНа242160(Команда)
	
	Результат = ОбновитьДанныеНа242160НаСервере();
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ?(Не Результат.ОК, Результат.ОписаниеОшибки, "Обновление данных на версию 24.2160 выполнен успешно");
	Сообщение.Сообщить();
	
КонецПроцедуры

#Область ОбработчикиРегламентныхЗаданий

&НаКлиенте
Процедура ИзменитьАктивностьРегЗаданияВыгрузки(Команда)
	ИзменитьАктивностьРегЗаданияНаСервере("ИспользуетсяРегламентВыгрузки", 
		ЭтаФорма.ИдентификаторРегламентВыгрузки);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАктивностьРегЗаданияЗагрузки(Команда)
	ИзменитьАктивностьРегЗаданияНаСервере("ИспользуетсяРегламентЗагрузки", 
		ЭтаФорма.ИдентификаторРегламентЗагрузки);	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеРегЗаданияВыгрузки(Команда)
	НастроитьРасписаниеРегламентногоЗадания(ЭтаФорма.ИдентификаторРегламентВыгрузки);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеРегЗаданияЗагрузки(Команда)
	НастроитьРасписаниеРегламентногоЗадания(ЭтаФорма.ИдентификаторРегламентЗагрузки);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗаданиеВыгрузки(Команда)
	ВыполнитьРегламентноеЗаданиеВручную(ЭтаФорма.ИдентификаторРегламентВыгрузки, "Выгрузка документов ЭПД");		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗаданиеЗагрузки(Команда)
	ВыполнитьРегламентноеЗаданиеВручную(ЭтаФорма.ИдентификаторРегламентЗагрузки, "Загрузка документов ЭПД");	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательФоновыхЗаданийПриИзменении(Элемент)
	ИзменитьПользователяРегламентныхЗаданийНаСервере();	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗагрузитьСправочникВидыУпаковки(Команда)
	
	РезультатЗагрузки = РезультатЗагрузкиСправочника("ESD_ВидыУпаковки");
	
	ПоказатьРезультатЗагрузкиСправочника(РезультатЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСправочникОпасныеГрузы(Команда)
	
	РезультатЗагрузки = РезультатЗагрузкиСправочника("ESD_ОпасныеГрузы");
	
	ПоказатьРезультатЗагрузкиСправочника(РезультатЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПервыйВход(Команда)
	
	ОткрытьФормуАвторизации();
		
КонецПроцедуры

&НаКлиенте
Процедура ЭПЛ_ПечатнаяФормаПриИзменении(Элемент)
	СохранитьНастройкиОбъекта("ESD_ПутевойЛист", Новый Структура("ПечатнаяФорма", ПечатнаяФормаЭПЛ));
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

#Область НастройкаИнтерфейсаФормы

&НаСервере
Процедура ОбновитьВидимостьИДоступностьЭлементов()
	Если ЭтоESD Тогда	
		ВыполненПервыйВход = ПройденаПервичнаяИнициализация();
		
		Элементы.ВыполнитьПервыйВход.Видимость = Не ВыполненПервыйВход;	
		Если Не ВыполненПервыйВход Тогда 
			НастройкаИнтерфейсаДляПервогоВхода();
			Возврат;
		КонецЕсли;				
	КонецЕсли;	
				
	НастроитьФункционалРегламентныхЗаданийНаСервере();
	
	ОбновитьВидимостьДоступностьЭлементовГруппировки(Истина);
	
	ОбновитьВидимостьПоФункциональнымОпциям();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнтерфейсНастроек()
	ЗагрузитьПараметрыГруппировки();
	
	НастройкиВыгружатьАрхивВложений();
	
	ЗагрузитьИспользоватьСНИЛС();
	
	ЗагрузитьИспользоватьТабельныйНомер();
	
	ЗаполнитьПользователейФоновыхЗаданий();
	
	ЗаполнитьНастройкиСопоставлений();
	
	ВывестиТекущуюВерсию();
	
	ИспользуемыйФункционал();
	
	ЗагрузитьХранитьСтатусыВДопСведениях();
КонецПроцедуры

&НаСервере
Процедура НастройкаИнтерфейсаДляПервогоВхода(ВходВыполнен = Ложь)
		
	МассивЭлементов = Новый Массив;
	
	МассивЭлементов.Добавить("ГруппаВходВыход");
	МассивЭлементов.Добавить("ГруппаВерсия");
	МассивЭлементов.Добавить("ГруппаРедакторИНИ");
	МассивЭлементов.Добавить("ГруппаИспользуемыйФункционал");
	
	МассивЭлементов.Добавить("ГруппаНачальноеЗаполнение");		
	МассивЭлементов.Добавить("ГруппаНастройкаДокументовОснований");
	МассивЭлементов.Добавить("ГруппаНастройкаГруппировки");
	МассивЭлементов.Добавить("ГруппаРегламентныеЗадания");
	МассивЭлементов.Добавить("ГруппаНастройкаСопоставлений");
	МассивЭлементов.Добавить("ГруппаИспользоватьСНИЛС");
	МассивЭлементов.Добавить("ГруппаИспользоватьТабельныйНомер");
	МассивЭлементов.Добавить("ГруппаХранениеСтатусов");
	МассивЭлементов.Добавить("ГруппаНастройкиВложенийИПечатныхФорм");
	
	МассивЭлементов.Добавить("ДекорацияПользователь");
	МассивЭлементов.Добавить("ДекорацияСервис");
	МассивЭлементов.Добавить("ГруппаАккаунт");
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", ВходВыполнен, МассивЭлементов);
	
КонецПроцедуры

#КонецОбласти // НастройкаИнтерфейсаФормы

#Область РегламентныеЗадания

&НаСервере
Процедура НастроитьФункционалРегламентныхЗаданийНаСервере()
	// Прерываем настройку, если ранее видимость была отключена
	Если Не Элементы.ГруппаРегламентныеЗадания.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Если СтандартныеРегламентныеЗаданияДоступны() Тогда
		УстановитьДанныеРегламентныхЗаданий();
		
		Элементы.НастроитьРасписаниеРегЗаданияЗагрузки.Видимость = ЗначениеЗаполнено(ЭтаФорма.ИдентификаторРегламентЗагрузки);
		Элементы.НастроитьРасписаниеРегЗаданияВыгрузки.Видимость = ЗначениеЗаполнено(ЭтаФорма.ИдентификаторРегламентВыгрузки);
		
		ОбновитьКнопкиИспользованияРегламентныхЗаданий();
		
		Элементы.ГруппаРегламентныеЗадания.Видимость = Истина;
	Иначе
		Элементы.ГруппаРегламентныеЗадания.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьАктивностьРегЗаданияНаСервере(Знач ИмяИндикатора, Знач Идентификатор)
	ТекущееЗначение = ЭтаФорма[ИмяИндикатора]; 
	
	НовоеЗначение = Не ТекущееЗначение;
	ПараметрыИзменения = Новый Структура("Использование", НовоеЗначение);
	
	Если Не ИзменитьРегламентноеЗаданиеНаСервере(Идентификатор, ПараметрыИзменения) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма[ИмяИндикатора] = НовоеЗначение;
	ОбновитьКнопкиИспользованияРегламентныхЗаданий();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеРегламентногоЗадания(Идентификатор)
	Расписание = РасписаниеРегламентногоЗаданияНаСервере(Идентификатор);
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Идентификатор", Идентификатор);
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	Диалог.Показать(Новый ОписаниеОповещения("ПослеНастройкиРасписанияРегЗадания", ЭтаФорма, ДопПараметры));
КонецПроцедуры

&НаКлиенте
Процедура ПослеНастройкиРасписанияРегЗадания(НовоеРасписание, ДопПараметры) Экспорт
	Если НовоеРасписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыИзменения = Новый Структура("Расписание", НовоеРасписание);
	ИзменитьРегламентноеЗаданиеНаСервере(ДопПараметры.Идентификатор, ПараметрыИзменения);
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеРегламентныхЗаданий()
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	РегламентныеЗаданияESD = МодульКода("ESD_РегламентныеЗаданияСервер").КоллекцияРегламентныхЗаданий();
	
	ЗаданиеЗагрузка = РегламентныеЗаданияESD["ЗагрузкаЭПД"];
	Если ЗаданиеЗагрузка <> Неопределено Тогда	
		ЭтаФорма.ИдентификаторРегламентЗагрузки  = ЗаданиеЗагрузка.УникальныйИдентификатор;
		ЭтаФорма.ИспользуетсяРегламентЗагрузки   = ЗаданиеЗагрузка.Использование;	
	КонецЕсли;
	
	ЗаданиеВыгрузка = РегламентныеЗаданияESD["ВыгрузкаЭПД"];
	Если ЗаданиеВыгрузка <> Неопределено Тогда	
		ЭтаФорма.ИдентификаторРегламентВыгрузки  = ЗаданиеВыгрузка.УникальныйИдентификатор;
		ЭтаФорма.ИспользуетсяРегламентВыгрузки   = ЗаданиеВыгрузка.Использование;	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОкончанииРучногоВыполненияРегламентногоЗадания()
	
	ОповещенияОбОкончанииВыполнения = ОповещенияОбОкончанииВыполненияРегламентныхЗаданий();
	
	Для каждого Оповещение Из ОповещенияОбОкончанииВыполнения Цикл
		
		Текст = НСтр("ru = 'Выполнена процедура регламентного задания';
			|en = 'Scheduled job procedure completed'");
		
		СтрокаДляПояснения = НСтр("ru = '%1.
			|Процедура завершена в фоновом задании %2';
			|en = '%1.
			|The scheduled job has been completed in the background job ""%2"".'");
		
		ТекстПояснения = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
			СтрокаДляПояснения,
			Оповещение.ПредставлениеРегламентногоЗадания,
			Строка(Оповещение.МоментОкончания));
		
		ПоказатьОповещениеПользователя(
			Текст,
			,
			ТекстПояснения,
			БиблиотекаКартинок.ВыполнитьРегламентноеЗаданиеВручную);
		
	КонецЦикла;
	
	Если ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Количество() > 0 Тогда
		
		ПодключитьОбработчикОжидания("СообщитьОбОкончанииРучногоВыполненияРегламентногоЗадания", 2, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОповещенияОбОкончанииВыполненияРегламентныхЗаданий()
	
	ОповещенияОбОкончанииВыполнения = Новый Массив;
	
	Если ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Количество() > 0 Тогда
		Индекс = ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Количество() - 1;
		
		УстановитьПривилегированныйРежим(Истина);
		Пока Индекс >= 0 Цикл
			
			НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор(
				ИдентификаторыФоновыхЗаданийПриРучномВыполнении[Индекс].Значение);
			Отбор = Новый Структура;
			Отбор.Вставить("УникальныйИдентификатор", НовыйУникальныйИдентификатор);
			
			МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
			
			Если МассивФоновыхЗаданий.Количество() = 1 Тогда
				МоментОкончания = МассивФоновыхЗаданий[0].Конец;
				
				Если ЗначениеЗаполнено(МоментОкончания) Тогда
					
					ОповещениеОкончания = Новый Структура;
					ОповещениеОкончания.Вставить("ПредставлениеРегламентногоЗадания",
						ИдентификаторыФоновыхЗаданийПриРучномВыполнении[Индекс].Представление);
					
					ОповещениеОкончания.Вставить("МоментОкончания", МоментОкончания);
					
					ОповещенияОбОкончанииВыполнения.Добавить(ОповещениеОкончания);
					
					ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Удалить(Индекс);
				КонецЕсли;
			Иначе
				ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Удалить(Индекс);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ОповещенияОбОкончанииВыполнения;
	
КонецФункции

&НаСервере
Процедура ОбновитьКнопкиИспользованияРегламентныхЗаданий()
	НеИспользуется = Новый Картинка;
	Используется   = КартинкаИнтерфейса(ЭтаФорма, "ESD_Успешно32");
	
	Если ЗначениеЗаполнено(ЭтаФорма.ИдентификаторРегламентЗагрузки)
		И ЭтаФорма.ИспользуетсяРегламентЗагрузки 
	Тогда
		Элементы.ИзменитьАктивностьРегЗаданияЗагрузки.Картинка = Используется;
	Иначе
		Элементы.ИзменитьАктивностьРегЗаданияЗагрузки.Картинка = НеИспользуется;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ЭтаФорма.ИдентификаторРегламентВыгрузки)
		И ЭтаФорма.ИспользуетсяРегламентВыгрузки 
	Тогда
		Элементы.ИзменитьАктивностьРегЗаданияВыгрузки.Картинка = Используется;
	Иначе
		Элементы.ИзменитьАктивностьРегЗаданияВыгрузки.Картинка = НеИспользуется;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗаданиеВручную(Идентификатор, Наименование)
	ПараметрыВыполнения = ВыполнитьРегламентноеЗаданиеВручнуюНаСервере(Идентификатор);
	
	МассивСообщенийОбОшибках = Новый Массив;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Если ПараметрыВыполнения.ЗапускВыполнен Тогда	
		Текст = НСтр("ru = 'Запущена процедура регламентного задания';
			|en = 'Scheduled job started'");
		
		ПояснениеТекст = НСтр("ru = '%1.
			|Процедура запущена в фоновом задании %2';
			|en = '%1.
			|The scheduled job has been started in the background job ""%2"".'");
		
		Пояснение = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
			ПояснениеТекст,
			Наименование,
			Строка(ПараметрыВыполнения.МоментЗапуска));
		
		ПоказатьОповещениеПользователя(
			Текст, ,
			Пояснение,
			БиблиотекаКартинок.ВыполнитьРегламентноеЗаданиеВручную);
		
		ЭтаФорма.ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Добавить(
			ПараметрыВыполнения.ИдентификаторФоновогоЗадания,
			Наименование);
		
		ПодключитьОбработчикОжидания(
			"СообщитьОбОкончанииРучногоВыполненияРегламентногоЗадания", 0.1, Истина);	
	ИначеЕсли ПараметрыВыполнения.ПроцедураУжеВыполняется Тогда	
		Текст = НСтр("ru = 'Процедура регламентного задания ""%1""
			|  уже выполняется в фоновом задании ""%2"", начатом %3.';
			|en = 'The scheduled job ""%1"" is running in
			|the background job ""%2""  started on %3.'");
		
		Сообщение = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
			Текст,
			Наименование,
			ПараметрыВыполнения.ПредставлениеФоновогоЗадания,
			Строка(ПараметрыВыполнения.МоментЗапуска));
		
		МассивСообщенийОбОшибках.Добавить(Сообщение);	
	Иначе
		Возврат;
	КонецЕсли;
	
	КоличествоОшибок = МассивСообщенийОбОшибках.Количество();
	Если КоличествоОшибок > 0 Тогда	
		Текст = НСтр("ru = 'Задания не выполнены (%1 из %2)';
			|en = 'The jobs are not completed (%1 out of %2)'");
		
		ЗаголовокТекстаПроОшибки = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
			Текст,
			Формат(КоличествоОшибок, "ЧГ="),
			"1");
		
		ТекстВсехОшибок = Новый ТекстовыйДокумент;
		ТекстВсехОшибок.ДобавитьСтроку(ЗаголовокТекстаПроОшибки + ":");
		
		Для Каждого ТекстЭтойОшибки Из МассивСообщенийОбОшибках Цикл
			ТекстВсехОшибок.ДобавитьСтроку("");
			ТекстВсехОшибок.ДобавитьСтроку(ТекстЭтойОшибки);
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьПользователяРегламентныхЗаданийНаСервере()
	Если Не ЗначениеЗаполнено(ЭтаФорма.ПользовательФоновыхЗаданий) Тогда
		ИмяПользователяИБ = ИмяТекущегоПользователяИБ();
	Иначе
		ИмяПользователяИБ = ЭтаФорма.ПользовательФоновыхЗаданий;
	КонецЕсли;
	
	ПараметрыЗадания = Новый Структура("ИмяПользователя", ИмяПользователяИБ);
	
	ИзменитьРегламентноеЗаданиеНаСервере(ЭтаФорма.ИдентификаторРегламентВыгрузки, ПараметрыЗадания);
	ИзменитьРегламентноеЗаданиеНаСервере(ЭтаФорма.ИдентификаторРегламентЗагрузки, ПараметрыЗадания);
	
	СохранитьПараметрыГруппировки();
КонецПроцедуры

&НаСервере
Функция ИзменитьРегламентноеЗаданиеНаСервере(Знач Идентификатор, Знач Параметры)
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	Результат = МодульКода("ESD_РегламентныеЗаданияСервер").ИзменитьРегламентноеЗадание(Идентификатор, Параметры);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ВыполнитьРегламентноеЗаданиеВручнуюНаСервере(Знач Идентификатор)
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ПараметрыВыполнения = МодульКода("ESD_РегламентныеЗаданияСлужебный").ВыполнитьРегламентноеЗаданиеВручную(Идентификатор);
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат ПараметрыВыполнения;
КонецФункции

&НаСервере
Функция РасписаниеРегламентногоЗаданияНаСервере(Знач Идентификатор)
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	Результат = МодульКода("ESD_РегламентныеЗаданияСервер").РасписаниеРегламентногоЗадания(Идентификатор);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;	
КонецФункции

#Область include_base_CommonForm_НастройкиЭПД_ДоступностьРегламентныхЗаданий
#КонецОбласти // include_base_CommonForm_НастройкиЭПД_ДоступностьРегламентныхЗаданий

#КонецОбласти // РегламентныеЗадания

&НаКлиенте
Процедура ПослеВопросаОДобавленииОбработки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ДополнительныеОтчетыИОбработки.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВсехДокументовОснований(ИмяКоманды)
	
	ПараметрыФормы = ПараметрыДляНастройкиОснований(ИмяКоманды);
	
	ОткрытьФорму("ОбщаяФорма." + ВыборТиповЭПДКлиент(), ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыДляНастройкиОснований(Знач ИмяКоманды)
	
	Если ИмяКоманды = "НастройкиДокументовОснованийЭПЛ" Тогда
		Ссылка = Документы[ПутевойЛист()].ПустаяСсылка();
	ИначеЕсли ИмяКоманды = "НастройкиДокументовОснованийЗнП" Тогда
		Ссылка = Документы[ЗаказНаПеревозку()].ПустаяСсылка();
	Иначе 	
		Ссылка = Документы[ТранспортнаяНакладная()].ПустаяСсылка();
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Ссылка", Ссылка);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьРезультатЗагрузкиСправочника(РезультатЗагрузки)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = РезультатЗагрузки.Текст;
	Сообщение.Сообщить();
	
	Если ЗначениеЗаполнено(РезультатЗагрузки.ОписаниеОшибок) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = РезультатЗагрузки.ОписаниеОшибок;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатЗагрузкиСправочника(Знач НаименованиеСправочника)
	
	ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки();
	
	Если НаименованиеСправочника = "ESD_ВидыУпаковки" Тогда
		Результат = МодульКода("Справочники.ESD_ВидыУпаковки").ЗагрузитьВидыУпаковкиСОнлайна(ОбщиеПараметрыЗагрузки);
	Иначе
		Результат = МодульКода("Справочники.ESD_ОпасныеГрузы").ЗагрузитьОпасныеГрузыСОнлайна(ОбщиеПараметрыЗагрузки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбновитьДанныеНа242160НаСервере()
	
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатПереходаНа242160();
	
КонецФункции

#Область НастройкаГруппировкиПозиций

&НаСервере
Процедура ЗагрузитьПараметрыГруппировки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПараметров = ХранилищеОбщихНастроек.Загрузить(
		"Saby", "ПараметрыГруппировкиПозицийОснований", , "ESD_ДляВсехПользователей");
	Если СтруктураПараметров <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыГруппировки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПараметров = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыГруппировкиПозицийОснований();
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ЭтаФорма);
	
	ХранилищеОбщихНастроек.Сохранить(
		"Saby", "ПараметрыГруппировкиПозицийОснований", СтруктураПараметров, , "ESD_ДляВсехПользователей");
	
	ОбновитьВидимостьДоступностьЭлементовГруппировки();
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьВидимостьДоступностьЭлементовГруппировки(ПриСозданииНаСервере = Ложь)
	
	Если ПриСозданииНаСервере Тогда
		ЗаполнитьРеквизитыНоменклатуры();
	КонецЕсли;
	
	Элементы.ГруппаВариантыГруппировки.Доступность = ЭтаФорма.ГруппироватьТоварыИзДокументовОснований;
	Элементы.РеквизитНоменклатуры.Доступность      = ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры;
	Элементы.НаименованиеОбщейПозиции.Доступность  = ЭтаФорма.ГруппироватьВОднуПозицию; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыНоменклатуры()
	
	Если Метаданные.Справочники.Найти("Номенклатура") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппироватьПоРеквизитуНоменклатуры.Доступность = Истина;
	
	Для Каждого Реквизит Из Справочники["Номенклатура"].ПустаяСсылка().Метаданные().Реквизиты Цикл
		Элементы.РеквизитНоменклатуры.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // НастройкаГруппировкиПозиций  

&НаСервере
Процедура ВыгружатьАрхивВложений()
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ХранилищеОбщихНастроек.Сохранить(
		"Saby", "ВыгружатьАрхивВложений", ЭтаФорма.ВыгружатьАрхивВложений, , "ESD_ДляВсехПользователей");
	
КонецПроцедуры

Процедура НастройкиВыгружатьАрхивВложений()
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ЭтаФорма.ВыгружатьАрхивВложений = ХранилищеОбщихНастроек.Загрузить(
		"Saby", "ВыгружатьАрхивВложений", , "ESD_ДляВсехПользователей");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИспользоватьСНИЛС()
	
	ЭтаФорма.ИспользоватьСНИЛС = ХранилищеОбщихНастроек.Загрузить("Saby", "ИспользоватьСНИЛС");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьХранитьСтатусыВДопСведениях()
	
	Если Не Элементы.ГруппаХранениеСтатусов.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений.Найти("ДополнительныеСведения") = Неопределено Тогда
		Элементы.ГруппаХранениеСтатусов.Доступность = Ложь;
	Иначе
		ЭтаФорма.ХранитьСтатусыВДопСведениях = Константы["ESD_ХранитьСтатусыВДопСведениях"].Получить();
	КонецЕсли;
	
КонецПроцедуры

#Область ФункционалПечати

&НаСервере
Процедура НастроитьФункционалПечати()
	НастройкиПечати_ЭПЛ();	
КонецПроцедуры

#Область ФункционалПечатиЭПЛ

&НаСервере
Процедура НастройкиПечати_ЭПЛ()
	// Видимость и доступность элементов по умолчанию 
	Элементы.Декорация_ФункционалПечатиОшибка_ЭПЛ.Видимость = Ложь;
	Элементы.ПечатнаяФормаЭПЛ.ТолькоПросмотр = Ложь;
	Элементы.ПечатнаяФормаЭПЛ.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Элементы.ПечатнаяФормаЭПЛ.СписокВыбора.Очистить();
	
	Попытка
		Если НЕ АвторизацияВыполнена Тогда
			ВызватьИсключение ФункционалПечатныхФорм_ОшибкаОтсутствуетАвторизация();	
		КонецЕсли;
		
		// Попытка получения и заполнения печатных форм
		ПечатнаяФормаЭПЛ_ЗаполнитьДанныеВыбора();
	Исключение
		ИнфоОшибки = ИнформацияОбОшибке();
		
		Элементы.Декорация_ФункционалПечатиОшибка_ЭПЛ.Видимость = Истина;
		Элементы.Декорация_ФункционалПечатиОшибка_ЭПЛ.Заголовок = КраткоеПредставлениеОшибки(ИнфоОшибки);
		Элементы.ПечатнаяФормаЭПЛ.ТолькоПросмотр = Истина;
		Элементы.ПечатнаяФормаЭПЛ.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПечатнаяФормаЭПЛ_ЗаполнитьДанныеВыбора()
	ИмяМетаданных = "ESD_ПутевойЛист";
	
	Попытка
		ПечатныеФормы = ЗагрузитьСписокВыбораПечатныхФорм(ИмяМетаданных);
	Исключение
		ВызватьИсключение ФункционалПечатныхФорм_ОшибкаПолученияПечатныхФорм();	
	КонецПопытки;
	
	// Заполнение списка выбора
	Для Каждого ДанныеПФ Из ПечатныеФормы Цикл
		ДанныеПечатнойФормы = ДанныеПФ["Values"];
		Элементы.ПечатнаяФормаЭПЛ.СписокВыбора.Добавить(ДанныеПечатнойФормы["Id"], ДанныеПечатнойФормы["Name"]);
	КонецЦикла;
	
	// Получение текущей печатной формы
	ЭтаФорма.ПечатнаяФормаЭПЛ = ВыбраннаяПечатнаяФорма(ИмяМетаданных);
КонецПроцедуры

#КонецОбласти

#Область ФункционалПечатиОбщее

&НаСервере
Функция ЗагрузитьСписокВыбораПечатныхФорм(ИмяМетаданных)
	Результат = МодульКода("ESD_ТНЗагрузкаСервер").ВариантыПечатнойФормы(ИмяМетаданных);
	Если Результат.Ошибка Тогда
		ВызватьИсключение Результат.Данные;
	КонецЕсли;
	
	Возврат Результат.Данные;
КонецФункции

&НаСервере
Функция ВыбраннаяПечатнаяФорма(ИмяМетаданных)
	Возврат МодульКода("Документы." + ИмяМетаданных).ТекущаяПечатнаяФорма();
КонецФункции

Функция ФункционалПечатныхФорм_ОшибкаОтсутствуетАвторизация()
	Возврат "Выбор печатной формы недоступен. Пожалуйста, выполните авторизацию в Saby";
КонецФункции

Функция ФункционалПечатныхФорм_ОшибкаПолученияПечатныхФорм()
	Возврат "Выбор печатной формы недоступен. Пожалуйста, переавторизуйтесь в Saby или попробуйте выполнить операцию позднее";
КонецФункции

#КонецОбласти

#КонецОбласти

&НаСервере
Процедура СохранитьИспользованиеСНИЛС()
	
	ХранилищеОбщихНастроек.Сохранить("Saby", "ИспользоватьСНИЛС", ЭтаФорма.ИспользоватьСНИЛС);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИспользованиеТабельногоНомера()
	
	ХранилищеОбщихНастроек.Сохранить("Saby", "ИспользоватьТабельныйНомер", ЭтаФорма.ИспользоватьТабельныйНомер);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьХранитьСтатусыВДопСведениях(Знач Значение)
	
	Константы["ESD_ХранитьСтатусыВДопСведениях"].Установить(Значение);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИспользоватьТабельныйНомер()
	
	ЭтаФорма.ИспользоватьТабельныйНомер = ХранилищеОбщихНастроек.Загрузить("Saby", "ИспользоватьТабельныйНомер");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПользователейФоновыхЗаданий()
	
	Элементы.ПользовательФоновыхЗаданий.СписокВыбора.Очистить();
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Попытка
		МассивПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Исключение
		
		МассивПользователей = Новый Массив;
		МассивПользователей.Добавить(ПользователиИнформационнойБазы.ТекущийПользователь());
		
	КонецПопытки;
	
	Для Каждого Пользователь Из МассивПользователей Цикл
		Элементы.ПользовательФоновыхЗаданий.СписокВыбора.Добавить(Пользователь.Имя);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяТекущегоПользователяИБ()
	
	ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	ИмяПользователя = "";
	Если ТекущийПользовательИБ <> Неопределено Тогда
		ИмяПользователя =  ТекущийПользовательИБ.Имя;
	КонецЕсли;
	
	Возврат ИмяПользователя;
	
КонецФункции

#Область Авторизация

&НаСервере
Процедура АвторизацияРасширенияНаСервере()
	Если Не ЭтоESD Тогда
		Возврат;		
	КонецЕсли;	
	
	ПослеИзмененияАвторизацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыйтиНаСервере()
	МодульОбъектаОбработки = ОбъектОбработки();
	
	saby_param = МодульОбъектаОбработки.НастройкиПодключенияПрочитать();
	Если saby_param <> Неопределено Тогда	
		saby_param.Вставить("session", Неопределено);
		saby_param.Вставить("password", Неопределено);
		МодульОбъектаОбработки.НастройкиПодключенияЗаписать(saby_param);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ESD_ВыйтиНаСервере()
	ВыйтиНаСервере();
	АвторизацияРасширенияНаСервере();	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокАвторизации()
	ФИОАвторизации = "";
	ИмяСервиса     = "";	
	ИмяАккаунта    = "";
	
	Модуль_Core = МодульКода("ESD_Core");
	
	ПараметрыАвторизации = Модуль_Core.НастройкиПодключенияПрочитать();
	СтруктураСессии      = Модуль_Core.СтруктураСессии(ПараметрыАвторизации);
	
	АвторизацияВыполнена = ТипЗнч(СтруктураСессии) = Тип("Структура")
		И ЗначениеЗаполнено(СтруктураСессии);
				
	Если АвторизацияВыполнена Тогда
		Элементы.ДекорацияАвторизация.Заголовок = "Выйти";
		Элементы.ДекорацияАвторизация.Подсказка = "Закрыть сессию";
		
		Если СтруктураСессии.Свойство("user_fio") Тогда
			ФИОАвторизации = СтруктураСессии.user_fio;
			ИмяСервиса = ПараметрыАвторизации.api_url;	
		КонецЕсли;
		
		СтруктураСессии.Свойство("AccountTitle", ИмяАккаунта);
		Элементы.ГруппаАккаунт.Видимость = Истина;
	Иначе
		Элементы.ДекорацияАвторизация.Заголовок = "Войти";
		Элементы.ДекорацияАвторизация.Подсказка = "Открыть сессию";
		Элементы.ГруппаАккаунт.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ДекорацияПользователь.Заголовок = ФИОАвторизации;
	Элементы.ДекорацияСервис.Заголовок	     = ИмяСервиса;
	Элементы.ДекорацияАккаунт.Заголовок      = ИмяАккаунта;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРезультатаЗакрытияФормыАвторизации(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	Иначе 	
		ПослеАвторизации();
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ESD_ПриАвторизации();
		ОбновитьАктуальныйСтатусВерсии();
	КонецЕсли;
		
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьАктуальныйСтатусВерсии()
	Если Не ЭтаФорма.ИспользоватьСсылкаНаОбновление Тогда
		Возврат;
	КонецЕсли;
		
	Элементы.ГруппаОбновление.Видимость = Истина;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДвоичныеДанныеОбработки", Неопределено);
	ДополнительныеПараметры.Вставить("НаКлиенте",               Ложь);
	ДополнительныеПараметры.Вставить("ОтветНаКлиенте",          Неопределено);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ВыполнитьКомандуСбис(
		ЭтаФорма, "АктуальныйСтатусВерсии", Неопределено, ДополнительныеПараметры);	
КонецПроцедуры

&НаСервере
Процедура ПослеАвторизации()
	Если ЭтоESD И Не ПройденаПервичнаяИнициализация() Тогда		
		ИзменитьЗначениеКонстанты("ESD_ПройденаПервичнаяИнициализация", Истина);
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ПослеПрохожденияПервичнойИнициализации();
		НастройкаИнтерфейсаДляПервогоВхода(Истина);
		ЗаполнитьИнтерфейсНастроек();
		ОбновитьВидимостьИДоступностьЭлементов();
	КонецЕсли;	
	
	ЗагрузитьСопоставленияДанных();
	АвторизацияРасширенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОбъекта(Знач ИмяМетаданных, Знач Настройки)
	МодульКода("Документы." + ИмяМетаданных).СохранитьНастройки(Настройки);	
КонецПроцедуры

#КонецОбласти // Авторизация

&НаСервере
Процедура ВывестиТекущуюВерсию()
	
	Если Найти(ЭтаФорма.ИмяФормы, "ESD") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонВерсии = "Версия: %1 %2";
	
	ИмяИВерсия = МодульКода("ESD_Core").ПолучитьИмяФайлаИНомерТекущейВерсии();
	Версия     = ИмяИВерсия[1];
	
	Если ЭтоCF() Тогда
		Продукт = "CF";
	Иначе
		Продукт = "";
	КонецЕсли;	
	
	Элементы.ДекорацияВерсия.Заголовок = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
		ШаблонВерсии, 
		Версия,
		Продукт);
	
КонецПроцедуры

&НаСервере
Процедура ИспользуемыйФункционал()
	
	Если Не ЭтоESD Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ИспользоватьТранспортнаяНакладная = Константы.ESD_ИспользоватьТранспортнаяНакладная.Получить();
	ЭтаФорма.ИспользоватьПутевойЛист           = Константы.ESD_ИспользоватьПутевойЛист.Получить();
	ЭтаФорма.ИспользоватьЗаказНаПеревозку      = Константы.ESD_ИспользоватьЗаказНаПеревозку.Получить();
	
	Если ОтключенВесьФункционал()
		И ПройденаПервичнаяИнициализация() Тогда
		
		// Включим весь функционал по дефолту
		Константы.ESD_ИспользоватьТранспортнаяНакладная.Установить(Истина);
		Константы.ESD_ИспользоватьПутевойЛист.Установить(Истина);
		Константы.ESD_ИспользоватьЗаказНаПеревозку.Установить(Истина);
		
		// перечитаем настройки
		ИспользуемыйФункционал();
		
	КонецЕсли;
		
КонецПроцедуры

#Область ИспользуемыйФункционал

&НаКлиенте
Процедура ОбновитьЗначениеФункциональнойОпции(ИмяОпции)
	
	ОбновитьЗначениеФункциональнойОпцииСервер(ИмяОпции);
	ОбновитьИнтерфейс();
	
	ОбновитьРабочийСтолCF();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначениеФункциональнойОпцииСервер(Знач ИмяОпции)
	
	Значение     = ЭтаФорма[ИмяОпции];
	ИмяКонстанты = "ESD_" + ИмяОпции;
		
	Если ОтключенВесьФункционал() Тогда
		
		ТекстСообщения = "Нельзя отключить весь функционал! Оставьте активным хотя бы один документ";
		МодульКода("ESD_ТНОбщегоНазначенияСервер").СообщитьПользователюСервер(ТекстСообщения, , "ГруппаИспользуемыйФункционал");
		
		// вернем флаг обратно
		ЭтаФорма[ИмяОпции] = Не ЭтаФорма[ИмяОпции];
		
	Иначе		
		Константы[ИмяКонстанты].Установить(Значение);		
	КонецЕсли;	
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Функция ОтключенВесьФункционал()
	
	ВключенОдинДокумент = Макс(
		ЭтаФорма.ИспользоватьТранспортнаяНакладная, 
		ЭтаФорма.ИспользоватьПутевойЛист, 
		ЭтаФорма.ИспользоватьЗаказНаПеревозку);
		
	Возврат Не ВключенОдинДокумент;	
	
КонецФункции

&НаСервере
Процедура ОбновитьВидимостьПоФункциональнымОпциям()
	
	Если Не ЭтаФорма.ЭтоESD Тогда
		Возврат;
	КонецЕсли;
		
	// ЭТрН	
	Элементы.НастройкиДокументовОснованийЭТрН.Видимость = ЭтаФорма.ИспользоватьТранспортнаяНакладная; 
	Элементы.ГруппаESD_ТранспортнаяНакладная.Видимость  = ЭтаФорма.ИспользоватьТранспортнаяНакладная;
		
	// ЭПЛ		
	Элементы.НастройкиДокументовОснованийЭПЛ.Видимость  = ЭтаФорма.ИспользоватьПутевойЛист;
	Элементы.ГруппаESD_ПутевойЛист.Видимость            = ЭтаФорма.ИспользоватьПутевойЛист; 
	
	// ЗнП
	Элементы.НастройкиДокументовОснованийЗнП.Видимость  = ЭтаФорма.ИспользоватьЗаказНаПеревозку;
	Элементы.ГруппаESD_ЗаказНаПеревозку.Видимость       = ЭтаФорма.ИспользоватьЗаказНаПеревозку;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРабочийСтолCF()

	Если ЭтоCF() Тогда
		Оповестить("ESD_ОбновитьРабочийСтол");
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиДоТекущегоРелизаНаКлиенте() Экспорт
	ОбновитьНастройкиДоТекущегоРелиза();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиДоТекущегоРелиза()
	Если ЭтоCF() Тогда
		Обработки.ESD_ВерсииНастроекСопоставлений.ОбновитьНастройкиДоТекущегоРелиза();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЭтоCF()
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").ЭтоCF();
КонецФункции
	
#КонецОбласти // ИспользуемыйФункционал

&НаКлиенте
Процедура ОткрытьРедакторФайловНастроекНажатие(Элемент)
	АдресСтраницы = ПолучитьАдресСтраницыРедактора(); 
	
	ПараметрыФормыРедактора = Новый Структура();
	ПараметрыФормыРедактора.Вставить("Заголовок", "Редактор файлов настроек");
	ПараметрыФормыРедактора.Вставить("АдресСтраницы", АдресСтраницы);
	ОткрытьФорму(ФормыЯдраКлиент() + "Browser", ПараметрыФормыРедактора, , "Редактор файлов настроек");
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСтраницыРедактора()
	ESDКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");	
	
	context_params = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД", Неопределено);
	
	Если ESDКлиентСервер.ЗначениеИзКоллекции(context_params, "session") <> Неопределено Тогда
		web_interface = ESDКлиентСервер.ЗначениеИзКоллекции(context_params, "web_interface");
		Если web_interface = "BrowserSabyPlugin" Тогда
			connector = "Lpp1C2";
		ИначеЕсли web_interface = "BrowserSaby" Тогда
			connector = "1c-lppbl";
		Иначе
			connector = "1C2";	
		КонецЕсли;
		
		Возврат context_params.api_url
			+ "/blockly_editor_1c/page/?connection_id="
			+ context_params.ConnectionId
			+ "&connector="
			+ connector
			+ "&command="
			+ connector; 
	КонецЕсли;
		
	Если ESDКлиентСервер.ЗначениеИзКоллекции(context_params, "api_url") <> Неопределено Тогда
		Возврат context_params.api_url + "/auth/";
	КонецЕсли;	
	
	Возврат "https://ie-1c.saby.ru/auth/";
КонецФункции

&НаКлиенте
Процедура СброситьКэшНажатие(Элемент)
	СброситьКэшНаСервере();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Общие настройки ини очищены";
	Сообщение.Сообщить();
КонецПроцедуры

&НаСервере
Процедура СброситьКэшНаСервере()
	ОбъектОбработки = ОбъектОбработки();
	ОбъектОбработки.СброситьКэшНаСервере();
КонецПроцедуры

&НаСервере
Функция ПройденаПервичнаяИнициализация()
	
	Если Не ЭтоESD Тогда
		Результат = Истина;
	Иначе
		Результат = Константы.ESD_ПройденаПервичнаяИнициализация.Получить();		
	КонецЕсли;

	Возврат Результат;
		
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуАвторизации()
	
	ПроверкаДанныхАутентификации = Новый ОписаниеОповещения("ОбработкаРезультатаЗакрытияФормыАвторизации",
		ЭтаФорма);
	
	ОткрытьФорму("Обработка.ESD_SABY.Форма.Вход", , ЭтаФорма, , , , ПроверкаДанныхАутентификации);
	
КонецПроцедуры

&НаСервере
Процедура ПослеИзмененияАвторизацииНаСервере()
	УстановитьЗаголовокАвторизации();	
	НастроитьФункционалПечати();	
КонецПроцедуры

#Область ПоддерживаемыеКонфигурации

&НаСервере
Процедура ЗаполнитьПоддерживаемыеКонфигурации()
	
	Если Не ЭтаФорма.ЭтоESD Тогда
		Возврат;
	КонецЕсли;	
	
	// заполним список выбора
	Список = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПоддержанныеКонфигурации();
	Для Каждого Строка Из Список Цикл
		
		НоваяСтрока = Элементы.ЭтаКонфигурация.СписокВыбора.Добавить();
		НоваяСтрока.Значение      = Строка.Ключ;
		НоваяСтрока.Представление = Строка.Значение.Представление;
		
	КонецЦикла;
	
	// Пустая
	НоваяСтрока = Элементы.ЭтаКонфигурация.СписокВыбора.Добавить();
	НоваяСтрока.Значение      = "";
	НоваяСтрока.Представление = "Своя конфигурация";
	
	// установим текущую конфигурацию
	КонфигурацияНастроек = КонфигурацияНастроекСопоставлений();	
	Если ЗначениеЗаполнено(КонфигурацияНастроек) Тогда
		ЭтаФорма.ЭтаКонфигурация = КонфигурацияНастроек;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция КонфигурацияНастроекСопоставлений()
	
	ТекущаяКонфигурация = Константы["ESD_КонфигурацияДляСопоставлений"].Получить();
	
	Если Не ЗначениеЗаполнено(ТекущаяКонфигурация) Тогда
				
		ДоступнаяКонфигурация = МодульКода("ESD_ТНОбщегоНазначенияСервер").ЭтоДоступнаяКонфигурация();
		ТекущаяКонфигурация = ДоступнаяКонфигурация.Имя;
		
	КонецЕсли;
	
	Возврат ТекущаяКонфигурация;
	
КонецФункции

&НаКлиенте
Процедура ПроверкаВозможностиЗагрузкиНастроек()

    ЗагрузкаДоступна = ЗначениеЗаполнено(ЭтаФорма.ЭтаКонфигурация);
	
	Элементы.ЗагрузитьНастройкиСопоставлений.Доступность = ЗагрузкаДоступна;
	Элементы.Декорация_КонфигурацияОшибка.Видимость      = Не ЗагрузкаДоступна;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаООчисткеНастроек(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ЭтаКонфигурация = "";
	
	ЭтаКонфигурацияОчисткаСервер();
	
	ПроверкаВозможностиЗагрузкиНастроек();
КонецПроцедуры

&НаСервере
Процедура ЭтаКонфигурацияОчисткаСервер()

	// сбросим значение константы
	ИзменитьЗначениеКонстанты("ESD_КонфигурацияДляСопоставлений", ЭтаФорма.ЭтаКонфигурация);
	
	// сбросим настройки сопоставлений
	УдалитьТекущиеСопоставленияДанных();
КонецПроцедуры

#КонецОбласти // ПоддерживаемыеКонфигурации

&НаСервере
Процедура ИзменитьЗначениеКонстанты(Знач Имя, Знач Значение)
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").УстановитьЗначениеКонстанты(
		Имя, Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияИспользованияНовогоРедактора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		ЭтаФорма.ИспользоватьНовыйРедактор = Не ЭтаФорма.ИспользоватьНовыйРедактор;
		Возврат;
	КонецЕсли;
	
	ИзменитьЗначениеКонстанты("ESD_ИспользоватьНовыйРедактор", ЭтаФорма.ИспользоватьНовыйРедактор);
	
	ИспользоватьНовыйРедакторПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьНовыйРедакторПриИзмененииНаСервере()
	
	ОбновитьСопоставленияДанных();
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПрименитьДополнительныеПрава(Результат) Экспорт
	
	ЭтаФорма.ИспользоватьСсылкаНаОбновление = Результат.СкачиваниеОбновления;
	ЭтаФорма.Элементы.ГруппаОбновление.Видимость = Результат.СкачиваниеОбновления;
	
	Для Каждого Настройка Из Результат Цикл
		Если Лев(Настройка.Ключ, 10) = "Настройки_" Тогда
			Если Настройка.Ключ = "Настройки_Дополнительно" Тогда
				ЭтаФорма.Элементы["ГруппаИспользоватьСНИЛС"].Видимость = Настройка.Значение И ЭтаФорма.ИспользоватьПутевойЛист;
				ЭтаФорма.Элементы["ГруппаИспользоватьТабельныйНомер"].Видимость = Настройка.Значение;
				ЭтаФорма.Элементы["ГруппаХранениеСтатусов"].Видимость = Настройка.Значение И ЭтоESD;
			ИначеЕсли Настройка.Ключ = "Настройки_РедакторИНИ" Тогда
				ЭтаФорма.Элементы["ГруппаРедакторИНИ"].Видимость = Настройка.Значение;
			ИначеЕсли Настройка.Ключ = "Настройки_ГруппаНастройкаГруппировки" Тогда
				ЭтаФорма.Элементы["ГруппаНастройкаГруппировки"].Видимость = Настройка.Значение И (ЭтаФорма.ИспользоватьТранспортнаяНакладная 
																								Или ЭтаФорма.ИспользоватьЗаказНаПеревозку);
			Иначе
				ЭтаФорма.Элементы[Сред(Настройка.Ключ, 11)].Видимость = Настройка.Значение;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_base_CommonForm_НастройкиЭПД_НастройкиСопоставлений
#КонецОбласти // include_base_CommonForm_НастройкиЭПД_НастройкиСопоставлений

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область includr_etrn_base_CommonModule_Метаданные
#КонецОбласти // includr_etrn_base_CommonModule_Метаданные

#Область includr_etrn_base_CommonModule_МетаданныеКлиент
#КонецОбласти // includr_etrn_base_CommonModule_МетаданныеКлиент

#Область includr_etrn_base_CommonModule_КартинкаИнтерфейса
#КонецОбласти // includr_etrn_base_CommonModule_КартинкаИнтерфейса

#Область includr_etrn_base_CommonModule_ОбъектОбработки
#КонецОбласти // includr_etrn_base_CommonModule_ОбъектОбработки

#Область includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере
#КонецОбласти // includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область includr_core_base_Авторизация_СменаАккаунта
#КонецОбласти

#Область includr_core_base_Helpers_КартинкиУспешноОшибка
#КонецОбласти

#Область СменаАккаунта_ДополнительныеПроцедурыИФункции

&НаКлиенте
Функция ПроверитьНаличиеПараметровПодключенияНаСервере() Экспорт
	Возврат ESD_КомандыОбменаДляФормыКлиент.ПроверитьНаличиеПараметровПодключенияНаСервере();
КонецФункции

&НаКлиенте
Процедура УстановитьЗаголовокПодсказкуКнопкиВыйти()
	АвторизацияРасширенияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьАктуальностьВерсии(ФормаОткрыта = Истина)
	// Заглушка
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыборИзСписка(СписокВыбора, ОписаниеОповещения, ЭлементФормы = Неопределено, ЗаголовокОкнаВыбора = "Выберите значение")
	// Проблема только при скрытии областей управляемой формы с двухфакторной авторизацией
	//Подглядел у 1с
	
	// обход ошибок платформы: в тонком клиенте не работает ПоказатьВыборИзСписка (ПоказатьВыборИзМеню не работает в веб-клиенте 
	// и в событии ПриИзмененииСодержимогоОбласти табличного документа - где мы его и хотим использовать прежде всего)
	# Если ВебКлиент Тогда	
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, ЭлементФормы);	
	#Иначе
		СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, ЗаголовокОкнаВыбора, ЭлементФормы);		
	#КонецЕсли
КонецПроцедуры

#КонецОбласти

#Область includr_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область includr_core_base_locale_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область includr_core_base_ExtException //&НаСервереБезКонтекста
#КонецОбласти