
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Найти(ЭтаФорма.ИмяФормы, "ESD") <> 0 Тогда
		ЭтаФорма.ЭтоESD = Истина;		
	КонецЕсли;
	
	ЗагрузитьПараметрыГруппировки();
	
	ЗагрузитьИспользоватьСНИЛС();
	
	ЗагрузитьИспользоватьТабельныйНомер();
	
	ЗаполнитьПользователейФоновыхЗаданий();
	
	АвторизацияРасширения();
	
	ЗаполнитьНастройкиСопоставлений();
	
	ВывестиТекущуюВерсию();
	
	ИспользуемыйФункционал();
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

#Область include_base_CommonForm_НастройкиЭПД_ОбновлениеВерсииОбработчикиСобытийФормы
#КонецОбласти // include_base_CommonForm_НастройкиЭПД_ОбновлениеВерсииОбработчикиСобытийФормы

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппироватьТоварыИзДокументовОснованийПриИзменении(Элемент)
	
	Если Не ЭтаФорма.ГруппироватьТоварыИзДокументовОснований Тогда
		ЭтаФорма.ГруппироватьВОднуПозицию            = Ложь;
		ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьПоРеквизитуНоменклатурыПриИзменении(Элемент)
	
	Если ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры Тогда
		ЭтаФорма.ГруппироватьВОднуПозицию = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитНоменклатурыПриИзменении(Элемент)
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьВОднуПозициюПриИзменении(Элемент)
	
	Если ЭтаФорма.ГруппироватьВОднуПозицию Тогда
		ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбщейПозицииПриИзменении(Элемент)
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательФоновыхЗаданийПриИзменении(Элемент)
	
	ПараметрыЗадания = ПараметрыЗадания(ЭтаФорма.ИдентификаторРегламентВыгрузки);
	
	ИзменитьРегламентноеЗадание(ЭтаФорма.ИдентификаторРегламентВыгрузки, ПараметрыЗадания);
	
	ПараметрыЗадания = ПараметрыЗадания(ЭтаФорма.ИдентификаторРегламентЗагрузки);
	
	ИзменитьРегламентноеЗадание(ЭтаФорма.ИдентификаторРегламентЗагрузки, ПараметрыЗадания);
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСНИЛСПриИзменении(Элемент)
	
	СохранитьИспользованиеСНИЛС();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвторизацию(Элемент)
	
	Если Элементы.ДекорацияАвторизация.Заголовок = "Войти" Тогда
		
		ПроверкаДанныхАутентификации = Новый ОписаниеОповещения("ОбработкаРезультатаЗакрытияФормыАвторизации",
																	ЭтаФорма);
		
		ОткрытьФорму("Обработка.ESD_SABY.Форма.Вход", , ЭтаФорма, , , , ПроверкаДанныхАутентификации);
		
	Иначе		
		
		УстановитьЗаголовокАвторизации(Истина);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сессия и пароль сброшены";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновлениеНажатие(Элемент)
    // BSLLS:UsingSynchronousCalls-off
    ЗапуститьПриложение(Элемент.Подсказка);
    // BSLLS:UsingSynchronousCalls-on
КонецПроцедуры 

&НаКлиенте
Процедура ИспользоватьТранспортнаяНакладнаяПриИзменении(Элемент)
	ОбновитьЗначениеФункциональнойОпции(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПутевойЛистПриИзменении(Элемент)
	ОбновитьЗначениеФункциональнойОпции(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗаказНаПеревозкуПриИзменении(Элемент)
	ОбновитьЗначениеФункциональнойОпции(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТабельныйНомерПриИзменении(Элемент)
	
	СохранитьИспользованиеТабельногоНомера();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкиДокументовОснований(Команда)
	
	ТекущаяКнопка = ЭтаФорма.ТекущийЭлемент;
	
	НастройкаВсехДокументовОснований(ТекущаяКнопка.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРегламентныхЗаданий(Команда)
	
	СсылкаНаВнешнююОбработкуСРегламентами = СсылкаНаВнешнююОбработкуСРегламентами();
	
	Если ТипЗнч(СсылкаНаВнешнююОбработкуСРегламентами) = Тип("Строка") Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СсылкаНаВнешнююОбработкуСРегламентами;
		Сообщение.Сообщить();
		
	ИначеЕсли ЗначениеЗаполнено(СсылкаНаВнешнююОбработкуСРегламентами) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", СсылкаНаВнешнююОбработкуСРегламентами);
		
		ОткрытьФорму("Справочник.ДополнительныеОтчетыИОбработки.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
		
	Иначе
		
		ПроцедураПослеВопросаОДобавленииОбработки = Новый ОписаниеОповещения(
			"ПослеВопросаОДобавленииОбработки", ЭтаФорма);
		
		ПоказатьВопрос(
			ПроцедураПослеВопросаОДобавленииОбработки,
			"Добавить обработку регламентных заданий сейчас?",
			РежимДиалогаВопрос.ДаНет,
			120,
			КодВозвратаДиалога.Нет,
			"Внешняя обработка не найдена.",
			КодВозвратаДиалога.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВыгрузки(Команда)
	НастройкиРасписанияРегламентногоЗадания(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЗагрузки(Команда)
	НастройкиРасписанияРегламентногоЗадания(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеНа242160(Команда)
	
	Результат = ОбновитьДанныеНа242160НаСервере();
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ?(Не Результат.ОК, Результат.ОписаниеОшибки, "Обновление данных на версию 24.2160 выполнен успешно");
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура АктивностьРегламентногоЗадания(Команда)
	
	ЭтоЗагрузка = (ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.АктивностьЗагрузки);
	
	Если ЭтоЗагрузка Тогда
		
		ЭтаФорма.ИспользуетсяРегламентЗагрузки = Не ЭтаФорма.ИспользуетсяРегламентЗагрузки;
		Идентификатор                          = ЭтаФорма.ИдентификаторРегламентЗагрузки;
		
	Иначе
		
		ЭтаФорма.ИспользуетсяРегламентВыгрузки = Не ЭтаФорма.ИспользуетсяРегламентВыгрузки;
		Идентификатор                          = ЭтаФорма.ИдентификаторРегламентВыгрузки;
		
	КонецЕсли;
	
	ПараметрыЗадания = ПараметрыЗадания(Идентификатор);
	
	ИзменитьРегламентноеЗадание(Идентификатор, ПараметрыЗадания);
	
	ОбновитьКнопкиИспользованияРегламентныхЗаданий();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗадание(Команда)
	
	ЭтоЗагрузка = (ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ВыполнитьЗагрузку);
	
	Если ЭтоЗагрузка Тогда
		Идентификатор = ЭтаФорма.ИдентификаторРегламентЗагрузки;
		Наименование  = "Загрузка документов ЭПД";
	Иначе
		Идентификатор = ЭтаФорма.ИдентификаторРегламентВыгрузки;
		Наименование  = "Выгрузка документов ЭПД";
	КонецЕсли;
	
	ПараметрыВыполнения = ВыполнитьРегламентноеЗаданиеСервер(Идентификатор);
	МассивСообщенийОбОшибках = Новый Массив;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Если ПараметрыВыполнения.ЗапускВыполнен Тогда
		
		Текст = НСтр("ru = 'Запущена процедура регламентного задания';
			|en = 'Scheduled job started'");
		
		ПояснениеТекст = НСтр("ru = '%1.
			|Процедура запущена в фоновом задании %2';
			|en = '%1.
			|The scheduled job has been started in the background job ""%2"".'");
		
		Пояснение = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
			ПояснениеТекст,
			Наименование,
			Строка(ПараметрыВыполнения.МоментЗапуска));
		
		ПоказатьОповещениеПользователя(
			Текст, ,
			Пояснение,
			БиблиотекаКартинок.ВыполнитьРегламентноеЗаданиеВручную);
		
		ЭтаФорма.ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Добавить(
			ПараметрыВыполнения.ИдентификаторФоновогоЗадания,
			Наименование);
		
		ПодключитьОбработчикОжидания(
			"СообщитьОбОкончанииРучногоВыполненияРегламентногоЗадания", 0.1, Истина);
		
	ИначеЕсли ПараметрыВыполнения.ПроцедураУжеВыполняется Тогда
		
		Текст = НСтр("ru = 'Процедура регламентного задания ""%1""
			|  уже выполняется в фоновом задании ""%2"", начатом %3.';
			|en = 'The scheduled job ""%1"" is running in
			|the background job ""%2""  started on %3.'");
		
		Сообщение = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
			Текст,
			Наименование,
			ПараметрыВыполнения.ПредставлениеФоновогоЗадания,
			Строка(ПараметрыВыполнения.МоментЗапуска));
		
		МассивСообщенийОбОшибках.Добавить(Сообщение);
		
	Иначе
		Возврат;
	КонецЕсли;
	
	КоличествоОшибок = МассивСообщенийОбОшибках.Количество();
	Если КоличествоОшибок > 0 Тогда
		
		Текст = НСтр("ru = 'Задания не выполнены (%1 из %2)';
			|en = 'The jobs are not completed (%1 out of %2)'");
		
		ЗаголовокТекстаПроОшибки = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
			Текст,
			Формат(КоличествоОшибок, "ЧГ="),
			"1");
		
		ТекстВсехОшибок = Новый ТекстовыйДокумент;
		ТекстВсехОшибок.ДобавитьСтроку(ЗаголовокТекстаПроОшибки + ":");
		
		Для Каждого ТекстЭтойОшибки Из МассивСообщенийОбОшибках Цикл
			ТекстВсехОшибок.ДобавитьСтроку("");
			ТекстВсехОшибок.ДобавитьСтроку(ТекстЭтойОшибки);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСправочникВидыУпаковки(Команда)
	
	РезультатЗагрузки = РезультатЗагрузкиСправочника("ESD_ВидыУпаковки");
	
	ПоказатьРезультатЗагрузкиСправочника(РезультатЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСправочникОпасныеГрузы(Команда)
	
	РезультатЗагрузки = РезультатЗагрузкиСправочника("ESD_ОпасныеГрузы");
	
	ПоказатьРезультатЗагрузкиСправочника(РезультатЗагрузки);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьИДоступностьЭлементов()
	
	Если СтандартныеРегламентныеЗаданияДоступны() Тогда
		
		ВидимостьОбработкиДляРегламентов = Ложь;
		
		СсылкаНаВнешнююОбработкуСРегламентами = СсылкаНаВнешнююОбработкуСРегламентами();
		Если СсылкаНаВнешнююОбработкуСРегламентами <> Тип("Строка")
			И ЗначениеЗаполнено(СсылкаНаВнешнююОбработкуСРегламентами) Тогда
						
			ВидимостьОбработкиДляРегламентов = Истина;
			
		КонецЕсли;
		
		Элементы.НастройкиРегламентныхЗаданий.Видимость = ВидимостьОбработкиДляРегламентов;
		
		УстановитьДанныеРегламентныхЗаданий();
		
		ЕстьЗагрузка = ЗначениеЗаполнено(ЭтаФорма.ИдентификаторРегламентЗагрузки);
		Элементы.НастройкиЗагрузки.Видимость = ЕстьЗагрузка;
		
		ЕстьВыгрузка = ЗначениеЗаполнено(ЭтаФорма.ИдентификаторРегламентВыгрузки);
		Элементы.НастройкиВыгрузки.Видимость = ЕстьВыгрузка;
		
		ОбновитьКнопкиИспользованияРегламентныхЗаданий();
		
		Элементы.ГруппаРегламентныеЗадания.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаРегламентныеЗадания.Видимость = Ложь;
		
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьЭлементовГруппировки(Истина);
	
	ОбновитьВидимостьПоФункциональнымОпциям();
	
КонецПроцедуры

#Область РегламентныеЗадания

&НаКлиенте
Процедура НастройкиРасписанияРегламентногоЗадания(КомандаИмя)
	
	Идентификаторы = Новый Структура;
	Идентификаторы.Вставить("Выгрузка", ЭтаФорма.ИдентификаторРегламентВыгрузки);
	Идентификаторы.Вставить("Загрузка", ЭтаФорма.ИдентификаторРегламентЗагрузки);
	
	ДанныеРасписания = РасписаниеРегламентногоЗадания(КомандаИмя, Идентификаторы);
	Если ДанныеРасписания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Идентификатор", ДанныеРасписания.Идентификатор);
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ДанныеРасписания.Расписание);
	Диалог.Показать(Новый ОписаниеОповещения("ОткрытиеРасписаниеЗавершение", ЭтаФорма, ДопПараметры));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьРегламентноеЗадание(НовоеРасписание, Идентификатор)
	
	ПараметрыЗадания = ПараметрыЗадания(Идентификатор);
	
	ПараметрыЗадания.Вставить("Расписание", НовоеРасписание);
	
	ИзменитьРегламентноеЗадание(Идентификатор, ПараметрыЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеРасписаниеЗавершение(НовоеРасписание, ДопПараметры) Экспорт
	
	Если НовоеРасписание <> Неопределено Тогда
		ЗаписатьРегламентноеЗадание(НовоеРасписание, ДопПараметры.Идентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеРегламентныхЗаданий()
	
	ЗаданияВыгрузкиЗагрузки = РегламентныеЗаданияИзБД();
	
	ЗаданиеЗагрузка = ЗаданияВыгрузкиЗагрузки.ЗаданиеЗагрузка;
	ЗаданиеВыгрузка = ЗаданияВыгрузкиЗагрузки.ЗаданиеВыгрузка;
	
	ЕстьЗагрузка = ЗаданиеЗагрузка <> Неопределено;
	Если ЕстьЗагрузка Тогда
		
		ЭтаФорма.ИдентификаторРегламентЗагрузки  = ЗаданиеЗагрузка.УникальныйИдентификатор;
		ЭтаФорма.ИспользуетсяРегламентЗагрузки   = ЗаданиеЗагрузка.Использование;
		
	КонецЕсли;
	
	ЕстьВыгрузка = ЗаданиеВыгрузка <> Неопределено;
	Если ЕстьВыгрузка Тогда
		
		ЭтаФорма.ИдентификаторРегламентВыгрузки  = ЗаданиеВыгрузка.УникальныйИдентификатор;
		ЭтаФорма.ИспользуетсяРегламентВыгрузки   = ЗаданиеВыгрузка.Использование;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОкончанииРучногоВыполненияРегламентногоЗадания()
	
	ОповещенияОбОкончанииВыполнения = ОповещенияОбОкончанииВыполненияРегламентныхЗаданий();
	
	Для каждого Оповещение Из ОповещенияОбОкончанииВыполнения Цикл
		
		Текст = НСтр("ru = 'Выполнена процедура регламентного задания';
			|en = 'Scheduled job procedure completed'");
		
		СтрокаДляПояснения = НСтр("ru = '%1.
			|Процедура завершена в фоновом задании %2';
			|en = '%1.
			|The scheduled job has been completed in the background job ""%2"".'");
		
		ТекстПояснения = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
			СтрокаДляПояснения,
			Оповещение.ПредставлениеРегламентногоЗадания,
			Строка(Оповещение.МоментОкончания));
		
		ПоказатьОповещениеПользователя(
			Текст,
			,
			ТекстПояснения,
			БиблиотекаКартинок.ВыполнитьРегламентноеЗаданиеВручную);
		
	КонецЦикла;
	
	Если ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Количество() > 0 Тогда
		
		ПодключитьОбработчикОжидания("СообщитьОбОкончанииРучногоВыполненияРегламентногоЗадания", 2, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОповещенияОбОкончанииВыполненияРегламентныхЗаданий()
	
	ОповещенияОбОкончанииВыполнения = Новый Массив;
	
	Если ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Количество() > 0 Тогда
		Индекс = ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Количество() - 1;
		
		УстановитьПривилегированныйРежим(Истина);
		Пока Индекс >= 0 Цикл
			
			НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор(
				ИдентификаторыФоновыхЗаданийПриРучномВыполнении[Индекс].Значение);
			Отбор = Новый Структура;
			Отбор.Вставить("УникальныйИдентификатор", НовыйУникальныйИдентификатор);
			
			МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
			
			Если МассивФоновыхЗаданий.Количество() = 1 Тогда
				МоментОкончания = МассивФоновыхЗаданий[0].Конец;
				
				Если ЗначениеЗаполнено(МоментОкончания) Тогда
					
					ОповещениеОкончания = Новый Структура;
					ОповещениеОкончания.Вставить("ПредставлениеРегламентногоЗадания",
						ИдентификаторыФоновыхЗаданийПриРучномВыполнении[Индекс].Представление);
					
					ОповещениеОкончания.Вставить("МоментОкончания", МоментОкончания);
					
					ОповещенияОбОкончанииВыполнения.Добавить(ОповещениеОкончания);
					
					ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Удалить(Индекс);
				КонецЕсли;
			Иначе
				ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Удалить(Индекс);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ОповещенияОбОкончанииВыполнения;
	
КонецФункции

&НаСервереБезКонтекста
Функция СсылкаНаВнешнююОбработкуСРегламентами()
	
	РезультатФункции = "";
	
	ЕстьДополнительныеОтчетыИОбработкиВКонфигурации =
		Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") <> Неопределено;
		
	Если Не ЕстьДополнительныеОтчетыИОбработкиВКонфигурации Тогда
		РезультатФункции = "В конфигурации нет справочника ""Дополнительные отчеты и обработки"", настройка недоступна.";
		Возврат РезультатФункции;
	КонецЕсли;
	
	ДопОтчетыИОбработкиВключены = Константы.ИспользоватьДополнительныеОтчетыИОбработки.Получить();
	Если Не ДопОтчетыИОбработкиВключены Тогда
		РезультатФункции =
			"В конфигурации не включено использование дополнительных отчетов и обработок. Настройка недоступна.";
		Возврат РезультатФункции;
	КонецЕсли;
	
	РезультатФункции = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка();
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|ГДЕ
	|	ДополнительныеОтчетыИОбработки.Наименование = &Наименование
	|	И НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления";
	
	ЗапросДанных.УстановитьПараметр("Наименование", "SABY_ФЗ");
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	Если ВыборкаДанных.Следующий() Тогда
		РезультатФункции = ВыборкаДанных.Ссылка;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура ОбновитьКнопкиИспользованияРегламентныхЗаданий()
	
	НеИспользуется = Новый Картинка;
	Используется   = КартинкаИнтерфейса(ЭтаФорма, "ESD_Успешно32");
	
	Если ЗначениеЗаполнено(ЭтаФорма.ИдентификаторРегламентЗагрузки)
		И ЭтаФорма.ИспользуетсяРегламентЗагрузки Тогда
		
		Элементы.АктивностьЗагрузки.Картинка = Используется;
		
	Иначе
		Элементы.АктивностьЗагрузки.Картинка = НеИспользуется;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ЭтаФорма.ИдентификаторРегламентВыгрузки)
		И ЭтаФорма.ИспользуетсяРегламентВыгрузки Тогда
		
		Элементы.АктивностьВыгрузки.Картинка = Используется;
		
	Иначе
		Элементы.АктивностьВыгрузки.Картинка = НеИспользуется;
	КонецЕсли;
	
КонецПроцедуры

#Область include_etrn_base_CommonForm_НастройкиЭПД_РегламентныеЗадания
#КонецОбласти // include_etrn_base_CommonForm_НастройкиЭПД_РегламентныеЗадания

#КонецОбласти // РегламентныеЗадания

&НаКлиенте
Процедура ПослеВопросаОДобавленииОбработки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ДополнительныеОтчетыИОбработки.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВсехДокументовОснований(ИмяКоманды)
	
	ПараметрыФормы = ПараметрыДляНастройкиОснований(ИмяКоманды);
	
	ОткрытьФорму("ОбщаяФорма." + ВыборТиповЭПДКлиент(), ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыДляНастройкиОснований(Знач ИмяКоманды)
	
	Если ИмяКоманды = "НастройкиДокументовОснованийЭПЛ" Тогда
		Ссылка = Документы[ПутевойЛист()].ПустаяСсылка();
	ИначеЕсли ИмяКоманды = "НастройкиДокументовОснованийЗнП" Тогда
		Ссылка = Документы[ЗаказНаПеревозку()].ПустаяСсылка();
	Иначе 	
		Ссылка = Документы[ТранспортнаяНакладная()].ПустаяСсылка();
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Ссылка", Ссылка);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьРезультатЗагрузкиСправочника(РезультатЗагрузки)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = РезультатЗагрузки.Текст;
	Сообщение.Сообщить();
	
	Если ЗначениеЗаполнено(РезультатЗагрузки.ОписаниеОшибок) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = РезультатЗагрузки.ОписаниеОшибок;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатЗагрузкиСправочника(Знач НаименованиеСправочника)
	
	ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки();
	
	Если НаименованиеСправочника = "ESD_ВидыУпаковки" Тогда
		Результат = МодульКода("Справочники.ESD_ВидыУпаковки").ЗагрузитьВидыУпаковкиСОнлайна(ОбщиеПараметрыЗагрузки);
	Иначе
		Результат = МодульКода("Справочники.ESD_ОпасныеГрузы").ЗагрузитьОпасныеГрузыСОнлайна(ОбщиеПараметрыЗагрузки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбновитьДанныеНа242160НаСервере()
	
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатПереходаНа242160();
	
КонецФункции

#Область НастройкаГруппировкиПозиций

&НаСервере
Процедура ЗагрузитьПараметрыГруппировки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПараметров = ХранилищеОбщихНастроек.Загрузить("Saby", "ПараметрыГруппировкиПозицийОснований");
	Если СтруктураПараметров <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыГруппировки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПараметров = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыГруппировкиПозицийОснований();
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ЭтаФорма);
	
	ХранилищеОбщихНастроек.Сохранить("Saby", "ПараметрыГруппировкиПозицийОснований", СтруктураПараметров);
	
	ОбновитьВидимостьДоступностьЭлементовГруппировки();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьЭлементовГруппировки(ПриСозданииНаСервере = Ложь)
	
	Если ПриСозданииНаСервере Тогда
		ЗаполнитьРеквизитыНоменклатуры();
	КонецЕсли;
	
	Элементы.ГруппаВариантыГруппировки.Доступность = ЭтаФорма.ГруппироватьТоварыИзДокументовОснований;
	Элементы.РеквизитНоменклатуры.Доступность      = ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры;
	Элементы.НаименованиеОбщейПозиции.Доступность  = ЭтаФорма.ГруппироватьВОднуПозицию;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыНоменклатуры()
	
	Если Метаданные.Справочники.Найти("Номенклатура") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппироватьПоРеквизитуНоменклатуры.Доступность = Истина;
	
	Для Каждого Реквизит Из Справочники["Номенклатура"].ПустаяСсылка().Метаданные().Реквизиты Цикл
		Элементы.РеквизитНоменклатуры.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // НастройкаГруппировкиПозиций

&НаСервере
Процедура ЗагрузитьИспользоватьСНИЛС()
	
	ЭтаФорма.ИспользоватьСНИЛС = ХранилищеОбщихНастроек.Загрузить("Saby", "ИспользоватьСНИЛС");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИспользованиеСНИЛС()
	
	ХранилищеОбщихНастроек.Сохранить("Saby", "ИспользоватьСНИЛС", ЭтаФорма.ИспользоватьСНИЛС);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИспользованиеТабельногоНомера()
	
	ХранилищеОбщихНастроек.Сохранить("Saby", "ИспользоватьТабельныйНомер", ЭтаФорма.ИспользоватьТабельныйНомер);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИспользоватьТабельныйНомер()
	
	ЭтаФорма.ИспользоватьТабельныйНомер = ХранилищеОбщихНастроек.Загрузить("Saby", "ИспользоватьТабельныйНомер");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПользователейФоновыхЗаданий()
	
	Элементы.ПользовательФоновыхЗаданий.СписокВыбора.Очистить();
	
	МассивПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого Пользователь Из МассивПользователей Цикл
		Элементы.ПользовательФоновыхЗаданий.СписокВыбора.Добавить(Пользователь.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыЗадания(Знач Идентификатор)
	
	ПараметрыЗадания = Новый Структура;
	
	Если Идентификатор = ЭтаФорма.ИдентификаторРегламентВыгрузки Тогда
		Использование = ЭтаФорма.ИспользуетсяРегламентВыгрузки;
	ИначеЕсли Идентификатор = ЭтаФорма.ИдентификаторРегламентЗагрузки Тогда
		Использование = ЭтаФорма.ИспользуетсяРегламентЗагрузки;
	Иначе
		Использование = Ложь;
	КонецЕсли;
	
	ПараметрыЗадания.Вставить("Использование", Использование);
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ПользовательФоновыхЗаданий) Тогда
		ИмяПользователяИБ =  ИмяТекущегоПользователяИБ();
	Иначе
		ИмяПользователяИБ = ЭтаФорма.ПользовательФоновыхЗаданий;
	КонецЕсли;
	
	ПараметрыЗадания.Вставить("ИмяПользователя", ИмяПользователяИБ);
	
	Возврат ПараметрыЗадания;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИмяТекущегоПользователяИБ()
	
	ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	ИмяПользователя = "";
	Если ТекущийПользовательИБ <> Неопределено Тогда
		ИмяПользователя =  ТекущийПользовательИБ.Имя;
	КонецЕсли;
	
	Возврат ИмяПользователя;
	
КонецФункции

#Область Авторизация

&НаСервере
Процедура АвторизацияРасширения()
	
	Если Не ЭтоESD Тогда
		Возврат;		
	КонецЕсли;	
	
	УстановитьЗаголовокАвторизации();	
	
КонецПроцедуры

&НаСервере
Процедура ВыйтиНаСервере()
	
	МодульОбъектаОбработки = ОбъектОбработки();
	
	saby_param = МодульОбъектаОбработки.НастройкиПодключенияПрочитать();
	Если saby_param <> Неопределено Тогда	
		saby_param.Вставить("session", Неопределено);
		saby_param.Вставить("password", Неопределено);
		МодульОбъектаОбработки.НастройкиПодключенияЗаписать(saby_param);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокАвторизации(Знач Выйти = Ложь)
	
	Если Выйти Тогда
		ВыйтиНаСервере();
	КонецЕсли;	
	
	ОбъектОбработки = ОбъектОбработки();
	
	ПараметрыАвторизации = ОбъектОбработки.НастройкиПодключенияПрочитать();
	СтруктураСессии = ОбъектОбработки.СтруктураСессии(ПараметрыАвторизации);
	
	АвторизацияВыполнена =
	    ТипЗнч(СтруктураСессии) = Тип("Структура")
		И ЗначениеЗаполнено(СтруктураСессии);
		
	Если АвторизацияВыполнена Тогда
		Элементы.ДекорацияАвторизация.Заголовок = "Выйти";
		Элементы.ДекорацияАвторизация.Подсказка = "Закрыть сессию";
	Иначе
		Элементы.ДекорацияАвторизация.Заголовок = "Войти";
		Элементы.ДекорацияАвторизация.Подсказка = "Открыть сессию";
	КонецЕсли;
	
	ФИОАвторизации = "";
	ИмяСервиса     = "";	
	Если АвторизацияВыполнена
		И СтруктураСессии.Свойство("user_fio") Тогда
		
		ФИОАвторизации = СтруктураСессии.user_fio;
		ИмяСервиса = ПараметрыАвторизации.api_url;
		
	КонецЕсли;
	
	Элементы.ДекорацияПользователь.Заголовок = ФИОАвторизации;
	Элементы.ДекорацияСервис.Заголовок	     = ИмяСервиса;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРезультатаЗакрытияФормыАвторизации(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	Иначе 
		УстановитьЗаголовокАвторизации();
		ПослеАвторизации();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеАвторизации()
	
	СоздатьСопоставленияПоУмолчанию();
	
	ОбновитьСопоставленныеДанные();
	
КонецПроцедуры

#КонецОбласти // Авторизация

&НаСервере
Процедура ВывестиТекущуюВерсию()
	
	Если Найти(ЭтаФорма.ИмяФормы, "ESD") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонВерсии = "Версия: %1";
	
	ИмяИВерсия = МодульКода("ESD_Core").ПолучитьИмяФайлаИНомерТекущейВерсии();
	Версия     = ИмяИВерсия[1];
	
	Элементы.ДекорацияВерсия.Заголовок = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(ШаблонВерсии, Версия);
	
КонецПроцедуры

&НаСервере
Процедура ИспользуемыйФункционал()
	
	Если Не ЭтоESD Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ИспользоватьТранспортнаяНакладная = Константы.ESD_ИспользоватьТранспортнаяНакладная.Получить();
	ЭтаФорма.ИспользоватьПутевойЛист           = Константы.ESD_ИспользоватьПутевойЛист.Получить();
	ЭтаФорма.ИспользоватьЗаказНаПеревозку      = Константы.ESD_ИспользоватьЗаказНаПеревозку.Получить();
	
	Если ОтключенВесьФункционал() Тогда
		
		// Первоначальная инициализация
		Константы.ESD_ИспользоватьТранспортнаяНакладная.Установить(Истина);
		Константы.ESD_ИспользоватьПутевойЛист.Установить(Истина);
		Константы.ESD_ИспользоватьЗаказНаПеревозку.Установить(Истина);
		
		// перечитаем настройки
		ИспользуемыйФункционал();
		
	КонецЕсли;
		
КонецПроцедуры

#Область ИспользуемыйФункционал

&НаКлиенте
Процедура ОбновитьЗначениеФункциональнойОпции(ИмяОпции)
	
	ОбновитьЗначениеФункциональнойОпцииСервер(ИмяОпции);
	ОбновитьИнтерфейс();
	
	ОбновитьРабочийСтолCF();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначениеФункциональнойОпцииСервер(Знач ИмяОпции)
	
	Значение     = ЭтаФорма[ИмяОпции];
	ИмяКонстанты = "ESD_" + ИмяОпции;
		
	Если ОтключенВесьФункционал() Тогда
		
		ТекстСообщения = "Нельзя отключить весь функционал! Оставьте активным хотя бы один документ";
		МодульКода("ESD_ТНОбщегоНазначенияСервер").СообщитьПользователюСервер(ТекстСообщения, , "ГруппаИспользуемыйФункционал");
		
		// вернем флаг обратно
		ЭтаФорма[ИмяОпции] = Не ЭтаФорма[ИмяОпции];
		
	Иначе		
		Константы[ИмяКонстанты].Установить(Значение);		
	КонецЕсли;	
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Функция ОтключенВесьФункционал()
	
	ВключенОдинДокумент = Макс(
		ЭтаФорма.ИспользоватьТранспортнаяНакладная, 
		ЭтаФорма.ИспользоватьПутевойЛист, 
		ЭтаФорма.ИспользоватьЗаказНаПеревозку);
		
	Возврат Не ВключенОдинДокумент;	
	
КонецФункции

&НаСервере
Процедура ОбновитьВидимостьПоФункциональнымОпциям()
	
	Если Не ЭтаФорма.ЭтоESD Тогда
		Возврат;
	КонецЕсли;
		
	// ЭТрН	
	Элементы.НастройкиДокументовОснованийЭТрН.Видимость = ЭтаФорма.ИспользоватьТранспортнаяНакладная; 
	Элементы.ГруппаESD_ТранспортнаяНакладная.Видимость  = ЭтаФорма.ИспользоватьТранспортнаяНакладная;
		
	// ЭПЛ		
	Элементы.НастройкиДокументовОснованийЭПЛ.Видимость  = ЭтаФорма.ИспользоватьПутевойЛист;
	Элементы.ГруппаESD_ПутевойЛист.Видимость            = ЭтаФорма.ИспользоватьПутевойЛист; 
	Элементы.ГруппаИспользоватьСНИЛС.Видимость          = ЭтаФорма.ИспользоватьПутевойЛист;
	
	// ЗнП
	Элементы.НастройкиДокументовОснованийЗнП.Видимость  = ЭтаФорма.ИспользоватьЗаказНаПеревозку;
	Элементы.ГруппаESD_ЗаказНаПеревозку.Видимость       = ЭтаФорма.ИспользоватьЗаказНаПеревозку;
	
	// Остальные	
	ЕстьЭтрНИлиЗаказ = ЭтаФорма.ИспользоватьТранспортнаяНакладная 
						Или ЭтаФорма.ИспользоватьЗаказНаПеревозку;
						
	Элементы.ГруппаНастройкаГруппировки.Видимость = ЕстьЭтрНИлиЗаказ;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРабочийСтолCF()

	Если ЭтоCF() Тогда
		Оповестить("ESD_ОбновитьРабочийСтол");
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Функция ЭтоCF()
	
	// Для старых конфигураций работающих на CF	
	ИмяОпции = "ESD_ИспользоватьТранспортнаяНакладная";	
	Возврат Метаданные.ФункциональныеОпции.Найти(ИмяОпции) = Неопределено;
	
КонецФункции

#КонецОбласти // ИспользуемыйФункционал

&НаКлиенте
Процедура ОткрытьРедакторФайловНастроекНажатие(Элемент)
		
	ESDКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");	
	context_params  = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД", Неопределено);
	
	Сессия   = ESDКлиентСервер.ДанныеСтруктуры(context_params, "session");
	АПИАдрес = ESDКлиентСервер.ДанныеСтруктуры(context_params, "api_url");
	
	Если Сессия <> Неопределено Тогда
		
		web_interface = ESDКлиентСервер.ДанныеСтруктуры(context_params, "public.web_interface");
		Если web_interface = "BrowserSabyPlugin" Тогда
			connector = "Lpp1C2";
		ИначеЕсли web_interface = "BrowserSaby" Тогда
			connector = "1c-lppbl";
		Иначе
			connector = "1C2";	
		КонецЕсли;
		
		АдресСтраницы = context_params.api_url
			+ "/blockly_editor_1c/page/?connection_id="
			+ context_params.ConnectionId
			+ "&connector="
			+ connector
			+ "&command="
			+ connector; 
			
	ИначеЕсли АПИАдрес <> Неопределено Тогда
		АдресСтраницы = context_params.api_url + "/auth/";
	Иначе
		АдресСтраницы = "https://ie-1c.saby.ru/auth/";	
	КонецЕсли;
	
	ПараметрыФормыРедактора = Новый Структура();
	ПараметрыФормыРедактора.Вставить("Заголовок", "Редактор файлов настроек");
	ПараметрыФормыРедактора.Вставить("АдресСтраницы", АдресСтраницы);
	ОткрытьФорму(ФормыЯдраКлиент() + "Browser", ПараметрыФормыРедактора, , "Редактор файлов настроек");
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьКэшНажатие(Элемент)
	СброситьКэшНаСервере();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Общие настройки ини очищены";
	Сообщение.Сообщить();
КонецПроцедуры

&НаСервере
Процедура СброситьКэшНаСервере()
	ОбъектОбработки = ОбъектОбработки();
	ОбъектОбработки.СброситьКэшНаСервере();
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_base_CommonForm_НастройкиЭПД_НастройкиСопоставлений
#КонецОбласти // include_base_CommonForm_НастройкиЭПД_НастройкиСопоставлений

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область includr_etrn_base_CommonModule_Метаданные
#КонецОбласти // includr_etrn_base_CommonModule_Метаданные

#Область includr_etrn_base_CommonModule_МетаданныеКлиент
#КонецОбласти // includr_etrn_base_CommonModule_МетаданныеКлиент

#Область includr_etrn_base_CommonModule_КартинкаИнтерфейса
#КонецОбласти // includr_etrn_base_CommonModule_КартинкаИнтерфейса

#Область includr_etrn_base_CommonModule_ОбъектОбработки
#КонецОбласти // includr_etrn_base_CommonModule_ОбъектОбработки

#Область include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере
#КонецОбласти // include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере
