
#Область ПеременныеФормы

// BSLLS:UnusedLocalVariable-off
&НаКлиенте
Перем ТранспортИнтеграции;
// BSLLS:UnusedLocalVariable-on

#КонецОбласти

#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ЭтоESD = ЭтоУниверсальноеРасширение();
	
	// Установим значение прохождения первичной инициализации
	ЭтаФорма.ПройденаПервичнаяИнициализация = ПройденаПервичнаяИнициализация();
	// Обработаем прохождение первичной инициализации
	Если ЭтаФорма.ПройденаПервичнаяИнициализация Тогда
		ЗаполнитьИнтерфейсНастроек();
		ПослеИзмененияАвторизацииНаСервере();
	КонецЕсли;

	// Настроим видимость и доступность элементов относительно первичной инициализации
	ОбновитьВидимостьИДоступностьЭлементов();
	
	// Подключение модуля "длительных операций" на форму
	МодульКода("ESD_ДлительныеОперации").Подключаемый_ПриСозданииНаСервере(ЭтаФорма);
	// Подключение "общих настроек ЭПД" на форму
	ESD_ОбщийФункционалСервер.ОбщиеНастройкиЭПД_Инициализация(ЭтаФорма, Элементы.ГруппаОбщийФункционалЭПД);
КонецПроцедуры

#Область include_base_CommonForm_НастройкиЭПД_ОбновлениеВерсииОбработчикиСобытийФормы
#КонецОбласти // include_base_CommonForm_НастройкиЭПД_ОбновлениеВерсииОбработчикиСобытийФормы

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы  

&НаКлиенте
Процедура ВыгружатьАрхивВложенийПриИзменении(Элемент)
	
	ВыгружатьАрхивВложений();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьТоварыИзДокументовОснованийПриИзменении(Элемент)
	
	Если Не ЭтаФорма.ГруппироватьТоварыИзДокументовОснований Тогда
		ЭтаФорма.ГруппироватьВОднуПозицию            = Ложь;
		ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьПоРеквизитуНоменклатурыПриИзменении(Элемент)
	
	Если ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры Тогда
		ЭтаФорма.ГруппироватьВОднуПозицию = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитНоменклатурыПриИзменении(Элемент)
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьВОднуПозициюПриИзменении(Элемент)
	
	Если ЭтаФорма.ГруппироватьВОднуПозицию Тогда
		ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбщейПозицииПриИзменении(Элемент)
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСНИЛСПриИзменении(Элемент)
	
	СохранитьИспользованиеСНИЛС();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвторизацию(Элемент)
	
	Если Элементы.ДекорацияАвторизация.Заголовок = "Войти" Тогда
		ОткрытьФормуАвторизации();
	Иначе		
		ВыйтиНаСервере();
		ПослеВыхода();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновлениеНажатие(Элемент)
    // BSLLS:UsingSynchronousCalls-off
    ЗапуститьПриложение(Элемент.Подсказка);
    // BSLLS:UsingSynchronousCalls-on
КонецПроцедуры 

&НаКлиенте
Процедура ИспользоватьТабельныйНомерПриИзменении(Элемент)
	
	СохранитьИспользованиеТабельногоНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтаКонфигурацияПриИзменении(Элемент)
	ПроверкаВозможностиЗагрузкиНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ЭтаКонфигурацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПроцедураПослеВопросаООчистке = Новый ОписаниеОповещения(
			"ПослеВопросаООчисткеНастроек", ЭтаФорма);
		
		ПоказатьВопрос(
			ПроцедураПослеВопросаООчистке,
			"Будут очищены все имеющиеся настройки сопоставлений, продолжить?",
			РежимДиалогаВопрос.ДаНет,
			120,
			КодВозвратаДиалога.Нет,
			"Очистить настройки сопоставлений?",
			КодВозвратаДиалога.Нет);
			
КонецПроцедуры

&НаКлиенте
Процедура ХранитьСтатусыВДопСведенияхПриИзменении(Элемент)
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияСервер")
		.ХранитьСтатусыВДополнительныхСведениях_Записать(ЭтаФорма.ХранитьСтатусыВДопСведениях);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАккаунтНажатие(Элемент)
	ОповещениеПослеСменыАккаунта = Новый ОписаниеОповещения("ПослеСменыАккаунта", ЭтаФорма);
	СменитьАккаунтВВыпадающемСписке(Элемент, , ОповещениеПослеСменыАккаунта);
КонецПроцедуры

&НаКлиенте
Процедура СписокРегламентныхЗаданийПользовательПриИзменении(Элемент)
	МодульКодаКлиент("ESD_РегламентныеЗаданияКлиент").ИзменитьПользователяРегламентныхЗаданий(
		ЭтаФорма.Элементы.СписокРегламентныхЗаданий.ТекущиеДанные);
    РегламентныеЗадания_ПослеИзменения(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СписокРегламентныхЗаданийИспользованиеПриИзменении(Элемент)
	МодульКодаКлиент("ESD_РегламентныеЗаданияКлиент").ИзменитьАктивностьРегламентныхЗаданий(
		ЭтаФорма.Элементы.СписокРегламентныхЗаданий.ТекущиеДанные);
	РегламентныеЗадания_ПослеИзменения(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СписокРегламентныхЗаданийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбранноеРегЗадание = Элемент.ТекущиеДанные;
	Если ВыбранноеРегЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.СписокРегламентныхЗаданийРучнойЗапуск Тогда
		РегламентныеЗадания_ВыполнитьВручную(ВыбранноеРегЗадание.УникальныйИдентификатор, ВыбранноеРегЗадание.Наименование);
	ИначеЕсли Поле = Элементы.СписокРегламентныхЗаданийРасписание Тогда
		РегламентныеЗадания_ИзменитьРасписание(ВыбранноеРегЗадание.УникальныйИдентификатор);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Декорация_ДополнительныеПоляНажатие(Элемент)
	ОткрытьФорму("Справочник.ESD_ДополнительныеПоля.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкиДокументовОснований(Команда)
	
	ТекущаяКнопка = ЭтаФорма.ТекущийЭлемент;
	
	НастройкаВсехДокументовОснований(ТекущаяКнопка.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСправочникВидыУпаковки(Команда)
	
	РезультатЗагрузки = РезультатЗагрузкиСправочника("ESD_ВидыУпаковки");
	
	ПоказатьРезультатЗагрузкиСправочника(РезультатЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСправочникОпасныеГрузы(Команда)
	
	РезультатЗагрузки = РезультатЗагрузкиСправочника("ESD_ОпасныеГрузы");
	
	ПоказатьРезультатЗагрузкиСправочника(РезультатЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПервыйВход(Команда)
	
	ОткрытьФормуАвторизации();
		
КонецПроцедуры

&НаКлиенте
Процедура ЭПЛ_ПечатнаяФормаПриИзменении(Элемент)
	ФункционалПечатныхФорм_СохранитьНастройкиНаСервере("ESD_ПутевойЛист", ПечатнаяФормаЭПЛ);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции 

#Область include_etrn_base_CommonForm_НастройкиЭПД_ОбработчикиОповещений_ОбработкаОповещенияВыходИзменитьАвторизацию
#КонецОбласти // include_etrn_base_CommonForm_НастройкиЭПД_ОбработчикиОповещений_ОбработкаОповещенияВыходИзменитьАвторизацию

#Область НастройкаИнтерфейсаФормы

&НаСервере
Процедура ОбновитьВидимостьИДоступностьЭлементов()
	Если ЭтоESD Тогда	
		Элементы.ВыполнитьПервыйВход.Видимость = Не ЭтаФорма.ПройденаПервичнаяИнициализация;	
		Если Не ПройденаПервичнаяИнициализация Тогда 
			НастройкаИнтерфейсаДляПервогоВхода();
			Возврат;
		КонецЕсли;				
	КонецЕсли;	
				
	ОбновитьВидимостьДоступностьЭлементовГруппировки(Истина);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнтерфейсНастроек()
	// Применим параметры настроек прав расширения
	МодульКода("РегистрыСведений.ESD_НастройкаПравРасширения").НастроитьИнтерфейсФормы(ЭтаФорма);

	ЗагрузитьПараметрыГруппировки();
	ЗаполнитьНастройкиСопоставлений();
	ВывестиТекущуюВерсию();
	ЗагрузитьДополнительныеНастройки();
	РегламентныеЗадания_ПервичнаяНастройка();
КонецПроцедуры

&НаСервере
Процедура НастройкаИнтерфейсаДляПервогоВхода(ВходВыполнен = Ложь)
		
	МассивЭлементов = Новый Массив;
	
	МассивЭлементов.Добавить("ГруппаВходВыход");
	МассивЭлементов.Добавить("ГруппаВерсия");
	МассивЭлементов.Добавить("ГруппаНачальноеЗаполнение");
	МассивЭлементов.Добавить("ГруппаОбщийФункционалЭПД");		
	МассивЭлементов.Добавить("ГруппаНастройкаГруппировки");
	МассивЭлементов.Добавить("ГруппаРегламентныеЗадания");
	МассивЭлементов.Добавить("ГруппаНастройкаСопоставлений");
	МассивЭлементов.Добавить("ГруппаНастройкиВложенийИПечатныхФорм");
	МассивЭлементов.Добавить("Дополнительно");
	
	МассивЭлементов.Добавить("ДекорацияПользователь");
	МассивЭлементов.Добавить("ДекорацияСервис");
	МассивЭлементов.Добавить("ГруппаАккаунт");
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", ВходВыполнен, МассивЭлементов);
	
КонецПроцедуры

#КонецОбласти // НастройкаИнтерфейсаФормы

#Область РегламентныеЗадания

&НаСервере
Процедура РегламентныеЗадания_ПервичнаяНастройка()
	Если Не Элементы.ГруппаРегламентныеЗадания.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	РегламентныеЗадания_ОбновитьСписок();
	РегламентныеЗадания_ЗаполнитьСписокВыбораПользователей();
	РегламентныеЗадания_НастроитьВизуальноеОформление();
КонецПроцедуры

&НаСервере
Процедура РегламентныеЗадания_ОбновитьСписок()
	СписокРегламентныхЗаданий.Очистить();
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	МассивРегЗаданий = ESD_РегламентныеЗаданияСлужебный.ПредопределенныеРегламентныеЗадания();
	Для Каждого ОписаниеРегламентное Из МассивРегЗаданий Цикл
		Если ОписаниеРегламентное.Значение.Служебный Тогда
			Продолжить;
		КонецЕсли;
		
		Задание = ESD_РегламентныеЗаданияСлужебный.НайтиРегламентноеЗаданиеПоКлючу(ОписаниеРегламентное.Значение.Ключ);
		Если Задание = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СписокРегламентныхЗаданий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Задание);
		ОписаниеРегламентное.Значение.Свойство("Подсказка", НоваяСтрока.Подсказка);
		НоваяСтрока.РучнойЗапуск = "Запустить вручную";
	КонецЦикла;
	
	Элементы.СписокРегламентныхЗаданий.ВысотаВСтрокахТаблицы = СписокРегламентныхЗаданий.Количество();
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервере
Процедура РегламентныеЗадания_ЗаполнитьСписокВыбораПользователей()
	Элементы.СписокРегламентныхЗаданийПользователь.СписокВыбора.Очистить();
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Попытка    
		МассивПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Исключение       
		МассивПользователей = Новый Массив;
		МассивПользователей.Добавить(ПользователиИнформационнойБазы.ТекущийПользователь());
	КонецПопытки;
	
	Для Каждого Пользователь Из МассивПользователей Цикл
		Элементы.СписокРегламентныхЗаданийПользователь.СписокВыбора.Добавить(Пользователь.Имя);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеЗадания_ВыполнитьВручную(УникальныйИдентификатор, Наименование)
	ПараметрыВыполнения = МодульКодаКлиент("ESD_РегламентныеЗаданияКлиент").ВыполнитьРегламентноеЗаданиеВручную(
		УникальныйИдентификатор, Наименование);
	Если ПараметрыВыполнения.ЗапускВыполнен Тогда
		Текст = НСтр("ru = 'Запущена процедура регламентного задания';
			|en = 'Scheduled job started'");
		
		ЭтаФорма.ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Добавить(
			УникальныйИдентификатор,
			Наименование);
		
		ТаймаутПроверкиВыполненияРегЗадания = 0.1;	
		ПодключитьОбработчикОжидания("РегламентныеЗадания_СообщитьОбОкончанииРучногоВыполнения"
			, ТаймаутПроверкиВыполненияРегЗадания
			, Истина);
	Иначе
		Текст = НСтр("ru = 'Процедура регламентного задания не запущена';
			|en = 'Scheduled job not started'");		
	КонецЕсли;
	
	ПоказатьИнформативноеОповещениеПользователя(Текст,,
		ПараметрыВыполнения.Пояснение,
		БиблиотекаКартинок.ESD_Часы);	
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеЗадания_ИзменитьРасписание(УникальныйИдентификатор)
	ОписаниеОповещения = Новый ОписаниеОповещения("РегламентныеЗадания_ПослеИзменения", ЭтаФорма);
	МодульКодаКлиент("ESD_РегламентныеЗаданияКлиент").ИзменитьРасписаниеРегламентныхЗаданий( 
		УникальныйИдентификатор,
		ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеЗадания_ПослеИзменения(Результат, ДополнительныеПараметры = Неопределено) Экспорт
    РегламентныеЗадания_ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеЗадания_СообщитьОбОкончанииРучногоВыполнения()
	ОповещенияОбОкончанииВыполнения = РегламентныеЗадания_ОповещенияОбОкончанииВыполнения();
	Для каждого Оповещение Из ОповещенияОбОкончанииВыполнения Цикл	
		Текст = НСтр("ru = 'Выполнена процедура регламентного задания';
			|en = 'Scheduled job procedure completed'");
		
		СтрокаДляПояснения = НСтр("ru = '%1.
			|Процедура завершена в фоновом задании %2';
			|en = '%1.
			|The scheduled job has been completed in the background job ""%2"".'");
		
		ТекстПояснения = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
			СтрокаДляПояснения,
			Оповещение.ПредставлениеРегламентногоЗадания,
			Строка(Оповещение.МоментОкончания));
		
		ПоказатьИнформативноеОповещениеПользователя(Текст,,
			ТекстПояснения,
			БиблиотекаКартинок.ESD_Часы);	
	КонецЦикла;
	
	Если ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Количество() > 0 Тогда	
		ПодключитьОбработчикОжидания("РегламентныеЗадания_СообщитьОбОкончанииРучногоВыполнения", 2, Истина);	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция РегламентныеЗадания_ОповещенияОбОкончанииВыполнения()
	
	ОповещенияОбОкончанииВыполнения = Новый Массив;
	
	Если ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Количество() > 0 Тогда
		Индекс = ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Количество() - 1;
		
		УстановитьПривилегированныйРежим(Истина);
		Пока Индекс >= 0 Цикл
			
			НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор(
				ИдентификаторыФоновыхЗаданийПриРучномВыполнении[Индекс].Значение);
			Отбор = Новый Структура;
			Отбор.Вставить("УникальныйИдентификатор", НовыйУникальныйИдентификатор);
			
			МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
			
			Если МассивФоновыхЗаданий.Количество() = 1 Тогда
				МоментОкончания = МассивФоновыхЗаданий[0].Конец;
				
				Если ЗначениеЗаполнено(МоментОкончания) Тогда
					
					ОповещениеОкончания = Новый Структура;
					ОповещениеОкончания.Вставить("ПредставлениеРегламентногоЗадания",
						ИдентификаторыФоновыхЗаданийПриРучномВыполнении[Индекс].Представление);
					
					ОповещениеОкончания.Вставить("МоментОкончания", МоментОкончания);
					
					ОповещенияОбОкончанииВыполнения.Добавить(ОповещениеОкончания);
					
					ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Удалить(Индекс);
				КонецЕсли;
			Иначе
				ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Удалить(Индекс);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ОповещенияОбОкончанииВыполнения;
	
КонецФункции

&НаСервере
Процедура РегламентныеЗадания_НастроитьВизуальноеОформление()
	Элементы.СписокРегламентныхЗаданий.ИзменятьСоставСтрок = Ложь;
	Элементы.СписокРегламентныхЗаданий.ИзменятьПорядокСтрок = Ложь;
	Элементы.СписокРегламентныхЗаданий.РазрешитьНачалоПеретаскивания = Ложь;
	Элементы.СписокРегламентныхЗаданий.РазрешитьПеретаскивание = Ложь;
	Элементы.СписокРегламентныхЗаданий.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
	Элементы.СписокРегламентныхЗаданий.ЦветФона = ЦветаСтиля.ЦветФонаФормы;
	Элементы.СписокРегламентныхЗаданий.Шапка = Ложь;
	Элементы.СписокРегламентныхЗаданийГруппаКолонокИмяПользователя.Видимость = Не ЭтоCF();
КонецПроцедуры

#КонецОбласти // РегламентныеЗадания

&НаКлиенте
Процедура ПослеВопросаОДобавленииОбработки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ДополнительныеОтчетыИОбработки.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВсехДокументовОснований(ИмяКоманды)
	
	ПараметрыФормы = ПараметрыДляНастройкиОснований(ИмяКоманды);
	
	ОткрытьФорму("ОбщаяФорма." + ВыборТиповЭПДКлиент(), ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыДляНастройкиОснований(Знач ИмяКоманды)
	
	Если ИмяКоманды = "НастройкиДокументовОснованийЭПЛ" Тогда
		Ссылка = Документы[ПутевойЛист()].ПустаяСсылка();
	ИначеЕсли ИмяКоманды = "НастройкиДокументовОснованийЗнП" Тогда
		Ссылка = Документы[ЗаказНаПеревозку()].ПустаяСсылка();
	Иначе 	
		Ссылка = Документы[ТранспортнаяНакладная()].ПустаяСсылка();
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Ссылка", Ссылка);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьРезультатЗагрузкиСправочника(РезультатЗагрузки)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = РезультатЗагрузки.Текст;
	Сообщение.Сообщить();
	
	Если ЗначениеЗаполнено(РезультатЗагрузки.ОписаниеОшибок) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = РезультатЗагрузки.ОписаниеОшибок;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатЗагрузкиСправочника(Знач НаименованиеСправочника)
	
	ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки();
	
	Если НаименованиеСправочника = "ESD_ВидыУпаковки" Тогда
		Результат = МодульКода("Справочники.ESD_ВидыУпаковки").ЗагрузитьВидыУпаковкиСОнлайна(ОбщиеПараметрыЗагрузки);
	Иначе
		Результат = МодульКода("Справочники.ESD_ОпасныеГрузы").ЗагрузитьОпасныеГрузыСОнлайна(ОбщиеПараметрыЗагрузки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбновитьДанныеНа242160НаСервере()
	
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатПереходаНа242160();
	
КонецФункции

#Область НастройкаГруппировкиПозиций

&НаСервере
Процедура ЗагрузитьПараметрыГруппировки()
	Если Не Элементы.ГруппаНастройкаГруппировки.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = ESD_ТНОбщегоНазначенияСервер
		.ESD_ЗагрузитьНастройкиОбъекта("ПараметрыГруппировкиПозицийОснований");
	Если СтруктураПараметров <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыГруппировки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПараметров = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыГруппировкиПозицийОснований();
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ЭтаФорма);
	
	ESD_ТНОбщегоНазначенияСервер.ESD_СохранитьНастройкиОбъекта("ПараметрыГруппировкиПозицийОснований", 
		СтруктураПараметров);
	
	ОбновитьВидимостьДоступностьЭлементовГруппировки();
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьВидимостьДоступностьЭлементовГруппировки(ПриСозданииНаСервере = Ложь)
	Если Не Элементы.ГруппаНастройкаГруппировки.Видимость Тогда
		Возврат;
	КонецЕсли;

	Если ПриСозданииНаСервере Тогда
		ЗаполнитьРеквизитыНоменклатуры();
	КонецЕсли;
	
	Элементы.ГруппаВариантыГруппировки.Доступность = ЭтаФорма.ГруппироватьТоварыИзДокументовОснований;
	Элементы.РеквизитНоменклатуры.Доступность      = ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры;
	Элементы.НаименованиеОбщейПозиции.Доступность  = ЭтаФорма.ГруппироватьВОднуПозицию; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыНоменклатуры()
	
	Если Метаданные.Справочники.Найти("Номенклатура") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппироватьПоРеквизитуНоменклатуры.Доступность = Истина;
	
	Для Каждого Реквизит Из Справочники["Номенклатура"].ПустаяСсылка().Метаданные().Реквизиты Цикл
		Элементы.РеквизитНоменклатуры.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // НастройкаГруппировкиПозиций  

#Область ГруппаНастройкаВложенийИПечатныхФорм

&НаСервере
Процедура НастроитьФункционалВложенийИПечатныхФорм()
	Если Не Элементы.ГруппаНастройкиВложенийИПечатныхФорм.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФункционалПечати();
	НастроитьФункционалВложений();
КонецПроцедуры

#Область ФункционалПечати

&НаСервере
Процедура НастроитьФункционалПечати()
	НастройкиПечати_ЭПЛ();	
КонецПроцедуры

#Область ФункционалПечатиЭПЛ

&НаСервере
Процедура НастройкиПечати_ЭПЛ()
	// Видимость и доступность элементов по умолчанию 
	Элементы.Декорация_ФункционалПечатиОшибка_ЭПЛ.Видимость = Ложь;
	Элементы.ПечатнаяФормаЭПЛ.ТолькоПросмотр = Ложь;
	Элементы.ПечатнаяФормаЭПЛ.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Элементы.ПечатнаяФормаЭПЛ.СписокВыбора.Очистить();
	
	Попытка
		Если НЕ АвторизацияВыполнена Тогда
			ВызватьИсключение ФункционалПечатныхФорм_ОшибкаОтсутствуетАвторизация();	
		КонецЕсли;
		
		// Попытка получения и заполнения печатных форм
		ПечатнаяФормаЭПЛ_ЗаполнитьДанныеВыбора();
	Исключение
		ИнфоОшибки = ИнформацияОбОшибке();
		
		Элементы.Декорация_ФункционалПечатиОшибка_ЭПЛ.Видимость = Истина;
		Элементы.Декорация_ФункционалПечатиОшибка_ЭПЛ.Заголовок = КраткоеПредставлениеОшибки(ИнфоОшибки);
		Элементы.ПечатнаяФормаЭПЛ.ТолькоПросмотр = Истина;
		Элементы.ПечатнаяФормаЭПЛ.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПечатнаяФормаЭПЛ_ЗаполнитьДанныеВыбора()
	ИмяМетаданных = "ESD_ПутевойЛист";
	
	Попытка
		ПечатныеФормы = ЗагрузитьСписокВыбораПечатныхФорм(ИмяМетаданных);
	Исключение
		ВызватьИсключение ФункционалПечатныхФорм_ОшибкаПолученияПечатныхФорм();	
	КонецПопытки;
	
	// Заполнение списка выбора
	Для Каждого ДанныеПФ Из ПечатныеФормы Цикл
		ДанныеПечатнойФормы = ДанныеПФ["Values"];
		Элементы.ПечатнаяФормаЭПЛ.СписокВыбора.Добавить(ДанныеПечатнойФормы["Id"], ДанныеПечатнойФормы["Name"]);
	КонецЦикла;
	
	// Получение текущей печатной формы
	ЭтаФорма.ПечатнаяФормаЭПЛ = ВыбраннаяПечатнаяФорма(ИмяМетаданных);
КонецПроцедуры

#КонецОбласти

#Область ФункционалПечатиОбщее

&НаСервере
Функция ЗагрузитьСписокВыбораПечатныхФорм(ИмяМетаданных)
	Результат = МодульКода("ESD_ТНЗагрузкаСервер").ВариантыПечатнойФормы(ИмяМетаданных);
	Если Результат.Ошибка Тогда
		ВызватьИсключение Результат.Данные;
	КонецЕсли;
	
	Возврат Результат.Данные;
КонецФункции

&НаСервере
Функция ВыбраннаяПечатнаяФорма(ИмяМетаданных)
	Возврат МодульКода("Документы." + ИмяМетаданных).ТекущаяПечатнаяФорма();
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФункционалПечатныхФорм_ОшибкаОтсутствуетАвторизация()
	Возврат "Выбор печатной формы недоступен. Пожалуйста, выполните авторизацию в Saby";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФункционалПечатныхФорм_ОшибкаПолученияПечатныхФорм()
	Возврат "Выбор печатной формы недоступен. Пожалуйста, переавторизуйтесь в Saby или попробуйте выполнить операцию позднее";
КонецФункции

&НаСервере
Процедура ФункционалПечатныхФорм_СохранитьНастройкиНаСервере(Знач ИмяМетаданныхДокумента, Знач ВыбраннаяПечатнаяФорма)
	// Сохраним настройки документа
	МодульКода("Документы." + ИмяМетаданныхДокумента).СохранитьНастройки(Новый Структура("ПечатнаяФорма", ВыбраннаяПечатнаяФорма));
	
	// Запишем статистику изменения настроек выбора печатной формы
	МодульКода("ESD_ТНЗагрузкаСервер").ЗаписатьСтатистикуВызоваВОблако("ПеревыборПФЭПЛ", "Расширение 1С ESD");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ФункционалВложений

&НаСервере
Процедура ВыгружатьАрхивВложений()
	ESD_ТНОбщегоНазначенияСервер.ESD_СохранитьНастройкиОбъекта("ВыгружатьАрхивВложений", ЭтаФорма.ВыгружатьАрхивВложений);
КонецПроцедуры

&НаСервере
Процедура НастроитьФункционалВложений()
	ЭтаФорма.ВыгружатьАрхивВложений = ESD_ТНОбщегоНазначенияСервер.ESD_ЗагрузитьНастройкиОбъекта("ВыгружатьАрхивВложений");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ДополнительныйФункционал

&НаСервере
Процедура ЗагрузитьДополнительныеНастройки()
	Если Не Элементы.Дополнительно.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьХранитьСтатусыВДопСведениях();
	ЗагрузитьИспользоватьСНИЛС();
	ЗагрузитьИспользоватьТабельныйНомер();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИспользоватьСНИЛС()
	ЭтаФорма.ИспользоватьСНИЛС = ESD_ТНОбщегоНазначенияСервер
		.ESD_ЗагрузитьНастройкиОбъекта("ИспользоватьСНИЛС", , "");
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьХранитьСтатусыВДопСведениях()
	Если Не ЭтаФорма.ЭтоESD Тогда
		Элементы.ГруппаХранениеСтатусов.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений.Найти("ДополнительныеСведения") = Неопределено Тогда
		Элементы.ГруппаХранениеСтатусов.Доступность = Ложь;
	Иначе
		ЭтаФорма.ХранитьСтатусыВДопСведениях = 
			ESD_ТНОбщегоНазначенияСервер.ХранитьСтатусыВДополнительныхСведениях_Загрузить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИспользоватьТабельныйНомер()	
	ЭтаФорма.ИспользоватьТабельныйНомер = ESD_ТНОбщегоНазначенияСервер
		.ESD_ЗагрузитьНастройкиОбъекта("ИспользоватьТабельныйНомер", , "");
КонецПроцедуры

&НаСервере
Процедура СохранитьИспользованиеСНИЛС()
	ESD_ТНОбщегоНазначенияСервер.ESD_СохранитьНастройкиОбъекта("ИспользоватьСНИЛС", 
		ЭтаФорма.ИспользоватьСНИЛС, , "");	
КонецПроцедуры

&НаСервере
Процедура СохранитьИспользованиеТабельногоНомера()	
	ESD_ТНОбщегоНазначенияСервер.ESD_СохранитьНастройкиОбъекта("ИспользоватьТабельныйНомер", 
		ЭтаФорма.ИспользоватьТабельныйНомер, , "");	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ИмяТекущегоПользователяИБ()
	
	ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	ИмяПользователя = "";
	Если ТекущийПользовательИБ <> Неопределено Тогда
		ИмяПользователя =  ТекущийПользовательИБ.Имя;
	КонецЕсли;
	
	Возврат ИмяПользователя;
	
КонецФункции

#Область Авторизация

&НаСервере
Процедура ПослеИзмененияАвторизацииНаСервере()
	Если Не ЭтоESD Тогда
		Возврат;		
	КонецЕсли;	
	
	УстановитьЗаголовокАвторизации();
	НастроитьФункционалВложенийИПечатныхФорм();
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокАвторизации()
	ФИОАвторизации = "";
	ИмяСервиса     = "";	
	ИмяАккаунта    = "";
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	ПараметрыАвторизации = МодульТНОбщегоНазначенияСервер.ESD_ПараметрыАвторизацииПользователя();
	АвторизацияВыполнена = МодульТНОбщегоНазначенияСервер.ESD_АвторизацияПройдена(ПараметрыАвторизации.Сессия);
				
	Если АвторизацияВыполнена Тогда
		Элементы.ДекорацияАвторизация.Заголовок = "Выйти";
		Элементы.ДекорацияАвторизация.Подсказка = "Закрыть сессию";
		
		Если ПараметрыАвторизации.Сессия.Свойство("UserFio") Тогда
			ФИОАвторизации = ПараметрыАвторизации.Сессия.UserFio;
			ИмяСервиса = ПараметрыАвторизации.Подключение.ApiUrl;	
		КонецЕсли;
		
		ПараметрыАвторизации.Сессия.Свойство("AccountTitle", ИмяАккаунта);
		Элементы.ГруппаАккаунт.Видимость = Истина;
	Иначе
		Элементы.ДекорацияАвторизация.Заголовок = "Войти";
		Элементы.ДекорацияАвторизация.Подсказка = "Открыть сессию";
		Элементы.ГруппаАккаунт.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ДекорацияПользователь.Заголовок = ФИОАвторизации;
	Элементы.ДекорацияСервис.Заголовок	     = ИмяСервиса;
	Элементы.ДекорацияАккаунт.Заголовок      = ИмяАккаунта;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРезультатаЗакрытияФормыАвторизации(Результат, Параметры) Экспорт
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПослеАвторизации();	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьАктуальныйСтатусВерсии()
	Если Не (ЭтаФорма.ИспользоватьСсылкаНаОбновление И ЭтаФорма.АвторизацияВыполнена) Тогда
		Элементы.ГруппаОбновление.Видимость = Ложь;
		Возврат;
	КонецЕсли;
		
	Элементы.ГруппаОбновление.Видимость = Истина;
	
	МодульТНОбщегоНазначенияКлиент = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент");
	ПараметрыКоманды = МодульТНОбщегоНазначенияКлиент.ВыполнитьКомандуСбис_ПараметрыКоманды();
	ПараметрыКоманды.Вставить("Подключаемый", Истина);
	МодульТНОбщегоНазначенияКлиент.ВыполнитьКомандуСбис(ЭтаФорма, "АктуальныйСтатусВерсии", Неопределено, 
		ПараметрыКоманды, 
		Новый УникальныйИдентификатор());	
КонецПроцедуры

&НаКлиенте
Процедура ПослеАвторизации()
	// Сохраним текущий признак прохождения первичной инициализации
	ТекущаяСостояниеПервичнойИнициализации = ЭтаФорма.ПройденаПервичнаяИнициализация;
	// Настроим функционал формы на сервере
	ПослеАвторизацииНаСервере();
	
	// При отличии текущего и нового признаков выполнить обработку
	Если ТекущаяСостояниеПервичнойИнициализации <> ЭтаФорма.ПройденаПервичнаяИнициализация Тогда
		ОбновитьРабочийСтол();	
	КонецЕсли;
	
	// После настройки формы выполним обработку общего функционала (не менять местами с "ПослеАвторизацииНаСервере")
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ESD_ПослеАвторизацииПользователя();
	// Выполним обработку первичной инициализации после авторизации
	ПриПервичнойИнициализации();
КонецПроцедуры

&НаСервере
Процедура ПослеАвторизацииНаСервере()
	Если ЭтоESD Тогда
		Если Не ПройденаПервичнаяИнициализация() Тогда		
			// Выполним стандартную обработку прохождения первичной авторизации
			МодульКода("ESD_ТНОбщегоНазначенияСервер").ESD_ПослеПервичнойИнициализации();
			// Обновим состояние первичной инициализации
			ЭтаФорма.ПройденаПервичнаяИнициализация = Истина;
		КонецЕсли;
	КонецЕсли;
	
	НастройкаИнтерфейсаДляПервогоВхода(Истина);
	ЗаполнитьИнтерфейсНастроек();
	ОбновитьВидимостьИДоступностьЭлементов();
	ПослеИзмененияАвторизацииНаСервере();
КонецПроцедуры

#КонецОбласти // Авторизация

#Область Выход

&НаКлиенте
Процедура ПослеВыхода()
	// Сообщим об завершении сеанса
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Сессия и пароль сброшены";
	Сообщение.Сообщить();
	
	// Загрузим актуальную версию
	ОбновитьАктуальныйСтатусВерсии();	
	
	Оповестить("Saby_ОбработкаВыхода");
КонецПроцедуры

&НаСервере
Процедура ВыйтиНаСервере()
	// Удалим параметры сессии из настроек подключения
	УдалитьПараметрыСессииНаСервере();
	// Обновим данные после выхода
	ПослеИзмененияАвторизацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьПараметрыСессииНаСервере()
	МодульОбъектаОбработки = ОбъектОбработки();
	
	saby_param = МодульОбъектаОбработки.НастройкиПодключенияПрочитать();
	Если saby_param <> Неопределено Тогда	
		saby_param.Вставить("session", Неопределено);
		saby_param.Вставить("password", Неопределено);
		МодульОбъектаОбработки.НастройкиПодключенияЗаписать(saby_param);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ВывестиТекущуюВерсию()
	
	Если Найти(ЭтаФорма.ИмяФормы, "ESD") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонВерсии = "Версия: %1 %2";
	
	ИмяИВерсия = МодульКода("ESD_Core").ПолучитьИмяФайлаИНомерТекущейВерсии();
	Версия     = ИмяИВерсия[1];
	
	Если ЭтоCF() Тогда
		Продукт = "CF";
	Иначе
		Продукт = "";
	КонецЕсли;	
	
	Элементы.ДекорацияВерсия.Заголовок = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
		ШаблонВерсии, 
		Версия,
		Продукт);
	
КонецПроцедуры

#Область ИспользуемыйФункционал

&НаКлиенте
Процедура ПриПервичнойИнициализации()
	// Обновим проверку возможности загрузки настроек
	ПроверкаВозможностиЗагрузкиНастроек();
	// Загрузим актуальную версию
	ОбновитьАктуальныйСтатусВерсии();	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРабочийСтол()
	Если ЭтоCF() Тогда
		Оповестить("ESD_ОбновитьРабочийСтол");
	Иначе
		// первичная инициализация, если все отключено - включаем по дефолту	
		ОбновитьИнтерфейс();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиДоТекущегоРелизаНаКлиенте() Экспорт
	ОбновитьНастройкиДоТекущегоРелиза();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиДоТекущегоРелиза()
	Если ЭтоCF() Тогда
		Обработки.ESD_ВерсииНастроекСопоставлений.ОбновитьНастройкиДоТекущегоРелиза();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЭтоCF()
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").ЭтоCF();
КонецФункции
	
#КонецОбласти // ИспользуемыйФункционал

&НаКлиенте
Процедура ОткрытьРедакторФайловНастроекНажатие(Элемент)
	АдресСтраницы = ПолучитьАдресСтраницыРедактора(); 
	
	ПараметрыФормыРедактора = Новый Структура();
	ПараметрыФормыРедактора.Вставить("Заголовок", "Редактор файлов настроек");
	ПараметрыФормыРедактора.Вставить("АдресСтраницы", АдресСтраницы);
	ОткрытьФорму(ФормыЯдраКлиент() + "Browser", ПараметрыФормыРедактора, , "Редактор файлов настроек");
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСтраницыРедактора()
	ESDКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");	
	
	context_params = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД");
	
	Если ESDКлиентСервер.ЗначениеИзКоллекции(context_params, "session") <> Неопределено Тогда
		web_interface = ESDКлиентСервер.ЗначениеИзКоллекции(context_params, "web_interface");
		Если web_interface = "BrowserSabyPlugin" Тогда
			connector = "Lpp1C2";
		ИначеЕсли web_interface = "BrowserSaby" Тогда
			connector = "1c-lppbl";
		Иначе
			connector = "1C2";	
		КонецЕсли;
		
		Возврат context_params.ApiUrl
			+ "/blockly_editor_1c/page/?connection_id="
			+ context_params.ConnectionId
			+ "&connector="
			+ connector
			+ "&command="
			+ connector; 
	КонецЕсли;
		
	Если ESDКлиентСервер.ЗначениеИзКоллекции(context_params, "ApiUrl") <> Неопределено Тогда
		Возврат context_params.ApiUrl + "/auth/";
	КонецЕсли;	
	
	Возврат "https://ie-1c.saby.ru/auth/";
КонецФункции

&НаКлиенте
Процедура СброситьКэшНажатие(Элемент)
	СброситьКэшНаСервере();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Общие настройки ини очищены";
	Сообщение.Сообщить();
КонецПроцедуры

&НаСервере
Процедура СброситьКэшНаСервере()
	ОбъектОбработки = ОбъектОбработки();
	ОбъектОбработки.СброситьКэшНаСервере();
КонецПроцедуры

&НаСервере
Функция ПройденаПервичнаяИнициализация()
	
	Если Не ЭтоESD Тогда
		Результат = Истина;
	Иначе
		Результат = Константы.ESD_ПройденаПервичнаяИнициализация.Получить();		
	КонецЕсли;

	Возврат Результат;
		
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуАвторизации()
	
	ПроверкаДанныхАутентификации = Новый ОписаниеОповещения("ОбработкаРезультатаЗакрытияФормыАвторизации",
		ЭтаФорма);
	
	ОткрытьФорму("Обработка.ESD_SABY.Форма.Вход", , ЭтаФорма, , , , ПроверкаДанныхАутентификации);
	
КонецПроцедуры

#Область ПоддерживаемыеКонфигурации

&НаСервере
Процедура ЗаполнитьПоддерживаемыеКонфигурации()
	Если Не ЭтаФорма.ЭтоESD Тогда
		Возврат;
	КонецЕсли;	
	
	Элементы.ЭтаКонфигурация.СписокВыбора.Очистить();
	
	// заполним список выбора
	Список = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПоддержанныеКонфигурации();
	Для Каждого Строка Из Список Цикл	
		НоваяСтрока = Элементы.ЭтаКонфигурация.СписокВыбора.Добавить();
		НоваяСтрока.Значение      = Строка.Ключ;
		НоваяСтрока.Представление = Строка.Значение.Представление;	
	КонецЦикла;
	
	// Пустая
	НоваяСтрока = Элементы.ЭтаКонфигурация.СписокВыбора.Добавить();
	НоваяСтрока.Значение      = "";
	НоваяСтрока.Представление = "Своя конфигурация";
	
	// установим текущую конфигурацию
	КонфигурацияНастроек = Справочники.ESD_НастройкиСопоставлений.ТекущаяКонфигурация();	
	Если ЗначениеЗаполнено(КонфигурацияНастроек) Тогда
		ЭтаФорма.ЭтаКонфигурация = КонфигурацияНастроек;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаВозможностиЗагрузкиНастроек()

    ЗагрузкаДоступна = ЗначениеЗаполнено(ЭтаФорма.ЭтаКонфигурация);
	
	Элементы.ЗагрузитьНастройкиСопоставлений.Доступность = ЗагрузкаДоступна;
	Элементы.Декорация_КонфигурацияОшибка.Видимость      = Не ЗагрузкаДоступна;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаООчисткеНастроек(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ЭтаКонфигурация = "";
	
	НастройкиСопоставлений_ОбновитьНаСервере();
	
	ПроверкаВозможностиЗагрузкиНастроек();
КонецПроцедуры

#КонецОбласти // ПоддерживаемыеКонфигурации

&НаСервере
Процедура ИзменитьЗначениеКонстанты(Знач Имя, Знач Значение)
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").УстановитьЗначениеКонстанты(
		Имя, Значение);
	
КонецПроцедуры

#Область ПодключаемыеПроцедурыИФункции

&НаСервере
Процедура Подключаемый_ПрименитьДополнительныеПрава(Результат) Экспорт
	ЭтаФорма.ИспользоватьСсылкаНаОбновление = Результат.СкачиваниеОбновления;
	Элементы.ГруппаОбновление.Видимость = Результат.СкачиваниеОбновления;
	
	Для Каждого Настройка Из Результат Цикл
		Если Лев(Настройка.Ключ, 10) <> "Настройки_" Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяЭлемента = Сред(Настройка.Ключ, 11);
		ЭлементФормы = ЭтаФорма.Элементы.Найти(ИмяЭлемента);
		Если ЭлементФормы <> Неопределено Тогда 
			ЭтаФорма.Элементы[Сред(Настройка.Ключ, 11)].Видимость = Настройка.Значение;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#Область ПодключаемыеПроцедурыИФункции_ДлительныеОперации

&НаКлиенте
Процедура Подключаемый_ДлительныеОперации_ПроверитьВыполнение() Экспорт
	// Небольшой переход на сервер для обработки завершенных длительных операций
	ЗавершенныеДлительныеОперации = Подключаемый_ДлительныеОперации_ОбработатьЗавершенныеНаСервере();
	// Обработаем завершенные на клиенте
	МодульКодаКлиент("ESD_ДлительныеОперацииКлиент").Подключаемый_ОбработатьЗавершенные(ЭтаФорма, ЗавершенныеДлительныеОперации);	
КонецПроцедуры

&НаСервере
Функция Подключаемый_ДлительныеОперации_ОбработатьЗавершенныеНаСервере()
	Возврат МодульКода("ESD_ДлительныеОперации").Подключаемый_ОбработатьЗавершенные(ЭтаФорма);	
КонецФункции

#КонецОбласти // ПодключаемыеПроцедурыИФункции_ДлительныеОперации

&НаКлиенте
Процедура Подключаемый_ОбщиеНастройкиЭПД_ОбновлениеПриОткрытии_Изменить()
	ESD_ОбщийФункционалКлиент.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_УстановитьЗначение(
		ЭтаФорма[ESD_ОбщийФункционалКлиентСервер.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_ИмяРеквизита()]
	);
КонецПроцедуры

#КонецОбласти // ПодключаемыеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_base_CommonForm_НастройкиЭПД_НастройкиСопоставлений
#КонецОбласти // include_base_CommonForm_НастройкиЭПД_НастройкиСопоставлений

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область includr_etrn_base_CommonModule_Метаданные
#КонецОбласти // includr_etrn_base_CommonModule_Метаданные

#Область includr_etrn_base_CommonModule_МетаданныеКлиент
#КонецОбласти // includr_etrn_base_CommonModule_МетаданныеКлиент

#Область includr_etrn_base_CommonModule_КартинкаИнтерфейса
#КонецОбласти // includr_etrn_base_CommonModule_КартинкаИнтерфейса

#Область includr_etrn_base_CommonModule_ОбъектОбработки
#КонецОбласти // includr_etrn_base_CommonModule_ОбъектОбработки

#Область includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере
#КонецОбласти // includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область includr_core_base_Авторизация_СменаАккаунта
#КонецОбласти

#Область includr_core_base_Helpers_ОписаниеОповещения
#КонецОбласти

#Область includr_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ОтображениеОповещенийПользователя
#КонецОбласти

#Область includr_core_base_Helpers_КартинкиУспешноОшибка
#КонецОбласти

#Область include_etrn_base_CommonForm_НастройкиЭПД_Функционал_СменаАккаунта_Module
#КонецОбласти

#Область includr_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область includr_core_base_Helpers_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область includr_core_base_Helpers_ExtException //&НаСервереБезКонтекста
#КонецОбласти