
&НаСервереБезКонтекста
Функция РегламентныеЗаданияИзБД()
	
	ЗаданиеЗагрузка = РегламентноеЗаданиеПоКлючу("Saby_Загрузка ЭПД");
	ЗаданиеВыгрузка = РегламентноеЗаданиеПоКлючу("Saby_Выгрузка ЭПД");
	
	Структура = Новый Структура;
	Структура.Вставить("ЗаданиеЗагрузка", ЗаданиеЗагрузка);
	Структура.Вставить("ЗаданиеВыгрузка", ЗаданиеВыгрузка);
	
	Возврат Структура;
	
КонецФункции

&НаСервереБезКонтекста
Функция РегламентноеЗаданиеПоКлючу(Ключ)
	
	Задание = Неопределено;
	
	Отбор = Новый Структура("Ключ", Ключ);
	НайденныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	Если НайденныеЗадания.Количество() Тогда
		Задание = НайденныеЗадания[0];
	КонецЕсли;
	
	Возврат Задание;
	
КонецФункции

&НаСервере
Функция ВыполнитьРегламентноеЗаданиеСервер(Знач Идентификатор)
	
	Результат = МодульКода("РегламентныеЗаданияСлужебный").ВыполнитьРегламентноеЗаданиеВручную(Идентификатор);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ИзменитьРегламентноеЗадание(Знач ИдентификаторРегламентногоЗадания, Знач ПараметрыЗадания)
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Попытка
		// 3.1.24
		МодульКода("РегламентныеЗаданияСервер").ИзменитьРегламентноеЗадание(ИдентификаторРегламентногоЗадания, ПараметрыЗадания);
	Исключение
		// 3.1.19
		МодульКода("РегламентныеЗаданияСервер").ИзменитьЗадание(ИдентификаторРегламентногоЗадания, ПараметрыЗадания);
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Функция СтандартныеРегламентныеЗаданияДоступны()
	
	МодульРегламентныеЗаданияСлужебный = МодульКода("РегламентныеЗаданияСлужебный");
	
	Возврат МодульРегламентныеЗаданияСлужебный <> Неопределено;
	
КонецФункции

&НаСервере
Функция РасписаниеРегламентногоЗадания(Знач ИмяКоманды, Знач Идентификаторы)
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Если ИмяКоманды = "НастройкаЗагрузки" Тогда
		Идентификатор = Идентификаторы.Загрузка;
	ИначеЕсли ИмяКоманды = "НастройкаВыгрузки" Тогда
		Идентификатор = Идентификаторы.Выгрузка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Расписание = МодульКода("РегламентныеЗаданияСервер").РасписаниеРегламентногоЗадания(Идентификатор);
	
	Структура = Новый Структура;
	Структура.Вставить("Идентификатор", Идентификатор);
	Структура.Вставить("Расписание",    Расписание);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Структура;
	
КонецФункции

