
Функция ЭПД_ТекущиеЭтапыСсылки(СсылкаНаДокумент, Знач ИмяМетаданных = "") Экспорт
	РезультатФункции = ЭПД_ДанныеТекущихЭтаповСсылки(СсылкаНаДокумент, ИмяМетаданных)
		.ВыгрузитьКолонку("ТекущийЭтап");
	Возврат РезультатФункции;	
КонецФункции

Функция ЭПД_ДанныеТекущихЭтаповСсылки(СсылкаНаДокумент, Знач ИмяМетаданных = "") Экспорт
	Если ПустаяСтрока(ИмяМетаданных) Тогда
		ИмяМетаданных = СсылкаНаДокумент.Метаданные().Имя;
	КонецЕсли;
	
	Запрос = Новый Запрос;
    Запрос.Текст = "
        |ВЫБРАТЬ
        |   ТекущиеЭтапыДокумента.ТипТитула КАК ТекущийЭтап,
		|	ТекущиеЭтапыДокумента.Наименование КАК Наименование,
		|	ТекущиеЭтапыДокумента.Доступен КАК Доступен,
		|	ТекущиеЭтапыДокумента.Идентификатор КАК Идентификатор
        |ИЗ
        |   Документ.&ИмяМетаданных.ТекущиеЭтапы КАК ТекущиеЭтапыДокумента
        |ГДЕ
        |   ТекущиеЭтапыДокумента.Ссылка = &Ссылка
        |";
    
    Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяМетаданных", ИмяМетаданных);
    Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);

    РезультатФункции = Запрос.Выполнить().Выгрузить();
	Возврат РезультатФункции;
КонецФункции

