
//DynamicDirective

Процедура ПолучитьДанныеТитулов(Форма, МенеджерВременныхТаблиц)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДанныхТитулов.Период КАК Период,
	|	ТаблицаДанныхТитулов.СсылкаНаДокумент КАК СсылкаНаДокумент,
	|	ТаблицаДанныхТитулов.ТипТитула КАК ТипТитула,
	|	ТаблицаДанныхТитулов.ИдентификаторТитула КАК ИдентификаторТитула,
	|	ТаблицаДанныхТитулов.Основной КАК Основной,
	|	ТаблицаДанныхТитулов.Данные КАК Данные,
	|	ТаблицаДанныхТитулов.Просмотрено КАК Просмотрено,
	|	ТаблицаДанныхТитулов.ТипТитулаОтказа КАК ТипТитулаОтказа
	|ПОМЕСТИТЬ ДанныеТитулов
	|ИЗ
	|	&ТаблицаДанныхТитулов КАК ТаблицаДанныхТитулов";
	
	ЗапросДанных.УстановитьПараметр("ТаблицаДанныхТитулов", Форма.ДанныеТитулов.Выгрузить());
	
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

