
Процедура СформироватьДанныеТитулов(МенеджерВременныхТаблиц, ОбъектДок)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ДанныеТитулов.Период КАК Период,
	|	ДанныеТитулов.СсылкаНаДокумент КАК СсылкаНаДокумент,
	|	ДанныеТитулов.ТипТитула КАК ТипТитула,
	|	ДанныеТитулов.ИдентификаторТитула КАК ИдентификаторТитула,
	|	ДанныеТитулов.Основной КАК Основной,
	|   ДанныеТитулов.Данные КАК Данные,
	|	ДанныеТитулов.Просмотрено КАК Просмотрено,
	|	ДанныеТитулов.ТипТитулаОтказа КАК ТипТитулаОтказа,
	|	ДанныеТитулов.ТипТитулаПорядок КАК ТипТитулаПорядок
	|ПОМЕСТИТЬ Saby_ДанныеТитулов
	|ИЗ
	|	&ДанныеТитулов КАК ДанныеТитулов";
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер");

	РазмерПорядка         = 2;
	РазмерСтрокиДляСсылок = 32;
	РазмерИдентификатора  = 36;

	ОписаниеТипаБулево         = Новый ОписаниеТипов("Булево");
	ОписаниеТипаПериода        = МодульТНОбщегоНазначенияКлиентСервер.ОписаниеТипаДата(ЧастиДаты.ДатаВремя);
	ОписаниеТипаПорядка        = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(РазмерПорядка));
	ОписаниеТипаТитула         = МодульТНОбщегоНазначенияКлиентСервер.ОписаниеТипаСтрока(РазмерСтрокиДляСсылок);
	ОписаниеТипаИдентификатора = МодульТНОбщегоНазначенияКлиентСервер.ОписаниеТипаСтрока(РазмерИдентификатора);
	
	ДанныеТитулов = Новый ТаблицаЗначений;
	ДанныеТитулов.Колонки.Добавить("Период",              ОписаниеТипаПериода);
	ДанныеТитулов.Колонки.Добавить("СсылкаНаДокумент",    Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1)));
	ДанныеТитулов.Колонки.Добавить("ТипТитула",           ОписаниеТипаТитула);
	ДанныеТитулов.Колонки.Добавить("ИдентификаторТитула", ОписаниеТипаИдентификатора);
	ДанныеТитулов.Колонки.Добавить("Основной",            ОписаниеТипаБулево);
	ДанныеТитулов.Колонки.Добавить("Данные",              МодульТНОбщегоНазначенияКлиентСервер.ОписаниеТипаСтрока(0));
	ДанныеТитулов.Колонки.Добавить("Просмотрено",         ОписаниеТипаБулево);
	ДанныеТитулов.Колонки.Добавить("ТипТитулаОтказа",     ОписаниеТипаТитула);
	ДанныеТитулов.Колонки.Добавить("ТипТитулаПорядок",    ОписаниеТипаПорядка);
	
	Для Каждого СтруктураДанных Из ОбъектДок.ДанныеТитулов Цикл
		СтрокаДанных = ДанныеТитулов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, СтруктураДанных);
	КонецЦикла;
	
	ЗапросДанных.УстановитьПараметр("ДанныеТитулов", ДанныеТитулов);
	
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

Процедура ПросмотретьТитулы(МассивСсылокНаДокумент, ИдентификаторыТитулов)
	Возврат;
КонецПроцедуры

