
&НаСервере
Процедура ДобавитьДанныеДокументовЭПД(ДанныеТитула)
	
	ТаблицаПутевыхЛистов = ТаблицаДокументов(ЭтаФорма.ПутевыеЛисты, "Документ");
	ТаблицаАктов         = ТаблицаДокументов(ЭтаФорма.Акты, "Документ");
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПутевыхЛистов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаПутевыхЛистов.Документ КАК Документ
	|ПОМЕСТИТЬ ПутевыеЛисты
	|ИЗ
	|	&ТаблицаПутевыхЛистов КАК ТаблицаПутевыхЛистов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАктов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаАктов.Документ КАК Документ
	|ПОМЕСТИТЬ Акты
	|ИЗ
	|	&ТаблицаАктов КАК ТаблицаАктов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ДокументЗамены КАК Ссылка,
	|	""ДокументЗамены"" КАК РеквизитОбъекта,
	|	""ДокументЗамены"" КАК ЭлементФормы,
	|	"""" КАК ИмяТаблицы,
	|	0 КАК НомерСтроки,
	|	ЛОЖЬ КАК ЭтоОформитель
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ОснованиеПередачиГрузаТС,
	|	""ОснованиеПередачиГрузаТС"",
	|	""ОснованиеПередачиГрузаТС"",
	|	"""",
	|	0,
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ОснованиеОплаты,
	|	""ОснованиеОплаты"",
	|	""ОснованиеОплаты"",
	|	"""",
	|	0,
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПереадресовкаНаОсновании,
	|	""ПереадресовкаНаОсновании"",
	|	""ПереадресовкаНаОсновании"",
	|	"""",
	|	0,
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПутевыеЛисты.Документ,
	|	""ПутевыеЛисты.Документ"",
	|	""ПутевыеЛистыДокумент"",
	|	""ПутевыеЛисты"",
	|	ПутевыеЛисты.НомерСтроки,
	|	ЛОЖЬ
	|ИЗ
	|	ПутевыеЛисты КАК ПутевыеЛисты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Акты.Документ,
	|	""Акты.Документ"",
	|	""АктыДокумент"",
	|	""Акты"",
	|	Акты.НомерСтроки,
	|	ЛОЖЬ
	|ИЗ
	|	Акты КАК Акты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ESD_ДокументыЭПД.Ссылка КАК Ссылка,
	|	ESD_ДокументыЭПД.ДанныеЮрЛиц.(
	|		ИНН КАК ИНН
	|	) КАК ДанныеЮрЛиц,
	|	СсылкиНаДокументы.РеквизитОбъекта КАК РеквизитОбъекта,
	|	СсылкиНаДокументы.ЭлементФормы КАК ЭлементФормы,
	|	СсылкиНаДокументы.НомерСтроки КАК НомерСтроки,
	|	СсылкиНаДокументы.ИмяТаблицы КАК ИмяТаблицы,
	|	СсылкиНаДокументы.ЭтоОформитель КАК ЭтоОформитель
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ESD_ДокументыЭПД КАК ESD_ДокументыЭПД
	|		ПО СсылкиНаДокументы.Ссылка = ESD_ДокументыЭПД.Ссылка";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ДокументыЭПД", ДокументыЭПД());
	
	ЗапросДанных.УстановитьПараметр("ТаблицаПутевыхЛистов",     ТаблицаПутевыхЛистов);
	ЗапросДанных.УстановитьПараметр("ТаблицаАктов",             ТаблицаАктов);
	ЗапросДанных.УстановитьПараметр("ДокументЗамены",           ЭтаФорма.ДокументЗамены);
	ЗапросДанных.УстановитьПараметр("ОснованиеПередачиГрузаТС", ЭтаФорма.ОснованиеПередачиГрузаТС);
	ЗапросДанных.УстановитьПараметр("ОснованиеОплаты",          ЭтаФорма.ОснованиеОплаты);
	ЗапросДанных.УстановитьПараметр("ПереадресовкаНаОсновании", ЭтаФорма.ПереадресовкаНаОсновании);
	
	ТаблицаДокументовЭПД = МодульКода("ESD_ТНОбщегоНазначенияСервер").ТаблицаЗначенийВМассивЭПД(
		ЗапросДанных.Выполнить().Выгрузить());
		
	ДанныеТитула.Вставить("ДокументыЭПД", ТаблицаДокументовЭПД);
	
КонецПроцедуры

Функция ТаблицаДокументов(ТаблицаДанных, ИмяКолонкиДокумента)
	
	РазмерНомераСтроки = 5;
	ТипНомераСтроки = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(РазмерНомераСтроки));
	
	РезультатФункции = Новый ТаблицаЗначений;
	РезультатФункции.Колонки.Добавить("НомерСтроки", ТипНомераСтроки);
	РезультатФункции.Колонки.Добавить("Документ", Новый ОписаниеТипов("СправочникСсылка." + ДокументыЭПД()));
	
	НомерСтроки = 1;
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		СтрокаРезультата = РезультатФункции.Добавить();
		СтрокаРезультата.НомерСтроки = НомерСтроки;
		СтрокаРезультата.Документ    = СтрокаДанных[ИмяКолонкиДокумента];
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

