
Функция ЧерновикПоГис_УИД(ПараметрыЗагрузки) Экспорт
	Перем Результат;
	
	ГИС_УИД = ПараметрыЗагрузки.ДанныеДокумента["ГИС_УИД"];
	Если Не ЗначениеЗаполнено(ГИС_УИД) Тогда
		Возврат Результат;
	КонецЕсли;

	Аккаунт = МодульКода("ESD_ТНОбщегоНазначенияСервер").АвторизованныйАккаунтСтрокой();
	Если ПараметрыЗагрузки.ДанныеДокумента["Направление"] = "Входящий" Тогда
		СостояниеДокумента = РегистрыСведений.ESD_СостоянияОбъектовИнтеграции.СостояниеДокументаПоГИС_УИД(
			ГИС_УИД, Перечисления.ESD_Направление.Исходящий, Аккаунт);
		Если СостояниеДокумента.КодСостояния = 0 Тогда
			Результат = СостояниеДокумента.ОбъектРасширения;
		КонецЕсли;
	Иначе
		// Пропустим загрузку исходящего черновика если есть входящий документ по ГИС_УИД с начатым ДО
		Если ПараметрыЗагрузки.ДанныеДокумента["ТекущиеЭтапы"].Количество() = 0 Тогда
			СостояниеДокумента = РегистрыСведений.ESD_СостоянияОбъектовИнтеграции.СостояниеДокументаПоГИС_УИД(
				ГИС_УИД, Перечисления.ESD_Направление.Входящий, Аккаунт);
			Если СостояниеДокумента.КодСостояния <> 0 Тогда
				Результат = СостояниеДокумента.ОбъектРасширения;
			КонецЕсли;
		
			Если ЗначениеЗаполнено(Результат) Тогда
				ВызватьИсключение "Существует входящий документ с активным ДО по переданному ГИС_УИД";	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции
		
