#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГруппироватьТоварыИзДокументовОснованийПриИзменении(Элемент)
	
	Если Не ЭтаФорма.ГруппироватьТоварыИзДокументовОснований Тогда
		ЭтаФорма.ГруппироватьВОднуПозицию            = Ложь;
		ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбщейПозицииПриИзменении(Элемент)
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры  

&НаКлиенте
Процедура ГруппироватьПоРеквизитуНоменклатурыПриИзменении(Элемент)
	
	Если ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры Тогда
		ЭтаФорма.ГруппироватьВОднуПозицию = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры 

&НаКлиенте
Процедура РеквизитНоменклатурыПриИзменении(Элемент)
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьВОднуПозициюПриИзменении(Элемент)
	
	Если ЭтаФорма.ГруппироватьВОднуПозицию Тогда
		ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыГруппировки();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура СохранитьПараметрыГруппировки()
	
	СтруктураПараметров = ПараметрыГруппировкиПозицийОснований();
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ЭтаФорма);
	
	ХранилищеОбщихНастроек.Сохранить("Saby", "ПараметрыГруппировкиПозицийОснований", СтруктураПараметров, , 
																				"ESD_ДляВсехПользователей");
	ОбновитьВидимостьДоступностьЭлементовГруппировки();
	
КонецПроцедуры      

&НаСервере
Процедура ОбновитьВидимостьДоступностьЭлементовГруппировки(ПриСозданииНаСервере = Ложь)
	
	Если ПриСозданииНаСервере Тогда
		ЗаполнитьРеквизитыНоменклатуры();
	КонецЕсли;
	
	Элементы.ГруппаВариантыГруппировки.Доступность = ЭтаФорма.ГруппироватьТоварыИзДокументовОснований;
	Элементы.РеквизитНоменклатуры.Доступность      = ЭтаФорма.ГруппироватьПоРеквизитуНоменклатуры;
	Элементы.НаименованиеОбщейПозиции.Доступность  = ЭтаФорма.ГруппироватьВОднуПозицию;
	
КонецПроцедуры

Функция ПараметрыГруппировкиПозицийОснований() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ГруппироватьТоварыИзДокументовОснований", Ложь);
	РезультатФункции.Вставить("ГруппироватьПоРеквизитуНоменклатуры",     Ложь);
	РезультатФункции.Вставить("РеквизитНоменклатуры",                      "");
	РезультатФункции.Вставить("ГруппироватьВОднуПозицию",                Ложь);
	РезультатФункции.Вставить("НаименованиеОбщейПозиции",                  "");
	РезультатФункции.Вставить("ПользовательФоновыхЗаданий",                "");
	
	Возврат РезультатФункции;
	
КонецФункции    

&НаСервере
Процедура ЗаполнитьРеквизитыНоменклатуры()
	
	Если Метаданные.Справочники.Найти("Номенклатура") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппироватьПоРеквизитуНоменклатуры.Доступность = Истина;
	
	Для Каждого Реквизит Из Справочники["Номенклатура"].ПустаяСсылка().Метаданные().Реквизиты Цикл
		Элементы.РеквизитНоменклатуры.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	ЗагрузитьПараметрыГруппировки();
	ОбновитьВидимостьДоступностьЭлементовГруппировки(Истина);
	
КонецПроцедуры  

&НаСервере
Процедура ЗагрузитьПараметрыГруппировки()
	
	СтруктураПараметров = ХранилищеОбщихНастроек.Загрузить("Saby", "ПараметрыГруппировкиПозицийОснований", ,
																				"ESD_ДляВсехПользователей");
	Если СтруктураПараметров <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры