
Процедура ДобавитьСсылочныеКолонкиТаблицыОпасныхГрузов(ТаблицаОпасныхГрузов)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер");
	
	ТаблицаОпасныхГрузов.Колонки.Добавить("Ссылка",                 МодульТНОбщегоНазначенияКлиентСервер.ОписаниеТипаСтрока(36));
	ТаблицаОпасныхГрузов.Колонки.Добавить("ГруппаУпаковкиЗначение", МодульТНОбщегоНазначенияКлиентСервер.ОписаниеТипаСтрока(36));
	
КонецПроцедуры

Процедура ПолучитьТаблицуСправочникОпасныхГрузов(МенеджерВременныхТаблиц)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	""Не существует"" КАК Ссылка,
	|	""Не существует"" КАК Наименование,
	|	""Не существует"" КАК ПолноеНаименование,
	|	""Не существует"" КАК Идентификатор,
	|	""Не существует"" КАК ТехническоеНаименование,
	|	""Не существует"" КАК НомерООН,
	|	""Не существует"" КАК Класс,
	|	""Не существует"" КАК КлассификационныйКод,
	|	""Не существует"" КАК ЗнакОпасности,
	|	""Не существует"" КАК ГруппаУпаковки,
	|	""Не существует"" КАК ГруппаУпаковкиЗначение,
	|	""Не существует"" КАК ТранспортныйИндекс
	|ПОМЕСТИТЬ СправочникОпасныхГрузов";
	
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

