
// Обработчик события "ПриАктивацииСтроки" таблицы "Дополнительные поля"
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//	Элемент - ТаблицаФормы - элемент таблицы формы "ДополнительныеПоля"
//
Процедура ДополнительныеПоля_ПриАктивизацииСтроки(Форма, Элемент) Экспорт
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита();
	ТекущиеДанные = Форма.Элементы[ИмяРеквизита_].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Направление = 1 Тогда
		Форма.Элементы[ИмяРеквизита_ + "Значение"].ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
	Форма.Элементы[ИмяРеквизита_ + "Значение"].ТолькоПросмотр = Ложь;
	Если ЗначениеЗаполнено(ТекущиеДанные.Тип) Тогда
		ЭлементЗначение = Форма.Элементы[ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита() + "Значение"];
		ЭлементЗначение.ОграничениеТипа = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ОписаниеТипа(ТекущиеДанные.Тип);
		ЭлементЗначение.СписокВыбора.Очистить();
		
		Если ЗначениеЗаполнено(ТекущиеДанные.СписокВыбора) Тогда
			Для Каждого Строка_ Из ТекущиеДанные.СписокВыбора Цикл 
				ЭлементЗначение.СписокВыбора.Добавить(Строка_.Значение);			
			КонецЦикла;
		КонецЕсли;
		
		ЭлементЗначение.РежимВыбораИзСписка = ТекущиеДанные.РежимВыбораИзСписка;
	КонецЕсли;
КонецПроцедуры

Процедура ДополнительныеПоля_Значение_ПриИзменении(Форма) Экспорт
	Форма.Модифицированность = Истина;		
КонецПроцедуры

