
// Обработчик события "НачалоВыбора" поля "Наименование" таблицы "Дополнительные поля"
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//	СтандартнаяОбработка - Булево - признак стандартной обработки события
//
Процедура ДополнительныеПоля_Наименование_НачалоВыбора(Форма, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	
    // BSLLS:GetFormMethod-off
	Форма_ = ПолучитьФорму("Справочник.ESD_ДополнительныеПоля.Форма.ФормаВыбора");
    // BSLLS:GetFormMethod-on
    
    РезультатВыбора_ = Форма_.ОткрытьМодально();
    Если РезультатВыбора_ <> Неопределено Тогда
        ДополнительныеПараметры = Новый Структура("ТекущаяСтрока", 
            Форма.Элементы[ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита()].ТекущаяСтрока);
        Форма.ДополнительныеПоля_Подключаемый_Наименование_ПослеВыбора(РезультатВыбора_, ДополнительныеПараметры);
	    ДополнительныеПоля_ПриАктивизацииСтроки(Форма, Неопределено);
    КонецЕсли;
КонецПроцедуры

