
// Обработчик события "НачалоВыбора" поля "Наименование" таблицы "Дополнительные поля"
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//	СтандартнаяОбработка - Булево - признак стандартной обработки события
//
Процедура ДополнительныеПоля_Наименование_НачалоВыбора(Форма, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОповещения = Новый Структура("ТекущаяСтрока, Форма", 
		Форма.Элементы[ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита()].ТекущаяСтрока,
		Форма);
	ОповещениеПослеВыбораЗначения = Новый ОписаниеОповещения("ДополнительныеПоля_Наименование_ПослеВыбора", ЭтотОбъект, ПараметрыОповещения); 
	ОткрытьФорму("Справочник.ESD_ДополнительныеПоля.Форма.ФормаВыбора", ,
		Форма,
		,
		,
		,
		ОповещениеПослеВыбораЗначения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

// Обработчик оповещения "ДополнительныеПоля_Наименование_ПослеВыбора"
//
// Параметры:
//	Результат - СправочникСсылка.ESD_ДополнительныеПоля, Неопределено - результат выбора
//	ДополнительныеПараметры - Структура - структура дополнительных параметров выбора
//
Процедура ДополнительныеПоля_Наименование_ПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ДополнительныеПараметры.Удалить("Форма");
	
	Форма.ДополнительныеПоля_Подключаемый_Наименование_ПослеВыбора(Результат, ДополнительныеПараметры);
	ДополнительныеПоля_ПриАктивизацииСтроки(Форма, Неопределено);	
КонецПроцедуры

