#Область СлужебныйПрограммныйИнтерфейс

// Возвращает список доступных событий на тип метаданных
//
// Параметры:
//	ИмяМетаданных - Строка - имя метаданных
//
// Возвращаемое значение:
//  Массив - список доступных событий	
Функция ДоступныеСобытия(Знач ИмяМетаданных) Экспорт
	Перем Результат;
	
	ТипМетаданных = МодульКода("АвтоматическиеСценарииКлиентСервер")
		.Saby_СтрРазделить82(СокрЛП(НРег(ИмяМетаданных)), ".", Ложь)[0];
	Если ТипМетаданных = "документ" Тогда 
		Результат = ДоступныеСобытияДокумента();
	ИначеЕсли ТипМетаданных = "справочник" Тогда
		Результат = ДоступныеСобытияСправочника();
	Иначе
		Результат = Новый Массив;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Возвращает список доступных событий справочника
//
// Возвращаемое значение:
//  Массив - список доступных событий	
Функция ДоступныеСобытияСправочника() Экспорт
	АвтоматическиеСценарииСобытия = МодульКода("Перечисления.АвтоматическиеСценарииСобытия");
	
	Результат = Новый Массив;
	Результат.Добавить(АвтоматическиеСценарииСобытия.ПриЗаписи);
	
	Возврат Результат;
КонецФункции

// Возвращает список доступных событий документа
//
// Возвращаемое значение:
//  Массив - список доступных событий	
Функция ДоступныеСобытияДокумента() Экспорт
	АвтоматическиеСценарииСобытия = МодульКода("Перечисления.АвтоматическиеСценарииСобытия");
	
	Результат = Новый Массив;
	Результат.Добавить(АвтоматическиеСценарииСобытия.ПриЗаписи);
	Результат.Добавить(АвтоматическиеСценарииСобытия.ОбработкаПроведения);
	Результат.Добавить(АвтоматическиеСценарииСобытия.ОбработкаУдаленияПроведения);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти