
Функция МодульКода(ИмяМодуля)
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция МодульКодаКлиент(ИмяМодуля)
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ОбъектОбработки()
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ПолучитьСтатусДокументаСБИС(КодСостояния) Экспорт
	
	ВсеВозможныеСостояния = ВсеВозможныеСостояния();
	
	Возврат ВсеВозможныеСостояния[КодСостояния];
	
КонецФункции

Функция ВсеВозможныеСостояния()
	
	РезультатФункции = Новый Соответствие;
	
	Состояния = Новый Массив;
	Состояния.Добавить(СтруктураСостояния("Документ не запущен в ЭДО SABY",      0,  0));
	Состояния.Добавить(СтруктураСостояния("Есть документ",                       1,  0));
	Состояния.Добавить(СтруктураСостояния("Отправлено приглашение",              2,  1));
	Состояния.Добавить(СтруктураСостояния("Отправлен",                           3,  0));
	Состояния.Добавить(СтруктураСостояния("Доставлен",                           4,  4));
	Состояния.Добавить(СтруктураСостояния("Ошибка при загрузке документа вSABY", 6,  3));
	Состояния.Добавить(СтруктураСостояния("Обработка завершена положительно",    7,  6));
	Состояния.Добавить(СтруктураСостояния("Обработка завершена отрицательно",    9,  5));
	Состояния.Добавить(СтруктураСостояния("Документ на выполнении",              10, 2));
	Состояния.Добавить(СтруктураСостояния("Отозван мной",                        19, 8));
	Состояния.Добавить(СтруктураСостояния("Удален контрагентом",                 20, 7));
	Состояния.Добавить(СтруктураСостояния("Аннулирован по соглашению",           22, 7));
	Состояния.Добавить(СтруктураСостояния("Ожидает подписания",                  23, 9));
	Состояния.Добавить(СтруктураСостояния("Ожидает аннулирования",               27, 9));
	
	Для Каждого СостояниеСтруктура Из Состояния Цикл
		РезультатФункции.Вставить(СостояниеСтруктура.ИдентификаторСБИС, СостояниеСтруктура);
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция СтруктураСостояния(Наименование, ИдентификаторСБИС, ИндексКартинки)
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Наименование",      Наименование);
	РезультатФункции.Вставить("ИдентификаторСБИС", ИдентификаторСБИС);
	РезультатФункции.Вставить("ИндексКартинки",    ИндексКартинки);
	
	Возврат РезультатФункции;
	
КонецФункции

#Область include_etrn_src_vo3_CommonModule_ВыполнениеФункцииНаСервере
#КонецОбласти // etrn_src_vo3_CommonModule_ВыполнениеФункцииНаСервере

#Область include_etrn_src_vo3_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_src_vo3_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_Document_ТранспортнаяНакладная_DocumentMgr
#КонецОбласти // include_etrn_base_Document_ТранспортнаяНакладная_DocumentMgr

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_CommonModule
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_CommonModule

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_CommonModule
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_CommonModule

#Область include_etrn_base_InformationRegister_ДанныеТитулов_InformationRegisterMgr
#КонецОбласти // include_etrn_base_InformationRegister_ДанныеТитулов_InformationRegisterMgr

#Область include_etrn_base_CommonModule_ТНВыгрузкаСервер_CommonModule
#КонецОбласти // include_etrn_base_CommonModule_ТНВыгрузкаСервер_CommonModule

#Область include_etrn_base_CommonModule_ТНЗагрузкаСервер_CommonModule
#КонецОбласти // include_etrn_base_CommonModule_ТНЗагрузкаСервер_CommonModule

#Область include_etrn_base_Enum_ВладелецОбъектаОтгрузки_Enum
#КонецОбласти // include_etrn_base_Enum_ВладелецОбъектаОтгрузки_Enum

#Область include_etrn_base_Enum_ГруппыУпаковки_Enum
#КонецОбласти // include_etrn_base_Enum_ГруппыУпаковки_Enum

#Область include_etrn_base_Enum_КлассыОпасностиГрузов_Enum
#КонецОбласти // include_etrn_base_Enum_КлассыОпасностиГрузов_Enum

#Область include_etrn_base_Enum_КодыОграниченийПроездаЧерезТуннели_Enum
#КонецОбласти // include_etrn_base_Enum_КодыОграниченийПроездаЧерезТуннели_Enum

#Область include_etrn_base_Enum_МетодОпределенияМассы_Enum
#КонецОбласти // include_etrn_base_Enum_МетодОпределенияМассы_Enum

#Область include_etrn_base_Enum_Направление_Enum
#КонецОбласти // include_etrn_base_Enum_Направление_Enum

#Область include_etrn_base_Enum_РолиКонтрагентов_Enum
#КонецОбласти // include_etrn_base_Enum_РолиКонтрагентов_Enum

#Область include_etrn_base_Enum_ТипТитулаЭтрН_Enum
#КонецОбласти // include_etrn_base_Enum_ТипТитулаЭтрН_Enum

#Область include_etrn_base_Enum_ТипыВладенияТС_Enum
#КонецОбласти // include_etrn_base_Enum_ТипыВладенияТС_Enum

#Область include_etrn_base_Catalog_ВидыУпаковки_CatalogMgr
#КонецОбласти // include_etrn_base_Catalog_ВидыУпаковки_CatalogMgr

#Область include_etrn_base_Catalog_ОпасныеГрузы_CatalogMgr
#КонецОбласти // include_etrn_base_Catalog_ОпасныеГрузы_CatalogMgr

#Область include_etrn_src_vo3_CommonModule_КартинкаИнтерфейса
#КонецОбласти // include_etrn_src_vo3_CommonModule_КартинкаИнтерфейса

