
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Переопределяемый_ПриСозданииНаСервере();
	НастройкаВидимостиЭлементовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗагрузитьАктуальныйСтатусВерсии();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ОбработатьОповещенияДляФормы(ЭтаФорма, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СсылкаОбновлениеНажатие(Элемент)
	ПроцедураПослеЗапускаПриложения = Новый ОписаниеОповещения("ПослеЗапускаПриложения", ЭтаФорма);	
	НачатьЗапускПриложения(ПроцедураПослеЗапускаПриложения, Элемент.Подсказка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДинСписокДокументов_ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ESD_ТНОбщегоНазначенияКлиент.ОткрытьДокументРасширенияЭПД(
				ВыбраннаяСтрока, "ESD_ЗаказНаПеревозку", Найти(Нрег(Элемент.ТекущиеДанные.Комментарий), "форматно-логический контроль")>0);
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список, Тип, "Направление");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВСбис(Команда)
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, Команда.Имя + "ИзСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументИзСбис(Команда)		
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ОбновитьДокументыСБИС(ЭтаФорма, Команда.Имя, ЗаказНаПеревозку());		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументИзСбисЗаПериод(Команда)
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ОбновитьДокументыЗаПериод(ЭтаФорма, "ОбновитьДокументИзСбис", Истина);
КонецПроцедуры

&НаКлиенте
Процедура Просмотрено(Команда)
	МассивДокументов = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ДокументыДляОбработки(ЭтаФорма);
	ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.СбросСтатусаНеПросмотрено", МассивДокументов);
	ОповеститьОбИзменении(Тип("ДокументСсылка." + ЗаказНаПеревозку()));
КонецПроцедуры

&НаКлиенте
Процедура ОтборИзмененныхДокументов(Команда)
	
	УстановленОтборИзмененныхДокументов = Не УстановленОтборИзмененныхДокументов;
	Если УстановленОтборИзмененныхДокументов Тогда		
		Значение = Ложь;		
	Иначе		
		Значение = Неопределено;		
	КонецЕсли;
		
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список, Значение, "Просмотрен");
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ПечатьДокумента(ЭтаФорма, Команда.Имя, "", Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВложенияВ1С(Команда)
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ЗагрузитьАрхивДокумента(ЭтаФорма, Истина);
	ОповеститьОбИзменении(ЭтаФорма.Элементы.Список.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОтборДокументовСОшибками(Команда)
	
	УстановленОтборДокументовСОшибками = Не УстановленОтборДокументовСОшибками;
	Если УстановленОтборДокументовСОшибками Тогда		
		Значение = Истина;		
	Иначе		
		Значение = Неопределено;		
	КонецЕсли;
		
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Значение,
		"ЕстьОшибки");
	
КонецПроцедуры

&НаКлиенте
Процедура МассовоеСоздание(Команда)
	// Типы основания
	ЗаполнитьСписокОснованийЗаказНаПеревозку();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДокумента",          "ESD_ЗаказНаПеревозку");
	ПараметрыФормы.Вставить("МножественноеСоздание", Истина);
	
    МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ВыбратьТипДокументаОснования(ЭтаФорма, ПараметрыФормы);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаОповещений

&НаКлиенте
Процедура ОбработатьОповещениеВыполнитьПереходНаФорме(ПараметрыПерехода = Неопределено) Экспорт
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, "ОбновитьАктивныйЭтап");
КонецПроцедуры

&НаСервере
Процедура ОбработатьОповещениеВыход() Экспорт
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДинСписокДокументов_УстановитьНастройки(ЭтаФорма);
КонецПроцедуры

#КонецОбласти // ОбработкаОповещений

&НаКлиенте
Процедура ПослеЗапускаПриложения(Результат, ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОснованийЗаказНаПеревозку()
	
	// Заполнить список оснований для Заказа
	Если ЭтоУниверсальноеРасширение() Тогда
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ОграничитьТипыДокументовОснований(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПрименитьДополнительныеПрава(Результат) Экспорт	
	ЭтаФорма.Элементы.ГруппаОбновление.Видимость = Результат.СкачиваниеОбновления;
КонецПроцедуры

&НаСервере
Процедура НастройкаВидимостиЭлементовНаСервере()
	ЭлементДоступен = ПравоДоступа("Редактирование", Метаданные.Документы.ESD_ЗаказНаПеревозку);
	Элементы.ФормаЗагрузитьВСбис.Видимость = ЭлементДоступен;
	Элементы.ФормаОбновитьДокументИзСбис.Видимость = ЭлементДоступен;
	Элементы.ФормаЗагрузитьВложенияВ1С.Видимость = ЭлементДоступен;
	Элементы.ФормаМассовоеСоздание.Видимость = ЭлементДоступен; 
	Элементы.ФормаОбновитьДокументИзСбисЗаПериод.Видимость = ЭлементДоступен;
КонецПроцедуры

#Область include_etrn_base_Document_ОбщийФункционал_ФормаСписка_ЗагрузитьАктуальныйСтатусВерсии
#КонецОбласти	

#Область include_etrn_base_Document_ОбщийФункционал_ФормаСписка_Переопределяемый_ПриСозданииНаСервере
#КонецОбласти

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_etrn_base_Document_ОбщийФункционал_Подключаемые_ДлительныеОперации
#КонецОбласти

#Область include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере //&НаСервере 
#КонецОбласти // include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти

#Область include_etrn_base_CommonModule_ОпределениеМодуляКода //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти // include_etrn_base_CommonModule_ОпределениеМодуляКода

#Область include_etrn_base_CommonModule_Метаданные //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти // include_etrn_base_CommonModule_Метаданные

