
Процедура ESD_СохранитьНастройкиОбъекта(КлючНастроек, Значение, ОписаниеНастроек = Неопределено, 
	ИмяПользователя = "ESD_ДляВсехПользователей", 
	Добавление = Ложь
) Экспорт
	Если Добавление Тогда
		ТекущееЗначение = ESD_ЗагрузитьНастройкиОбъекта(КлючНастроек, ОписаниеНастроек, ИмяПользователя);
		Если ТипЗнч(ТекущееЗначение) = Тип("Структура") И ТипЗнч(Значение) = Тип("Структура") Тогда
			Для Каждого КлючЗначение Из Значение Цикл
				ТекущееЗначение.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);	
			КонецЦикла;
		Иначе
			ТекущееЗначение = Значение;
		КонецЕсли;
	Иначе
		ТекущееЗначение = Значение;
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ХранилищеОбщихНастроек.Сохранить("Saby", КлючНастроек, ТекущееЗначение, ОписаниеНастроек, ИмяПользователя);	
КонецПроцедуры

Функция ESD_ЗагрузитьНастройкиОбъекта(КлючНастроек, ОписаниеНастроек = Неопределено, 
	ИмяПользователя = "ESD_ДляВсехПользователей"
) Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Возврат ХранилищеОбщихНастроек.Загрузить("Saby", КлючНастроек, ОписаниеНастроек, ИмяПользователя);
КонецФункции

