
Процедура ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_УстановитьЗначение(НовоеЗначение) Экспорт
	Если ТипЗнч(НовоеЗначение) <> Тип("Булево") Тогда
		Возврат;
	КонецЕсли;
	
	ESD_ТНОбщегоНазначенияСервер
		.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_Записать(НовоеЗначение);
КонецПроцедуры

Процедура ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_ОбработатьНаФормеЭПД(Форма, ЗначениеНастройки) Экспорт
	Если ЗначениеНастройки <> Истина Или Форма.ТолькоПросмотр Или Не Форма.ИндексКартинки Тогда
		Возврат;
	КонецЕсли;
	Если ESD_ТНОбщегоНазначенияКлиентСервер.ДокументооборотЗавершен(Форма.ИндексКартинки) Тогда
		Возврат;
	КонецЕсли;

	Форма.Подключаемый_ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_Выполнить();
КонецПроцедуры

Процедура ОбщиеНастройкиЭПД_ОбработатьЗначенияНаФормеЭПД(Форма) Экспорт
	ТекущиеЗначенияНастроекЭПД_ = ESD_ТНОбщегоНазначенияСервер.СлужебныеНастройки_Загрузить();
	ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_ОбработатьНаФормеЭПД(Форма, 
		ТекущиеЗначенияНастроекЭПД_.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД);
КонецПроцедуры

