
Процедура ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_УстановитьЗначение(Форма) Экспорт
	НовоеЗначение = Форма[ESD_ОбщийФункционалКлиентСервер.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_ИмяРеквизита()];
	Если ТипЗнч(НовоеЗначение) <> Тип("Булево") Тогда
		Возврат;
	КонецЕсли;
	
	ESD_ТНОбщегоНазначенияСервер.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_Записать(НовоеЗначение);
КонецПроцедуры

Процедура ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_ОбработатьНаФормеЭПД(Форма, ЗначениеНастройки) Экспорт
	Если ЗначениеНастройки <> Истина Или Форма.ТолькоПросмотр Или Не Форма.ИндексКартинки Тогда
		Возврат;
	КонецЕсли;
	Если ESD_ТНОбщегоНазначенияКлиентСервер.ДокументооборотЗавершен(Форма.ИндексКартинки) Тогда
		Возврат;
	КонецЕсли;

	Форма.Подключаемый_ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_Выполнить();
КонецПроцедуры

Процедура ОбщиеНастройкиЭПД_ОбработатьЗначенияНаФормеЭПД(Форма) Экспорт
	ТекущиеЗначенияНастроекЭПД_ = ESD_ТНОбщегоНазначенияСервер.СлужебныеНастройки_Загрузить();
	ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_ОбработатьНаФормеЭПД(Форма, 
		ТекущиеЗначенияНастроекЭПД_.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД);
КонецПроцедуры
	
Процедура ОбщиеНастройкиЭПД_Префикс_Применить(Форма) Экспорт
	ОбщиеНастройкиЭПД_Префикс = ESD_ОбщийФункционалКлиентСервер.ОбщиеНастройкиЭПД_ОбщиеНастройкиЭПД_Префикс_ИмяРеквизита();
	ESD_ТНОбщегоНазначенияСервер.СлужебныеНастройки_Записать(
		Новый Структура(
			ОбщиеНастройкиЭПД_Префикс,
			Форма[ОбщиеНастройкиЭПД_Префикс]
		)
	);
	
	Форма.Элементы.ОбщиеНастройкиЭПД_Префикс_Применить.Видимость = Ложь;  
КонецПроцедуры      

Процедура ОбщиеНастройкиЭПД_ПрефиксИзменениеТекстаРедактирования(Форма) Экспорт
	Форма.Элементы.ОбщиеНастройкиЭПД_Префикс_Применить.Видимость = Истина;
КонецПроцедуры

	
