
#Область СлужебныйПрограммныйИнтерфейс

Функция ПеренестиДанныеСторонНепосредственноВДокумент() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ОК",             Истина);
	РезультатФункции.Вставить("ОписаниеОшибки", "");
	
	// Реквизита со ссылкой больше нет, поэтому делать ничего не надо.
	Если ПустаяСсылка().Метаданные().ТабличныеЧасти.ДанныеЮрЛиц.Реквизиты.Найти("Сторона") = Неопределено Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	СоответствиеДанныхПоСсылкам = Новый Соответствие;
	ДобавитьДанныеПоКонтрагентамИОрганизациям(СоответствиеДанныхПоСсылкам);
	ДобавитьДанныеПоСторонамДокумента(СоответствиеДанныхПоСсылкам);
	
	ЗаполнитьДанныеСторонПоСсылкам(СоответствиеДанныхПоСсылкам);
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьДанныеПоКонтрагентамИОрганизациям(СоответствиеДанныхПоСсылкам)
	
	РольСторонаДокумента = ЗначениеМетаданных("ESD_РолиКонтрагентов.СторонаДокумента");
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ESD_ДокументыЭПДДанныеЮрЛиц.Сторона КАК Сторона
	|ИЗ
	|	Справочник.ESD_ДокументыЭПД.ДанныеЮрЛиц КАК ESD_ДокументыЭПДДанныеЮрЛиц
	|ГДЕ
	|	ESD_ДокументыЭПДДанныеЮрЛиц.Роль = &ПустаяСсылка
	|	И ТИПЗНАЧЕНИЯ(ESD_ДокументыЭПДДанныеЮрЛиц.Сторона) В (ТИП(Справочник.Контрагенты), ТИП(Справочник.Организации))
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ДокументыЭПД", ДокументыЭПД());
	ЗапросДанных.УстановитьПараметр("ПустаяСсылка", ЗначениеМетаданных("ESD_РолиКонтрагентов.ПустаяСсылка"));
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	
	КолонкиТаблицы = "Ссылка,РольСтрокой,Роль,ПолеОсновногоТелефона,КлючСтроки,ПараметрыРеквизитаФормы";
	
	ТаблицаЮрЛиц = Новый Массив;
	Пока ВыборкаДанных.Следующий() Цикл
		СтруктураДанных = Новый Структура(КолонкиТаблицы);
		СтруктураДанных.Ссылка                = ВыборкаДанных.Сторона;
		СтруктураДанных.РольСтрокой           = "СторонаДокумента";
		СтруктураДанных.Роль                  = РольСторонаДокумента;
		СтруктураДанных.ПолеОсновногоТелефона = "";
		
		ТаблицаЮрЛиц.Добавить(СтруктураДанных);
	КонецЦикла;
	
	ВыборкаДанных = МодульКода("ESD_ТНОбщегоНазначенияСервер").ВыборкаДанныхЮрЛиц(Неопределено, Неопределено, ТаблицаЮрЛиц);
	Пока ВыборкаДанных.Следующий() Цикл
		СтруктураДанныхЮрЛица = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ШаблонДанныхЮрЛица();
		ЗаполнитьЗначенияСвойств(СтруктураДанныхЮрЛица, ВыборкаДанных);
		СоответствиеДанныхПоСсылкам.Вставить(ВыборкаДанных.Ссылка, СтруктураДанныхЮрЛица);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДанныеПоСторонамДокумента(СоответствиеДанныхПоСсылкам)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ESD_ДокументыЭПДДанныеЮрЛиц.Сторона КАК Справочник.ESD_СторонаДокумента) КАК Сторона
	|ПОМЕСТИТЬ СтороныДокумента
	|ИЗ
	|	Справочник.ESD_ДокументыЭПД.ДанныеЮрЛиц КАК ESD_ДокументыЭПДДанныеЮрЛиц
	|ГДЕ
	|	ESD_ДокументыЭПДДанныеЮрЛиц.Роль = &ПустаяСсылкаРоль
	|	И ТИПЗНАЧЕНИЯ(ESD_ДокументыЭПДДанныеЮрЛиц.Сторона) = ТИП(Справочник.ESD_СторонаДокумента)
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> &ПустаяСсылкаСторона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтороныДокумента.Сторона КАК Ссылка,
	|	СтороныДокумента.Сторона.Наименование КАК НаименованиеОрганизации,
	|	СтороныДокумента.Сторона.ИНН КАК ИНН,
	|	СтороныДокумента.Сторона.КПП КАК КПП,
	|	СтороныДокумента.Сторона.ЮрФизЛицо КАК ЮрФизЛицо,
	|	СтороныДокумента.Сторона.СтранаРегистрации КАК СтранаРегистрации,
	|	СтороныДокумента.Сторона.КодФилиала КАК КодФилиала
	|ИЗ
	|	СтороныДокумента КАК СтороныДокумента";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ДокументыЭПД", ДокументыЭПД());
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_СторонаДокумента", СторонаДокумента());
	ЗапросДанных.УстановитьПараметр("ПустаяСсылкаРоль",    ЗначениеМетаданных("ESD_РолиКонтрагентов.ПустаяСсылка"));
	ЗапросДанных.УстановитьПараметр("ПустаяСсылкаСторона", ЗначениеМетаданных("ESD_СторонаДокумента.ПустаяСсылка"));
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	Пока ВыборкаДанных.Следующий() Цикл
		СтруктураДанныхЮрЛица = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ШаблонДанныхЮрЛица();
		ЗаполнитьЗначенияСвойств(СтруктураДанныхЮрЛица, ВыборкаДанных);
		СоответствиеДанныхПоСсылкам.Вставить(ВыборкаДанных.Ссылка, СтруктураДанныхЮрЛица);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеСторонПоСсылкам(СоответствиеДанныхПоСсылкам)
	
	Если СоответствиеДанныхПоСсылкам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РольСторонаДокумента = ЗначениеМетаданных("ESD_РолиКонтрагентов.СторонаДокумента");
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ESD_ДокументыЭПДДанныеЮрЛиц.Ссылка КАК Ссылка,
	|	ESD_ДокументыЭПДДанныеЮрЛиц.НомерСтроки КАК НомерСтроки,
	|	ESD_ДокументыЭПДДанныеЮрЛиц.Сторона КАК Сторона
	|ИЗ
	|	Справочник.ESD_ДокументыЭПД.ДанныеЮрЛиц КАК ESD_ДокументыЭПДДанныеЮрЛиц
	|ГДЕ
	|	ESD_ДокументыЭПДДанныеЮрЛиц.Роль = &ПустаяСсылкаРоль
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> &ПустаяСсылкаСторона
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> НЕОПРЕДЕЛЕНО
	|ИТОГИ ПО
	|	Ссылка";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ДокументыЭПД", ДокументыЭПД());
	ЗапросДанных.УстановитьПараметр("ПустаяСсылкаРоль",    ЗначениеМетаданных("ESD_РолиКонтрагентов.ПустаяСсылка"));
	ЗапросДанных.УстановитьПараметр("ПустаяСсылкаСторона", ЗначениеМетаданных("ESD_СторонаДокумента.ПустаяСсылка"));
	
	ВыборкаПоДокументам = ЗапросДанных.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		ОбъектСправочника = ВыборкаПоДокументам.Ссылка.ПолучитьОбъект();
		ОбъектСправочника.ДанныеЮрЛиц.Очистить();
		
		ВыборкаСторон = ВыборкаПоДокументам.Выбрать();
		Пока ВыборкаСторон.Следующий() Цикл
			СтрокаЮрЛица = ОбъектСправочника.ДанныеЮрЛиц.Добавить();
			СтруктураЮрЛица = СоответствиеДанныхПоСсылкам.Получить(ВыборкаСторон.Сторона);
			ЗаполнитьЗначенияСвойств(СтрокаЮрЛица, СтруктураЮрЛица);
			СтрокаЮрЛица.Роль = РольСторонаДокумента;
		КонецЦикла;
		
		ОбъектСправочника.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_etrn_base_Catalog_ДокументыЭПД_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_Catalog_ДокументыЭПД_СлужебныеПроцедурыИФункции
