
#Область СлужебныйПрограммныйИнтерфейс

Функция ПеренестиДанныеСторонНепосредственноВДокумент() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ОК",             Истина);
	РезультатФункции.Вставить("ОписаниеОшибки", "");
	
	// Реквизита со ссылкой больше нет, поэтому делать ничего не надо.
	Если ПустаяСсылка().Метаданные().ТабличныеЧасти.ДанныеЮрЛиц.Реквизиты.Найти("Сторона") = Неопределено Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	СоответствиеДанныхПоСсылкам = Новый Соответствие;
	ДобавитьДанныеПоКонтрагентамИОрганизациям(СоответствиеДанныхПоСсылкам);
	ДобавитьДанныеПоСторонамДокумента(СоответствиеДанныхПоСсылкам);
	
	ЗаполнитьДанныеСторонПоСсылкам(СоответствиеДанныхПоСсылкам);
	
	Возврат РезультатФункции;
	
КонецФункции

#Область НовыйРедакторИнтерфейс

Процедура ДобавитьДанныеДокументаЭПД(МассивДанныхДокументовЭПД, ДанныеДокументаЭПД, ТипДокументаЭПД = Неопределено) Экспорт
	
	ДанныеДокументаПолучены = ТипЗнч(ДанныеДокументаЭПД) = Тип("Соответствие")
		И ЗначениеЗаполнено(ДанныеДокументаЭПД)
		И ЗначениеЗаполнено(ДанныеДокументаЭПД["Номер"])
		И ЗначениеЗаполнено(ДанныеДокументаЭПД["Дата"]);
		
	Если Не ДанныеДокументаПолучены Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипДокументаЭПД <> Неопределено Тогда
		ДанныеДокументаЭПД.Вставить("Тип", ТипДокументаЭПД);
	КонецЕсли;
	
	Наименование = ДанныеДокументаЭПД["Наименование"];
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Наименование = "№%1 от %2";
		Наименование = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
			Наименование, ДанныеДокументаЭПД["Номер"], Формат(ДанныеДокументаЭПД["Дата"], "ДФ=dd.MM.yyyy"));
		ДанныеДокументаЭПД["Наименование"] = Наименование;
	КонецЕсли;
	
	МассивДанныхДокументовЭПД.Добавить(ДанныеДокументаЭПД);
	
КонецПроцедуры

Процедура ЗаполнитьСсылкиДокументовЭПД(МассивДанныхДокументовЭПД) Экспорт
	
	ИмяДата = "Дата";

	РазмерНомера = 255;
	ТипНомера = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(РазмерНомера));
	РазмерИндекса = 4;
	ТипИндекса = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(РазмерИндекса, 0));
	ТипДата = Новый ОписаниеТипов(ИмяДата, , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаДанныхДокументовЭПД = Новый ТаблицаЗначений;
	ТаблицаДанныхДокументовЭПД.Колонки.Добавить("Номер",  ТипНомера);
	ТаблицаДанныхДокументовЭПД.Колонки.Добавить(ИмяДата,  ТипДата);
	ТаблицаДанныхДокументовЭПД.Колонки.Добавить("Тип",    Новый ОписаниеТипов("ПеречислениеСсылка.ESD_ТипыДокумента"));
	ТаблицаДанныхДокументовЭПД.Колонки.Добавить("Индекс", ТипИндекса);
	
	Для Индекс = 0 По МассивДанныхДокументовЭПД.ВГраница() Цикл
		СтрокаДокументаЭПД = ТаблицаДанныхДокументовЭПД.Добавить();
		СтрокаДокументаЭПД.Номер  = МассивДанныхДокументовЭПД[Индекс]["Номер"];
		СтрокаДокументаЭПД.Дата   = МассивДанныхДокументовЭПД[Индекс][ИмяДата];
		СтрокаДокументаЭПД.Тип    = МассивДанныхДокументовЭПД[Индекс]["Тип"];
		СтрокаДокументаЭПД.Индекс = Индекс;
	КонецЦикла;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДанныхДокументовЭПД.Номер КАК Номер,
	|	ТаблицаДанныхДокументовЭПД.Дата КАК Дата,
	|	ТаблицаДанныхДокументовЭПД.Тип КАК Тип,
	|	ТаблицаДанныхДокументовЭПД.Индекс КАК Индекс
	|ПОМЕСТИТЬ ДанныеДокументовЭПД
	|ИЗ
	|	&ТаблицаДанныхДокументовЭПД КАК ТаблицаДанныхДокументовЭПД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументовЭПД.Индекс КАК Индекс,
	|	ЕСТЬNULL(ESD_ДокументыЭПД.Ссылка, ЗНАЧЕНИЕ(Справочник.ESD_ДокументыЭПД.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	ДанныеДокументовЭПД КАК ДанныеДокументовЭПД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ESD_ДокументыЭПД КАК ESD_ДокументыЭПД
	|		ПО ДанныеДокументовЭПД.Номер = ESD_ДокументыЭПД.Номер
	|			И ДанныеДокументовЭПД.Дата = ESD_ДокументыЭПД.Дата
	|			И ДанныеДокументовЭПД.Тип = ESD_ДокументыЭПД.Тип
	|			И (ДанныеДокументовЭПД.Номер <> """")
	|			И (ДанныеДокументовЭПД.Дата <> ДАТАВРЕМЯ(1, 1, 1))
	|			И (ДанныеДокументовЭПД.Тип <> ЗНАЧЕНИЕ(Перечисление.ESD_ТипыДокумента.ПустаяСсылка))";
	
	ЗапросДанных.УстановитьПараметр("ТаблицаДанныхДокументовЭПД", ТаблицаДанныхДокументовЭПД);
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	Пока ВыборкаДанных.Следующий() Цикл
		ДанныеДокументаЭПД = МассивДанныхДокументовЭПД[ВыборкаДанных.Индекс];
		Если ЗначениеЗаполнено(ДанныеДокументаЭПД["Ссылка"]) Тогда
			Продолжить;
		КонецЕсли;
		СсылкаДокументЭПД = ОбновленныйДокументЭПД(ВыборкаДанных.Ссылка, ДанныеДокументаЭПД);
		ДанныеДокументаЭПД.Вставить("Ссылка", СсылкаДокументЭПД);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // НовыйРедакторИнтерфейс

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область НовыйРедактор

Функция ОбновленныйДокументЭПД(СсылкаДокументЭПД, ДанныеДокументаЭПД)
	
	Если Не СсылкаДокументЭПД.Пустая() Тогда
		РезультатФункции = СсылкаДокументЭПД.ПолучитьОбъект();
		РезультатФункции.ДанныеЮрЛиц.Очистить();
	Иначе
		РезультатФункции = Справочники.ESD_ДокументыЭПД.СоздатьЭлемент();
	КонецЕсли;
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьЗначенияИзСоответствия(РезультатФункции, ДанныеДокументаЭПД);
	
	Стороны = ДанныеДокументаЭПД["Стороны"];
	Если ЗначениеЗаполнено(Стороны) Тогда
		Для Каждого ДанныеСтороны Из Стороны Цикл
			ДанныеСтороны = ДанныеСтороны["Стороны.Сторона"];
			СтрокаСтороны = РезультатФункции.ДанныеЮрЛиц.Добавить();
			МодульТНОбщегоНазначенияСервер.ЗаполнитьЗначенияИзСоответствия(СтрокаСтороны, ДанныеСтороны);
			СтрокаСтороны.НаименованиеОрганизации = ДанныеСтороны["Наименование"];
			Если Не ЗначениеЗаполнено(СтрокаСтороны.НаименованиеОрганизации) Тогда
				СтрокаСтороны.НаименованиеОрганизации = Строка(СтрокаСтороны.ЮрФизЛицо) + " " + СтрокаСтороны.ИНН;
			КонецЕсли;
			СтрокаСтороны.Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.СторонаДокумента");
			СтрокаСтороны.КлючСтроки = МодульТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(РезультатФункции, "ДанныеЮрЛиц");
		КонецЦикла;
	КонецЕсли;
	
	РезультатФункции.Записать();
	РезультатФункции = РезультатФункции.Ссылка;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // НовыйРедактор

Процедура ДобавитьДанныеПоКонтрагентамИОрганизациям(СоответствиеДанныхПоСсылкам)
	
	РольСторонаДокумента = ЗначениеМетаданных("ESD_РолиКонтрагентов.СторонаДокумента");
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ESD_ДокументыЭПДДанныеЮрЛиц.Сторона КАК Сторона
	|ИЗ
	|	Справочник.ESD_ДокументыЭПД.ДанныеЮрЛиц КАК ESD_ДокументыЭПДДанныеЮрЛиц
	|ГДЕ
	|	ESD_ДокументыЭПДДанныеЮрЛиц.Роль = &ПустаяСсылка
	|	И ТИПЗНАЧЕНИЯ(ESD_ДокументыЭПДДанныеЮрЛиц.Сторона) В (ТИП(Справочник.Контрагенты), ТИП(Справочник.Организации))
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ДокументыЭПД", ДокументыЭПД());
	ЗапросДанных.УстановитьПараметр("ПустаяСсылка", ЗначениеМетаданных("ESD_РолиКонтрагентов.ПустаяСсылка"));
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	
	КолонкиТаблицы = "Ссылка,РольСтрокой,Роль,ПолеОсновногоТелефона,КлючСтроки,ПараметрыРеквизитаФормы";
	
	ТаблицаЮрЛиц = Новый Массив;
	Пока ВыборкаДанных.Следующий() Цикл
		СтруктураДанных = Новый Структура(КолонкиТаблицы);
		СтруктураДанных.Ссылка                = ВыборкаДанных.Сторона;
		СтруктураДанных.РольСтрокой           = "СторонаДокумента";
		СтруктураДанных.Роль                  = РольСторонаДокумента;
		СтруктураДанных.ПолеОсновногоТелефона = "";
		
		ТаблицаЮрЛиц.Добавить(СтруктураДанных);
	КонецЦикла;
	
	ВыборкаДанных = МодульКода("ESD_ТНОбщегоНазначенияСервер").ВыборкаДанныхЮрЛиц(Неопределено, Неопределено, ТаблицаЮрЛиц);
	Пока ВыборкаДанных.Следующий() Цикл
		СтруктураДанныхЮрЛица = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ШаблонДанныхЮрЛица();
		ЗаполнитьЗначенияСвойств(СтруктураДанныхЮрЛица, ВыборкаДанных);
		СоответствиеДанныхПоСсылкам.Вставить(ВыборкаДанных.Ссылка, СтруктураДанныхЮрЛица);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДанныеПоСторонамДокумента(СоответствиеДанныхПоСсылкам)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ESD_ДокументыЭПДДанныеЮрЛиц.Сторона КАК Справочник.ESD_СторонаДокумента) КАК Сторона
	|ПОМЕСТИТЬ СтороныДокумента
	|ИЗ
	|	Справочник.ESD_ДокументыЭПД.ДанныеЮрЛиц КАК ESD_ДокументыЭПДДанныеЮрЛиц
	|ГДЕ
	|	ESD_ДокументыЭПДДанныеЮрЛиц.Роль = &ПустаяСсылкаРоль
	|	И ТИПЗНАЧЕНИЯ(ESD_ДокументыЭПДДанныеЮрЛиц.Сторона) = ТИП(Справочник.ESD_СторонаДокумента)
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> &ПустаяСсылкаСторона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтороныДокумента.Сторона КАК Ссылка,
	|	СтороныДокумента.Сторона.Наименование КАК НаименованиеОрганизации,
	|	СтороныДокумента.Сторона.ИНН КАК ИНН,
	|	СтороныДокумента.Сторона.КПП КАК КПП,
	|	СтороныДокумента.Сторона.ЮрФизЛицо КАК ЮрФизЛицо,
	|	СтороныДокумента.Сторона.СтранаРегистрации КАК СтранаРегистрации,
	|	СтороныДокумента.Сторона.КодФилиала КАК КодФилиала
	|ИЗ
	|	СтороныДокумента КАК СтороныДокумента";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ДокументыЭПД", ДокументыЭПД());
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_СторонаДокумента", СторонаДокумента());
	ЗапросДанных.УстановитьПараметр("ПустаяСсылкаРоль",    ЗначениеМетаданных("ESD_РолиКонтрагентов.ПустаяСсылка"));
	ЗапросДанных.УстановитьПараметр("ПустаяСсылкаСторона", ЗначениеМетаданных("ESD_СторонаДокумента.ПустаяСсылка"));
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	Пока ВыборкаДанных.Следующий() Цикл
		СтруктураДанныхЮрЛица = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ШаблонДанныхЮрЛица();
		ЗаполнитьЗначенияСвойств(СтруктураДанныхЮрЛица, ВыборкаДанных);
		СоответствиеДанныхПоСсылкам.Вставить(ВыборкаДанных.Ссылка, СтруктураДанныхЮрЛица);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеСторонПоСсылкам(СоответствиеДанныхПоСсылкам)
	
	Если СоответствиеДанныхПоСсылкам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РольСторонаДокумента = ЗначениеМетаданных("ESD_РолиКонтрагентов.СторонаДокумента");
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ESD_ДокументыЭПДДанныеЮрЛиц.Ссылка КАК Ссылка,
	|	ESD_ДокументыЭПДДанныеЮрЛиц.НомерСтроки КАК НомерСтроки,
	|	ESD_ДокументыЭПДДанныеЮрЛиц.Сторона КАК Сторона
	|ИЗ
	|	Справочник.ESD_ДокументыЭПД.ДанныеЮрЛиц КАК ESD_ДокументыЭПДДанныеЮрЛиц
	|ГДЕ
	|	ESD_ДокументыЭПДДанныеЮрЛиц.Роль = &ПустаяСсылкаРоль
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> &ПустаяСсылкаСторона
	|	И ESD_ДокументыЭПДДанныеЮрЛиц.Сторона <> НЕОПРЕДЕЛЕНО
	|ИТОГИ ПО
	|	Ссылка";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ДокументыЭПД", ДокументыЭПД());
	ЗапросДанных.УстановитьПараметр("ПустаяСсылкаРоль",    ЗначениеМетаданных("ESD_РолиКонтрагентов.ПустаяСсылка"));
	ЗапросДанных.УстановитьПараметр("ПустаяСсылкаСторона", ЗначениеМетаданных("ESD_СторонаДокумента.ПустаяСсылка"));
	
	ВыборкаПоДокументам = ЗапросДанных.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		ОбъектСправочника = ВыборкаПоДокументам.Ссылка.ПолучитьОбъект();
		ОбъектСправочника.ДанныеЮрЛиц.Очистить();
		
		ВыборкаСторон = ВыборкаПоДокументам.Выбрать();
		Пока ВыборкаСторон.Следующий() Цикл
			СтрокаЮрЛица = ОбъектСправочника.ДанныеЮрЛиц.Добавить();
			СтруктураЮрЛица = СоответствиеДанныхПоСсылкам.Получить(ВыборкаСторон.Сторона);
			ЗаполнитьЗначенияСвойств(СтрокаЮрЛица, СтруктураЮрЛица);
			СтрокаЮрЛица.Роль = РольСторонаДокумента;
		КонецЦикла;
		
		ОбъектСправочника.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_etrn_base_Catalog_ДокументыЭПД_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_Catalog_ДокументыЭПД_СлужебныеПроцедурыИФункции
