
&НаКлиенте
Процедура ПечатьQR(Форма, ЗаголовокПечатнойФормы, ЭтоФормаСписка = Ложь) Экспорт
	// Сформируем параметры печати
	ПараметрыПечати = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыПечати(
		Форма.УникальныйИдентификатор,
		ЗаголовокПечатнойФормы,
		ЭтоФормаСписка,
		Истина);
	ПараметрыПечати.Вставить("Форма", Форма);
	
	// Обработаем начало печати
	ПередВыполнениемПечати(Форма, ПараметрыПечати);
	
	// Определим обработчик оповещения
	ПроцедураОткрытьПечатнуюФорму = Новый ОписаниеОповещения("ПечатнаяФормаQR_Сформировать", 
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент"), ПараметрыПечати);
		
	ПроверитьМодифицированностьИПродолжитьВыполнение(ПроцедураОткрытьПечатнуюФорму);	
КонецПроцедуры

