
&НаКлиенте
Процедура ПечатнаяФормаQR_Сформировать(Результат, ПараметрыПечати) Экспорт
	ПодготовитьПараметрыПечати(ПараметрыПечати);
	Если Не ПараметрыПечати.Свойство("СсылкаНаДокумент") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПечати.Удалить("Форма");
	
	РезультатСоздания = ПечатнаяФормаQR_Создать(ПараметрыПечати);
	ПечатнаяФормаQR_Отобразить(РезультатСоздания, ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Функция ПечатнаяФормаQR_Создать(ПараметрыПечати) Экспорт
	#Если ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
	ПараметрыПечати.Вставить("ЭтоТолстыйКлиент", Истина);
	#КонецЕсли

	Результат = МодульКодаКлиент("ESD_ТНОбщегоНазначенияСервер").SabyДанныеПечатнойФормыQR(
		ПараметрыПечати);
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Процедура ПечатнаяФормаQR_Отобразить(Результат, ДополнительныеПараметры) Экспорт
	ПечатнаяФормаQR = Неопределено;
	Если Результат.ПечатнаяФормаQR <> Неопределено Тогда	
		#Если ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
			// Табличный документ в толстом клиенте не передается с сервера на клиент, поэтому заворачиваем в строку внутр.
			ПечатнаяФормаQR = ЗначениеИзСтрокиВнутр(Результат.ПечатнаяФормаQR);
		#Иначе
			ПечатнаяФормаQR = Результат.ПечатнаяФормаQR;
		#КонецЕсли	
	КонецЕсли;
	
	Если ПечатнаяФормаQR <> Неопределено Тогда
		ПечатнаяФормаQR.Показать();
	Иначе
		ОткрытьСсылкуИзСпискаДокументов(Результат);
	КонецЕсли;
КонецПроцедуры

