#Область ПрограммныйИнтерфейс

// Возвращает таблицу значений дополнительных полей.
//
// Параметры:
//	СтруктураОтбора - Структура, Соответствие - коллекция пар "ключ-значения" описания отбора
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица значений дополнительных полей
//
Функция Таблица(СтруктураОтбора) Экспорт
	Если Не ЗначениеЗаполнено(СтруктураОтбора) Тогда
		ВызватьИсключение "Для получения таблицы данных необходимо указать отбор!";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	// BSLLS:FieldsFromJoinsWithoutIsNull-off
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ESD_ЗначенияДополнительныхПолей.Владелец КАК Владелец,	
		|	ESD_ЗначенияДополнительныхПолей.Идентификатор КАК Идентификатор,
		|	ESD_ЗначенияДополнительныхПолей.Направление КАК Направление,
		|	ESD_ЗначенияДополнительныхПолей.Значение КАК Значение,
		|	ESD_ЗначенияДополнительныхПолей.Номер КАК Номер,		
		|	ESD_ЗначенияДополнительныхПолей.Служебное КАК Служебное,
		|	ESD_ЗначенияДополнительныхПолей.ТипТитула КАК ТипТитула
		|ПОМЕСТИТЬ ESD_ЗначенияДополнительныхПолей
		|ИЗ
		|	РегистрСведений.ESD_ЗначенияДополнительныхПолей КАК ESD_ЗначенияДополнительныхПолей
		|ГДЕ
		|	&Отбор
		|;////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ESD_ЗначенияДополнительныхПолей.Владелец КАК Владелец,	
		|	ESD_ЗначенияДополнительныхПолей.Идентификатор КАК Идентификатор,
		|	ESD_ЗначенияДополнительныхПолей.Направление КАК Направление,
		|	ESD_ЗначенияДополнительныхПолей.Значение КАК Значение,
		|	ESD_ЗначенияДополнительныхПолей.Номер КАК Номер,		
		|	ESD_ЗначенияДополнительныхПолей.Служебное КАК Служебное,
		|	ESD_ЗначенияДополнительныхПолей.ТипТитула КАК ТипТитула,
		|	ЕСТЬNULL(ESD_ДополнительныеПоля.Наименование, ESD_ЗначенияДополнительныхПолей.Идентификатор) КАК Наименование,
		|	ЕСТЬNULL(ESD_ДополнительныеПоля.Тип, """") КАК Тип,
		|	ЕСТЬNULL(ESD_ДополнительныеПоля.ПроверятьЗаполнение, Ложь) КАК ПроверятьЗаполнение,
		|	ЕСТЬNULL(ESD_ДополнительныеПоля.РежимВыбораИзСписка, Ложь) КАК РежимВыбораИзСписка,
		|	ESD_ДополнительныеПоля.СписокВыбора.(Значение) КАК СписокВыбора
		|ИЗ
		|	ESD_ЗначенияДополнительныхПолей КАК ESD_ЗначенияДополнительныхПолей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ESD_ДополнительныеПоля КАК ESD_ДополнительныеПоля
		|		ПО ESD_ЗначенияДополнительныхПолей.Идентификатор = ESD_ДополнительныеПоля.Идентификатор
		|			И НЕ ESD_ДополнительныеПоля.ПометкаУдаления
		|";
	// BSLLS:FieldsFromJoinsWithoutIsNull-on
		
	ОбщийТекстОтбора = "ИСТИНА";
	Если ЗначениеЗаполнено(СтруктураОтбора) Тогда
		НомерПараметра = 1;
		Для Каждого ОписаниеОтбора Из СтруктураОтбора Цикл
			ИмяПараметра = "Параметр" + Строка(НомерПараметра);
			Если ТипЗнч(ОписаниеОтбора.Значение) = Тип("Массив") Тогда
				УсловиеОтбора = " В(&" + ИмяПараметра + ")";	
			Иначе
				УсловиеОтбора = " = &" + ИмяПараметра;	
			КонецЕсли;
			
			ОбщийТекстОтбора = ОбщийТекстОтбора
				+ " И ESD_ЗначенияДополнительныхПолей." + ОписаниеОтбора.Ключ + УсловиеОтбора;
			Запрос.УстановитьПараметр(ИмяПараметра, ОписаниеОтбора.Значение);
			
			НомерПараметра = НомерПараметра + 1;
		КонецЦикла;
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор", ОбщийТекстОтбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции 

// Возвращает массив структур дополнительных полей
//
// Параметры:
//	СтруктураОтбора - Структура, Соответствие - коллекция пар "ключ-значения" описания отбора
//
// Возвращаемое значение:
//	Массив - массив структур значений дополнительных полей	
//
Функция Массив(СтруктураОтбора) Экспорт
	Результат = Новый Массив;
	Таблица_ = Таблица(СтруктураОтбора);
	
	Для Каждого СтрокаТаблицы_ Из Таблица_ Цикл
		СтруктураДанных = СтруктураОбъекта();
		ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаТаблицы_, , "СписокВыбора"); 
		
		Если ЗначениеЗаполнено(СтрокаТаблицы_.СписокВыбора) Тогда
			Для Каждого ЗначенияСпискаВыбора Из СтрокаТаблицы_.СписокВыбора Цикл
				СтруктураЗначенияВыбора = Новый Структура("Значение", ЗначенияСпискаВыбора.Значение);
				СтруктураДанных.СписокВыбора.Добавить(СтруктураЗначенияВыбора);
			КонецЦикла;
		КонецЕсли;
		
		Результат.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Возвращает значение дополнительного поля
//
// Параметры:
//	Ссылка - ДокументСсылка - ссылка на документ ЭПД ESD
//	Идентификатор - Строка - строковый идентификатор дополнительного поля
//
// Возвращаемое значение:
//	Строка, Булево, Дата, Число, Неопределено - значение дополнительного поля
//	
Функция Значение(Ссылка, Идентификатор) Экспорт
	МенеджерЗаписи = РегистрыСведений.ESD_ЗначенияДополнительныхПолей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Владелец = Ссылка;
	МенеджерЗаписи.Идентификатор = Идентификатор;
	
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Частный случай удаления по идентификатору
//
// Параметры:
// 	Владелец - ДокументСсылка - ссылка на документ ЭПД ESD
//	Направление - ПеречислениеСсылка.ESD_Направление - направление значения дополнительного поля
//	Идентификатор - Строка - идентификатор дополнительного поля
//
Процедура УдалитьПоИдентификатору(Владелец, Направление, Идентификатор) Экспорт
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Владелец", Владелец);
	СтруктураОтбора.Вставить("Направление", Направление);
	СтруктураОтбора.Вставить("Идентификатор", Идентификатор);
	Таблица_ = Таблица(СтруктураОтбора);
	
	Для Каждого СтрокаУдаления Из Таблица_ Цикл
		НаборЗаписей = РегистрыСведений.ESD_ЗначенияДополнительныхПолей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Владелец.Установить(СтрокаУдаления.Владелец);
		НаборЗаписей.Отбор.Направление.Установить(СтрокаУдаления.Направление);
		НаборЗаписей.Отбор.Номер.Установить(СтрокаУдаления.Номер);
		НаборЗаписей.Записать(Истина);
	КонецЦикла;		
КонецПроцедуры

// Удаление записей, подчиненных ссылке документа
// 
// Параметры:
// 	Владелец - ДокументСсылка - ссылка на документ ЭПД ESD
//	Направление - ПеречислениеСсылка.ESD_Направление - направление значения дополнительного поля
//
Процедура Очистить(Владелец, Направление = Неопределено) Экспорт
	НаборЗаписей = РегистрыСведений.ESD_ЗначенияДополнительныхПолей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Владелец.Установить(Владелец);
	Если Направление <> Неопределено Тогда
		НаборЗаписей.Отбор.Направление.Установить(Направление);
	КонецЕсли;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

// Записывает значение дополнительного реквизита
// 
// Параметры:
//  Владелец - ДокументСсылка - ссылка на документ-владельца дополнительного значения
//	СписокПолей - Соответствие, Структура - коллекция дополнительных полей
//	Направление - ПеречислениеСсылка.ESD_Направление - направление значения дополнительного поля
//	ПерезаписатьПоВладельцу - Булево - признак обновления значений дополнительных полей владельца
//
Процедура ЗаписатьЗначения(Владелец, СписокПолей, Знач Направление = Неопределено, ПерезаписатьПоВладельцу = Истина) Экспорт
	Если Направление = Неопределено Тогда
		Направление = Перечисления.ESD_Направление.Входящий;
	КонецЕсли;
	
	Если ПерезаписатьПоВладельцу Тогда
		Очистить(Владелец, Направление);
	КонецЕсли;
	
	ТекущиеЗначения = Таблица(Новый Структура("Владелец, Направление", Владелец, Направление));
	
	Для Каждого ОписаниеДополнительногоПоля Из СписокПолей Цикл
		СтруктураОбъекта = СтруктураОбъекта();
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта, ОписаниеДополнительногоПоля);
		СтруктураОбъекта.Владелец = Владелец;
		СтруктураОбъекта.Направление = Направление;
		
		Отказ = Ложь;
		ПередЗаписьюЗначения(СтруктураОбъекта, ТекущиеЗначения, Отказ);
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписатьЗначение(СтруктураОбъекта);
	КонецЦикла;
КонецПроцедуры

// Записывает значение дополнительного реквизита
// 
// Параметры:
//	СтруктураОбъекта - Структура, Соответствие - структура объекта значения дополнительного поля
// 
Процедура ЗаписатьЗначение(СтруктураОбъекта) Экспорт
	Если Не ЗначениеЗаполнено(СтруктураОбъекта.Направление) Тогда
		СтруктураОбъекта.Направление = Перечисления.ESD_Направление.Входящий;
	КонецЕсли;
	
	// При установленном "номере" считаем, что все уже ранее было проверено и обработано
	Если Не ЗначениеЗаполнено(СтруктураОбъекта.Номер) Тогда
		Отказ = Ложь;
		ПередЗаписьюЗначения(СтруктураОбъекта, , Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ESD_ЗначенияДополнительныхПолей.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураОбъекта);
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры

// Возвращает структуру описания значения дополнительного поля
//
// Возвращаемое значение:
//	Структура - структура описания объекта
//
Функция СтруктураОбъекта() Экспорт
	Результат = Справочники.ESD_ДополнительныеПоля.СтруктураОбъекта();
	Результат.Вставить("Владелец", Неопределено);
	Результат.Вставить("Значение", Неопределено);
	Результат.Вставить("Направление", Неопределено);
	Результат.Вставить("Номер", 0);
	Результат.Вставить("Служебное", Ложь);
	Результат.Вставить("ТипТитула", Неопределено);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПередЗаписьюЗначения(СтруктураОбъекта, ТекущиеЗначения = Неопределено, Отказ = Ложь)
	Если Не (ЗначениеЗаполнено(СтруктураОбъекта.Значение) 
		И ЗначениеЗаполнено(СтруктураОбъекта.Идентификатор)
		И ЗначениеЗаполнено(СтруктураОбъекта.Владелец)
		И ЗначениеЗаполнено(СтруктураОбъекта.Направление)) 
	Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ТекущиеЗначения = Неопределено Тогда 
		ТекущиеЗначения = Таблица(Новый Структура("Владелец", СтруктураОбъекта.Владелец));	
	КонецЕсли; 
		
	Если СтруктураОбъекта.Направление = Перечисления.ESD_Направление.Исходящий Тогда
		СтруктураОтбора = Новый Структура("Идентификатор,Направление");
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтруктураОбъекта);
		Если ТекущиеЗначения.НайтиСтроки(СтруктураОтбора).Количество() Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Актуализируем порядковый номер значения
	СтруктураОбъекта.Номер = ТекущиеЗначения.Количество() + 1;
	
	// Учтем новое значение следующей проверки
	ЗаполнитьЗначенияСвойств(ТекущиеЗначения.Добавить(), СтруктураОбъекта);
КонецПроцедуры

#КонецОбласти