
#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  Код - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.Saby_КлассыОпасностиГрузов - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция ЗначениеПоКоду(Код) Экспорт
	
	Если Код = "1" Тогда
		Возврат Класс1;
	ИначеЕсли Код = "2" Тогда
		Возврат Класс2;
	ИначеЕсли Код = "3" Тогда
		Возврат Класс3;
	ИначеЕсли Код = "4.1" Тогда
		Возврат Класс4_1;
	ИначеЕсли Код = "4.2" Тогда
		Возврат Класс4_2;
	ИначеЕсли Код = "4.3" Тогда
		Возврат Класс4_3;
	ИначеЕсли Код = "5.1" Тогда
		Возврат Класс5_1;
	ИначеЕсли Код = "5.2" Тогда
		Возврат Класс5_2;
	ИначеЕсли Код = "6.1" Тогда
		Возврат Класс6_1;
	ИначеЕсли Код = "6.2" Тогда
		Возврат Класс6_2;
	ИначеЕсли Код = "7" Тогда
		Возврат Класс7;
	ИначеЕсли Код = "8" Тогда
		Возврат Класс8;
	ИначеЕсли Код = "9" Тогда
		Возврат Класс9;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующий код по указанному значению перечисления.
//
// Параметры:
//  Значение  - ПеречислениеСсылка.Saby_КлассыОпасностиГрузов - значение перечисления
//
// Возвращаемое значение:
//   Строка - Строковое представление кода.
//
Функция КодПоЗначению(Значение) Экспорт
	
	Если Значение = Класс1 Тогда
		Возврат "1";
	ИначеЕсли Значение = Класс2 Тогда
		Возврат "2";
	ИначеЕсли Значение = Класс3 Тогда
		Возврат "3";
	ИначеЕсли Значение = Класс4_1 Тогда
		Возврат "4.1";
	ИначеЕсли Значение = Класс4_2 Тогда
		Возврат "4.2";
	ИначеЕсли Значение = Класс4_3 Тогда
		Возврат "4.3";
	ИначеЕсли Значение = Класс5_1 Тогда
		Возврат "5.1";
	ИначеЕсли Значение = Класс5_2 Тогда
		Возврат "5.2";
	ИначеЕсли Значение = Класс6_1 Тогда
		Возврат "6.1";
	ИначеЕсли Значение = Класс6_2 Тогда
		Возврат "6.2";
	ИначеЕсли Значение = Класс7 Тогда
		Возврат "7";
	ИначеЕсли Значение = Класс8 Тогда
		Возврат "8";
	ИначеЕсли Значение = Класс9 Тогда
		Возврат "9";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
