
Функция НастройкиЭПД_Загрузить() Экспорт
	СтруктураОбъекта_ = НастройкиЭПД_СтруктураОбъекта();
	ТекущиеНастройки_ = ESD_ЗагрузитьНастройкиОбъекта(НастройкиЭПД_Ключ());
	Если ТипЗнч(ТекущиеНастройки_) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта_, ТекущиеНастройки_);
	КонецЕсли;
	
	Возврат СтруктураОбъекта_;	
КонецФункции

Процедура НастройкиЭПД_Записать(НовыеЗначения) Экспорт
	Если ТипЗнч(НовыеЗначения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеНастройки_ = НастройкиЭПД_Загрузить();
	ЗаполнитьЗначенияСвойств(ТекущиеНастройки_, НовыеЗначения);
	ESD_СохранитьНастройкиОбъекта(НастройкиЭПД_Ключ(), ТекущиеНастройки_);		
КонецПроцедуры

Функция НастройкиЭЗЗ_Загрузить() Экспорт
	Возврат НастройкиЭПД_Загрузить().ЭЗЗ;			
КонецФункции

Процедура НастройкиЭЗЗ_УстановитьЗначение(Ключ, Значение) Экспорт
	ТекущиеНастройки_ = НастройкиЭПД_Загрузить();
	ТекущиеНастройки_.ЭЗЗ[Ключ] = Значение;
	ESD_СохранитьНастройкиОбъекта(НастройкиЭПД_Ключ(), ТекущиеНастройки_);
КонецПроцедуры

