
Процедура Подключаемый_ФормированиеПечатнойФормы_ЗаполнитьДополнительныеПараметрыПечати(Параметры, СсылкаНаДокумент)
	Если Параметры.ВыгрузкаАрхива Или Параметры.ЭтоПечатьQRКода Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("УстановитьПечатнуюФорму") Тогда
		ИмяМетаданных = МодульКода("ESD_ТНОбщегоНазначенияСервер").ИмяМетаданныхДокумента(СсылкаНаДокумент);
		МодульДокумента = МодульКода("Документы." + ИмяМетаданных);
		ТекущаяПечатнаяФорма = МодульДокумента.ТекущаяПечатнаяФорма();
		Если ЗначениеЗаполнено(ТекущаяПечатнаяФорма) И ТекущаяПечатнаяФорма <> МодульДокумента.ПечатнаяФормаПоУмолчанию() Тогда
			Подключаемый_ФормированиеПечатнойФормы_ЗаписатьПечатнуюФорму(СсылкаНаДокумент, ТекущаяПечатнаяФорма);
			Параметры.Вставить("УстановитьПечатнуюФорму", ТекущаяПечатнаяФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура Подключаемый_ФормированиеПечатнойФормы_ЗаписатьПечатнуюФорму(СсылкаНаДокумент, ПечатнаяФорма) Экспорт
	// Сохраним выбранную печатную форму в РС "Значения дополнительных полей"
	СтруктураОбъекта_ = РегистрыСведений.ESD_ЗначенияДополнительныхПолей.СтруктураОбъекта();
	СтруктураОбъекта_.Идентификатор = "VisualForm";
	СтруктураОбъекта_.Направление = Перечисления.ESD_Направление.Исходящий;
	СтруктураОбъекта_.Значение = ПечатнаяФорма;
	СтруктураОбъекта_.Служебное = Истина;
	СтруктураОбъекта_.Владелец = СсылкаНаДокумент;
	РегистрыСведений.ESD_ЗначенияДополнительныхПолей.ЗаписатьЗначение(СтруктураОбъекта_);	
КонецПроцедуры

