#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	// Если замещение истина и набор пуст - значит, записи удаляются
	Если Замещение И ЭтотОбъект.Количество() = 0 Тогда
		ОбработатьУдалениеЗаписи();	
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьУдалениеЗаписи()
	Если Не ЭтотОбъект.Отбор.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим подчиненные записи журнала
	НаборЗаписейЖурнала = МодульКода("РегистрыСведений.АвтоматическиеСценарииЖурнал").СоздатьНаборЗаписей();
	Для Каждого ЭлементОтбора Из ЭтотОбъект.Отбор Цикл
		НаборЗаписейЖурнала.Отбор[ЭлементОтбора.Имя].Установить(ЭлементОтбора.Значение);			
	КонецЦикла;
	НаборЗаписейЖурнала.Записать(Истина);
КонецПроцедуры

#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти


