#Область ПрограммныйИнтерфейс

// Добавление нового "запущенного" автоматического сценария
//
// Параметры:
//	АвтоматическийСценарий - СправочникСсылка.АвтоматическиеСценарии - запускаемый автоматический сценарий
//	Основание - СправочникСсылка, ДокументСсылка - основание запуска автоматического сценария
//
// Возвращаемое значение:
//	Строка - идентификатор запущенного автоматического сценария
//
Функция Добавить(АвтоматическийСценарий, Основание) Экспорт
	НачатьТранзакцию();
	
	Попытка
		Идентификатор = Строка(Новый УникальныйИдентификатор());
		
		МенеджерЗаписи = РегистрыСведений[ИмяОбъекта()].СоздатьМенеджерЗаписи();
		МенеджерЗаписи.АвтоматическийСценарий = АвтоматическийСценарий;
		МенеджерЗаписи.ОснованиеID            = Основание.УникальныйИдентификатор();
		МенеджерЗаписи.ID                     = Идентификатор;
		МенеджерЗаписи.ДатаВремяЗапуска       = ТекущаяДатаСеанса();
		
		ДополнительныеПараметры = СтруктураДополнительныхПараметров();
		ДополнительныеПараметры.Основание = Основание;
		МенеджерЗаписи.ДополнительныеПараметры = Новый ХранилищеЗначения(ДополнительныеПараметры);
		
		МенеджерЗаписи.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Идентификатор = Неопределено;
	КонецПопытки;
	
	Возврат Идентификатор;
КонецФункции

// Завершение выполнения автоматического сценария
//
// Параметры:
//	АвтоматическийСценарий - СправочникСсылка.АвтоматическиеСценарии - тип автоматического сценария
//	ID - Строка - идентификатор запущенного автоматического сценария
//
Процедура Завершить(АвтоматическийСценарий, ID) Экспорт
	НачатьТранзакцию();
	
	Попытка
		НаборЗаписей = РегистрыСведений[ИмяОбъекта()].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.АвтоматическийСценарий.Установить(АвтоматическийСценарий);
		НаборЗаписей.Отбор.ID.Установить(ID);
		НаборЗаписей.Прочитать();
		
		Если Не НаборЗаписей.Количество() Тогда
			ВызватьИсключение "";	
		КонецЕсли;
		
		Запись = НаборЗаписей[0];
		Если Запись.Завершен Тогда
			ВызватьИсключение "";
		КонецЕсли;
	
		Запись.ДатаВремяЗавершения = ТекущаяДатаСеанса();
		Запись.Завершен = Истина;
		НаборЗаписей.Записать(Истина);
	
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
КонецПроцедуры

// Поиск запущенных автоматических сценариев по структуре отбора
//
// Параметры:
//	СтруктураОтбора - Структура - структура отбора данных
//	
// Возвращаемое значение:
//	Структура - см. СтруктураДанных()
//
Функция НайтиПоОтбору(СтруктураОтбора) Экспорт
	ТипЗнчОтбора = ТипЗнч(СтруктураОтбора);
	Если Не((ТипЗнчОтбора = Тип("Структура") Или ТипЗнчОтбора = Тип("Соответствие")) И СтруктураОтбора.Количество()) Тогда
		ВызватьИсключение "Необходимо указать отбор";
	КонецЕсли;
	
	// BSLLS:QueryParseError-off
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	АвтоматическиеСценарии.АвтоматическийСценарий КАК АвтоматическийСценарий,
		|	АвтоматическиеСценарии.ОснованиеID КАК ОснованиеID,
		|	АвтоматическиеСценарии.ID КАК ID,
		|	АвтоматическиеСценарии.ДатаВремяЗапуска КАК ДатаВремяЗапуска,
		|	АвтоматическиеСценарии.ДатаВремяЗавершения КАК ДатаВремяЗавершения,
		|	АвтоматическиеСценарии.Завершен КАК Завершен,
		|	АвтоматическиеСценарии.Комментарий КАК Комментарий,
		|	АвтоматическиеСценарии.ДополнительныеПараметры КАК ДополнительныеПараметры
		|ИЗ
		|	РегистрСведений." + ИмяОбъекта() + " КАК АвтоматическиеСценарии
		|ГДЕ
		|	ИСТИНА И #УсловиеОтбора
		|УПОРЯДОЧИТЬ ПО
		|	АвтоматическиеСценарии.АвтоматическийСценарий.Приоритет ВОЗР	
		|";
	// BSLLS:QueryParseError-on
	
	МодульКода("АвтоматическиеСценарииСервер")
		.ЗапросОтбора_ПрименитьСтруктуруОтбора(Запрос, СтруктураОтбора, "АвтоматическиеСценарии", "#УсловиеОтбора");
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

// Поиск данных запущенного автоматического сценария по идентификатору
//
// Параметры:
//	Идентификатор - Строка - идентификатор запущенного автоматического сценария
//	
// Возвращаемое значение:
//	Структура - см. СтруктураДанных()
//
Функция НайтиПоИдентификатору(Идентификатор) Экспорт
	Перем Результат;
	
	// BSLLS:QueryParseError-off
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	АвтоматическиеСценарии.ОснованиеID КАК ОснованиеID,
		|	АвтоматическиеСценарии.АвтоматическийСценарий КАК АвтоматическийСценарий,
		|	АвтоматическиеСценарии.Завершен КАК Завершен,
		|	АвтоматическиеСценарии.Комментарий КАК Комментарий,
		|	АвтоматическиеСценарии.ДатаВремя КАК ДатаВремя,
		|	АвтоматическиеСценарии.ДополнительныеПараметры КАК ДополнительныеПараметры
		|ИЗ
		|	РегистрСведений." + ИмяОбъекта() + " КАК АвтоматическиеСценарии
		|ГДЕ
		|	АвтоматическиеСценарии.ID = &Идентификатор	
		|";
	// BSLLS:QueryParseError-on
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = СтруктураДанных();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		Результат.ID = Идентификатор;
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получение основания запуска автоматического сценария
//
// Параметры:
//	АвтоматическийСценарий - СправочникСсылка.АвтоматическиеСценарии - элемент справочника
//	ID - Строка - идентификатор запущенного автоматического сценария
//
// Возвращаемое значение:
//	Произвольно - какая-то ссылка на какой-то объект
//
Функция Основание(АвтоматическийСценарий, ID) Экспорт
	СтруктураОтбора = Новый Структура("АвтоматическийСценарий,ID", АвтоматическийСценарий, ID);
	НайденныеАС = НайтиПоОтбору(СтруктураОтбора);
	Если НайденныеАС.Количество() Тогда
		АС = НайденныеАС[0];
		Возврат АС.ДополнительныеПараметры.Получить().Основание;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураДанных() 
	Результат = Новый Структура;
	Результат.Вставить("АвтоматическийСценарий");
	Результат.Вставить("ОснованиеID");
	Результат.Вставить("ID");
	Результат.Вставить("ДатаВремяЗапуска");
	Результат.Вставить("ДатаВремяЗавершения");
	Результат.Вставить("Завершен");
	Результат.Вставить("Комментарий");
	Результат.Вставить("ДополнительныеПараметры");
	
	Возврат Результат;
КонецФункции

Функция СтруктураДополнительныхПараметров()
	ДополнительныеПараметры = Новый Структура("Основание");
	Возврат ДополнительныеПараметры;
КонецФункции

#КонецОбласти

#Область include_etrn_base_Modules_АвтоматическиеСценарии_InformationRegister_АвтоматическиеСценарии_ИмяОбъекта
#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти