
Процедура SabyФормированиеПечатнойФормы_Загрузить(РезультатФункции, ПараметрыЗагрузкиФайловSaby)
	АдресФайла = ПараметрыЗагрузкиФайловSaby["СсылкаНаPDF"];
	РезультатЗагрузкиSaby = МодульКода("ESD_ТНЗагрузкаСервер")
		.АдресДвоичныхДанныхПечатнойФормы(ПараметрыЗагрузкиФайловSaby, АдресФайла);
		
	ТекстОшибки = "Не удалось получить печатную форму из Saby.";
	Если РезультатЗагрузкиSaby.Ошибка Тогда
		РезультатФункции.ОписаниеОшибки = ТекстОшибки + "
			|" + РезультатЗагрузкиSaby.Данные;
	ИначеЕсли Не ЗначениеЗаполнено(РезультатЗагрузкиSaby.Данные) Тогда
		РезультатФункции.ОписаниеОшибки = ТекстОшибки;
	Иначе
		РезультатФункции.АдресДвоичныхДанных = РезультатЗагрузкиSaby.Данные;
	КонецЕсли;	
КонецПроцедуры

Процедура SabyФормированиеПечатнойФормы_ЗаполнитьДополнительныеПараметрыЗагрузки(ПараметрыПечати)
	// Если параметр не был передан, то попробуем определить его вручную
	Если Не ПараметрыПечати.Свойство("УстановитьПечатнуюФорму") Тогда
		МодульДокумента = МодульКода("Документы." + ПараметрыПечати.ИмяМетаданных);
		ТекущаяПечатнаяФорма = МодульДокумента.ТекущаяПечатнаяФорма();
		Если Не ЗначениеЗаполнено(ТекущаяПечатнаяФорма) Тогда
			// Прервем выполнение, если "текущая печатная форма" не выбрана или соответствует форме "по умолчанию" 
			Возврат;		
		КонецЕсли;
		
		ПараметрыПечати.Вставить("УстановитьПечатнуюФорму", ТекущаяПечатнаяФорма);
	КонецЕсли;
	
    SabyФормированиеПечатнойФормы_ЗаписатьПечатнуюФорму(ПараметрыПечати.СсылкаНаДокумент, 
		ПараметрыПечати.УстановитьПечатнуюФорму);		
КонецПроцедуры

Процедура SabyФормированиеПечатнойФормы_ОбработатьПараметрыЗагрузкиФайлов(ПараметрыЗагрузкиФайловSaby, ПараметрыЗагрузки)
	// Если не была выполнена выгрузка/актуализация данных на онлайн, но все же надо обновить печатку
	Если Не ПараметрыЗагрузкиФайловSaby.ТребуетсяОбновление И 
		ПараметрыЗагрузки.Свойство("УстановитьПечатнуюФорму") 
	Тогда
		МодульКода("ESD_ТНЗагрузкаСервер").SabyОбновитьСсылкуНаПечатнуюФорму(ПараметрыЗагрузкиФайловSaby);
	КонецЕсли;	
КонецПроцедуры

Процедура SabyФормированиеПечатнойФормы_ЗаписатьПечатнуюФорму(СсылкаНаДокумент, ПечатнаяФорма) Экспорт
	// Определим идентификатор доп. поля "печатной формы"
	ИдентификаторДопПоля = "VisualForm";
	
	// Удалим предыдущее значение, если осталось
	РегистрыСведений.ESD_ЗначенияДополнительныхПолей.УдалитьПоИдентификатору(СсылкаНаДокумент,
		Перечисления.ESD_Направление.Исходящий,
		ИдентификаторДопПоля);
	
	// Сохраним выбранную печатную форму в РС "Значения дополнительных полей"
	СтруктураОбъекта_ = РегистрыСведений.ESD_ЗначенияДополнительныхПолей.СтруктураОбъекта();
	СтруктураОбъекта_.Идентификатор = ИдентификаторДопПоля;
	СтруктураОбъекта_.Направление = Перечисления.ESD_Направление.Исходящий;
	СтруктураОбъекта_.Значение = ПечатнаяФорма;
	СтруктураОбъекта_.Служебное = Истина;
	СтруктураОбъекта_.Владелец = СсылкаНаДокумент;
	РегистрыСведений.ESD_ЗначенияДополнительныхПолей.ЗаписатьЗначение(СтруктураОбъекта_);	
КонецПроцедуры

