
// Получает данные печатной формы документа с онлайна.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры загрузки печатной формы из Saby
//
// Возвращаемое значение:
//   Структура - Результат загрузки данных из Saby (см. ОбщийРезультатЗагрузкиДанныхSaby())
//
Функция SabyДанныеПечатнойФормы(ПараметрыЗагрузки) Экспорт
	SabyОбработатьПараметрыЗагрузкиДанных(ПараметрыЗагрузки);
	
	РезультатФункции = SabyОбщийРезультатЗагрузкиДанных(ПараметрыЗагрузки.СсылкаНаДокумент);
	РезультатФункции.Вставить("АдресДвоичныхДанных", Неопределено);
	
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.СсылкаНаДокумент) Тогда
		РезультатФункции.ОписаниеОшибки = "Документ еще ни разу не сохранен. Печатная форма недоступна.";
		Возврат РезультатФункции;
	КонецЕсли;
	
	SabyФормированиеПечатнойФормы_ЗаполнитьДополнительныеПараметрыЗагрузки(ПараметрыЗагрузки);
	
	МодульESD_ЗагрузкаСервер = МодульКода("ESD_ТНЗагрузкаСервер"); 
	ПараметрыЗагрузкиФайловSaby = МодульESD_ЗагрузкаСервер.SabyСформироватьПараметрыЗагрузкиФайлов(
		ПараметрыЗагрузки, , Истина);
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузкиФайловSaby.ИдентификаторСБИС) Тогда
		РезультатФункции.ОписаниеОшибки = "Документ не выгружен в SABY. Печатная форма недоступна.";
		РезультатФункции.СписокДокументов = ПараметрыЗагрузкиФайловSaby.СписокДокументов;
		РезультатФункции.ОшибкиОбщие      = ПараметрыЗагрузкиФайловSaby.ОшибкиОбщие;
		Возврат РезультатФункции;
	КонецЕсли;
	
	SabyФормированиеПечатнойФормы_ОбработатьПараметрыЗагрузкиФайлов(ПараметрыЗагрузкиФайловSaby, ПараметрыЗагрузки);
	
	SabyФормированиеПечатнойФормы_Загрузить(РезультатФункции, ПараметрыЗагрузкиФайловSaby);
	Возврат РезультатФункции;
КонецФункции

