#Область ПрограммныйИнтерфейс

// Загрузка предопределенных рег. заданий в систему
//
// Параметры:
//	Обновить - Булево - признак необходимости обновить/актуализировать данные рег. задания
//
//DynamicDirective
Процедура ЗагрузитьРегламентныеЗадания(Обновить = Ложь) Экспорт
	Для Каждого ПараметрыРегЗадания Из ПредопределенныеРегламентныеЗадания(Истина) Цикл
		ЗагрузитьРегламентноеЗадание(ПараметрыРегЗадания.Значение, Обновить);	
	КонецЦикла;
КонецПроцедуры

// Поиск регламентного задания по ключу
//
// Параметры:
//	Ключ - Строка - ключ регламентного задания
//
// Возвращаемое значение:
//	РегламентноеЗадание - объект регламентного задания
//
//DynamicDirective
Функция НайтиРегламентноеЗаданиеПоКлючу(Ключ) Экспорт
	Задание = Неопределено;
	
	Отбор = Новый Структура("Ключ", Ключ);
	НайденныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	
	Если НайденныеЗадания.Количество() Тогда
		Задание = НайденныеЗадания[0];
	КонецЕсли;
	
	Возврат Задание;
КонецФункции

// Поиск регламентного задания по идентификатору
//
// Параметры:
//	Идентификатор - Строка - идентификатор регламентного задания
//
// Возвращаемое значение:
//	РегламентноеЗадание - объект регламентного задания
//
//DynamicDirective
Функция НайтиРегламентноеЗаданиеПоИдентификатору(Знач Идентификатор) Экспорт
	Если ТипЗнч(Идентификатор) = Тип("Строка") Тогда
		Идентификатор = Новый УникальныйИдентификатор(Идентификатор);
	Иначе
		Если ТипЗнч(Идентификатор) <> Тип("УникальныйИдентификатор") Тогда
			ВызватьИсключение "Передан недействительный идентификатор регламентного задания";
		КонецЕсли;
	КонецЕсли;
	
	Возврат РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Создание рег. задания по параметрам
//
// Параметры:
//	ПараметрыЗадания - Структура - структура параметров регламентного задания
//
// Возвращаемое значение:
//	РегламентноеЗадание - объект регламентного задания
//
//DynamicDirective
Функция СоздатьРегламентноеЗадание(ПараметрыЗадания) Экспорт
	МетаданныеЗадания = ПараметрыЗадания.Метаданные;
	Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеЗадания);
	
	Если ПараметрыЗадания.Свойство("Наименование") Тогда
		Задание.Наименование = ПараметрыЗадания.Наименование;
	Иначе
		Задание.Наименование = МетаданныеЗадания.Наименование;
	КонецЕсли;
	
	Если ПараметрыЗадания.Свойство("Использование") Тогда
		Задание.Использование = ПараметрыЗадания.Использование;
	Иначе
		Задание.Использование = МетаданныеЗадания.Использование;
	КонецЕсли;
	
	Если ПараметрыЗадания.Свойство("Ключ") Тогда
		Задание.Ключ = ПараметрыЗадания.Ключ;
	Иначе
		Задание.Ключ = МетаданныеЗадания.Ключ;
	КонецЕсли;
	
	Если ПараметрыЗадания.Свойство("ИмяПользователя") Тогда
		Задание.ИмяПользователя = ПараметрыЗадания.ИмяПользователя;
	КонецЕсли;
	
	Если ПараметрыЗадания.Свойство("ИнтервалПовтораПриАварийномЗавершении") Тогда
		Задание.ИнтервалПовтораПриАварийномЗавершении = ПараметрыЗадания.ИнтервалПовтораПриАварийномЗавершении;
	Иначе
		Задание.ИнтервалПовтораПриАварийномЗавершении = МетаданныеЗадания.ИнтервалПовтораПриАварийномЗавершении;
	КонецЕсли;
	
	Если ПараметрыЗадания.Свойство("КоличествоПовторовПриАварийномЗавершении") Тогда
		Задание.КоличествоПовторовПриАварийномЗавершении = ПараметрыЗадания.КоличествоПовторовПриАварийномЗавершении;
	Иначе
		Задание.КоличествоПовторовПриАварийномЗавершении = МетаданныеЗадания.КоличествоПовторовПриАварийномЗавершении;
	КонецЕсли;
	
	Если ПараметрыЗадания.Свойство("Параметры") Тогда
		Задание.Параметры = ПараметрыЗадания.Параметры;
	КонецЕсли;
	
	Если ПараметрыЗадания.Свойство("Расписание") Тогда
		Задание.Расписание = ПараметрыЗадания.Расписание;
	КонецЕсли;
	
	Задание.Записать();
	
	Возврат Задание;	
КонецФункции

// Выполнить рег. задание вручную
//
// Параметры:
//	Идентификатор - Строка - идентификатор рег. задания
//
// Возвращаемое значение:
//	Структура - параметры выполнения рег. задания
//
//DynamicDirective
Функция ВыполнитьРегламентноеЗаданиеВручную(Знач Идентификатор) Экспорт
	
	РезультатФункции = ВыполнитьРегламентноеЗаданиеВручнуюБСП(Идентификатор);
	Если РезультатФункции <> Неопределено Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ЗапускВыполнен",               Ложь);
	РезультатФункции.Вставить("ПроцедураУжеВыполняется",      Ложь);
	РезультатФункции.Вставить("МоментЗапуска",                Дата(1, 1, 1));
	РезультатФункции.Вставить("ИдентификаторФоновогоЗадания", Неопределено);
	РезультатФункции.Вставить("ПредставлениеФоновогоЗадания", "");
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Идентификатор));
	Если РегламентноеЗадание <> Неопределено Тогда
		РезультатФункции.ПроцедураУжеВыполняется = РегламентноеЗадание.ПоследнееЗадание <> Неопределено
			И РегламентноеЗадание.ПоследнееЗадание.Состояние = СостояниеФоновогоЗадания.Активно;
		Если Не РезультатФункции.ПроцедураУжеВыполняется Тогда
			ФоновоеЗадание = ФоновыеЗадания.Выполнить(
				РегламентноеЗадание.Метаданные.ИмяМетода,
				РегламентноеЗадание.Параметры,
				РегламентноеЗадание.Ключ,
				РегламентноеЗадание.Наименование);
				
			РезультатФункции.ИдентификаторФоновогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;
			РезультатФункции.ПредставлениеФоновогоЗадания = ФоновоеЗадание.Наименование;
			РезультатФункции.ЗапускВыполнен               = Истина;
			РезультатФункции.МоментЗапуска                = ФоновоеЗадание.Начало;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Возвращает расписание рег. задания
//
// Параметры:
//	РегламентноеЗадание - РегламентноеЗадание, УникальныйИдентификатор, Строка - идентификатор рег. задания
//
// Возвращаемое значение:
//	РасписаниеРегламентногоЗадания - расписание рег. задания
//
//DynamicDirective
Функция РасписаниеРегламентногоЗадания(Знач РегламентноеЗадание) Экспорт
	Перем Расписание;
	
	Если ТипЗнч(РегламентноеЗадание) <> Тип("РегламентноеЗадание") Тогда
		РегламентноеЗадание = НайтиРегламентноеЗаданиеПоИдентификатору(РегламентноеЗадание);
	КонецЕсли;
	
	Если РегламентноеЗадание <> Неопределено Тогда
		Расписание = РегламентноеЗадание.Расписание;
	КонецЕсли;
	
	Возврат Расписание;
КонецФункции

// Выполняет изменение параметров рег. задания и возвращает "статус"
//
// Параметры:
//	РегламентноеЗадание - РегламентноеЗадание, УникальныйИдентификатор, Строка - идентификатор рег. задания
//	Параметры - Структура - новые значения параметров рег. задания
//
// Возвращаемое значение:
//	Булево - статус изменения рег. задания
//
//DynamicDirective
Функция ИзменитьРегламентноеЗадание(Знач РегламентноеЗадание, Параметры) Экспорт
	Если ТипЗнч(РегламентноеЗадание) <> Тип("РегламентноеЗадание") Тогда
		РегламентноеЗадание = МодульКода("ESD_РегламентныеЗаданияСлужебный").НайтиРегламентноеЗаданиеПоИдентификатору(РегламентноеЗадание);
		Если РегламентноеЗадание = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
		
	ТребуетсяЗапись = Ложь;
	Для Каждого КлючЗначение Из Параметры Цикл
		Если РегламентноеЗадание[КлючЗначение.Ключ] = КлючЗначение.Значение Тогда
			Продолжить;
		КонецЕсли;
		
		РегламентноеЗадание[КлючЗначение.Ключ] = КлючЗначение.Значение;
		ТребуетсяЗапись = Истина;
	КонецЦикла;
	
	Если ТребуетсяЗапись Тогда
		РегламентноеЗадание.Записать();
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

#Область include_etrn_base_CommonModule_РегламентныеЗаданияСлужебный_ФункционалПредопределенныхРегламентныхЗаданий
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область include_etrn_base_CommonModule_РегламентныеЗаданияСлужебный_ПредопределенныеРегламентныеЗадания
#КонецОбласти

// Выполнить рег. задание вручную, используя функционал БСП
//
// Параметры:
//	Идентификатор - Строка - идентификатор рег. задания
//
// Возвращаемое значение:
//	Структура - параметры выполнения рег. задания
//
//DynamicDirective
Функция ВыполнитьРегламентноеЗаданиеВручнуюБСП(Знач Идентификатор)
	Результат = Неопределено;
	
	// Ручной запуск рег. заданий из БСП выполняется через функционал общего модуля "РегламентныеЗаданияСлужебный"
	Если Метаданные.ОбщиеМодули.Найти("РегламентныеЗаданияСлужебный") = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		// При прямом обращении может возникнуть "ошибка компиляции", когда модуль отсутствует
		ОбщийМодуль = Вычислить("РегламентныеЗаданияСлужебный");
		Результат = ОбщийМодуль.ВыполнитьРегламентноеЗаданиеВручную(Идентификатор);	
	Исключение
		Результат = Неопределено;	
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

// Загрузить рег. задание в систему
//
// Параметры:
//	Параметры - Структура - параметры рег. задания
//	Обновить - Булево - признак необходимости обновления/актуализации
//
// Возвращаемое значение:
//	РегламентноеЗадание - найденный/созданный объект рег. задания
//
//DynamicDirective
Функция ЗагрузитьРегламентноеЗадание(Параметры, Обновить = Ложь)
	РегламентноеЗадание = НайтиРегламентноеЗаданиеПоКлючу(Параметры.Ключ);
	
	Если РегламентноеЗадание = Неопределено Тогда
		Свойства = БазовыеСвойстваРегламентногоЗадания();
		// Определяем "Наименование" рег. задания
		Свойства.Вставить("Наименование", Параметры.Наименование);
		// Определяем "Ключ" рег. задания
		Свойства.Вставить("Ключ", Параметры.Ключ);
		
		Если Параметры.Свойство("Расписание") Тогда
			Свойства.Использование = Истина;
			Свойства.Расписание = Параметры.Расписание;
		КонецЕсли;
		
		// Добавляем "Ключ" в параметры рег. задания, так как метод обработки общий
		Свойства.Параметры.Добавить(Параметры.Ключ);
		
		РегламентноеЗадание = СоздатьРегламентноеЗадание(Свойства);
		Возврат РегламентноеЗадание;
	Иначе
		Если Обновить Тогда
			ОбновитьРегламентноеЗадание(РегламентноеЗадание, Параметры);
		КонецЕсли;
		
		Возврат РегламентноеЗадание;
	КонецЕсли;
КонецФункции

// Обновляет изменяемые параметры регламентного задания
//
// Параметры:
//	РегламентноеЗадание - РегламентноеЗадание - рег. задание
//	Параметры - Структура - изменяемые параметры рег. задания
//
//DynamicDirective
Процедура ОбновитьРегламентноеЗадание(РегламентноеЗадание, Параметры)
	ТребуетсяЗапись = Ложь;
	
	Если РегламентноеЗадание.Наименование <> Параметры.Наименование Тогда
		РегламентноеЗадание.Наименование = Параметры.Наименование;
		ТребуетсяЗапись = Истина;
	КонецЕсли;
	
	БазовыеСвойства = БазовыеСвойстваРегламентногоЗадания();
	Если РегламентноеЗадание.Метаданные <> БазовыеСвойства.Метаданные Тогда
		НовоеРегЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(БазовыеСвойства.Метаданные);
		ЗаполнитьЗначенияСвойств(НовоеРегЗадание, РегламентноеЗадание, , "Метаданные");
		УдалитьРегламентноеЗадание(РегламентноеЗадание.УникальныйИдентификатор);
		РегламентноеЗадание = НовоеРегЗадание;
		ТребуетсяЗапись = Истина;
	КонецЕсли;
	
	Если Не ТребуетсяЗапись Тогда
		Возврат;
	КонецЕсли;
	
	РегламентноеЗадание.Записать();
КонецПроцедуры

// Удаление регламентного задания
//
// Параметры:
//	Идентификатор - Строка - идентификатор рег. задания
//
//DynamicDirective
Процедура УдалитьРегламентноеЗадание(Идентификатор)
	РегламентноеЗадание = НайтиРегламентноеЗаданиеПоИдентификатору(Идентификатор);
	Если РегламентноеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегламентноеЗадание.Удалить();
КонецПроцедуры

// Общие параметры описания регламентного задания
//
// Параметры:
//	Имя - Строка - имя рег. задания 
//	Представление - Строка - представление рег. задания 
//	Подсказка - Строка - описание рег. задания в списке на форме настроек ЭПД
//	Служебный - Булево - служебное рег. задание, не отображать в списке настроек ЭПД
//
// Возвращаемое значение:
//	Структура - структура параметров описания регламентного задания
//
//DynamicDirective
Функция ПараметрыОписанияРегламентногоЗадания(Имя, Знач Представление = "", Знач Подсказка = "", Служебный = Ложь)
	Если ПустаяСтрока(Представление) Тогда
		Представление = Имя;
	КонецЕсли;
	Префикс = Префикс();
	
	// Наименование - наименование рег. задания
	// Ключ - ключ рег. задания
	// Метод - вызываемый метод через общий интерфейс запуска "ВыполнитьРегламентноеЗадание"
	// Параметры - коллекция параметров, которая обрабатывается методом
	Результат = Новый Структура;
	Результат.Вставить("Наименование", Префикс + ". " + Представление);
	Результат.Вставить("Ключ", Префикс + "_" + Имя);
	Результат.Вставить("Метод");
	Результат.Вставить("Параметры");
	Результат.Вставить("Подсказка", Подсказка);
	Результат.Вставить("Служебный", Служебный);
	
	Возврат Результат;
КонецФункции 

// Основные свойства регламентного задания
//
// Возвращаемое значение:
//	Структура - структура основных свойств регламентного задания
//
//DynamicDirective
Функция БазовыеСвойстваРегламентногоЗадания()
	Результат = Новый Структура;
	Результат.Вставить("Расписание", Новый РасписаниеРегламентногоЗадания);
	Результат.Вставить("Использование", Ложь);
	Результат.Вставить("Метаданные", МетаданныеРегламентногоЗадания());
	Результат.Вставить("Параметры", Новый Массив);
		
	Возврат Результат;
КонецФункции

#Область include_etrn_base_CommonModule_РегламентныеЗаданияСлужебный_Переопределяемый
#КонецОбласти

#КонецОбласти

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода