
// Возвращает метаданные-основание для создания рег. заданий
//
// Возвращаемое значение:
//	Метаданные.РегламентныеЗадания - метаданные-основание для создания рег. заданий
//
//DynamicDirective
Функция МетаданныеРегламентногоЗадания()
	Возврат Метаданные.РегламентныеЗадания.ESD_ЗапускРегламентныхОпераций;
КонецФункции

// Возвращает префикс, который используется для формирования ключа и наименования рег. задания
//
// Возвращаемое значение:
//	Строка - префикс ключа и наименования рег. задания
//
//DynamicDirective
Функция Префикс()
	Возврат "ESD";
КонецФункции

