
Функция ПредопределенноеРегламентноеЗаданиеВыгрузкаЭПД(ПодробноеОписание = Ложь)
	ПараметрыРегЗадания = ПараметрыОписанияРегламентногоЗадания("Выгрузка ЭПД", , "Выполняет выгрузку документов ЭПД в Saby");
	Возврат ПараметрыРегЗадания;
КонецФункции

Функция ПредопределенноеРегламентноеЗаданиеЗагрузкаЭПД(ПодробноеОписание = Ложь)
	ПараметрыРегЗадания = ПараметрыОписанияРегламентногоЗадания("Загрузка ЭПД", , "Выполняет загрузку документов ЭПД в Saby");
	Возврат ПараметрыРегЗадания;
КонецФункции

Функция ПредопределенноеРегламентноеЗаданиеСтатистикаЭПД(ПодробноеОписание = Ложь)
	ПараметрыРегЗадания = ПараметрыОписанияРегламентногоЗадания("Статистика ЭПД", , "Отправляет статистику работы функционала в Saby", Истина);
	Если Не ПодробноеОписание Тогда
		Возврат ПараметрыРегЗадания;
	КонецЕсли;
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ВремяНачала = Дата(1, 1, 1, 5, 0, 0);
	Расписание.ВремяЗавершения = Дата(1, 1, 1, 7, 0, 0);
	Расписание.ПериодПовтораДней = 1;
	ПараметрыРегЗадания.Вставить("Расписание", Расписание);
	
	Возврат ПараметрыРегЗадания;
КонецФункции

