
// Возвращает соответствие предопределенных рег. заданий, создаваемых программно
//
// Параметры:
//	ПодробноеОписание - Булево - Включать расписание в ответ
//
// Возвращаемое значение:
//	Соответствие - соответствие параметров предопределенных рег. заданий
//
//DynamicDirective
Функция ПредопределенныеРегламентныеЗадания(ПодробноеОписание = Ложь) Экспорт
	Результат = Новый Соответствие;
	
	Результат.Вставить("ВыгрузкаЭПД", ПредопределенноеРегламентноеЗаданиеВыгрузкаЭПД(ПодробноеОписание)); 
	Результат.Вставить("ЗагрузкаЭПД", ПредопределенноеРегламентноеЗаданиеЗагрузкаЭПД(ПодробноеОписание));
    Результат.Вставить("СтатистикаЭПД", ПредопределенноеРегламентноеЗаданиеСтатистикаЭПД(ПодробноеОписание));
	
	Возврат Результат;
КонецФункции

Функция ПредопределенноеРегламентноеЗаданиеВыгрузкаЭПД(ПодробноеОписание = Ложь) Экспорт
	ПараметрыРегЗадания = ПараметрыОписанияРегламентногоЗадания("Выгрузка ЭПД");
	Возврат ПараметрыРегЗадания;
КонецФункции

Функция ПредопределенноеРегламентноеЗаданиеЗагрузкаЭПД(ПодробноеОписание = Ложь) Экспорт
	ПараметрыРегЗадания = ПараметрыОписанияРегламентногоЗадания("Загрузка ЭПД");
	Возврат ПараметрыРегЗадания;
КонецФункции

Функция ПредопределенноеРегламентноеЗаданиеСтатистикаЭПД(ПодробноеОписание = Ложь) Экспорт
	ПараметрыРегЗадания = ПараметрыОписанияРегламентногоЗадания("Статистика ЭПД");
	Если Не ПодробноеОписание Тогда
		Возврат ПараметрыРегЗадания;
	КонецЕсли;
	ЧасыВремяНачало = 5;
	ЧасыВремяОкончание = 7;
	Расписание = РасписаниеРегЗаданияЕжедневно(Дата(1, 1, 1, ЧасыВремяНачало, 0, 0), Дата(1, 1, 1, ЧасыВремяОкончание, 0, 0));
	ПараметрыРегЗадания.Вставить("Расписание", Расписание);
	Возврат ПараметрыРегЗадания;
КонецФункции

// Общий метод запуска регламентного задания по ключу
//
// Параметры:
//   Ключ - Строка - ключ регламентного задания
//
//DynamicDirective
Процедура ВыполнитьРегламентноеЗадание(Ключ) Экспорт
	ПредопределенныеРегламентныеЗадания = ПредопределенныеРегламентныеЗадания();
	
	Если Ключ = ПредопределенныеРегламентныеЗадания["ВыгрузкаЭПД"].Ключ Тогда
		МодульКода("ESD_ТНВыгрузкаСервер").ВыгрузитьДокументыЭПДПоРегламентномуЗаданию();
	ИначеЕсли Ключ = ПредопределенныеРегламентныеЗадания["ЗагрузкаЭПД"].Ключ Тогда
		МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьДокументыЭПДПоРегламентномуЗаданию();
	ИначеЕсли Ключ = ПредопределенныеРегламентныеЗадания["СтатистикаЭПД"].Ключ Тогда
		МодульКода("ESD_ТНВыгрузкаСервер").ОтправитьСтатистикуПоРегламентномуЗаданию();	
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры 

