
// Установка пользователя запуска регламентного задания
//
Процедура СлужебныеРегламентныеЗадания_УстановитьТекущегоПользователя() Экспорт
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	ПараметрыИзменения = Новый Структура("ИмяПользователя", ИмяПользователя);
	
	Для Каждого ОписаниеРегЗадания Из ПредопределенныеРегламентныеЗадания() Цикл
		ПараметрыРегЗадания = ОписаниеРегЗадания.Значение;
		Если Не ПараметрыРегЗадания.Служебный Тогда
			Продолжить;
		КонецЕсли;
		
		РегЗадание = НайтиРегламентноеЗаданиеПоКлючу(ПараметрыРегЗадания.Ключ);
		Если РегЗадание = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИзменитьРегламентноеЗадание(РегЗадание, ПараметрыИзменения);
	КонецЦикла;
КонецПроцедуры

// Возвращает соответствие предопределенных рег. заданий, создаваемых программно
//
// Параметры:
//	ПодробноеОписание - Булево - Включать расписание в ответ
//
// Возвращаемое значение:
//	Соответствие - соответствие параметров предопределенных рег. заданий
//
//DynamicDirective
Функция ПредопределенныеРегламентныеЗадания(ПодробноеОписание = Ложь) Экспорт
	Результат = Новый Соответствие;
	
	Результат.Вставить("ВыгрузкаЭПД", ПредопределенноеРегламентноеЗаданиеВыгрузкаЭПД(ПодробноеОписание)); 
	Результат.Вставить("ЗагрузкаЭПД", ПредопределенноеРегламентноеЗаданиеЗагрузкаЭПД(ПодробноеОписание));
    Результат.Вставить("СтатистикаЭПД", ПредопределенноеРегламентноеЗаданиеСтатистикаЭПД(ПодробноеОписание));
	
	Возврат Результат;
КонецФункции

// Общий метод запуска регламентного задания по ключу
//
// Параметры:
//   Ключ - Строка - ключ регламентного задания
//
//DynamicDirective
Процедура ВыполнитьРегламентноеЗадание(Ключ) Экспорт
	ПредопределенныеРегламентныеЗадания = ПредопределенныеРегламентныеЗадания();
	
	Если Ключ = ПредопределенныеРегламентныеЗадания["ВыгрузкаЭПД"].Ключ Тогда
		ESD_ТНВыгрузкаСервер.ВыгрузитьДокументыЭПДПоРегламентномуЗаданию();
	ИначеЕсли Ключ = ПредопределенныеРегламентныеЗадания["ЗагрузкаЭПД"].Ключ Тогда
		ESD_ТНЗагрузкаСервер.ЗагрузитьДокументыЭПДПоРегламентномуЗаданию();
	ИначеЕсли Ключ = ПредопределенныеРегламентныеЗадания["СтатистикаЭПД"].Ключ Тогда
		ESD_ТНВыгрузкаСервер.ОтправитьСтатистикуПоРегламентномуЗаданию();	
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры 

