#Область ПрограмнныйИнтерфейс

// Запуск автоматических сценариев по отрабатываемому событию объекта
//
// Параметры:
//  ОснованиеСсылка - ДокументСсылка, СправочникСсылка - основание запуска автоматического сценария
//  Событие - Перечисления.АвтоматическиеСценарииСобытия - отрабатываемое событие
//
Процедура ЗапуститьАвтоматическиеСценарии(ОснованиеСсылка, Событие) Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	СтруктураОтбора = Новый Структура("Активно", Истина);
	СтруктураОтбора.Вставить("ОснованиеМетаданные", ОснованиеСсылка.Метаданные().ПолноеИмя());
	СтруктураОтбора.Вставить("Событие", Событие);
	
	АвтоматическиеСценарии = МодульКода("Справочники.АвтоматическиеСценарии").НайтиПоОтбору(СтруктураОтбора);
	Если Не ЗначениеЗаполнено(АвтоматическиеСценарии) Тогда
		Возврат;
	КонецЕсли;
	
	СинхронныеАС = Новый Массив;
	Для Каждого АвтоматическийСценарий Из АвтоматическиеСценарии Цикл
		Объект = АвтоматическийСценарий.Ссылка.ПолучитьОбъект();
		Объект.Основание = ОснованиеСсылка;
		
		Попытка
			// Запустим на выполнение автоматический сценарий
			ИдентификаторАС = Объект.Запустить();
			Если ИдентификаторАС = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Зарегистрируем первые действия на выполнение
			ПослеВыполненияДействия(АвтоматическийСценарий.Ссылка, ИдентификаторАС);
			// Проверим вариант выполнения
			Если Объект.ВариантВыполнения = МодульКода("Перечисления.АвтоматическиеСценарииВариантыВыполнения").Синхронно Тогда
				// Добавим "синхронные" запущенные АС в отдельный список
				СинхронныеАС.Добавить(Новый Структура("АвтоматическийСценарий, ID", 
					АвтоматическийСценарий.Ссылка, 
					ИдентификаторАС));
			КонецЕсли;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			МодульКода("АвтоматическиеСценарииСерверСлужебный")
				.ЗаписатьВЖурналРегистрации(Объект, "Запуск", , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;
	КонецЦикла;
	
	// Отдельно обработаем сихнонные автоматические сценарии
	ВыполнитьДействияЗапущенных(СинхронныеАС);
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Выбор и выполнение активных действий автоматических сценариев (со статусом "Создано")
// Процедура используется для обработки выполнения общего и собственных регламентных заданий
//
// Параметры:
//	АвтоматическиеСценарии - Массив - список автоматических сценариев, по которым необходимо отобрать действия.
//
Процедура ВыполнитьДействияЧерезРегламентноеЗадание(Знач АвтоматическиеСценарии = Неопределено) Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	СоответствиеОтбора = Новый Соответствие;
	
	Если АвтоматическиеСценарии = Неопределено Тогда
		// Для всех автоматических сценариев, выполняемыми общим рег. заданием 
		СоответствиеОтбора.Вставить("АвтоматическийСценарий.ВариантВыполнения", 
			МодульКода("Перечисления.АвтоматическиеСценарииВариантыВыполнения").ОбщееРегламентноеЗадание);
	Иначе
		// Укажем переданные автоматические сценарии параметром отбора		
		СоответствиеОтбора.Вставить("АвтоматическийСценарий", АвтоматическиеСценарии);
	КонецЕсли;
	СоответствиеОтбора.Вставить("Завершен", Ложь);
	
	Попытка
		ЗапущенныеАвтоматическиеСценарии = МодульКода("РегистрыСведений.АвтоматическиеСценарии")
			.НайтиПоОтбору(СоответствиеОтбора);
	Исключение
		Возврат;
	КонецПопытки;
	
	ВыполнитьДействияЗапущенных(ЗапущенныеАвтоматическиеСценарии);
КонецПроцедуры

// Выполнение действий запущенных автоматических сценариев
//
// Параметры:
//	ЗапущенныеАвтоматическиеСценарии - Массив, ТаблицаЗначений - список данных запущенных автоматических сценариев
//
Процедура ВыполнитьДействияЗапущенных(ЗапущенныеАвтоматическиеСценарии = Неопределено) Экспорт
	Для Каждого ДанныеЗапущенногоАС Из ЗапущенныеАвтоматическиеСценарии Цикл
		ВыполнитьДействияЗапущенного(ДанныеЗапущенногоАС);				
	КонецЦикла;
КонецПроцедуры

// Выполнение действий запущенного автоматического сценария
//
// Параметры:
//	ЗапущенныйАвтоматическийСценарий - Структура - данные запущенного автоматического сценария
//
Процедура ВыполнитьДействияЗапущенного(ЗапущенныйАвтоматическийСценарий) Экспорт
	// Найдем активные действия переданных/найденных автоматических сценариев
	АктивныеДействия = МодульКода("РегистрыСведений.АвтоматическиеСценарииЖурнал").АктивныеДействия(
		ЗапущенныйАвтоматическийСценарий.АвтоматическийСценарий,
		ЗапущенныйАвтоматическийСценарий.ID);
		
	АвтоматическийСценарийЗавершен = Ложь;
	Для Каждого ДанныеДействия Из АктивныеДействия Цикл
		АвтоматическийСценарийОбъект = ДанныеДействия.АвтоматическийСценарий.ПолучитьОбъект();
		// Выполним действие
		АвтоматическийСценарийОбъект.ВыполнитьДействие(ДанныеДействия.ID, ДанныеДействия.Действие);
		// Получим результат постобработки выполнения действия
		Результат = ПослеВыполненияДействия(ДанныеДействия.ID, ДанныеДействия.Действие);
		
		АвтоматическийСценарийЗавершен = Результат.Завершен;
		
		// Прерываем выполнение других действий, если АС завершен
		Если Результат.Завершен Тогда
			Прервать;	
		КонецЕсли;	
	КонецЦикла;
	
	Если АвтоматическийСценарийЗавершен Тогда
		Завершить(ЗапущенныйАвтоматическийСценарий.АвтоматическийСценарий, ЗапущенныйАвтоматическийСценарий.ID);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обработка после выполнения действия
//
// Параметры:
//	АвтоматическийСценарий - СправочникСсылка.АвтоматическиеСценарии - элемент настроек автоматического сценария
//	ID - Строка - идентификатор запущенного автоматического сценария
//	Действие - СправочникСсылка.АвтоматическиеСценарииДействия - завершенное действие автоматического сценария
//
Процедура ЗарегистрироватьНовоеДействие(АвтоматическийСценарий, ID, Действие) Экспорт
	МодульКода("РегистрыСведений.АвтоматическиеСценарииЖурнал").ДобавитьНовыйСтатус(АвтоматическийСценарий, ID, Действие);
КонецПроцедуры

// Обработка после выполнения действия
//
// Параметры:
//	АвтоматическийСценарий - СправочникСсылка.АвтоматическиеСценарии - элемент настроек автоматического сценария
//	ID - Строка - идентификатор запущенного автоматического сценария
//	ЗавершенноеДействие - СправочникСсылка.АвтоматическиеСценарииДействия - завершенное действие автоматического сценария
//
// Возвращаемое значение:
//	Структура - коллекция параметров результата обработки выполнения
//
Функция ПослеВыполненияДействия(АвтоматическийСценарий, ID, ЗавершенноеДействие = Неопределено) Экспорт
	Результат = Новый Структура("Завершен", Ложь);
	
	СледующиеДействия = МодульКода("Справочники.АвтоматическиеСценарии")
		.СледующиеДействия(АвтоматическийСценарий, ЗавершенноеДействие);
	
	Если Не СледующиеДействия.Количество() Тогда
		Если Не НевыполненныеДействия(ID).Количество() Тогда
			Результат.Завершен = Истина;	
		КонецЕсли;
	Иначе
		Для Каждого ДанныеДействия Из СледующиеДействия Цикл
			ЗарегистрироватьНовоеДействие(АвтоматическийСценарий, ID, ДанныеДействия.Действие);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Завершение выполнения автоматического сценария
//
// Параметры:
//	АвтоматическийСценарий - СправочникСсылка.АвтоматическиеСценарии - элемент настроек автоматического сценария
//	ID - Строка - уникальный идентификатор запущенного автоматического сценария
//
Процедура Завершить(АвтоматическийСценарий, ID) Экспорт
	МодульКода("РегистрыСведений.АвтоматическиеСценарии").Завершить(АвтоматическийСценарий, ID);
КонецПроцедуры

// Получение списка всех невыполненных действий запущенного автоматического сценария
//
// Параметры:
//	ID - Строка - идентификатор запущенного автоматического сценария
// 
// Возвращаемое значение:
//	ТаблицаЗначений - список невыполненных действий
//
Функция НевыполненныеДействия(ID) Экспорт
	Запрос = Новый Запрос;
	// BSLLS:QueryParseError-off
	Запрос.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		| 	АвтоматическиеСценарии.АвтоматическийСценарий КАК АвтоматическийСценарий,
		|	АвтоматическиеСценарии.ID КАК ID
		|ПОМЕСТИТЬ ДанныеАвтоматическогоСценария
		|ИЗ
		|	РегистрСведений." + МодульКода("РегистрыСведений.АвтоматическиеСценарии").ИмяОбъекта() + " КАК АвтоматическиеСценарии
		|ГДЕ
		|	АвтоматическиеСценарии.ID = &ID
		|;////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЖурналВыполненияАвтоматическихСценариев.АвтоматическийСценарий КАК АвтоматическийСценарий,
		|	ЖурналВыполненияАвтоматическихСценариев.Действие КАК Действие,
		|	ЖурналВыполненияАвтоматическихСценариев.Статус КАК Статус
		|ПОМЕСТИТЬ ЖурналВыполненияАвтоматическихСценариев
		|ИЗ
		|	РегистрСведений." + МодульКода("РегистрыСведений.АвтоматическиеСценарииЖурнал").ИмяОбъекта() + ".СрезПоследних(,
		|   	(АвтоматическийСценарий, ID) В (ВЫБРАТЬ АвтоматическийСценарий, ID ИЗ ДанныеАвтоматическогоСценария) 
		|	) КАК ЖурналВыполненияАвтоматическихСценариев
		|;////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДействияАвтоматическихСценариев.Ссылка КАК АвтоматическийСценарий,
		|	ДействияАвтоматическихСценариев.Действие КАК Действие
		|ПОМЕСТИТЬ ВсеДействия
		|ИЗ
		|	ДанныеАвтоматическогоСценария КАК ДанныеАвтоматическогоСценария
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник." + МодульКода("Справочники.АвтоматическиеСценарии").ИмяОбъекта() + ".Действия КАК ДействияАвтоматическихСценариев
		|		ПО ДанныеАвтоматическогоСценария.АвтоматическийСценарий = ДействияАвтоматическихСценариев.Ссылка
		|;////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеДействия.Действие КАК Действие,
		|	(ЖурналВыполненияАвтоматическихСценариев.Статус = &СтатусСоздано) КАК НаВыполнении	
		|ИЗ
		|	ВсеДействия КАК ВсеДействия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЖурналВыполненияАвтоматическихСценариев КАК ЖурналВыполненияАвтоматическихСценариев
		|		ПО ВсеДействия.АвтоматическийСценарий = ЖурналВыполненияАвтоматическихСценариев.АвтоматическийСценарий
		|			И ВсеДействия.Действие = ЖурналВыполненияАвтоматическихСценариев.Действие
		|ГДЕ
		|	(ЖурналВыполненияАвтоматическихСценариев.Действие ЕСТЬ NULL 
		|		ИЛИ ЖурналВыполненияАвтоматическихСценариев.Статус = &СтатусСоздано)		
		|";
	// BSLLS:QueryParseError-on
	Запрос.УстановитьПараметр("ID", ID);
	Запрос.УстановитьПараметр("СтатусСоздано", МодульКода("Перечисления.АвтоматическиеСценарииСтатусыВыполнения").Создано);
	
	Возврат Запрос.Выполнить().Выгрузить(); 
КонецФункции

#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти // includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода

