
Процедура СостояниеОбъектаИнтеграции_ПриЗаписиНового(АктивныйЭтап)
	ПараметрыСтатус = ESD_ТНОбщегоНазначенияСервер.ПараметрыЗаписиРегистраСостояний();		
    ПараметрыСтатус.АктивныйЭтап           = СокрЛП(АктивныйЭтап);
    ПараметрыСтатус.Ссылка                 = Ссылка;
    ПараметрыСтатус.ТипИсточника           = ИмяМетаданных();
    ПараметрыСтатус.ИдентификаторИсточника = Ссылка.УникальныйИдентификатор();
	ESD_ТНОбщегоНазначенияСервер.ОбновитьДанныеСостояния(ПараметрыСтатус);	
КонецПроцедуры

