
#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  Тип - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.Saby_ТипТитулаЭтрН - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция ЗначениеПоКоду(Знач Тип) Экспорт
	
	Если Тип = "Заявка" Тогда
		Значение = Заявка;
	ИначеЕсли Тип = "Заказ" Тогда
		Значение = Заказ;
	Иначе
		Значение = Перечисления.Saby_ТипДокументаЗнП.ПустаяСсылка();
	КонецЕсли;	
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс 