
// Заполнение реквизитов формы из источника
// Параметры: 
//	Форма - ФормаКлиентскогоПриложения - форма для заполнения реквизитов
//  ДанныеЗаполнения - Структура - данные для заполнения реквизитов
//  Исключения - Массив - реквизиты исключения
//  СписокОшибок - Неопределено, Массив - массив, куда будут добавлены ошибки заполнения
//
Процедура ESD_ЗаполнитьРеквизитыФормы(Форма, ДанныеЗаполнения, Исключения = Неопределено, СписокОшибок = Неопределено) Экспорт	
	Если Исключения = Неопределено Тогда
		Исключения = Новый Массив;
	КонецЕсли;
    Если СписокОшибок = Неопределено Тогда
        СписокОшибок = Новый Массив;
    КонецЕсли;	
	
	ТипТаблицаЗначений = Новый ОписаниеТипов("ТаблицаЗначений");	
		
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл 				
		Если Не ДанныеЗаполнения.Свойство(РеквизитФормы.Имя) Тогда
            Продолжить;
        КонецЕсли;

        Если Исключения.Найти(РеквизитФормы.Имя) <> Неопределено Тогда
            Продолжить;
        КонецЕсли;
        
        ЗначениеИсточник = ДанныеЗаполнения[РеквизитФормы.Имя];	
        Если РеквизитФормы.ТипЗначения = ТипТаблицаЗначений Тогда 
            УниверсальноеЗаполнениеФормы_ТаблицаЗначений(Форма, РеквизитФормы, ЗначениеИсточник, СписокОшибок);								
        Иначе
            Форма[РеквизитФормы.Имя] = ЗначениеИсточник;
        КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

