
Процедура УниверсальноеЗаполнениеФормы_ТаблицаЗначений(Форма, РеквизитФормы, ЗначениеИсточник, СписокОшибок)
	// Очистим ТЗ от текущих данных
    Форма[РеквизитФормы.Имя].Очистить();
	
    // Прервем выполнение, если новые значения отсутствуют
	Если Не ЗначениеЗаполнено(ЗначениеИсточник) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеИсточник) = Тип("Массив") Тогда
		Массив = ЗначениеИсточник;
	Иначе
        Попытка
			Массив = ДесериализоватьЗначение(ЗначениеИсточник, Новый Массив, Истина);
		Исключение
			ОписаниеОшибки_ = УниверсальноеЗаполнениеФормы_СтруктураОшибки(
				РеквизитФормы, "Ошибка заполнения таблицы");
			СписокОшибок.Добавить(ОписаниеОшибки_);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
    // Отдельно запоним колонки ТЗ
	УниверсальноеЗаполнениеФормы_КолонкиТаблицыФормы(Форма, РеквизитФормы, Массив);
КонецПроцедуры

Процедура УниверсальноеЗаполнениеФормы_КолонкиТаблицыФормы(Форма, РеквизитФормы, Массив)
	МодульESD_ОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
    Для Каждого Значение Из Массив Цикл 	
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрокаТЗ = Форма[РеквизитФормы.Имя].Добавить();
		
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			ЕстьОдноименныйРеквизит = МодульESD_ОбщегоНазначенияКлиентСервер
               .ЕстьРеквизитИлиСвойство(НоваяСтрокаТЗ, РеквизитФормы.Имя);
			Если ЕстьОдноименныйРеквизит Тогда 
				ИмяКолонки = РеквизитФормы.Имя;
			Иначе 
				ИмяКолонки = Лев(РеквизитФормы.Имя, СтрДлина(РеквизитФормы.Имя) - 1);
			КонецЕсли;
			
			НоваяСтрокаТЗ[ИмяКолонки] = Значение;	
		Иначе	
			// Структура
			Для Каждого КлючЗначение Из Значение Цикл
				НоваяСтрокаТЗ[КлючЗначение.Ключ] = КлючЗначение.Значение;
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Функция УниверсальноеЗаполнениеФормы_СтруктураОшибки(РеквизитФормы, Текст = "")
    Возврат Новый Структура("РеквизитФормы, Текст", РеквизитФормы, Текст);
КонецФункции

