
Процедура СлужебныеРеквизитыФормы_Создать(Форма) Экспорт
	НовыеРеквизиты = Новый Массив;
	
	ОписаниеРеквизита_ = СлужебныеРеквизитыФормы_ПравоРедактирования_Описание();
	РеквизитыФормы_Добавить(НовыеРеквизиты, Форма, ОписаниеРеквизита_);
		
	Если НовыеРеквизиты.Количество() Тогда
		Форма.ИзменитьРеквизиты(НовыеРеквизиты);	
	КонецЕсли;
КонецПроцедуры  

Процедура СлужебныеРеквизитыФормы_Заполнить(Форма) Экспорт
	Форма.ПравоРедактирования = ПравоДоступа("Редактирование", Форма.Метаданные());
КонецПроцедуры    

Функция СлужебныеРеквизитыФормы_ПравоРедактирования_Описание() Экспорт
	Возврат СлужебныеРеквизитыФормы_ОписаниеРеквизита("ПравоРедактирования", Новый ОписаниеТипов("Булево"));	
КонецФункции   
 
