
Процедура РеквизитыФормы_Добавить(СписокРеквизитов, Форма, Описание)
	Если Не ESD_ТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(Форма, Описание.Имя) Тогда 
		СписокРеквизитов.Добавить(Новый РеквизитФормы(Описание.Имя, Описание.Тип));
		Для Каждого ОписаниеКолонки_ Из Описание.Колонки Цикл
			СписокРеквизитов.Добавить(Новый РеквизитФормы(ОписаниеКолонки_.Имя, ОписаниеКолонки_.Тип, Описание.Имя));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 

Функция СлужебныеРеквизитыФормы_ОписаниеРеквизита(Имя, Тип)
	Возврат Новый Структура("Имя, Тип, Колонки", Имя, Тип, Новый Массив);
КонецФункции

