
Процедура СлужебныеРеквизитыФормы_Создать(Форма) Экспорт
	НовыеРеквизиты = Новый Массив;
	
	ОписаниеРеквизита_ = СлужебныеРеквизитыФормы_ПравоРедактирования_Описание();
	СлужебныеРеквизитыФормы_Добавить(НовыеРеквизиты, Форма, ОписаниеРеквизита_);
	
	Если НовыеРеквизиты.Количество() Тогда
		Форма.ИзменитьРеквизиты(НовыеРеквизиты);	
	КонецЕсли;
КонецПроцедуры  

Процедура СлужебныеРеквизитыФормы_Заполнить(Форма) Экспорт
	Форма.ПравоРедактирования = ПравоДоступа("Редактирование", Форма.Метаданные());
КонецПроцедуры    

Функция СлужебныеРеквизитыФормы_ПравоРедактирования_Описание() Экспорт
	Возврат Новый структура("Имя, Тип", "ПравоРедактирования", Новый ОписаниеТипов("Булево"));	
КонецФункции 
 
