#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузкаДанныхЭПД_ОбъектESD_ЗаполнитьСписокВыбораНаСервере();
	Если Параметры.Свойство("ПараметрыДействия") Тогда
		ЗагрузкаДанныхЭПД_ЗаполнитьПараметрыДействия(Параметры.ПараметрыДействия);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Применить(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметрыДействия = ЗагрузкаДанныхЭПД_СформироватьПараметрыДействия();
	Закрыть(СтруктураПараметрыДействия);
КонецПроцедуры

#КонецОбласти // ОбработчикиКоманд

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузкаДанныхЭПД_ЗаполнитьПараметрыДействия(ПараметрыДействия)
	Если Не ЗначениеЗаполнено(ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ОбъектESD = ПараметрыДействия["ПриВыполнении"]["ОбъектESD"];
	ЭтаФорма.ДатаНачала = ПараметрыДействия["ПриВыполнении"]["ДатаНачала"];
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаДанныхЭПД_ОбъектESD_ЗаполнитьСписокВыбораНаСервере()
	Элементы.ОбъектESD.СписокВыбора.Очистить();
	Для Каждого ОписаниеОбъектаESD Из ЗагрузкаДанныхЭПД_ДоступныеОбъектыESD() Цикл
		Элементы.ОбъектESD.СписокВыбора.Добавить(
			ОписаниеОбъектаESD.Значение, ОписаниеОбъектаESD.Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗагрузкаДанныхЭПД_ДоступныеОбъектыESD()
	Результат = Новый Массив;
	ЗагрузкаДанныхЭПД_ОписаниеОбъекта = ЗагрузкаДанныхЭПД_ОписаниеОбъектаESD("Документ.ESD_ТранспортнаяНакладная", 
		"Документ 'Транспортная накладная'");
	Результат.Добавить(ЗагрузкаДанныхЭПД_ОписаниеОбъекта);
	ЗагрузкаДанныхЭПД_ОписаниеОбъекта = ЗагрузкаДанныхЭПД_ОписаниеОбъектаESD("Документ.ESD_ПутевойЛист", 
		"Документ 'Путевой лист'");
	Результат.Добавить(ЗагрузкаДанныхЭПД_ОписаниеОбъекта);
	ЗагрузкаДанныхЭПД_ОписаниеОбъекта = ЗагрузкаДанныхЭПД_ОписаниеОбъектаESD("Документ.ESD_ЗаказНаПеревозку", 
		"Документ 'Заказ на перевозку'");
	Результат.Добавить(ЗагрузкаДанныхЭПД_ОписаниеОбъекта);
	
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗагрузкаДанныхЭПД_ОписаниеОбъектаESD(Значение = "", Представление = "")
	Возврат Новый Структура("Значение,Представление", Значение, Представление);
КонецФункции

&НаКлиенте
Функция ЗагрузкаДанныхЭПД_СформироватьПараметрыДействия()
	РезультатФункции = Новый Структура("ПередВыполнением,ПриВыполнении,ПослеВыполнения");
	РезультатФункции.ПриВыполнении = ЗагрузкаДанныхЭПД_СформироватьПараметрыДействия_ПриВыполнении();	
	РезультатФункции.ПередВыполнением = Новый Структура;
	РезультатФункции.ПослеВыполнения = Новый Структура;
	
	Возврат РезультатФункции;
КонецФункции

&НаКлиенте
Функция ЗагрузкаДанныхЭПД_СформироватьПараметрыДействия_ПриВыполнении()
	РезультатФункции = Новый Соответствие;
	РезультатФункции.Вставить("ОбъектESD", ЭтаФорма.ОбъектESD);
	РезультатФункции.Вставить("ДатаНачала", ЭтаФОрма.ДатаНачала);
	Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
