
Процедура Подключаемый_ВыгрузкаВSaby_ПослеВыполненияОбмена(ИмяМетода, ПараметрыМетода, РезультатМетода, 
	context_params = Неопределено, ДополнительныеПараметры = Неопределено
)
	ESD_ОбщийФункционалСервер.ЛогированиеОбменаSaby_Записать(ИмяМетода, 
		ПараметрыМетода, 
		РезультатМетода, 
		context_params, 
		ДополнительныеПараметры);
КонецПроцедуры

Функция Подключаемый_ВыгрузкаВSaby_СформироватьСтруктуруОшибки(ИнформацияОбОшибке)
	Попытка
		СтруктураОшибки = ЗначениеИзСтрокиВнутр(ИнформацияОбОшибке.Описание);
	Исключение
		СтруктураОшибки = Новый Структура("ОписаниеОшибки", ИнформацияОбОшибке.Описание);
	КонецПопытки;

	Возврат СтруктураОшибки;
КонецФункции

