
Процедура Подключаемый_ДополнительныеПоля_ПослеВыгрузкиДокумента(ПараметрыВыгрузки)
	Направление_ = Перечисления.ESD_Направление.Исходящий;
	РегистрыСведений.ESD_ЗначенияДополнительныхПолей.Очистить(ПараметрыВыгрузки.Ссылка, Направление_);
КонецПроцедуры

Процедура Подключаемый_ДополнительныеПоля_ДобавитьНаВыгрузку(СтруктураДокумента, ПараметрыВыгрузки)
	ДополнительныеПоля_ = Подключаемый_ДополнительныеПоля_Сформировать(ПараметрыВыгрузки);
	Если Не ДополнительныеПоля_.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СтруктураДокумента.Свойство("Документ") Тогда
		СтруктураДокумента.Вставить("Документ", Новый Структура);
	КонецЕсли;
	
	СтруктураДокумента.Документ.Вставить("ИнформационноеПоле", ДополнительныеПоля_);		
КонецПроцедуры

Функция Подключаемый_ДополнительныеПоля_Сформировать(ПараметрыВыгрузки, ПараметрыОтбора = Неопределено)
	МассивДополнительныхПолей = Новый Массив;
	
	Направление_ = Перечисления.ESD_Направление.Исходящий;
	СтруктураОтбора_ = Новый Структура("Владелец, Направление", ПараметрыВыгрузки.Ссылка, Направление_);
	Если ТипЗнч(ПараметрыОтбора) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из ПараметрыОтбора Цикл
			СтруктураОтбора_.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);	
		КонецЦикла;
	КонецЕсли;
		
	ТаблицаИсходящихЗначений_ = РегистрыСведений.ESD_ЗначенияДополнительныхПолей.Таблица(СтруктураОтбора_);
	Если Не ЗначениеЗаполнено(ТаблицаИсходящихЗначений_) Тогда
		Возврат МассивДополнительныхПолей;
	КонецЕсли;
	
	ДополнительныеПоля_Текст = Новый Массив;
	Для Каждого Строка_ Из ТаблицаИсходящихЗначений_ Цикл
		СтрЗначение_ = Справочники.ESD_ДополнительныеПоля.ВСтроку(Строка_.Значение, Строка_.Тип);
		ДополнительныеПоля_Текст.Добавить(Новый Структура("Ид, Значение", Строка_.Идентификатор, СтрЗначение_));		
	КонецЦикла;
	
	МассивДополнительныхПолей.Добавить(Новый Структура("Текст", ДополнительныеПоля_Текст));
	Возврат МассивДополнительныхПолей;
КонецФункции

