
// Изменение печатной формы в Saby
// Параметры:
//  ПараметрыВыгрузки - Структура - см. Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыВыгрузки
//  context_params - Структура - параметры подключения к СБИС
//
// Возвращаемое значение:
//   Структура - структура описания результата выполнения функции
//
Функция Подключаемый_ВыгрузитьПечатнуюФорму(ПараметрыВыгрузки, context_params = Неопределено) Экспорт
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

	РезультатФункции = МодульТНОбщегоНазначенияКлиентСервер.РезультатВзаимодействияСоСБИС(1);
	МодульТНОбщегоНазначенияСервер.ЗаполнитьПараметрыВыгрузки(ПараметрыВыгрузки, РезультатФункции);
	
	ОбщиеПараметрыВыгрузки = МодульТНОбщегоНазначенияСервер.ОбщиеПараметрыВыгрузкиЗагрузки(context_params);
	ДанныеДокумента = ПараметрыВыгрузки.ДанныеДокумента;
	
	МодульДокумента = МодульКода("Документы." + ПараметрыВыгрузки.ИмяМетаданных);
	Если Не ЗначениеЗаполнено(ДанныеДокумента) Тогда
		ДанныеДокумента = МодульДокумента.ДанныеДокумента(ПараметрыВыгрузки.Ссылка, ПараметрыВыгрузки.ТипТитула);
	КонецЕсли;
	
	ДополнительныеПоля_ = Подключаемый_ДополнительныеПоля_Сформировать(ПараметрыВыгрузки);
	ДокументВыгрузки = Новый Структура("ИнформационноеПоле", ДополнительныеПоля_);
	
	Документ = Новый Структура("Документ", ДокументВыгрузки);
	Если ЗначениеЗаполнено(ПараметрыВыгрузки.ИдентификаторСБИС) Тогда
		Адресация = Новый Структура;
		Адресация.Вставить("Идентификатор", ПараметрыВыгрузки.ИдентификаторСБИС);
		Документ.Вставить("Адресация", Адресация);
	КонецЕсли;
	ПараметрыВыгрузки.Вставить("СтруктураДокумента", Документ);
	
	ВыполнитьВыгрузку(ПараметрыВыгрузки, ОбщиеПараметрыВыгрузки, РезультатФункции);
	
	МодульТНОбщегоНазначенияСервер.ЗаписатьОшибкиВЖурналРегистрации(РезультатФункции.Ошибки, 
		МодульТНОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации_ВыгрузкаВSaby());
	РезультатФункции.Итог.Успех = Не ЗначениеЗаполнено(РезультатФункции.Ошибки);
	Возврат РезультатФункции;
КонецФункции

