
//DynamicDirective

Процедура ПолучитьДанныеТитулов(Форма, МенеджерВременныхТаблиц)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	Saby_ДанныеТитулов.Период КАК Период,
	|	Saby_ДанныеТитулов.СсылкаНаДокумент КАК СсылкаНаДокумент,
	|	Saby_ДанныеТитулов.ТипТитула КАК ТипТитула,
	|	Saby_ДанныеТитулов.ИдентификаторТитула КАК ИдентификаторТитула,
	|	Saby_ДанныеТитулов.Основной КАК Основной,
	|	Saby_ДанныеТитулов.Данные КАК Данные,
	|	Saby_ДанныеТитулов.Просмотрено КАК Просмотрено,
	|	Saby_ДанныеТитулов.ТипТитулаОтказа КАК ТипТитулаОтказа
	|ПОМЕСТИТЬ ДанныеТитулов
	|ИЗ
	|	РегистрСведений.Saby_ДанныеТитулов КАК Saby_ДанныеТитулов
	|ГДЕ
	|	Saby_ДанныеТитулов.СсылкаНаДокумент = &СсылкаНаДокумент";
	
	ЗапросДанных.УстановитьПараметр("СсылкаНаДокумент", Форма.СсылкаНаЭТрН);
	
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

