
Процедура СформироватьДанныеТитулов(МенеджерВременныхТаблиц, СсылкаНаДокумент)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ДанныеТитулов.Период КАК Период,
	|	ДанныеТитулов.СсылкаНаДокумент КАК СсылкаНаДокумент,
	|	ДанныеТитулов.ТипТитула КАК ТипТитула,
	|	ДанныеТитулов.ИдентификаторТитула КАК ИдентификаторТитула,
	|	ДанныеТитулов.Основной КАК Основной,
	|	ДанныеТитулов.Данные КАК Данные,
	|	ДанныеТитулов.Просмотрено КАК Просмотрено,
	|	ДанныеТитулов.ТипТитулаОтказа КАК ТипТитулаОтказа,
	|	ДанныеТитулов.ТипТитула.Порядок КАК ТипТитулаПорядок
	|ПОМЕСТИТЬ Saby_ДанныеТитулов
	|ИЗ
	|	РегистрСведений.Saby_ДанныеТитулов КАК ДанныеТитулов
	|ГДЕ
	|	ДанныеТитулов.СсылкаНаДокумент = &СсылкаНаДокумент";
	
	ЗапросДанных.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

Процедура ПросмотретьТитулы(МассивСсылокНаДокумент, ИдентификаторыТитулов)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	Saby_ДанныеТитулов.Период КАК Период,
	|	Saby_ДанныеТитулов.СсылкаНаДокумент КАК СсылкаНаДокумент,
	|	Saby_ДанныеТитулов.ТипТитула КАК ТипТитула,
	|	Saby_ДанныеТитулов.ИдентификаторТитула КАК ИдентификаторТитула,
	|	Saby_ДанныеТитулов.Данные КАК Данные,
	|	ИСТИНА КАК Просмотрено
	|ИЗ
	|	РегистрСведений.Saby_ДанныеТитулов КАК Saby_ДанныеТитулов
	|ГДЕ
	|	Saby_ДанныеТитулов.СсылкаНаДокумент В(&МассивСсылокНаДокумент)
	|	И Saby_ДанныеТитулов.ИдентификаторТитула В(&ИдентификаторыТитулов)
	|	И НЕ Saby_ДанныеТитулов.Просмотрено";
	
	ЗапросДанных.УстановитьПараметр("МассивСсылокНаДокумент", МассивСсылокНаДокумент);
	Если ИдентификаторыТитулов <> Неопределено Тогда
		ЗапросДанных.УстановитьПараметр("ИдентификаторыТитулов", ИдентификаторыТитулов);
	Иначе
		ЗапросДанных.Текст = СтрЗаменить(
			ЗапросДанных.Текст,
			"Saby_ДанныеТитулов.ИдентификаторТитула В(&ИдентификаторыТитулов)",
			"ИСТИНА");
	КонецЕсли;
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	Пока ВыборкаДанных.Следующий() Цикл
		МенеджерЗаписи = МодульКода("РегистрыСведений.Saby_ДанныеТитулов").СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДанных);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры
