
Процедура СформироватьДанныеТитулов(МенеджерВременныхТаблиц, СсылкаНаДокумент)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ДанныеТитулов.Период КАК Период,
	|	ДанныеТитулов.СсылкаНаДокумент КАК СсылкаНаДокумент,
	|	ДанныеТитулов.ТипТитула КАК ТипТитула,
	|	ДанныеТитулов.ИдентификаторТитула КАК ИдентификаторТитула,
	|	ДанныеТитулов.Основной КАК Основной,
	|	ДанныеТитулов.Данные КАК Данные,
	|	ДанныеТитулов.Просмотрено КАК Просмотрено,
	|	ДанныеТитулов.ТипТитулаОтказа КАК ТипТитулаОтказа,
	|	ДанныеТитулов.ТипТитула.Порядок КАК ТипТитулаПорядок
	|ПОМЕСТИТЬ ESD_ДанныеТитулов
	|ИЗ
	|	РегистрСведений.ESD_ДанныеТитулов КАК ДанныеТитулов
	|ГДЕ
	|	ДанныеТитулов.СсылкаНаДокумент = &СсылкаНаДокумент";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ДанныеТитулов", ДанныеТитулов());
	
	ЗапросДанных.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

Процедура ПросмотретьТитулы(МассивСсылокНаДокумент, ИдентификаторыТитулов)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ESD_ДанныеТитулов.Период КАК Период,
	|	ESD_ДанныеТитулов.СсылкаНаДокумент КАК СсылкаНаДокумент,
	|	ESD_ДанныеТитулов.ТипТитула КАК ТипТитула,
	|	ESD_ДанныеТитулов.ИдентификаторТитула КАК ИдентификаторТитула,
	|	ESD_ДанныеТитулов.Данные КАК Данные,
	|	ИСТИНА КАК Просмотрено
	|ИЗ
	|	РегистрСведений.ESD_ДанныеТитулов КАК ESD_ДанныеТитулов
	|ГДЕ
	|	ESD_ДанныеТитулов.СсылкаНаДокумент В(&МассивСсылокНаДокумент)
	|	И ESD_ДанныеТитулов.ИдентификаторТитула В(&ИдентификаторыТитулов)
	|	И НЕ ESD_ДанныеТитулов.Просмотрено";
	
	ЗапросДанных.УстановитьПараметр("ИдентификаторыТитулов",  ИдентификаторыТитулов);
	ЗапросДанных.УстановитьПараметр("МассивСсылокНаДокумент", МассивСсылокНаДокумент);
	
	Если ИдентификаторыТитулов = Неопределено Тогда

		ЗапросДанных.Текст = СтрЗаменить(
			ЗапросДанных.Текст,
			"ESD_ДанныеТитулов.ИдентификаторТитула В(&ИдентификаторыТитулов)",
			"ИСТИНА");
			
	КонецЕсли;
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ДанныеТитулов", ДанныеТитулов());
    	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	Пока ВыборкаДанных.Следующий() Цикл
		МенеджерЗаписи = МодульКода("РегистрыСведений.ESD_ДанныеТитулов").СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДанных);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

