#Область ПользовательскийИнтерфейс

// Возвращает коллекцию-соответствие предопределенных рег. заданий
//
// Возвращаемое значение:
//	Соответствие - коллекция-соответствие предопределенных рег. заданий
//
//DynamicDirective
Функция КоллекцияРегламентныхЗаданий() Экспорт
	Результат = Новый Соответствие;
	
	МодульКодаРегЗаданияСлужебный = МодульКода("ESD_РегламентныеЗаданияСлужебный");
	Для Каждого КлючЗначение Из МодульКодаРегЗаданияСлужебный.ПредопределенныеРегламентныеЗадания() Цикл
		РегЗадание = МодульКодаРегЗаданияСлужебный.НайтиРегламентноеЗаданиеПоКлючу(КлючЗначение.Значение.Ключ);
		Результат.Вставить(КлючЗначение.Ключ, РегЗадание);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 

// Выполнить рег. задание вручную
//
// Параметры:
//	Идентификатор - Строка - идентификатор рег. задания
//
// Возвращаемое значение:
//	Структура - параметры выполнения рег. задания
//
//DynamicDirective
Функция ВыполнитьРегламентноеЗаданиеВручную(Знач Идентификатор) Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ПараметрыВыполнения = МодульКода("ESD_РегламентныеЗаданияСлужебный").ВыполнитьРегламентноеЗаданиеВручную(Идентификатор);
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат ПараметрыВыполнения;
КонецФункции

// Получает расписание рег. задания по идентификатору
//
// Параметры:
//	Идентификатор - Строка - идентификатор рег. задания
//
// Возвращаемое значение:
//	РасписаниеРегламентногоЗадания - расписание рег. задания
//
Функция РасписаниеРегламентногоЗадания(Знач Идентификатор) Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	Результат = МодульКода("ESD_РегламентныеЗаданияСлужебный").РасписаниеРегламентногоЗадания(Идентификатор);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;	
КонецФункции

// Выполняет изменение параметров рег. задания в привилегированном режиме и возвращает "статус"
//
// Параметры:
//	Идентификатор - Строка - идентификатор рег. задания
//	Параметры - Структура - новые значения параметров рег. задания
//
// Возвращаемое значение:
//	Булево - статус изменения рег. задания
//
//DynamicDirective
Функция ИзменитьРегламентноеЗадание(Знач Идентификатор, Знач Параметры) Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	Результат = МодульКода("ESD_РегламентныеЗаданияСлужебный").ИзменитьРегламентноеЗадание(Идентификатор, Параметры);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода