#Область ПользовательскийИнтерфейс

// Возвращает коллекцию-соответствие предопределенных рег. заданий
//
// Возвращаемое значение:
//	Соответствие - коллекция-соответствие предопределенных рег. заданий
//
//DynamicDirective
Функция КоллекцияРегламентныхЗаданий() Экспорт
	Результат = Новый Соответствие;
	
	МодульКодаРегЗаданияСлужебный = МодульКода("ESD_РегламентныеЗаданияСлужебный");
	Для Каждого КлючЗначение Из МодульКодаРегЗаданияСлужебный.ПредопределенныеРегламентныеЗадания() Цикл
		РегЗадание = МодульКодаРегЗаданияСлужебный.НайтиРегламентноеЗаданиеПоКлючу(КлючЗначение.Значение.Ключ);
		Результат.Вставить(КлючЗначение.Ключ, РегЗадание);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет изменение параметров рег. задания и возвращает "статус"
//
// Параметры:
//	Идентификатор - Строка - идентификатор рег. задания
//	Параметры - Структура - новые значения параметров рег. задания
//
// Возвращаемое значение:
//	Булево - статус изменения рег. задания
//
//DynamicDirective
Функция ИзменитьРегламентноеЗадание(Знач Идентификатор, Знач Параметры) Экспорт
	РегламентноеЗадание = МодульКода("ESD_РегламентныеЗаданияСлужебный").НайтиРегламентноеЗаданиеПоИдентификатору(Идентификатор);
	Если РегламентноеЗадание = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из Параметры Цикл
		РегламентноеЗадание[КлючЗначение.Ключ] = КлючЗначение.Значение;	
	КонецЦикла;
		
	РегламентноеЗадание.Записать();
	Возврат Истина;
КонецФункции

// Возвращает расписание рег. задания
//
// Параметры:
//	Идентификатор - Строка - идентификатор рег. задания
//
// Возвращаемое значение:
//	РасписаниеРегламентногоЗадания - расписание рег. задания
//
//DynamicDirective
Функция РасписаниеРегламентногоЗадания(Знач Идентификатор) Экспорт
	Расписание = Неопределено;
	
	РегламентноеЗадание = МодульКода("ESD_РегламентныеЗаданияСлужебный").НайтиРегламентноеЗаданиеПоИдентификатору(Идентификатор);
	Если РегламентноеЗадание <> Неопределено Тогда
		Расписание = РегламентноеЗадание.Расписание;
	КонецЕсли;
	
	Возврат Расписание;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода