#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Тип_ЗагрузитьСписокВыбораНаСервере();
	Владелец_ЗагрузитьСписокВыбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Тип_НастроитьЗависимыеПоляПриИзменении();
	Если Не ОбработатьДоступностьСпискаВыбораВыбранногоТипа() Тогда
		Объект.СписокВыбора.Очистить();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПредзаполнитьФормуПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	Объект.СписокВыбора.Очистить();
	Тип_НастроитьЗависимыеПоляПриИзменении();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПредзаполнитьФормуПоУмолчанию()
	Если Не ЗначениеЗаполнено(Объект.Идентификатор) Тогда
		Объект.Идентификатор = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Владелец_ЗагрузитьСписокВыбораНаСервере()
	Элементы.ВладелецМетаданные.СписокВыбора.Очистить();
	Для Каждого ОписаниеВладельца Из Справочники.ESD_ДополнительныеПоля.Владельцы() Цикл
		Элементы.ВладелецМетаданные.СписокВыбора.Добавить(ОписаниеВладельца.Имя, ОписаниеВладельца.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура Тип_ЗагрузитьСписокВыбораНаСервере()
	Элементы.Тип.СписокВыбора.Очистить();
	Для Каждого НаименованиеТипа Из Справочники.ESD_ДополнительныеПоля.ДоступныеТипыДанных() Цикл
		Элементы.Тип.СписокВыбора.Добавить(НаименованиеТипа);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Тип_НастроитьЗависимыеПоляПриИзменении()
	Если ОбработатьДоступностьСпискаВыбораВыбранногоТипа() Тогда
		НастроитьТипВводаЗначенияСпискаВыбора();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьТипВводаЗначенияСпискаВыбора()
	ОписаниеВыбранногоТипа = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ОписаниеТипа(Объект.Тип);
	Если Не ЗначениеЗаполнено(ОписаниеВыбранногоТипа) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СписокВыбораЗначение.ОграничениеТипа = ОписаниеВыбранногоТипа;
КонецПроцедуры

&НаКлиенте
Функция ОбработатьДоступностьСпискаВыбораВыбранногоТипа()
	ДоступенСписокВыбора_ = ДоступенСписокВыбора(Объект.Тип); 
	Если Не ДоступенСписокВыбора_ Тогда
		Объект.РежимВыбораИзСписка = Ложь;
	КонецЕсли;
	
	Элементы.СписокВыбора.Видимость = ДоступенСписокВыбора_;
	Элементы.РежимВыбораИзСписка.Видимость = ДоступенСписокВыбора_;	
	
	Возврат ДоступенСписокВыбора_;
КонецФункции

&НаКлиенте
Функция ДоступенСписокВыбора(Знач СтрТип) 
	Возврат ЗначениеЗаполнено(СтрТип) И СтрТип <> "Булево";
КонецФункции

#КонецОбласти
