
// Возвращает параметры документа для использования в методах АПИ
//
// Параметры:
//  ИмяМетаданных - Строка - имя метаданных документа
//  СторонняяОрганизация - Булево - признак того, что титул отправляет сторонняя организация.
//
// Возвращаемое значение:
// 	Структура - параметры документа
//
//DynamicDirective
Функция ПараметрыДокументаДляАПИ(ИмяМетаданных, СторонняяОрганизация = Ложь) Экспорт
		
	Если ИмяМетаданных = ТранспортнаяНакладнаяКлиент() Тогда
		
		ТипДляАПИ             = "ConsignmentNote";
		РегламентДляАПИ       = "Транспортная накладная";
		ИдентификаторДляАПИ   = "ad40d873-9d1e-47d7-b7e9-f39636b36301";
		ТипДляВыгрузкиДляАПИ  = "ЭТрН";		
		ИмяПеречисленияДляАПИ = ТипТитулаЭтрНКлиент();
				
	ИначеЕсли ИмяМетаданных = ПутевойЛистКлиент() Тогда
		
		ТипДляАПИ             = "Waybill";
		ТипДляВыгрузкиДляАПИ  = "Waybill";
		ИмяПеречисленияДляАПИ = ТипТитулаЭПЛКлиент();
		
		Если СторонняяОрганизация Тогда
			РегламентДляАПИ      = "ЭПЛ (Входящий)";
			ИдентификаторДляАПИ  = "48e4c1ba-a877-4f16-8a25-da0cf3209bf8";
		Иначе
			РегламентДляАПИ      = "ЭПЛ";
			ИдентификаторДляАПИ  = "7b589621-deec-488c-ada2-5df9db6c329e";
		КонецЕсли;
		
	ИначеЕсли ИмяМетаданных = ЗаказНаПеревозкуКлиент() Тогда
		
		ТипДляАПИ             = "TransportOrder";
		ТипДляВыгрузкиДляАПИ  = "TransportOrder";
		ИмяПеречисленияДляАПИ = ТипТитулаЗнПКлиент();
		
		Если СторонняяОрганизация Тогда
			РегламентДляАПИ      = "Заказ на перевозку (Входящий)";
			ИдентификаторДляАПИ  = "e000d24d-35a7-4a31-a692-22405b34dfbe";
		Иначе
			РегламентДляАПИ      = "Заказ на перевозку";
			ИдентификаторДляАПИ  = "6c052893-6b54-4f55-baf5-83e515b5aff4";
		КонецЕсли;
		
	Иначе
		
		ТипДляАПИ             = "";
		РегламентДляАПИ       = "";
		ИдентификаторДляАПИ   = "";
		ТипДляВыгрузкиДляАПИ  = "";
		ИмяПеречисленияДляАПИ = "";
		
	КонецЕсли;
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Тип",                     ТипДляАПИ);
	РезультатФункции.Вставить("Регламент",               РегламентДляАПИ);
	РезультатФункции.Вставить("ИдентификаторРегламента", ИдентификаторДляАПИ);
	РезультатФункции.Вставить("ТипДляВыгрузки",          ТипДляВыгрузкиДляАПИ);
	РезультатФункции.Вставить("ИмяПеречисления",         ИмяПеречисленияДляАПИ); 
	
	Возврат РезультатФункции;
	
КонецФункции

