
#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  Код - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.Saby_ТипыВладенияТС - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция ЗначениеПоКоду(Код) Экспорт
	
	Если Код = "2" Тогда
		Возврат ЗначениеМетаданных("Saby_ТипыВладенияТС.СовместнаяСобственностьСупругов");
	ИначеЕсли Код = "3" Тогда
		Возврат ЗначениеМетаданных("Saby_ТипыВладенияТС.Аренда");
	ИначеЕсли Код = "4" Тогда
		Возврат ЗначениеМетаданных("Saby_ТипыВладенияТС.Лизинг");
	ИначеЕсли Код = "5" Тогда
		Возврат ЗначениеМетаданных("Saby_ТипыВладенияТС.БезвозмездноеПользование");
	Иначе
		Возврат ЗначениеМетаданных("Saby_ТипыВладенияТС.Собственность");
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующий код по указанному значению перечисления.
//
// Параметры:
//  Значение  - ПеречислениеСсылка.Saby_ТипыВладенияТС - значение перечисления
//
// Возвращаемое значение:
//   Строка - Строковое представление кода.
//
Функция КодПоЗначению(Значение) Экспорт
	
	Если Значение = ЗначениеМетаданных("Saby_ТипыВладенияТС.СовместнаяСобственностьСупругов") Тогда
		Возврат "2";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_ТипыВладенияТС.Аренда") Тогда
		Возврат "3";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_ТипыВладенияТС.Лизинг") Тогда
		Возврат "4";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_ТипыВладенияТС.БезвозмездноеПользование") Тогда
		Возврат "5";
	Иначе
		Возврат "1";
	КонецЕсли;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак необходимости документального подтверждения факта владения транспортным средством.
//
// Параметры:
//  ТипВладения - ПеречислениеСсылка.Saby_ТипыВладенияТС - ссылка на тип владения транспортным средством
//
// Возвращаемое значение:
//   Булево - Истина, если документальное подтверждение необходимо.
//
Функция ТребуетПодтвержденияВладения(ТипВладения) Экспорт
	
	Возврат ТипВладения = ЗначениеМетаданных("Saby_ТипыВладенияТС.Аренда")
		Или ТипВладения = ЗначениеМетаданных("Saby_ТипыВладенияТС.Лизинг")
		Или ТипВладения = ЗначениеМетаданных("Saby_ТипыВладенияТС.БезвозмездноеПользование");
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных
