
Процедура НастройкиЭПД_Инициализация(Форма, ГруппаВладелец) Экспорт
	ГруппаКонтейнер = НастройкиЭПД_Контейнер_ДобавитьНаФорму(Форма, ГруппаВладелец);
	НастройкиЭПД_СоздатьЭлементы(Форма, ГруппаКонтейнер);
	НастройкиЭПД_Загрузить(Форма);
КонецПроцедуры

Процедура НастройкиЭПД_СоздатьЭлементы(Форма, ГруппаКонтейнер) Экспорт
	НастройкиЭЗЗ_СоздатьЭлементы(Форма, ГруппаКонтейнер);
КонецПроцедуры

Процедура НастройкиЭПД_Загрузить(Форма) Экспорт
	ЗначенияНастроек = ESD_ТНОбщегоНазначенияСервер.НастройкиЭПД_Загрузить();
	НастройкиЭЗЗ_ЗаполнитьЗначенияНастроек(Форма, ЗначенияНастроек.ЭЗЗ);  
КонецПроцедуры

Функция НастройкиЭПД_Контейнер_ДобавитьНаФорму(Форма, ГруппаВладелец) Экспорт
	ИмяГруппы = "ГруппаНастройкиЭПД_Контейнер";
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если ГруппаФормы = Неопределено Тогда
		ГруппаФормы = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаВладелец);
		ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормы.Поведение = ПоведениеОбычнойГруппы.Обычное;
		ГруппаФормы.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаФормы.РастягиватьПоВертикали = Ложь;
		ГруппаФормы.ОтображатьЗаголовок = Ложь;
	КонецЕсли;
	
	Возврат ГруппаФормы;
КонецФункции

#Область include_etrn_base_CommonModule_ОбщийФункционалСервер_НастройкиЭПД_ЭЗЗ_ПодключаемыйИнтерфейс
#КонецОбласти // include_etrn_base_CommonModule_ОбщийФункционалСервер_НастройкиЭПД_ЭЗЗ_ПодключаемыйИнтерфейс 

