
#Область ОбработчикиСобытийОбъекта

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	СписокОшибок = ОбъектЗаполненКорректно();
	Если СписокОшибок.Количество() Тогда
		ОбщийТекстОшибки = СписокОшибок[0];
		Для i = 1 По СписокОшибок.Количество() - 1 Цикл
			ОбщийТекстОшибки = ОбщийТекстОшибки + Символы.ПС + СписокОшибок[i];
		КонецЦикла;
		
		ВызватьИсключение ОбщийТекстОшибки;
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтотОбъект.ЭтоНовый());
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") И ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
		ESD_ТНЗагрузкаСервер.ЗаписатьСтатистикуВызоваВОблако("ДобавлениеДопПоля", "ДополнительныеПоля");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныйПрограммныйИнтефрейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъектЗаполненКорректно()
	Результат = Новый Массив;
	
	СтруктураОтбора = Новый Структура("Идентификатор", Идентификатор);
	ОбъектыПоОтбору_ = Справочники.ESD_ДополнительныеПоля.ОбъектыПоОтбору(СтруктураОтбора);
	Для Каждого СтруктураОбъекта_ Из ОбъектыПоОтбору_ Цикл
		// Пропускам проверку текущего элемента
		Если СтруктураОбъекта_.Ссылка = Ссылка Тогда
			Продолжить;
		КонецЕсли;
		
		// Для "доп. полей" с пустым "Владельцем" допускается существование только одного элемента с "Идентификатором"
		// Для "доп. полей" с заполненным "Владельцем" допускается существование нескольких элементов с одинаковым "Идентификатором"
		//	если прочие принадлежат отличным от текущего "Владельцам"
		Если Не (ЗначениеЗаполнено(ВладелецМетаданные) И ЗначениеЗаполнено(СтруктураОбъекта_.ВладелецМетаданные)
			И ВладелецМетаданные <> СтруктураОбъекта_.ВладелецМетаданные)
		Тогда 
			Результат.Добавить("Дополнительное поле с указанным идентификатором уже существует!");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти