
#Область ОбработчикиСобытийОбъекта

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтотОбъект.ЭтоНовый());
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") И ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
		ESD_ТНЗагрузкаСервер.ЗаписатьСтатистикуВызоваВОблако("ДобавлениеДопПоля", "ДополнительныеПоля");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныйПрограммныйИнтефрейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти