
#Область ПрограммныйИнтерфейс

Функция СсылкаПоИдентификатору(Идентификатор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ESD_ДополнительныеПоля.Ссылка КАК Ссылка	
		|ИЗ
		|	Справочник.ESD_ДополнительныеПоля КАК ESD_ДополнительныеПоля
		|ГДЕ
		|	ESD_ДополнительныеПоля.Идентификатор = &Идентификатор
		|";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
КонецФункции

Функция ОбъектыПоОтбору(СтруктураОтбора = Неопределено) Экспорт
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ESD_ДополнительныеПоля.Ссылка КАК Ссылка,
		|	ESD_ДополнительныеПоля.ПометкаУдаления КАК ПометкаУдаления,
		|	ESD_ДополнительныеПоля.Идентификатор КАК Идентификатор,
		|	ESD_ДополнительныеПоля.Тип КАК Тип,
		|	ESD_ДополнительныеПоля.Наименование КАК Наименование,
		|	ESD_ДополнительныеПоля.Код КАК Код,
		|	ESD_ДополнительныеПоля.ПроверятьЗаполнение КАК ПроверятьЗаполнение,
		|	ESD_ДополнительныеПоля.ВладелецМетаданные КАК ВладелецМетаданные,
		|	ESD_ДополнительныеПоля.РежимВыбораИзСписка КАК РежимВыбораИзСписка	
		|ПОМЕСТИТЬ ESD_ДополнительныеПоля
		|ИЗ
		|	Справочник.ESD_ДополнительныеПоля КАК ESD_ДополнительныеПоля
		|ГДЕ
		|	&Отбор
		|;//////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ESD_ДополнительныеПоля.Ссылка КАК Ссылка,
		|	ESD_ДополнительныеПоля.ПометкаУдаления КАК ПометкаУдаления,
		|	ESD_ДополнительныеПоля.Идентификатор КАК Идентификатор,
		|	ESD_ДополнительныеПоля.Тип КАК Тип,
		|	ESD_ДополнительныеПоля.Наименование КАК Наименование,
		|	ESD_ДополнительныеПоля.Код КАК Код,
		|	ESD_ДополнительныеПоля.ПроверятьЗаполнение КАК ПроверятьЗаполнение,
		|	ESD_ДополнительныеПоля.РежимВыбораИзСписка КАК РежимВыбораИзСписка,	
		|	ESD_ДополнительныеПоля.ВладелецМетаданные КАК ВладелецМетаданные,
		|	ЕСТЬNULL(СписокВыбораДополнительныхПолей.Значение, Неопределено) КАК ЗначениеВыбора
		|ИЗ
		|	ESD_ДополнительныеПоля КАК ESD_ДополнительныеПоля
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ESD_ДополнительныеПоля.СписокВыбора КАК СписокВыбораДополнительныхПолей
		|		ПО ESD_ДополнительныеПоля.Ссылка = СписокВыбораДополнительныхПолей.Ссылка
		|ИТОГИ
		|	МАКСИМУМ(ESD_ДополнительныеПоля.Идентификатор),
		|	МАКСИМУМ(ESD_ДополнительныеПоля.Тип),
		|	МАКСИМУМ(ESD_ДополнительныеПоля.Наименование),
		|	МАКСИМУМ(ESD_ДополнительныеПоля.Код),
		|	МАКСИМУМ(ESD_ДополнительныеПоля.ПометкаУдаления),
		|	МАКСИМУМ(ESD_ДополнительныеПоля.ПроверятьЗаполнение),
		|	МАКСИМУМ(ESD_ДополнительныеПоля.ВладелецМетаданные),
		|	МАКСИМУМ(ESD_ДополнительныеПоля.РежимВыбораИзСписка)
		|ПО
		|	ESD_ДополнительныеПоля.Ссылка
		|";
	
	ОбщийТекстОтбора = "ИСТИНА";
	Если СтруктураОтбора <> Неопределено Тогда
		НомерПараметра = 1;
		Для Каждого ОписаниеОтбора Из СтруктураОтбора Цикл
			ИмяПараметра = "Параметр" + НомерПараметра;
			Если ТипЗнч(ОписаниеОтбора.Значение) = Тип("Массив") Тогда
				УсловиеОтбора = ОписаниеОтбора.Ключ + " В(&" + ИмяПараметра + ")";	
			Иначе
				УсловиеОтбора = ОписаниеОтбора.Ключ + " = &" + ИмяПараметра;	
			КонецЕсли;
			ОбщийТекстОтбора = ОбщийТекстОтбора + " И " + УсловиеОтбора;
			Запрос.УстановитьПараметр(ИмяПараметра, ОписаниеОтбора.Значение);
			НомерПараметра = НомерПараметра + 1;
		КонецЦикла;
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор", ОбщийТекстОтбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	Пока Выборка.Следующий() Цикл
		СтруктураОбъекта = СтруктураОбъекта();
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта, Выборка);
		
		ВыборкаЗначенийВыбора = Выборка.Выбрать();
		Пока ВыборкаЗначенийВыбора.Следующий() Цикл
			Если Не ЗначениеЗаполнено(ВыборкаЗначенийВыбора.ЗначениеВыбора) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураЗначенияВыбора = Новый Структура("Значение", ВыборкаЗначенийВыбора.ЗначениеВыбора);
			СтруктураОбъекта.СписокВыбора.Добавить(СтруктураЗначенияВыбора);
		КонецЦикла;
		
		Результат.Добавить(СтруктураОбъекта);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДоступныеТипыДанных() Экспорт
	Результат = Новый Массив;
	Результат.Добавить("Строка");
	Результат.Добавить("Число");
	Результат.Добавить("Булево");
	Результат.Добавить("Дата");
	
	Возврат Результат;
КонецФункции

Функция СтруктураОбъекта() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", Неопределено);
	Результат.Вставить("Код", "");
	Результат.Вставить("Наименование", "");
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("ПометкаУдаления", Ложь);
	Результат.Вставить("Тип", "");
	Результат.Вставить("ПроверятьЗаполнение", Ложь);
	Результат.Вставить("РежимВыбораИзСписка", Ложь);
	Результат.Вставить("ВладелецМетаданные", "");
	Результат.Вставить("СписокВыбора", Новый Массив);
	
	Возврат Результат;
КонецФункции

#Область include_etrn_base_Modules_AdditionalFields_Catalog_ДополнительныеПоля_МодульМенеджера_СлужебныйПрограммныйИнтерфейс_Переопределяемый
#КонецОбласти // include_etrn_base_Modules_AdditionalFields_Catalog_ДополнительныеПоля_МодульМенеджера_СлужебныйПрограммныйИнтерфейс_Переопределяемый

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти