
#Область ПрограммныйИнтерфейс

// Возвращает имя указанной роли.
//
// Параметры:
//  ВидЮрЛица - ПеречислениеСсылка.ESD_ЮрФизЛицо - значение перечисления
//
// Возвращаемое значение:
//   Строка - имя роли как в конфигураторе.
//
Функция ИмяВида(ВидЮрЛица) Экспорт
	
	Если ВидЮрЛица = ЗначениеМетаданных("ESD_ЮрФизЛицо.ЮрЛицо") Тогда
		РезультатФункции = "ЮрЛицо";
	ИначеЕсли ВидЮрЛица = ЗначениеМетаданных("ESD_ЮрФизЛицо.ФизЛицо") Тогда
		РезультатФункции = "ФизЛицо";
	ИначеЕсли ВидЮрЛица = ЗначениеМетаданных("ESD_ЮрФизЛицо.ИндивидуальныйПредприниматель") Тогда
		РезультатФункции = "ИндивидуальныйПредприниматель";
	ИначеЕсли ВидЮрЛица = ЗначениеМетаданных("ESD_ЮрФизЛицо.ЮрЛицоНеРезидент") Тогда
		РезультатФункции = "ЮрЛицоНеРезидент";
	Иначе
		РезультатФункции = "";
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных
