#Область ПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ОбщийФункционалСервер_События_ПрограммныйИнтерфейс
#КонецОбласти // include_etrn_base_CommonModule_ОбщийФункционалСервер_События_ПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ОбщийФункционалСервер_ФЛК_ПрограммныйИнтерфейс
#КонецОбласти // include_etrn_base_CommonModule_ОбщийФункционалСервер_ФЛК_ПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ОбщийФункционалСервер_ЭПД_ПрограммныйИнтерфейс
#КонецОбласти // include_etrn_base_CommonModule_ОбщийФункционалСервер_ЭПД_ПрограммныйИнтерфейс

#КонецОбласти

#Область ПодключаемыйИнтерфейс

#Область include_etrn_base_CommonModule_ОбщийФункционалСервер_События_ПодключаемыйИнтерфейс
#КонецОбласти // include_etrn_base_CommonModule_ОбщийФункционалСервер_События_ПодключаемыйИнтерфейс

#Область include_etrn_base_CommonModule_ОбщийФункционалСервер_ФЛК_ПодключаемыйИнтерфейс
#КонецОбласти // include_etrn_base_CommonModule_ОбщийФункционалСервер_ФЛК_ПодключаемыйИнтерфейс

#Область include_etrn_base_CommonModule_ОбщийФункционалСервер_РезультатФЛК_ПодключаемыйИнтерфейс
#КонецОбласти // include_etrn_base_CommonModule_ОбщийФункционалСервер_РезультатФЛК_ПодключаемыйИнтерфейс

#Область include_etrn_base_CommonModule_ОбщийФункционалСервер_ОбщиеНастройкиЭПД_ПодключаемыйИнтерфейс
#КонецОбласти // include_etrn_base_CommonModule_ОбщийФункционалСервер_ОбщиеНастройкиЭПД_ПодключаемыйИнтерфейс

#Область include_etrn_base_Modules_AdditionalFields_CommonModule_ОбщийФункционал_Сервер_ПодключаемыйИнтерфейс
#КонецОбласти // include_etrn_base_Modules_AdditionalFields_CommonModule_ОбщийФункционал_Сервер_ПодключаемыйИнтерфейс

#Область ЗапросДанных

Процедура ЗапросДанных_ПрименитьСтруктуруОтбора(Запрос, СтруктураОтбора, ИмяТаблицы, ИмяОтбора) Экспорт
	УсловияОтбора = Новый Массив;
	ШаблонИмениПараметра = ЗапросДанных_ШаблонИмениПараметра();
	
	Для Каждого КлючЗначение Из СтруктураОтбора Цикл
		Если ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
			ЗапросДанных_ОбработатьЗначениеОтбора_Массив(Запрос, КлючЗначение, УсловияОтбора, 
				ИмяТаблицы);
		ИначеЕсли ТипЗнч(КлючЗначение.Значение) = Тип("Структура") Тогда
			ЗапросДанных_ОбработатьЗначениеОтбора_Структура(Запрос, КлючЗначение, УсловияОтбора, 
				ИмяТаблицы);	
		Иначе
			ИмяПараметра = ШаблонИмениПараметра + Строка(УсловияОтбора.Количество());
			СтрокаУсловия = КлючЗначение.Ключ + " = &" + ИмяПараметра;
			УсловияОтбора.Добавить(ИмяТаблицы + "." + СтрокаУсловия);
			Запрос.УстановитьПараметр(ИмяПараметра, КлючЗначение.Значение);	
		КонецЕсли;
	КонецЦикла;
	
	ОбщийТекстОтбора = ESD_ТНОбщегоНазначенияКлиентСервер
		.СтрСоединитьЭПД(УсловияОтбора, " И ");	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ИмяОтбора, ОбщийТекстОтбора);	
КонецПроцедуры

Процедура ЗапросДанных_ОбработатьЗначениеОтбора_Массив(Запрос, ОписаниеПараметра, УсловияОтбора, ИмяТаблицы)
	ИмяПараметра = ЗапросДанных_ШаблонИмениПараметра() + Строка(УсловияОтбора.Количество());
	Запрос.УстановитьПараметр(ИмяПараметра, ОписаниеПараметра.Значение);
	СтрокаУсловия = ОписаниеПараметра.Ключ + " В(&" + ИмяПараметра + ")";
	УсловияОтбора.Добавить(ИмяТаблицы + "." + СтрокаУсловия);
КонецПроцедуры

Процедура ЗапросДанных_ОбработатьЗначениеОтбора_Структура(Запрос, ОписаниеПараметра, УсловияОтбора, ИмяТаблицы)
	ОписаниеЗначения = ОписаниеПараметра.Значение;
	НомерТекущегоПараметра = Строка(УсловияОтбора.Количество());
	Если ОписаниеЗначения.Свойство("ДатаНачала") И ОписаниеЗначения.Свойство("ДатаОкончания") Тогда
		ИмяПараметра_ДатаНачала = "&ДатаНачала" + НомерТекущегоПараметра;
		ИмяПараметра_ДатаОкончания = "&ДатаОкончания" + НомерТекущегоПараметра;
		
		ПолеТаблицы_ = ИмяТаблицы + "." + ОписаниеПараметра.Ключ;
		СтрокаУсловия = ПолеТаблицы_ + "МЕЖДУ " + ИмяПараметра_ДатаНачала + " И " + ИмяПараметра_ДатаОкончания;
		УсловияОтбора.Добавить(СтрокаУсловия);
		
		Запрос.УстановитьЗначение(ИмяПараметра_ДатаНачала, ОписаниеЗначения.ДатаНачала);
		Запрос.УстановитьЗначение(ИмяПараметра_ДатаОкончания, ОписаниеЗначения.ДатаОкончания);
	КонецЕсли;
КонецПроцедуры

Функция ЗапросДанных_ШаблонИмениПараметра()
	Возврат "Параметр";
КонецФункции

#КонецОбласти

#Область ЛогированиеОбменаSaby

Процедура ЛогированиеОбменаSaby_Записать(ИмяМетода, ПараметрыМетода, РезультатМетода, 
	context_params = Неопределено, ДополнительныеПараметры = Неопределено
) Экспорт
	Если ESD_ТНОбщегоНазначенияСервер.ЛогироватьОбменSaby_Загрузить() <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ESD_ЛогированиеОбменаSaby.ЗаписатьЛог(ИмяМетода, 
		ПараметрыМетода, 
		РезультатМетода, 
		context_params, 
		ДополнительныеПараметры);
КонецПроцедуры

#КонецОбласти

#Область ОбщиеНастройкиЭПД

Функция ОбщиеНастройкиЭПД_Префикс() Экспорт
	Префикс_ = ESD_ТНОбщегоНазначенияСервер.НастройкаПрефиксаДляДокументов_Загрузить();
	Если Не ЗначениеЗаполнено(Префикс_) Или ТипЗнч(Префикс_) <> Тип("Строка") Тогда
		Префикс_ = "00";  
	КонецЕсли;
	
	Возврат Префикс_;  
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ОбщийФункционалСервер_События_СлужебныйПрограммныйИнтерфейс
#КонецОбласти // include_etrn_base_CommonModule_ОбщийФункционалСервер_События_СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область include_etrn_base_CommonModule_ОбщийФункционалСервер_События_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_CommonModule_ОбщийФункционалСервер_События_СлужебныеПроцедурыИФункции 

#Область include_etrn_base_Modules_AdditionalFields_CommonModule_ОбщийФункционал_Сервер_СлужебныеПроцедурыИФункцииПереопределяемый
#КонецОбласти // include_etrn_base_Modules_AdditionalFields_CommonModule_ОбщийФункционал_Сервер_СлужебныеПроцедурыИФункцииПереопределяемый 

#КонецОбласти