
#Область СобытияОбъекта

Процедура ПередЗаписью(Отказ)
	ПередЗаписью_ЗаписьСтатистикиИспользования();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПередЗаписью_ЗаписьСтатистикиИспользования()
	Если Не ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ESD_ТНЗагрузкаСервер.ЗаписатьСтатистикуВызоваВОблако("КастомноеДействие", "АвтоматическиеСценарии");
КонецПроцедуры

#КонецОбласти