#Область СлужебныйПрограммныйИнтерфейс

// Формирование списка действий, доступных основанию автоматического сценария
//
// Параметры:
//  Владелец - Строка - полное имя метаданных основания
//
// Возвращаемое значение:
//	Массив - массив доступных действий
//
Функция СписокДействийПоВладельцу(Владелец) Экспорт
	Запрос = Новый Запрос;
	
	// BSLLS:QueryParseError-off
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	АвтоматическиеСценарииДействия.Ссылка КАК Ссылка,
		|	АвтоматическиеСценарииДействия.ОбработчикПриВыполнении КАК ОбработчикПриВыполнении,
		|	АвтоматическиеСценарииДействия.ОбработчикПередВыполнением КАК ОбработчикПередВыполнением,
		|	АвтоматическиеСценарииДействия.ОбработчикПослеВыполнения КАК ОбработчикПослеВыполнения	
		|ПОМЕСТИТЬ ДействияПодчиненныеВладельцу
		|ИЗ
		|	Справочник." + ИмяОбъекта() + " КАК АвтоматическиеСценарииДействия
		|ГДЕ
		|	Не АвтоматическиеСценарииДействия.БезВладельцев
		|;//////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		| 	ДействияПодчиненныеВладельцу.Ссылка КАК Ссылка,
		|	ДействияПодчиненныеВладельцу.ОбработчикПриВыполнении КАК ОбработчикПриВыполнении,
		|	ДействияПодчиненныеВладельцу.ОбработчикПередВыполнением КАК ОбработчикПередВыполнением,
		|	ДействияПодчиненныеВладельцу.ОбработчикПослеВыполнения КАК ОбработчикПослеВыполнения	
		|ИЗ
		|	ДействияПодчиненныеВладельцу КАК ДействияПодчиненныеВладельцу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник." + ИмяОбъекта() + ".Владельцы КАК ВладельцыДействия
		|		ПО ДействияПодчиненныеВладельцу.Ссылка = ВладельцыДействия.Ссылка
		|			И ВладельцыДействия.Владелец = &Владелец
		|		
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АвтоматическиеСценарииДействия.Ссылка,
		|	АвтоматическиеСценарииДействия.ОбработчикПриВыполнении,
		|	АвтоматическиеСценарииДействия.ОбработчикПередВыполнением,
		|	АвтоматическиеСценарииДействия.ОбработчикПослеВыполнения	
		|ИЗ
		|	Справочник." + ИмяОбъекта() + " КАК АвтоматическиеСценарииДействия
		|ГДЕ
		|	АвтоматическиеСценарииДействия.БезВладельцев
		|";
	// BSLLS:QueryParseError-on
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Формирование структуры обработчиков действия
//
// Параметры:
//	Ссылка - СправочникСсылка.АвтоматическиеСценарииДействия - ссылка на действие
//	
// Возвращаемое значение:
//	Структура - обработчики действия
//
Функция Обработчики(Ссылка) Экспорт
	Запрос = Новый Запрос;
	// BSLLS:QueryParseError-off
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	АвтоматическиеСценарииДействия.ОбработчикПередВыполнением КАК ПередВыполнением,
		|	АвтоматическиеСценарииДействия.ОбработчикПриВыполнении КАК ПриВыполнении,
		|	АвтоматическиеСценарииДействия.ОбработчикПослеВыполнения КАК ПослеВыполнения
		|ИЗ
		|	Справочник." + ИмяОбъекта() + " КАК АвтоматическиеСценарииДействия
		|ГДЕ
		|	АвтоматическиеСценарииДействия.Ссылка = &Ссылка
		|";
	// BSLLS:QueryParseError-on
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураОбработчиков();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат ДекодироватьОписаниеОбработчиков(Выборка);
КонецФункции

Функция ДекодироватьОписаниеОбработчиков(Описание) Экспорт
	Результат = СтруктураОбработчиков(); 
	Для Каждого КлючЗначение Из Результат Цикл
		Попытка
			ОписаниеОбработчика = ДекодироватьОписаниеОбработчика(Описание[КлючЗначение.Ключ]);
		Исключение
			ОписаниеОбработчика = ОписаниеОбработчика();
			ОписаниеОбработчика.Текст = Описание[КлючЗначение.Ключ];
		КонецПопытки;
		
		Результат[КлючЗначение.Ключ] = ОписаниеОбработчика;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Выполнение обработчиков действий
//
// Параметры:
//	Действие - СправочникСсылка.АвтоматическиеСценарииДействия - действие, обработчики которого нужнов выполнить
//	Основание - Произвольно - основание выполнения действия
//	Параметры - Соответствие - см. Параметры(). Передаются при выполнении из модуля объекта справочника "АвтоматическиеСценарии"
//
// Возвращаемое значение:
//	Структура - см. РезультатВыполнения()
//
Функция ВыполнитьОбработчики(Действие, Основание, Параметры) Экспорт
	Перем РезультатВыполнения;
	
	ОписаниеОбработчиков = СтруктураОбработчиков();
	ЗаполнитьЗначенияСвойств(ОписаниеОбработчиков, Параметры);
		
	Если ЭтоПредопределенноеДействие(Действие) Тогда
		// Для предопределенного действия вытащим обработчики соответствующим методом
		ОбработчикиДействия = МодульКода("Перечисления.АвтоматическиеСценарииПредопределенныеДействия")
			.Обработчики(Действие);	
	Иначе
		// Для обычного обработчика используем внутренний метод	
		ОбработчикиДействия = Обработчики(Действие);
	КонецЕсли;
	
	Для Каждого Обработчик Из ОбработчикиДействия Цикл
		ИмяОбработчика = Обработчик.Ключ;
		ОписаниеОбработчика = Обработчик.Значение;
		
		ПараметрыОбработчика = ОписаниеОбработчиков[ИмяОбработчика]; 
		Если ТипЗнч(ПараметрыОбработчика) <> Тип("Соответствие") Тогда
			ПараметрыОбработчика = Новый Соответствие;
		КонецЕсли;
		
		Если ОписаниеОбработчика.Свойство("Параметры") Тогда
			НормированныеПараметры = НормироватьПараметрыОбработчика(ОписаниеОбработчика.Параметры, ПараметрыОбработчика);
		Иначе
			НормированныеПараметры = ПараметрыОбработчика;	
		КонецЕсли;
		
		ТекстОбработчика = Обработчик.Значение.Текст;
		МодульКода("АвтоматическиеСценарииСервер").ВыполнитьОбработчик(ТекстОбработчика, 
			Основание, НормированныеПараметры, РезультатВыполнения);
		
		Если РезультатВыполнения.Ошибка Тогда
			// Сформируем более подробное описание ошибки
			РезультатВыполнения.Комментарий = "Ошибка выполнения обработчика """ + Обработчик.Ключ + """. 
				|
				|" + РезультатВыполнения.Комментарий;
			Прервать;
		ИначеЕсли РезультатВыполнения.Отказ Тогда
			Прервать;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатВыполнения;
КонецФункции

// Кодирование описания обработчика в строку
//
// Параметры:
//	Текст - Строка - текст обработка
//	Параметры - ТаблицаЗначений - таблица параметров обработчика
//
// Возвращаемое значение:
//	Строка - текст закодированных данных
Функция ЗакодироватьОписаниеОбработчика(Текст, Параметры) Экспорт
	Результат = ОписаниеОбработчика();
	Результат.Текст = Текст;
	Результат.Параметры = Параметры;
	
	Возврат ЗначениеВСтрокуВнутр(Результат);
КонецФункции

// Попытка декодировать описание обработчика
//
// Параметры:
//	ЗакодированноеОписание - Строка - закодированное описание обработчика
//
// Возвращаемое значение:
//	Структура, Неопределено - декодированное описание
//
Функция ДекодироватьОписаниеОбработчика(ЗакодированноеОписание) Экспорт
	Результат = ОписаниеОбработчика();
	ЗаполнитьЗначенияСвойств(Результат, ЗначениеИзСтрокиВнутр(ЗакодированноеОписание));
	Возврат Результат;
КонецФункции

// Формирование структуры описания обработчика
//
// Возвращаемое значение:
//	Структура - коллекция полей описания обработчика
Функция ОписаниеОбработчика() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Текст");
	Результат.Вставить("Параметры");
	
	Возврат Результат;
КонецФункции

// Формирование структуры описания параметров обработчиков
//
// Возвращаемое значение:
//	Структура - параметры выполнения действия
//
Функция СтруктураОбработчиков() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ПередВыполнением");
	Результат.Вставить("ПриВыполнении");
	Результат.Вставить("ПослеВыполнения");
	
	Возврат Результат;
КонецФункции

// Сформировать текстовое описание обработчика и параметров
//
// Параметры:
//	ДействиеОбъект - СправочникОбъект.АвтоматическиеСценарииДействия
//
// Возвращаемое значение:
//	Строка - закодированное в текст описание обработчика
//
Функция ВыгрузитьДействиеТекстовымОписанием(ДействиеОбъект) Экспорт
	МодульАвтоматическиеСценарииДействия = МодульКода("Справочники.АвтоматическиеСценарииДействия");
	Обработчики = МодульАвтоматическиеСценарииДействия.СтруктураОбработчиков();
	Для Каждого Обработчик Из Обработчики Цикл
		ПрефиксОбработчика = "Обработчик" + Обработчик.Ключ;
		Обработчики[Обработчик.Ключ] = ДействиеОбъект[ПрефиксОбработчика];
	КонецЦикла;	
		
	Возврат ЗначениеВСтрокуВнутр(Обработчики);		
КонецФункции

// Проверяем переданное действие, является ли оно предопределенным
//
// Параметры:
//	Действие - ПеречислениеСсылка.АвтоматическиеСценарииПредопределенноеДействие - действие АС
//
// Возвращаемое значение:
//	Булево - признак, что это предопределенное действие
// 
Функция ЭтоПредопределенноеДействие(Действие) Экспорт
	Возврат ТипЗнч(Действие) = Тип(
		"ПеречислениеСсылка." + МодульКода("Перечисления.АвтоматическиеСценарииПредопределенныеДействия").ИмяОбъекта()
	);		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверка и приведение к нормированному виду коллекции параметров автоматического сценария
//
// Параметры:
//	ТаблицаШаблон - ТаблицаЗначений - таблица параметров действия АС
//	КоллекцияПараметров - Соответствие - коллекция заполненных параметров АС
//
// Возвращаемое значение:
//	Соответствие - проверенные и нормированные значения параметров
//
Функция НормироватьПараметрыОбработчика(ТаблицаШаблон, КоллекцияПараметров)
	Если Не ЗначениеЗаполнено(ТаблицаШаблон) Тогда
		Возврат КоллекцияПараметров;
	КонецЕсли;
	
	Результат = Новый Соответствие;
	Для Каждого Строка Из ТаблицаШаблон Цикл
		ЗначениеПараметра = КоллекцияПараметров[Строка.Ключ];
		Если ЗначениеПараметра <> Неопределено И
			Строка.Тип.СодержитТип(ТипЗнч(ЗначениеПараметра)) 
		Тогда
			Результат.Вставить(Строка.Ключ, ЗначениеПараметра);		
		Иначе
		    Результат.Вставить(Строка.Ключ, Неопределено);
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область include_etrn_base_Modules_АвтоматическиеСценарии_Catalog_АвтоматическиеСценарииДействия_ИмяОбъекта
#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти