&НаКлиенте
Перем ДоступныеДействия;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ТекущийЭтап_УстановитьОграничениеТипа(Параметры.Основание) Тогда
		ВызватьИсключение "Не выбрано основание документа Saby";
	КонецЕсли;
	
	ДоступныеДействия_ЗаполнитьНаСервере(Параметры.Основание);
	
	Если Параметры.Свойство("ПараметрыДействия") Тогда
		ЗаполнитьПараметрыДействияНаСервере(Параметры.ПараметрыДействия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Действие_ЗаполнитьСписокВыбора();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТекущийЭтапПриИзменении(Элемент)
	Действие_ЗаполнитьСписокВыбора();
КонецПроцедуры

&НаКлиенте
Процедура ДействиеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	#Если ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
		ВыбранныйЭлемент = ВыбратьИзСписка(Элементы.Действие.СписокВыбора, Элементы.Действие);
		Действие_ПослеВыбора(ВыбранныйЭлемент);
	#Иначе
		ОписаниеОповещения_ = Новый ОписаниеОповещения("Действие_ПослеВыбора", ЭтаФорма);
		ПоказатьВыборИзСписка(ОписаниеОповещения_, Элементы.Действие.СписокВыбора, Элементы.Действие);
	#КонецЕсли
КонецПроцедуры

#КонецОбласти

#Область СобытияКоманд

&НаКлиенте
Процедура Применить(Команда)
	Если Не ПроверитьЗаполнениеПараметров() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметрыДействия = СформироватьПараметрыДействия();
	Закрыть(СтруктураПараметрыДействия);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ТекущийЭтап_УстановитьОграничениеТипа(Основание)
	Результат = Ложь;
	
	ТитулыОснования = ДоступныеОснования()[Основание];
	Если ТитулыОснования <> Неопределено Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(ТитулыОснования.ПустаяСсылка()));
		Элементы.ТекущийЭтап.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеОснования()
	Результат = Новый Соответствие;
	Результат.Вставить("Документ.ESD_ТранспортнаяНакладная", 
		Перечисления.ESD_ТипТитулаЭтрН);
	Результат.Вставить("Документ.ESD_ПутевойЛист", 
		Перечисления.ESD_ТипТитулаЭПЛ);
	Результат.Вставить("Документ.ESD_ЗаказНаПеревозку", 
		Перечисления.ESD_ТипТитулаЗнП);
	Результат.Вставить("Документ.ESD_ПоручениеЭкспедитору", 
		Перечисления.ESD_ТипТитулаЭПЭ);
	Результат.Вставить("Документ.ESD_ЭкспедиторскаяРасписка", 
		Перечисления.ESD_ТипТитулаЭЭР);
	Результат.Вставить("Документ.ESD_СкладскаяРасписка", 
		Перечисления.ESD_ТипТитулаЭСР);
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыДействияНаСервере(ПараметрыДействия)
	Если Не ЗначениеЗаполнено(ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыДействияНаСервере_ПередВыполнением(ПараметрыДействия["ПередВыполнением"]);
	ЗаполнитьПараметрыДействияНаСервере_ПриВыполнении(ПараметрыДействия["ПриВыполнении"]);
	ЗаполнитьПараметрыДействияНаСервере_ПослеВыполнения(ПараметрыДействия["ПослеВыполнения"]);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыДействияНаСервере_ПередВыполнением(ПараметрыОбработчика)
	Если Не ЗначениеЗаполнено(ПараметрыОбработчика) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ТекущийЭтап = ПараметрыОбработчика["ТекущийЭтап"];
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыДействияНаСервере_ПриВыполнении(ПараметрыОбработчика)
	Если Не ЗначениеЗаполнено(ПараметрыОбработчика) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Комментарий = ПараметрыОбработчика["Комментарий"];
	ЭтаФорма.Действие = ПараметрыОбработчика["Действие"];
	
	ЭтаФорма.Исполнители.Очистить();
	Для Каждого Исполнитель_ Из ПараметрыОбработчика["Исполнители"] Цикл
		НоваяСтрока = ЭтаФорма.Исполнители.Добавить();
		НоваяСтрока.Исполнитель = Исполнитель_.Значение;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыДействияНаСервере_ПослеВыполнения(ПараметрыОбработчика)
КонецПроцедуры

&НаКлиенте
Функция СформироватьПараметрыДействия()
	ПараметрыПередВыполнением = Новый Структура("ТекущийЭтап", ЭтаФорма.ТекущийЭтап);
	ПараметрыПриВыполнении = Новый Структура("Действие,Комментарий", ЭтаФорма.Действие, ЭтаФорма.Комментарий);
	
	Исполнители_ = Новый СписокЗначений;
	Для Каждого Строка Из ЭтаФорма.Исполнители Цикл
		Исполнители_.Добавить(Строка.Исполнитель);
	КонецЦикла;
	ПараметрыПриВыполнении.Вставить("Исполнители", Исполнители_);
	
	Возврат Новый Структура("ПередВыполнением,ПриВыполнении,ПослеВыполнения",
		ПараметрыПередВыполнением,
		ПараметрыПриВыполнении,
		Новый Структура);
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеПараметров()
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Истина;
	Если Не ЗначениеЗаполнено(ЭтаФорма.ТекущийЭтап) Тогда
		Результат = Ложь;
		Сообщить("Не заполнена фаза закрытия");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Действие_ЗаполнитьСписокВыбора()
	Элементы.Действие.СписокВыбора.Очистить();
	Для Каждого ДоступноеДействие_ Из Действие_ДоступныеЗначения(ЭтаФорма.ТекущийЭтап) Цикл
		Элементы.Действие.СписокВыбора.Добавить(ДоступноеДействие_.Действие);		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Действие_ПослеВыбора(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Действие = Результат;
КонецПроцедуры

&НаКлиенте
Функция Действие_ДоступныеЗначения(Этап)
	СтруктураОтбора_ = Новый Структура("Этап", Этап);
	Возврат ЭтаФорма.ДоступныеЭтапыДействия.НайтиСтроки(СтруктураОтбора_);
КонецФункции

&НаСервере
Процедура ДоступныеДействия_ЗаполнитьНаСервере(Основание)
	Если Основание = "Документ.ESD_ТранспортнаяНакладная" Тогда
		ДоступныеДействия_ = Действие_ДоступныеЗначения_ЭТрН_ДобавитьНаСервере();		
	ИначеЕсли Основание = "Документ.ESD_ПутевойЛист" Тогда
		ДоступныеДействия_ = Действие_ДоступныеЗначения_ЭПЛ_ДобавитьНаСервере();
	ИначеЕсли Основание = "Документ.ESD_ЗаказНаПеревозку" Тогда
		ДоступныеДействия_ = Действие_ДоступныеЗначения_ЭЗЗ_ДобавитьНаСервере();
	ИначеЕсли Основание = "Документ.ESD_ПоручениеЭкспедитору" Тогда
		ДоступныеДействия_ = Действие_ДоступныеЗначения_ЭПЭ_ДобавитьНаСервере();
	ИначеЕсли Основание = "Документ.ESD_ЭкспедиторскаяРасписка" Тогда
		ДоступныеДействия_ = Действие_ДоступныеЗначения_ЭЭР_ДобавитьНаСервере();
	ИначеЕсли Основание = "Документ.ESD_СкладскаяРасписка" Тогда
		ДоступныеДействия_ = Действие_ДоступныеЗначения_ЭСР_ДобавитьНаСервере();
	Иначе
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ДоступныеЭтапыДействия.Очистить();
	
	Элементы.ТекущийЭтап.РежимВыбораИзСписка = Истина;
	Элементы.ТекущийЭтап.СписокВыбора.Очистить();
	Для Каждого КлючЗначение Из ДоступныеДействия_ Цикл
		Элементы.ТекущийЭтап.СписокВыбора.Добавить(КлючЗначение.Ключ);
		Для Каждого Действие_ Из КлючЗначение.Значение Цикл
			НоваяСтрока_ = ЭтаФорма.ДоступныеЭтапыДействия.Добавить();
			НоваяСтрока_.Этап = КлючЗначение.Ключ;
			НоваяСтрока_.Действие = Действие_;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция Действие_ДоступныеЗначения_ЭПЛ_ДобавитьНаСервере()
	СоответствиеЗначений = Новый Соответствие;
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Отправить");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЛ.Выпуск, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Допущен");
	Массив_.Добавить("Не допущен");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЛ.ПредрейсовыйМедосмотр, Массив_);
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЛ.ПредрейсовыйТехосмотр, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Выпущен");
	Массив_.Добавить("Завершить");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЛ.Выпускающий, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Принят");
	Массив_.Добавить("На медосмотр");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЛ.Принимающий, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Проведен");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЛ.ПослерейсовыйМедосмотр, Массив_);
	
	Возврат СоответствиеЗначений;
КонецФункции

&НаСервереБезКонтекста
Функция Действие_ДоступныеЗначения_ЭЗЗ_ДобавитьНаСервере()
	СоответствиеЗначений = Новый Соответствие;
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Отправить");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЗнП.Оформление, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Утвердить");
	Массив_.Добавить("Отклонить");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЗнП.Утверждение, Массив_);
	
	Возврат СоответствиеЗначений;
КонецФункции

&НаСервереБезКонтекста
Функция Действие_ДоступныеЗначения_ЭТрН_ДобавитьНаСервере()
	СоответствиеЗначений = Новый Соответствие;
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Погружен");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭТрН.Погрузка, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Принят");
	Массив_.Добавить("Не принят");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭТрН.ПолучениеГруза, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Получен");
	Массив_.Добавить("Получен частично");
	Массив_.Добавить("Не принят");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭТрН.ПриемкаГруза, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Выдан");
	Массив_.Добавить("Выдан частично");
	Массив_.Добавить("Не выдан");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭТрН.ВыдачаГруза, Массив_);
	
	Возврат СоответствиеЗначений;
КонецФункции

&НаСервереБезКонтекста
Функция Действие_ДоступныеЗначения_ЭПЭ_ДобавитьНаСервере()
	СоответствиеЗначений = Новый Соответствие;
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Отправить");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЭ.ИнформацияКлиента, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Утвердить");
	Массив_.Добавить("Отклонить");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЭ.ИнформацияЭкспедитора, Массив_);

	Возврат СоответствиеЗначений;
КонецФункции

&НаСервереБезКонтекста
Функция Действие_ДоступныеЗначения_ЭЭР_ДобавитьНаСервере()
	СоответствиеЗначений = Новый Соответствие;

	Массив_ = Новый Массив;
	Массив_.Добавить("Отправить");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭЭР.ИнформацияЭкспедитора, Массив_);
	
	Возврат СоответствиеЗначений;
КонецФункции

&НаСервереБезКонтекста
Функция Действие_ДоступныеЗначения_ЭСР_ДобавитьНаСервере()
	СоответствиеЗначений = Новый Соответствие;
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Отправить");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭСР.ИнформацияЭкспедитора, Массив_);
	
	Возврат СоответствиеЗначений;
КонецФункции

#КонецОбласти
