#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ОснованиеЯвляетсяДокументомSaby(Параметры.Основание) Тогда
		ВызватьИсключение "Не выбрано основание документа Saby";
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрыДействия") Тогда
		ЗаполнитьПараметрыДействияНаСервере(Параметры.ПараметрыДействия);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияКоманд

&НаКлиенте
Процедура Применить(Команда)
	Если Не ПроверитьЗаполнениеПараметров() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметрыДействия = СформироватьПараметрыДействия();
	Закрыть(СтруктураПараметрыДействия);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОснованиеЯвляетсяДокументомSaby(Основание)
	Результат = Ложь;
	
	ТитулыОснования = ДоступныеОснования()[Основание];
	Если ТитулыОснования <> Неопределено Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(ТитулыОснования.ПустаяСсылка()));
		Элементы.ТекущийЭтап.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеОснования()
	Результат = Новый Соответствие;
	Результат.Вставить("Документ.ESD_ТранспортнаяНакладная", Перечисления.ESD_ТипТитулаЭтрН);
	Результат.Вставить("Документ.ESD_ПутевойЛист", Перечисления.ESD_ТипТитулаЭПЛ);
	Результат.Вставить("Документ.ESD_ЗаказНаПеревозку", Перечисления.ESD_ТипТитулаЗнП);
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыДействияНаСервере(ПараметрыДействия)
	Если Не ЗначениеЗаполнено(ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыДействияНаСервере_ПередВыполнением(ПараметрыДействия["ПередВыполнением"]);
	ЗаполнитьПараметрыДействияНаСервере_ПриВыполнении(ПараметрыДействия["ПриВыполнении"]);
	ЗаполнитьПараметрыДействияНаСервере_ПослеВыполнения(ПараметрыДействия["ПослеВыполнения"]);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыДействияНаСервере_ПередВыполнением(ПараметрыОбработчика)
	Если Не ЗначениеЗаполнено(ПараметрыОбработчика) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ТекущийЭтап = ПараметрыОбработчика["ТекущийЭтап"];
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыДействияНаСервере_ПриВыполнении(ПараметрыОбработчика)
	Если Не ЗначениеЗаполнено(ПараметрыОбработчика) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Комментарий = ПараметрыОбработчика["Комментарий"];
	ЭтаФорма.Действие = ПараметрыОбработчика["Действие"];
	
	ЭтаФорма.Исполнители.Очистить();
	Для Каждого Исполнитель_ Из ПараметрыОбработчика["Исполнители"] Цикл
		НоваяСтрока = ЭтаФорма.Исполнители.Добавить();
		НоваяСтрока.Исполнитель = Исполнитель_.Значение;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыДействияНаСервере_ПослеВыполнения(ПараметрыОбработчика)
КонецПроцедуры

&НаКлиенте
Функция СформироватьПараметрыДействия()
	ПараметрыПередВыполнением = Новый Структура("ТекущийЭтап", ЭтаФорма.ТекущийЭтап);
	ПараметрыПриВыполнении = Новый Структура("Действие,Комментарий", ЭтаФорма.Действие, ЭтаФорма.Комментарий);
	
	Исполнители_ = Новый СписокЗначений;
	Для Каждого Строка Из ЭтаФорма.Исполнители Цикл
		Исполнители_.Добавить(Строка.Исполнитель);
	КонецЦикла;
	ПараметрыПриВыполнении.Вставить("Исполнители", Исполнители_);
	
	Возврат Новый Структура("ПередВыполнением,ПриВыполнении,ПослеВыполнения",
		ПараметрыПередВыполнением,
		ПараметрыПриВыполнении,
		Новый Структура);
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеПараметров()
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Истина;
	Если Не ЗначениеЗаполнено(ЭтаФорма.ТекущийЭтап) Тогда
		Результат = Ложь;
		Сообщить("Не заполнена фаза закрытия");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти
