&НаКлиенте
Перем ДоступныеДействия;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ОснованиеЯвляетсяДокументомSaby(Параметры.Основание) Тогда
		ВызватьИсключение "Не выбрано основание документа Saby";
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрыДействия") Тогда
		ЗаполнитьПараметрыДействияНаСервере(Параметры.ПараметрыДействия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступныеДействия = Действие_ДоступныеЗначенияНаСервере();
	Действие_ЗаполнитьСписокВыбора();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТекущийЭтапПриИзменении(Элемент)
	Действие_ЗаполнитьСписокВыбора();
КонецПроцедуры

&НаКлиенте
Процедура ДействиеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	#Если ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
		ВыбранныйЭлемент = ВыбратьИзСписка(Элементы.Действие.СписокВыбора, Элементы.Действие);
		Действие_ПослеВыбора(ВыбранныйЭлемент);
	#Иначе
		ОписаниеОповещения_ = Новый ОписаниеОповещения("Действие_ПослеВыбора", ЭтаФорма);
		ПоказатьВыборИзСписка(ОписаниеОповещения_, Элементы.Действие.СписокВыбора, Элементы.Действие);
	#КонецЕсли
КонецПроцедуры

#КонецОбласти

#Область СобытияКоманд

&НаКлиенте
Процедура Применить(Команда)
	Если Не ПроверитьЗаполнениеПараметров() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметрыДействия = СформироватьПараметрыДействия();
	Закрыть(СтруктураПараметрыДействия);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОснованиеЯвляетсяДокументомSaby(Основание)
	Результат = Ложь;
	
	ТитулыОснования = ДоступныеОснования()[Основание];
	Если ТитулыОснования <> Неопределено Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(ТитулыОснования.ПустаяСсылка()));
		Элементы.ТекущийЭтап.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеОснования()
	Результат = Новый Соответствие;
	Результат.Вставить("Документ.ESD_ТранспортнаяНакладная", Перечисления.ESD_ТипТитулаЭтрН);
	Результат.Вставить("Документ.ESD_ПутевойЛист", Перечисления.ESD_ТипТитулаЭПЛ);
	Результат.Вставить("Документ.ESD_ЗаказНаПеревозку", Перечисления.ESD_ТипТитулаЗнП);
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыДействияНаСервере(ПараметрыДействия)
	Если Не ЗначениеЗаполнено(ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыДействияНаСервере_ПередВыполнением(ПараметрыДействия["ПередВыполнением"]);
	ЗаполнитьПараметрыДействияНаСервере_ПриВыполнении(ПараметрыДействия["ПриВыполнении"]);
	ЗаполнитьПараметрыДействияНаСервере_ПослеВыполнения(ПараметрыДействия["ПослеВыполнения"]);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыДействияНаСервере_ПередВыполнением(ПараметрыОбработчика)
	Если Не ЗначениеЗаполнено(ПараметрыОбработчика) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ТекущийЭтап = ПараметрыОбработчика["ТекущийЭтап"];
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыДействияНаСервере_ПриВыполнении(ПараметрыОбработчика)
	Если Не ЗначениеЗаполнено(ПараметрыОбработчика) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Комментарий = ПараметрыОбработчика["Комментарий"];
	ЭтаФорма.Действие = ПараметрыОбработчика["Действие"];
	
	ЭтаФорма.Исполнители.Очистить();
	Для Каждого Исполнитель_ Из ПараметрыОбработчика["Исполнители"] Цикл
		НоваяСтрока = ЭтаФорма.Исполнители.Добавить();
		НоваяСтрока.Исполнитель = Исполнитель_.Значение;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыДействияНаСервере_ПослеВыполнения(ПараметрыОбработчика)
КонецПроцедуры

&НаКлиенте
Функция СформироватьПараметрыДействия()
	ПараметрыПередВыполнением = Новый Структура("ТекущийЭтап", ЭтаФорма.ТекущийЭтап);
	ПараметрыПриВыполнении = Новый Структура("Действие,Комментарий", ЭтаФорма.Действие, ЭтаФорма.Комментарий);
	
	Исполнители_ = Новый СписокЗначений;
	Для Каждого Строка Из ЭтаФорма.Исполнители Цикл
		Исполнители_.Добавить(Строка.Исполнитель);
	КонецЦикла;
	ПараметрыПриВыполнении.Вставить("Исполнители", Исполнители_);
	
	Возврат Новый Структура("ПередВыполнением,ПриВыполнении,ПослеВыполнения",
		ПараметрыПередВыполнением,
		ПараметрыПриВыполнении,
		Новый Структура);
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеПараметров()
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Истина;
	Если Не ЗначениеЗаполнено(ЭтаФорма.ТекущийЭтап) Тогда
		Результат = Ложь;
		Сообщить("Не заполнена фаза закрытия");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Действие_ЗаполнитьСписокВыбора()
	Элементы.Действие.СписокВыбора.Очистить();
	Для Каждого ДоступноеДействие_ Из Действие_ДоступныеЗначения(ЭтаФорма.ТекущийЭтап) Цикл
		Элементы.Действие.СписокВыбора.Добавить(ДоступноеДействие_);		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Действие_ПослеВыбора(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Действие = Результат;
КонецПроцедуры

&НаКлиенте
Функция Действие_ДоступныеЗначения(Этап)
	РезультатФункции = ДоступныеДействия[Этап];
	Если ТипЗнч(РезультатФункции) <> Тип("Массив") Тогда
		РезультатФункции = Новый Массив;
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

&НаСервереБезКонтекста
Функция Действие_ДоступныеЗначенияНаСервере()
	РезультатФункции = Новый Соответствие;
	
	Действие_ДоступныеЗначения_ЭПЛ_ДобавитьНаСервере(РезультатФункции);
	Действие_ДоступныеЗначения_ЭЗЗ_ДобавитьНаСервере(РезультатФункции);
	Действие_ДоступныеЗначения_ЭТрН_ДобавитьНаСервере(РезультатФункции);
	Действие_ДоступныеЗначения_ЭПЭ_ДобавитьНаСервере(РезультатФункции);
	Действие_ДоступныеЗначения_ЭЭР_ДобавитьНаСервере(РезультатФункции);
	Действие_ДоступныеЗначения_ЭСР_ДобавитьНаСервере(РезультатФункции);
	
	Возврат РезультатФункции;
КонецФункции

&НаСервереБезКонтекста
Процедура Действие_ДоступныеЗначения_ЭПЛ_ДобавитьНаСервере(СоответствиеЗначений)
	Массив_ = Новый Массив;
	Массив_.Добавить("Отправить");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЛ.Выпуск, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Допущен");
	Массив_.Добавить("Не допущен");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЛ.ПредрейсовыйМедосмотр, Массив_);
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЛ.ПредрейсовыйТехосмотр, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Выпущен");
	Массив_.Добавить("Завершить");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЛ.Выпускающий, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Принят");
	Массив_.Добавить("На медосмотр");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЛ.Принимающий, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Проведен");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭПЛ.ПослерейсовыйМедосмотр, Массив_);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Действие_ДоступныеЗначения_ЭЗЗ_ДобавитьНаСервере(СоответствиеЗначений)
	Массив_ = Новый Массив;
	Массив_.Добавить("Отправить");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЗнП.Оформление, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Утвердить");
	Массив_.Добавить("Отклонить");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЗнП.Утверждение, Массив_);	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Действие_ДоступныеЗначения_ЭТрН_ДобавитьНаСервере(СоответствиеЗначений)
	Массив_ = Новый Массив;
	Массив_.Добавить("Погружен");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭТрН.Погрузка, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Принят");
	Массив_.Добавить("Не принят");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭТрН.ПолучениеГруза, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Получен");
	Массив_.Добавить("Получен частично");
	Массив_.Добавить("Не принят");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭТрН.ПриемкаГруза, Массив_);
	
	Массив_ = Новый Массив;
	Массив_.Добавить("Выдан");
	Массив_.Добавить("Выдан частично");
	Массив_.Добавить("Не выдан");
	СоответствиеЗначений.Вставить(Перечисления.ESD_ТипТитулаЭТрН.ВыдачаГруза, Массив_);		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Действие_ДоступныеЗначения_ЭПЭ_ДобавитьНаСервере(СоответствиеЗначений)
			
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Действие_ДоступныеЗначения_ЭЭР_ДобавитьНаСервере(СоответствиеЗначений)
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Действие_ДоступныеЗначения_ЭСР_ДобавитьНаСервере(СоответствиеЗначений)
	
КонецПроцедуры

#КонецОбласти
