
// Возвращает двоичные данные файла печатной формы из Saby.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры загрузки
//  АдресФайлаSaby - Строка - адрес печатной формы pdf
//
// Возвращаемое значение:
//   Строка - адрес двоичных данных файла печатной формы.
//
//DynamicDirective
Функция АдресДвоичныхДанныхПечатнойФормы(ПараметрыЗагрузки, Знач АдресФайлаSaby = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(АдресФайлаSaby) Тогда
		// Если не получили адрес файла - попробуем повторно обратиться на онлайн
		МодульМенеджераЭПД = МодульКодаКлиент("Документы." + ПараметрыЗагрузки.ИмяМетаданных);
		РезультатSaby = МодульМенеджераЭПД.SabyСсылкаНаПечатнуюФормуЭПД(ПараметрыЗагрузки);
		Если РезультатSaby.Ошибка Или Не ЗначениеЗаполнено(РезультатSaby.Данные) Тогда
			Возврат РезультатSaby;
		КонецЕсли;
		АдресФайлаSaby = РезультатSaby.Данные;
	КонецЕсли;
	
	Если ПараметрыЗагрузки.Свойство("УстановитьПечатнуюФорму") Тогда
		ОбработатьИзменениеПечатнойФормы(АдресФайлаSaby, ПараметрыЗагрузки.УстановитьПечатнуюФорму);
	КонецЕсли;
	
	РезультатSaby = SabyЗагрузитьДанныеПоСсылке(ПараметрыЗагрузки, АдресФайлаSaby);
	Если РезультатSaby.Успешно Тогда	
		РезультатSaby.Данные = ПоместитьВоВременноеХранилище(РезультатSaby.Данные, 
			ПараметрыЗагрузки.УникальныйИдентификатор);
	Иначе
		РезультатSaby.Данные = "Ошибка загрузки печатного документа из Saby.
			|Для просмотра деталей используйте функционал ""Логирования"" на форме ""Настройки""";
	КонецЕсли;

	Возврат SabyРезультатВзаимодействияСОнлайном(Не РезультатSaby.Успешно, РезультатSaby.Данные);
КонецФункции

// Возвращает ссылку на печатную форму PDF
//
// Параметры:
//	ПараметрыЗагрузки - Структура - параметры загрузки данных из Saby
//
// Возвращаемое значение:
//	Строка, Неопределено - результат обращения в Saby
//
//DynamicDirective
Функция SabyСсылкаНаПечатнуюФорму(ПараметрыЗагрузки) Экспорт
	РезультатФункции = SabyРезультатВзаимодействияСОнлайном();
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.ИдентификаторСБИС) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Идентификатор", ПараметрыЗагрузки.ИдентификаторСБИС);
	ПараметрыМетода.Вставить("ДопПоля","Подстановки, Расширение");
	
	Попытка
		Результат = ВыполнитьМетодSaby_ПрочитатьДокумент(ПараметрыЗагрузки, ПараметрыМетода);
		РезультатФункции.Данные = Результат["СсылкаНаPDF"];
	Исключение	
		ИнфоОшибки = ИнформацияОбОшибке();
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			ПараметрыЗагрузки.СсылкаНаДокумент,
			"Загрузка печатной формы",
			ИнфоОшибки.Описание);
	КонецПопытки;
	
	Возврат РезультатФункции;
КонецФункции

