
Процедура ОбработатьИзменениеПечатнойФормы(АдресФайла, ПечатнаяФорма)
	АдресФайла = SabyСформироватьАдресФайлаПодВыбраннуюПечатнуюФорму(АдресФайла, ПечатнаяФорма);
КонецПроцедуры

Функция SabyСформироватьАдресФайлаПодВыбраннуюПечатнуюФорму(АдресФайла, ПечатнаяФорма)
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	СоставURL = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(АдресФайла, "?");
	Если СоставURL.Количество() < 2 Тогда
		// Отсутствуют параметры в адресе
		Возврат АдресФайла;
	КонецЕсли;
	
	СоставПараметровURL = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(СоставURL[1], "&");
	paramsURL = Неопределено;
	paramsIndex = 0;
	
	Для i = 0 По СоставПараметровURL.Количество() - 1 Цикл
		СоставПараметра = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(СоставПараметровURL[i], "=");
		Если СоставПараметра[0] = "params" Тогда
			paramsURL = СоставПараметра[1];
			paramsIndex = i;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	ОбновитьАдресФайла = Ложь;
	Если paramsURL <> Неопределено Тогда
		МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
		paramsJSON = МодульТНОбщегоНазначенияСервер.ДекодироватьURLВСтроку(paramsURL);
		params = МодульТНОбщегоНазначенияСервер.ДекодироватьJSON(paramsJSON);
		
		param = params["Params"];
		Для i = 0 По param["s"].Количество() - 1 Цикл
			col = param["s"][i];
			Если col["n"] = "ReqId" Тогда
				param["d"][i] = param["d"][i] + ПечатнаяФорма;
				ОбновитьАдресФайла = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
	Если Не ОбновитьАдресФайла Тогда
		Возврат АдресФайла;
	КонецЕсли;
	
	paramsJSON = МодульТНОбщегоНазначенияСервер.ЗакодироватьJSON(params);
	paramsURL = МодульТНОбщегоНазначенияСервер.КодироватьСтрокуВURL(paramsJSON);
	СоставПараметровURL[paramsIndex] = "params=" + paramsURL;
	ПараметрыURL = МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(СоставПараметровURL, "&");
	СоставURL[1] = ПараметрыURL;
	Возврат МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(СоставURL, "?");
КонецФункции

