
#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  КодСтрокой - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.Saby_МетодОпределенияМассы - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция МетодОпределенияМассыПоКоду(КодСтрокой) Экспорт
	
	// убираем лидирующий ноль
	СтандартнаяДлина = 1;
	Если СтрДлина(КодСтрокой) > СтандартнаяДлина Тогда
		Код = Прав(СокрЛП(КодСтрокой), 1);
	Иначе
		Код = КодСтрокой;
	КонецЕсли;	
	
	Если Код = "1" Тогда
		Результат = ЗначениеМетаданных("Saby_МетодОпределенияМассы.ВзвешиваниеПоОбщейМассе");
	ИначеЕсли Код = "2" Тогда
		Результат = ЗначениеМетаданных("Saby_МетодОпределенияМассы.ВзвешиваниеПоосно");
	ИначеЕсли Код = "3" Тогда
		Результат = ЗначениеМетаданных("Saby_МетодОпределенияМассы.Расчетный");
	Иначе
		Результат = ЗначениеМетаданных("Saby_МетодОпределенияМассы.ПустаяСсылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает соответствующий код по указанному значению перечисления.
//
// Параметры:
//  Значение  - ПеречислениеСсылка.Saby_МетодОпределенияМассы - значение перечисления
//  СНулем    - Булево - вернуть знаечение с лидирующим нулем
//
// Возвращаемое значение:
//   Строка - Строковое представление кода.
//
Функция КодПоМетодуОпределенияМассы(Значение, СНулем = Ложь) Экспорт
	
	Если Значение = ЗначениеМетаданных("Saby_МетодОпределенияМассы.ВзвешиваниеПоОбщейМассе") Тогда
		Код = "1";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_МетодОпределенияМассы.ВзвешиваниеПоосно") Тогда
		Код = "2";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_МетодОпределенияМассы.Расчетный") Тогда
		Код = "3";
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если СНулем Тогда
		Код = "0" + Код;
	КонецЕсли;
	
	Возврат Код;
		
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

