
#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  Код - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.Saby_МетодОпределенияМассы - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция ЗначениеПоКоду(Код) Экспорт
	
	// убираем лидирующий ноль
	СтандартнаяДлина = 1;
	Если СтрДлина(Код) > СтандартнаяДлина Тогда
		Код = Прав(СокрЛП(Код), 1);
	КонецЕсли;	
	
	Если Код = "1" Тогда
		Возврат ВзвешиваниеПоОбщейМассе;
	ИначеЕсли Код = "2" Тогда
		Возврат ВзвешиваниеПоосно;
	ИначеЕсли Код = "3" Тогда
		Возврат Расчетный;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующий код по указанному значению перечисления.
//
// Параметры:
//  Значение  - ПеречислениеСсылка.Saby_МетодОпределенияМассы - значение перечисления
//  СНулем    - Булево - вернуть знаечение с лидирующим нулем
//
// Возвращаемое значение:
//   Строка - Строковое представление кода.
//
Функция КодПоЗначению(Значение, СНулем = Ложь) Экспорт
	
	Если Значение = ВзвешиваниеПоОбщейМассе Тогда
		Код = "1";
	ИначеЕсли Значение = ВзвешиваниеПоосно Тогда
		Код = "2";
	ИначеЕсли Значение = Расчетный Тогда
		Код = "3";
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если СНулем Тогда
		Код = "0" + Код;
	КонецЕсли;
	
	Возврат Код;
		
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
