
Функция КодироватьСтрокуВURL(СтрокаДляКодирования)
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
    
    Запись = Новый ЗаписьТекста(ВременныйФайл, КодировкаТекста.UTF8);
    Запись.Записать(СтрокаДляКодирования);
    Запись.Закрыть();
    
    ДвоичныеДанные = Новый ДвоичныеДанные(ВременныйФайл);
    ЗакодированныеДанные = Base64Строка(ДвоичныеДанные);
    
    // BSLLS:UsingSynchronousCalls-off
    УдалитьФайлы(ВременныйФайл);
    // BSLLS:UsingSynchronousCalls-on

    Выполнить("ЗакодированныеДанные = КодироватьСтроку(ЗакодированныеДанные, СпособКодированияСтроки.КодировкаURL)");

	Возврат ЗакодированныеДанные;
	
КонецФункции

