
// Формирует печатную форму документа или QR-кода
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - источник перехода
//  ЗаголовокПечатнойФормы - Строка - заголовок печатной формы QR-кода
//  ЭтоФормаСписка - Булево - признак формы
//  ВыборПечатнойФормы - Булево - признак выбора печатной формы перед печатью
//
&НаКлиенте
Процедура ПечатьДокумента(Форма, ЗаголовокПечатнойФормы = "", ЭтоФормаСписка = Ложь, ВыборПечатнойФормы = Ложь) Экспорт
	// Сформируем параметры печати
	ПараметрыПечати = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыПечати(
		Форма.УникальныйИдентификатор,
		ЗаголовокПечатнойФормы,
		ЭтоФормаСписка, 
		ВыборПечатнойФормы);
	ПараметрыПечати.Вставить("Форма", Форма);
	
	// Обработаем начало печати
	ПередВыполнениемПечати(Форма, ПараметрыПечати);
	
	// Определим обработчик оповещения
	ПроцедураОткрытьПечатнуюФорму = Новый ОписаниеОповещения("ПечатнаяФорма_ПередФормированием",
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент"), ПараметрыПечати);
		
	ПроверитьМодифицированностьИПродолжитьВыполнение(ПроцедураОткрытьПечатнуюФорму);
КонецПроцедуры

