
&НаКлиенте
Процедура ПослеПодготовкиПараметровПечати(ПараметрыПечати) Экспорт
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнениемПечати(Форма, ПараметрыПечати)
	ФормаОбъект = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ФормаОбъект(Форма);
	Если Не ПараметрыПечати.ЭтоФормаСписка И ФормаОбъект.Ссылка.Пустая() Тогда
		Форма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлПечатнойФормыВESD(Результат, ПараметрыПечати)
	ДанныеФайла = Неопределено;
	
	Если ЗначениеЗаполнено(Результат.АдресДвоичныхДанных) Тогда			
		ДанныеФайла = Новый Структура("Расширение, СсылкаНаДвоичныеДанныеФайла");			
		ДанныеФайла.Расширение                  = "pdf";
		ДанныеФайла.СсылкаНаДвоичныеДанныеФайла = Результат.АдресДвоичныхДанных;	
	ИначеЕсли ЗначениеЗаполнено(Результат.СсылкаНаПрисоединенныйФайл) Тогда	
		ДанныеФайла = МодульКодаКлиент("ESD_РаботаСФайлами").ДанныеФайла(
			Результат.СсылкаНаПрисоединенныйФайл, 
			Неопределено, 
			ПараметрыПечати.УникальныйИдентификатор);					
    Иначе		
		ОткрытьСсылкуИзСпискаДокументов(Результат);
		Возврат;
	КонецЕсли;	
	
	Если ДанныеФайла <> Неопределено Тогда
		МодульКодаКлиент("ESD_РаботаСФайламиКлиент").ОткрытьФайлЧерезПриложение(ДанныеФайла);		
    КонецЕсли;
КонецПроцедуры

