
&НаКлиенте
Процедура ПечатнаяФорма_Сформировать(Результат, ПараметрыПечати) Экспорт
	ПараметрыПечати.Удалить("Форма");
	
	РезультатСоздания = ПечатнаяФорма_Создать(ПараметрыПечати);
	ПечатнаяФорма_Отобразить(РезультатСоздания, ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПечатнаяФорма_ПередФормированием(Результат, ПараметрыПечати) Экспорт
	ПодготовитьПараметрыПечати(ПараметрыПечати);
	Если Не ПараметрыПечати.Свойство("СсылкаНаДокумент") Тогда
		Возврат;
	КонецЕсли;
	
	ВыборПечатнойФормы = ПараметрыПечати.ВыборПечатнойФормы;
	ПараметрыПечати.Удалить("ВыборПечатнойФормы");
	Если ВыборПечатнойФормы Тогда
		ПечатнаяФорма_ОткрытьФормуВыбора(ПараметрыПечати);
	Иначе
		ПечатнаяФорма_Сформировать(Неопределено, ПараметрыПечати);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатнаяФорма_ОткрытьФормуВыбора(Параметры) Экспорт
	// Определение параметров формы
	ПараметрыФормы = Новый Структура("Основание, ЭтоВО"
		, Параметры.СсылкаНаДокумент
		, Параметры.Форма.ЭтоВО
	);
	
	// Определения оповещения
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатнаяФорма_ПослеВыбора"
		, МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		, Параметры);
		
	// Открытие формы
	ОткрытьФорму("ОбщаяФорма." + ВыборПечатнойФормыКлиент()
		, ПараметрыФормы
		, Параметры.Форма
		, , ,
		, ОписаниеОповещения
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	 
КонецПроцедуры
	
&НаКлиенте
Процедура ПечатнаяФорма_ПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Id) Тогда
		ДополнительныеПараметры.Вставить("УстановитьПечатнуюФорму", Результат.Id);
	КонецЕсли;
	
	ПечатнаяФорма_Сформировать(Неопределено, ДополнительныеПараметры);
КонецПроцедуры

&НаКлиенте
Функция ПечатнаяФорма_Создать(ПараметрыПечати) Экспорт
	Результат = МодульКодаКлиент("ESD_ТНОбщегоНазначенияСервер").SabyДанныеПечатнойФормы(ПараметрыПечати);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПечатнаяФорма_Отобразить(Результат, ПараметрыПечати) Экспорт
	ОткрытьФайлПечатнойФормыВESD(Результат, ПараметрыПечати);
КонецПроцедуры

