
// Создание реквизита и элемента формы с последующим заполнением данных
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма
//  ВладелецСтраницы - ГруппаФормы - элемент "ГруппаФормы" вида "Страницы"
//
// Возвращаемое значение:
//	ГруппаФормы - добавленный элемент формы
Функция События_СоздатьСтраницу(Форма, ВладелецСтраницы) Экспорт
	ЭлементыФормы = События_ЭлементыФормы(Форма);
	
	ИмяСтраницы = "ESD_События_Страница";
	Страница_ = ЭлементыФормы.Найти(ИмяСтраницы);
	Если Страница_ = Неопределено Тогда
		Страница_ = ЭлементыФормы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), ВладелецСтраницы);
		Страница_.Заголовок = "События";
		Страница_.Вид = ВидГруппыФормы.Страница;
		Страница_.Видимость = Истина;
		
		События_ДобавитьРеквизиты(Форма);
		События_СоздатьГруппу(Форма, Страница_);		
	КонецЕсли;
	
	// Перенесем признак "ТолькоПросмотр" с формы на страницу
	Страница_.ТолькоПросмотр = Форма.ТолькоПросмотр;
	
	Возврат Страница_;
КонецФункции

Функция События_СоздатьГруппу(Форма, ГруппаВладелец) Экспорт
	ЭлементыФормы_ = События_ЭлементыФормы(Форма);
	
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.События_ИмяРеквизита();
	ЭлементФормы_ = ЭлементыФормы_.Найти(ИмяРеквизита_);
	Если ЭлементФормы_ = Неопределено Тогда
		ЭлементФормы = ЭлементыФормы_.Добавить(ИмяРеквизита_, Тип("ПолеФормы"), ГруппаВладелец);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормы.ПутьКДанным = ИмяРеквизита_;
		ЭлементФормы.РастягиватьПоГоризонтали = Истина;
		ЭлементФормы.РастягиватьПоВертикали = Истина;
		ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
		ЭлементФормы.АвтоМаксимальнаяВысота = Ложь;
		ЭлементФормы.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// Перенесем признак "ТолькоПросмотр" с формы на элемент
	ЭлементФормы.ТолькоПросмотр = Форма.ТолькоПросмотр;
	ЭлементФормы.Доступность = Форма.Доступность;
	
	Возврат ЭлементФормы;
КонецФункции

Функция События_ДобавитьРеквизиты(Форма) Экспорт
	НовыеРеквизиты = Новый Массив;
	
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.События_ИмяРеквизита();
	Если ESD_ТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(Форма, ИмяРеквизита_) Тогда
		Возврат НовыеРеквизиты;		
	КонецЕсли;
	
	РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита_, Новый ОписаниеТипов("ТабличныйДокумент"));
	НовыеРеквизиты.Добавить(РеквизитФормы);
	
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);
	
	Возврат НовыеРеквизиты;
КонецФункции

