
Функция События_ТабличныйДокументИзSaby(СсылкаНаДокумент, ДополнительныеПараметры, СлужебныеПараметры) Экспорт
	// Загрузим список событий
	СписокСобытий = События_Загрузить(СсылкаНаДокумент, СлужебныеПараметры.context_params);
	Возврат События_СформироватьТабличныйДокумент(СсылкаНаДокумент, СписокСобытий, ДополнительныеПараметры, СлужебныеПараметры);
КонецФункции

Функция События_ТабличныйДокументИз1С(СсылкаНаДокумент, ДополнительныеПараметры, СлужебныеПараметры) Экспорт
	СписокДанных = РегистрыСведений.ESD_ДанныеСобытий.Таблица(СсылкаНаДокумент, , Ложь);
	Возврат События_СформироватьТабличныйДокумент(СсылкаНаДокумент, СписокДанных, ДополнительныеПараметры, СлужебныеПараметры);	
КонецФункции

Функция События_Загрузить(СсылкаНаДокумент, context_params = Неопределено) Экспорт
	ИдентификаторДокумента = РегистрыСведений
		.ESD_СостоянияОбъектовИнтеграции.СостояниеПоОбъекту(СсылкаНаДокумент).Идентификатор;
	Если Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ДанныеДокумента = Новый Структура("ИмяМетаданных, ИдентификаторДокумента, ИзРасширения", 
		СсылкаНаДокумент.Метаданные().Имя, 
		ИдентификаторДокумента,
		Истина);
	
	Возврат События_ЗагрузитьДанныеЭПД(ДанныеДокумента, context_params);	
КонецФункции

