
Функция События_ТабличныйДокументИзSaby(СсылкаНаДокумент, context_params = Неопределено, ВывестиТекущийЭтап = Истина, ОтображатьСлужебные = Ложь) Экспорт
	// Загрузим список событий
	СписокСобытий = События_Загрузить(СсылкаНаДокумент, context_params);
	Возврат События_СформироватьТабличныйДокумент(СсылкаНаДокумент, СписокСобытий, ВывестиТекущийЭтап, ОтображатьСлужебные);
КонецФункции

Функция События_ТабличныйДокументИз1С(СсылкаНаДокумент, ВывестиТекущийЭтап = Истина, ОтображатьСлужебные = Ложь) Экспорт
	ПараметрыОтбора = Новый Структура;
	Если Не ОтображатьСлужебные Тогда
		ПараметрыОтбора.Вставить("Служебное", Ложь);
	КонецЕсли;
	
	СписокДанных = РегистрыСведений.ESD_ДанныеСобытий.Таблица(СсылкаНаДокумент, ПараметрыОтбора, Ложь);
	Возврат События_СформироватьТабличныйДокумент(СсылкаНаДокумент, СписокДанных, ВывестиТекущийЭтап, Истина);	
КонецФункции

Функция События_Загрузить(СсылкаНаДокумент, context_params = Неопределено) Экспорт
	ИдентификаторДокумента = РегистрыСведений
		.ESD_СостоянияОбъектовИнтеграции.СостояниеПоОбъекту(СсылкаНаДокумент).Идентификатор;
	Если Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ДанныеДокумента = Новый Структура("ИмяМетаданных, ИдентификаторДокумента, ИзРасширения", 
		СсылкаНаДокумент.Метаданные().Имя, 
		ИдентификаторДокумента,
		Истина);
	
	Возврат События_ЗагрузитьДанныеЭПД(ДанныеДокумента, context_params);	
КонецФункции

