
Функция События_ЗагрузитьДанныеЭПД(ПараметрыЗагрузки, ЗНАЧ context_params = Неопределено) Экспорт
	Перем ОбработанныеДанныеСобытий;
	
	Если context_params = Неопределено Тогда
		context_params = ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД();
		Если Не ЗначениеЗаполнено(context_params) Тогда
			Возврат ОбработанныеДанныеСобытий;
		КонецЕсли;		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("context_params, ДопПараметры", 
		context_params, ПараметрыЗагрузки);
	СтруктураПараметров.Вставить("ИгнорироватьДанныеБезПодстановки", Истина);
	РезультатЗагрузки = ESD_ТНЗагрузкаСервер.ЗагрузитьСписокИзмененийДокументов(СтруктураПараметров);
	Если Не ЗначениеЗаполнено(РезультатЗагрузки) Тогда
		Возврат ОбработанныеДанныеСобытий;
	КонецЕсли;
	
	События_ЗаписатьСтатистику();
		
	Для Каждого КлючЗначение Из РезультатЗагрузки Цикл
		ДанныеДокумента = КлючЗначение.Значение;
		ОбработанныеДанныеСобытий = События_ОбработатьСписок(ДанныеДокумента["Событие"]);	
	КонецЦикла;
	
	Возврат ОбработанныеДанныеСобытий;
КонецФункции

Функция События_СформироватьТабличныйДокумент(СсылкаНаДокумент, СписокДанных, ВывестиТекущийЭтап = Истина, ОтображатьСлужебные = Ложь) Экспорт
	ТабличныйДокумент = События_ШаблонТабличногоДокумента();
	
	Если Не ОтображатьСлужебные Тогда
		// Удалим "служебные" события
		События_УдалитьСлужебные(СписокДанных);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СписокДанных) Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;

	Макет = События_Макет();
	
	События_ВывестиДанныеВТабличныйДокумент(ТабличныйДокумент, СписокДанных[0], Макет);
	Для i = 1 По СписокДанных.Количество() - 1 Цикл
		События_ВывестиРазделительВТабличныйДокумент(ТабличныйДокумент, Макет);
		События_ВывестиДанныеВТабличныйДокумент(ТабличныйДокумент, СписокДанных[i], Макет);
	КонецЦикла;
	
	Если ВывестиТекущийЭтап Тогда
		ДанныеСостоянияОбъекта = ESD_ТНОбщегоНазначенияСервер.ДанныеСостоянияОбъекта(СсылкаНаДокумент);
		Если ДанныеСостоянияОбъекта <> Неопределено
			И ЗначениеЗаполнено(ДанныеСостоянияОбъекта.АктивныйЭтап) 
		Тогда
			// Добавим новую строку
			СтруктураОбъекта = События_СтруктураОбъекта();
			СтруктураОбъекта.ДатаВремя = ТекущаяДатаСеанса();
			
			СтруктураОбъекта.Название = Документы[СсылкаНаДокумент.Метаданные().Имя].Подключаемый_События_НазваниеТекущегоЭтапа(
				ДанныеСостоянияОбъекта.АктивныйЭтап, СсылкаНаДокумент);
			
			// Выведем в табличный документ
			События_ВывестиРазделительВТабличныйДокумент(ТабличныйДокумент, Макет);
			События_ВывестиДанныеВТабличныйДокумент(ТабличныйДокумент, СтруктураОбъекта, Макет, Истина);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
КонецФункции 

Функция События_ОбработатьСписок(СписокДанных) Экспорт
	РезультатФункции = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СписокДанных) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Для i = 0 По СписокДанных.Количество() - 1 Цикл
		ОбработанныеДанныеСобытия = События_ОбработатьДанные(СписокДанных[i]);
		Если ОбработанныеДанныеСобытия = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатФункции.Добавить(ОбработанныеДанныеСобытия);
	КонецЦикла;
	
	Возврат РезультатФункции;
КонецФункции

Функция События_ОбработатьДанные(ДанныеСобытия, ИсключитьСлужебныеСобытия = Истина) Экспорт
	Если Не ЗначениеЗаполнено(ДанныеСобытия["Идентификатор"]) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураОбъекта = События_СтруктураОбъекта();
	
	СтруктураОбъекта.Идентификатор = ДанныеСобытия["Идентификатор"];
	СтруктураОбъекта.Название      = ДанныеСобытия["Название"];
	СтруктураОбъекта.Комментарий   = ДанныеСобытия["Комментарий"];
	
	Если ЗначениеЗаполнено(ДанныеСобытия["ДатаВремяДокумента"]) Тогда
		СтруктураОбъекта.ДатаВремя = ДанныеСобытия["ДатаВремяДокумента"];
	Иначе
		СтруктураОбъекта.ДатаВремя = ДанныеСобытия["ДатаВремя"];
	КонецЕсли;
	
	ДанныеИсполнителя = ДанныеСобытия["Исполнитель"];
	Если ЗначениеЗаполнено(ДанныеИсполнителя) Тогда
		СтруктураОбъекта.ИсполнительИмя           = ДанныеИсполнителя["Имя"];
		СтруктураОбъекта.ИсполнительФамилия       = ДанныеИсполнителя["Фамилия"];
		СтруктураОбъекта.ИсполнительОтчество      = ДанныеИсполнителя["Отчество"];
		СтруктураОбъекта.ИсполнительИдентификатор = ДанныеИсполнителя["Идентификатор"];
	КонецЕсли;
	
	СтруктураОбъекта.Служебное = ESD_ОбщийФункционалКлиентСервер.События_ЭтоСлужебное(ДанныеСобытия["Название"]);
	
	ДанныеДействия = ДанныеСобытия["Действие"];
	Если ЗначениеЗаполнено(ДанныеДействия) Тогда
		СтруктураОбъекта.ДействиеНазвание      = ДанныеДействия["Название"];
		СтруктураОбъекта.ДействиеИдентификатор = ДанныеДействия["Идентификатор"];
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
КонецФункции

Функция События_Макет() Экспорт
	Возврат РегистрыСведений.ESD_ДанныеСобытий.ПолучитьМакет("Макет");
КонецФункции

