
#Область include_etrn_base_CommonModule_ОбщийФункционалСервер_События_СлужебныеПроцедурыИФункцииПереопределяемый
#КонецОбласти // include_etrn_base_CommonModule_ОбщийФункционалСервер_События_СлужебныеПроцедурыИФункцииПереопределяемый

Функция События_СтруктураОбъекта()
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("Название", "");
	Результат.Вставить("ДатаВремя", Дата(1, 1, 1));
	Результат.Вставить("Комментарий", "");
	
	Результат.Вставить("ИсполнительИмя", "");
	Результат.Вставить("ИсполнительФамилия", "");
	Результат.Вставить("ИсполнительОтчество", "");
	Результат.Вставить("ИсполнительИдентификатор", "");
	
	Результат.Вставить("Служебное", Ложь);
	Результат.Вставить("ДействиеНазвание", "");
	Результат.Вставить("ДействиеИдентификатор", "");
	
	Возврат Результат;
КонецФункции

Процедура События_ВывестиДанныеВТабличныйДокумент(ТабличныйДокумент, Данные, ИмяМетаданных,
	Макет = Неопределено, 
	АльтернативныеНазвания = Неопределено, 
	АктивныйЭтап = Ложь
)
	Если Макет = Неопределено Тогда
		Макет = События_Макет();
	КонецЕсли;
	
	Если АктивныйЭтап Тогда
		ИмяОбласти = "СобытиеАктивноШапка";
	Иначе
		ИмяОбласти = "СобытиеШапка";
	КонецЕсли;
	
	ОбластьДанныеСобытия = Макет.ПолучитьОбласть(ИмяОбласти);
	ОбластьДанныеСобытия.Параметры.ДатаВремя = Данные.ДатаВремя;
	ОбластьДанныеСобытия.Параметры.Название = События_ОбработатьНазвание(ИмяМетаданных, 
		Данные.Название, АльтернативныеНазвания);
	ТабличныйДокумент.Вывести(ОбластьДанныеСобытия);
	
	Если Не ПустаяСтрока(Данные.ИсполнительФамилия) Или Не ПустаяСтрока(Данные.ИсполнительИмя) Тогда
		Исполнитель = СокрЛП(СтрЗаменить(
			Данные.ИсполнительФамилия + " " + Данные.ИсполнительИмя + " " + Данные.ИсполнительОтчество
			, "  " // Ищем двойной слитный пробел
			, " " // Заменяем на одиночный пробел
		));
		
		ОбластьДанныеСобытия = Макет.ПолучитьОбласть("СобытиеИсполнитель");
		ОбластьДанныеСобытия.Параметры.Исполнитель = Исполнитель;
		ТабличныйДокумент.Вывести(ОбластьДанныеСобытия);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Данные.ДействиеНазвание) Тогда
		ОбластьДанныеСобытия = Макет.ПолучитьОбласть("СобытиеДействие");
		ОбластьДанныеСобытия.Параметры.Действие = Данные.ДействиеНазвание;
		ТабличныйДокумент.Вывести(ОбластьДанныеСобытия);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Данные.Комментарий) Тогда
		ОбластьДанныеСобытия = Макет.ПолучитьОбласть("СобытиеКомментарий");
		ОбластьДанныеСобытия.Параметры.Комментарий = Данные.Комментарий;
		ТабличныйДокумент.Вывести(ОбластьДанныеСобытия);
	КонецЕсли;
КонецПроцедуры

Функция События_ОбработатьНазвание(ИмяМетаданных, Название, Знач АльтернативныеНазвания = Неопределено)
	Если АльтернативныеНазвания = Неопределено Тогда
		АльтернативныеНазвания = Новый Соответствие;
	КонецЕсли;
	
	Название_ = ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов(ИмяМетаданных, "ЗначениеПоПредставлению", Название);
	Если Не ЗначениеЗаполнено(Название_) Тогда
		Возврат Название;
	КонецЕсли;
	
	АльтернативноеНазвание_ = АльтернативныеНазвания[НРег(Название_)];
	Если ЗначениеЗаполнено(АльтернативноеНазвание_) Тогда
		Название_ = АльтернативноеНазвание_;
	КонецЕсли;
	
	Возврат Название_;	
КонецФункции

Процедура События_ВывестиРазделительВТабличныйДокумент(ТабличныйДокумент, Макет = Неопределено)
	Если Макет = Неопределено Тогда
		Макет = События_Макет();
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Разделитель"));	
КонецПроцедуры

Функция События_ШаблонТабличногоДокумента()
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабличныйДокумент;
КонецФункции

Процедура События_УдалитьСлужебные(СписокДанных)
	Если Не ЗначениеЗаполнено(СписокДанных) Тогда
		Возврат;
	КонецЕсли;
	
	i = СписокДанных.Количество() - 1;
	Пока i >= 0 Цикл
		Если СписокДанных[i].Служебное Тогда
			СписокДанных.Удалить(i);
		КонецЕсли;
		i = i - 1;
	КонецЦикла;
КонецПроцедуры

