
&НаСервере
Процедура Переопределяемый_ПриСозданииНаСервере()
	// Установим настройки дин. списка по умолчанию
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДинСписокДокументов_УстановитьНастройки(ЭтаФорма); 
	// Настроим функционал формы относительно настроек прав расширения
	МодульКода("РегистрыСведений.ESD_НастройкаПравРасширения").НастроитьИнтерфейсФормы(ЭтаФорма);
	// Подключение модуля "длительных операций" на форму
	МодульКода("ESD_ДлительныеОперации").Подключаемый_ПриСозданииНаСервере(ЭтаФорма);	
КонецПроцедуры

