
&НаСервере
Процедура Переопределяемый_ПриСозданииНаСервере()
	// Установим настройки дин. списка по умолчанию
	ESD_ОбщийФункционалСервер.ДинСписокДокументов_УстановитьНастройки(ЭтаФорма); 
	// Настроим функционал формы относительно настроек прав расширения
	РегистрыСведений.ESD_НастройкаПравРасширения.НастроитьИнтерфейсФормы(ЭтаФорма);
	// Подключение модуля "длительных операций" на форму
	ESD_ДлительныеОперации.Подключаемый_ПриСозданииНаСервере(ЭтаФорма);
	
	SabyАккаунт_УстановитьЗаголовокНаСервере();
КонецПроцедуры

