
// Получение параметров авторизации пользователя в сервисе Saby
//
// Возвращаемое значение:
//	Структура - параметры авторизациия пользователя
//
Функция ESD_ПараметрыАвторизацииПользователя() Экспорт
	Результат = Новый Структура("Подключение,Сессия");
	ОбъектОбработки = ОбъектОбработки();
	
	Результат.Подключение = ОбъектОбработки.НастройкиПодключенияПрочитать();
    Если ЗначениеЗаполнено(Результат.Подключение) Тогда
	    Результат.Сессия = ОбъектОбработки.СтруктураСессии(Результат.Подключение);
	КонецЕсли;

    Возврат Результат;
КонецФункции

// Признак прохождения авторизации пользователя в сервисе Saby
//
// Параметры:
//	ПараметрыСессии - Структура - параметры сессии пользователя из настроек подключения
//
// Возвращаемое значение:
//	Булево - признак авторизации
Функция ESD_АвторизацияПройдена(Знач ПараметрыСессии) Экспорт
	Возврат ТипЗнч(ПараметрыСессии) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыСессии);
КонецФункции

Процедура Подключаемый_ФормированиеПечатнойФормы_ЗаполнитьДополнительныеПараметрыПечати(Параметры, СсылкаНаДокумент)
КонецПроцедуры

#Область includr_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_РаботаСХранилищемНастроек_СлужебныйПрограммныйИнтерфейс
#КонецОбласти // includr_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_РаботаСХранилищемНастроек_СлужебныйПрограммныйИнтерфейс

#Область includr_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_ОбщиеСтруктуры
#КонецОбласти // includr_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_ОбщиеСтруктуры

#Область includr_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_Печать_СлужебныйПрограммныйИнтерфейс
#КонецОбласти // includr_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_Печать_СлужебныйПрограммныйИнтерфейс

