
Функция SabyОбщийРезультатЗагрузкиДанных(СсылкаНаДокумент = Неопределено) Экспорт
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ОписаниеОшибки",             "");
	РезультатФункции.Вставить("СписокДокументов",           Неопределено);
	РезультатФункции.Вставить("СсылкаНаДокумент",           СсылкаНаДокумент);
	РезультатФункции.Вставить("СсылкаНаПрисоединенныйФайл", Неопределено);
	РезультатФункции.Вставить("ОшибкиОбщие", 				"");
	Возврат РезультатФункции;
КонецФункции

Процедура SabyОбработатьПараметрыЗагрузкиДанных(ПараметрыЗагрузки) Экспорт
	Перем ИмяМетаданных_;
	
	Если Не ПараметрыЗагрузки.Свойство("ИмяМетаданных", ИмяМетаданных_) Или Не ЗначениеЗаполнено(ИмяМетаданных_) Тогда
		ПараметрыЗагрузки.Вставить("ИмяМетаданных", ИмяМетаданныхДокумента(ПараметрыЗагрузки.СсылкаНаДокумент));	
	КонецЕсли;
КонецПроцедуры

