
// Общая точка подключения функционала на документы ESD
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//	ВладелецСтраницы - ГруппаФормы - родительский элемент "ГруппаФормы" с видом "Страница"
//
Процедура ДополнительныеПоля_Инициализация(Форма, ВладелецСтраницы) Экспорт
	ДополнительныеПоля_СоздатьСтраницу(Форма, ВладелецСтраницы);
	ДополнительныеПоля_ЗагрузитьДанныеНаСервере(Форма);
	ДополнительныеПоля_НастроитьВидимостьЭлементов(Форма);
КонецПроцедуры

// Создание страницы формы для работы с функицоналом "Дополнительные поля" 
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//  ВладелецСтраницы - ГруппаФормы - родительский элемент "ГруппаФормы" с видом "Страница"
//
// Возвращаемое значение:
//	ГруппаФормы - созданная основная страница формы
//
Функция ДополнительныеПоля_СоздатьСтраницу(Форма, ВладелецСтраницы) Экспорт
	ЭлементыФормы = ДополнительныеПоля_ЭлементыФормы(Форма);
	
	ИмяСтраницы_ = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяСтраницы();
	Страница_ = ЭлементыФормы.Найти(ИмяСтраницы_);
	Если Страница_ = Неопределено Тогда
		Страница_ = ЭлементыФормы.Добавить(ИмяСтраницы_, Тип("ГруппаФормы"), ВладелецСтраницы);
		Страница_.Заголовок = "Дополнительные поля";
		Страница_.Вид = ВидГруппыФормы.Страница;
		Страница_.Видимость = Истина;	
		
		ДополнительныеПоля_ДобавитьРеквизиты(Форма);
		ДополнительныеПоля_СоздатьЭлементы(Форма, Страница_);
	КонецЕсли;
	
	Страница_.ТолькоПросмотр = Форма.ТолькоПросмотр; 
	Страница_.Доступность = Форма.Доступность;
	
	Возврат Страница_;
КонецФункции

// Создание элементов формы для работы с функционалом "Дополнительные поля"
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//  ГруппаВладелец - ГруппаФормы - родительский элемент "ГруппаФормы"
//
// Возвращаемое значение:
//	ГруппаФормы - созданная основная группа формы
//
Функция ДополнительныеПоля_СоздатьЭлементы(Форма, ГруппаВладелец) Экспорт
	ЭлементыФормы_ = ДополнительныеПоля_ЭлементыФормы(Форма);
	
	ЭлементФормы = ДополнительныеПоля_СоздатьЭлементы_Таблица(ЭлементыФормы_, ГруппаВладелец);		
	ЭлементФормы.Доступность = Форма.Доступность;
	ЭлементФормы.ТолькоПросмотр = Форма.ТолькоПросмотр;
	
	Возврат ЭлементФормы;
КонецФункции

Функция ДополнительныеПоля_СоздатьЭлементы_Таблица(ЭлементыФормы, ГруппаВладелец) Экспорт
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита();
	ЭлементФормы_ = ЭлементыФормы.Найти(ИмяРеквизита_);
	Если ЭлементФормы_ <> Неопределено Тогда
		Возврат ЭлементФормы_;
	КонецЕсли;
	
	// Добавим таблицу
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяРеквизита_
		, Тип("ТаблицаФормы"), ГруппаВладелец);
	ЭлементФормы.ПутьКДанным = ИмяРеквизита_;
	ЭлементФормы.Отображение = ОтображениеТаблицы.Список;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.РастягиватьПоВертикали = Истина;
    ЭлементФормы.ИзменятьСоставСтрок = Ложь;
	ЭлементФормы.ИзменятьПорядокСтрок = Ложь;
	ЭлементФормы.АвтоВводНовойСтроки = Ложь;
	Если Метаданные.ОсновнойРежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда 
		// Для управляемого приложения уберем командную панель табличной части
		ЭлементФормы["ПоложениеКоманднойПанели"] = Вычислить("ПоложениеКоманднойПанелиЭлементаФормы.Нет");
	КонецЕсли;
	ЭлементФормы.УстановитьДействие("ПриАктивизацииСтроки", 
		"ДополнительныеПоля_Подключаемый_ПриАктивизацииСтроки");
	ЭлементФормы.УстановитьДействие("Выбор", 
		"ДополнительныеПоля_Подключаемый_Выбор");
	
	// Добавим колонку "Значение" таблицы параметров обработчика 
	ЭлементФормыКолонка = ЭлементыФормы.Добавить(ИмяРеквизита_ + "Направление", 
		Тип("ПолеФормы"), 
		ЭлементФормы);       
	ЭлементФормыКолонка.Вид = ВидПоляФормы.ПолеКартинки;
	ЭлементФормыКолонка.РастягиватьПоГоризонтали = Ложь;
	ЭлементФормыКолонка.Ширина = 2;
	ЭлементФормыКолонка.КартинкаЗначений = БиблиотекаКартинок.ESD_Направление;
	ЭлементФормыКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормыКолонка.ТолькоПросмотр = Истина;
	ЭлементФормыКолонка.ПутьКДанным = ИмяРеквизита_ + "." + "Направление";
	
	// Добавим колонку "Ключ" таблицы параметров обработчика 
	ЭлементФормыКолонка = ЭлементыФормы.Добавить(ИмяРеквизита_ + "Наименование"
		, Тип("ПолеФормы")
		, ЭлементФормы);       
	ЭлементФормыКолонка.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормыКолонка.ПутьКДанным = ИмяРеквизита_ + "." + "Наименование";
	ЭлементФормыКолонка.ТолькоПросмотр = Истина;
	ЭлементФормыКолонка.УстановитьДействие("НачалоВыбора", "ДополнительныеПоля_Подключаемый_Наименование_НачалоВыбора");
	
	// Добавим колонку "Значение" таблицы параметров обработчика 
	ЭлементФормыКолонка = ЭлементыФормы.Добавить(ИмяРеквизита_ + "Значение", 
		Тип("ПолеФормы"), 
		ЭлементФормы);       
	ЭлементФормыКолонка.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормыКолонка.ПутьКДанным = ИмяРеквизита_ + "." + "Значение";
	ЭлементФормыКолонка.УстановитьДействие("ПриИзменении", "ДополнительныеПоля_Подключаемый_Значение_ПриИзменении");
	
	ЭлементФормыКолонка = ЭлементыФормы.Добавить(ИмяРеквизита_ + "ТипТитула", 
		Тип("ПолеФормы"), 
		ЭлементФормы);       
	ЭлементФормыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементФормыКолонка.ТолькоПросмотр = Истина;
	ЭлементФормыКолонка.Заголовок = "Этап";
	ЭлементФормыКолонка.ПутьКДанным = ИмяРеквизита_ + "." + "ТипТитула";
	
	ЭлементФормыКолонка = ЭлементыФормы.Добавить(ИмяРеквизита_ + "КомандаСкопировать", 
		Тип("ПолеФормы"), 
		ЭлементФормы);       
	ЭлементФормыКолонка.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементФормыКолонка.ТолькоПросмотр = Истина;
	ЭлементФормыКолонка.Заголовок = "";
	ЭлементФормыКолонка.Гиперссылка = Истина;
	ЭлементФормыКолонка.ГиперссылкаЯчейки = Истина;
	ЭлементФормыКолонка.ОтображатьВШапке = Ложь;
	ЭлементФормыКолонка.ПутьКДанным = ИмяРеквизита_ + "." + "КомандаСкопировать";
	
	Возврат ЭлементФормы;
КонецФункции

// Создание реквизитов формы для работы с функционалом "Дополнительные поля"
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//
// Возвращаемое значение:
//	Массив - список созданных реквизитов формы
//
Функция ДополнительныеПоля_ДобавитьРеквизиты(Форма) Экспорт
	ДобавляемыеРеквизиты = Новый Массив;
	
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита();
	Если ESD_ТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(Форма, ИмяРеквизита_) Тогда
		Возврат ДобавляемыеРеквизиты;		
	КонецЕсли;
	
	// Добавим таблицу значений
	РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита_
		, Новый ОписаниеТипов("ТаблицаЗначений"));
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	
	// Добавим колонки
	РеквизитТЗ = Новый РеквизитФормы("Идентификатор"
		, Новый ОписаниеТипов("Строка"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Значение"
		, Новый ОписаниеТипов(Новый Массив), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Ссылка"
		, Новый ОписаниеТипов(Новый Массив), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Тип"
		, Новый ОписаниеТипов("Строка"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Наименование"
		, Новый ОписаниеТипов("Строка"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Направление"
		, Новый ОписаниеТипов("Число"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("ПроверятьЗаполнение"
		, Новый ОписаниеТипов("Булево"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("РежимВыбораИзСписка"
		, Новый ОписаниеТипов("Булево"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("ТипТитула"
		, Новый ОписаниеТипов(Новый Массив), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("КомандаСкопировать"
		, Новый ОписаниеТипов("Строка"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	
	ИмяРеквизитаСписокВыбора_ = "СписокВыбора";
	РеквизитТЗ = Новый РеквизитФормы(ИмяРеквизитаСписокВыбора_
		, Новый ОписаниеТипов("ТаблицаЗначений"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Значение"
		, Новый ОписаниеТипов(Новый Массив), ИмяРеквизита_ + "." + ИмяРеквизитаСписокВыбора_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
		
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Возврат ДобавляемыеРеквизиты;
КонецФункции

// Загрузка данных "дополнительных полей" на форму
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//
Процедура ДополнительныеПоля_ЗагрузитьДанныеНаСервере(Форма) Экспорт
	ИмяРеквизитаТаблицы = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита();
	Форма[ИмяРеквизитаТаблицы].Очистить();
	
	Владелец_ = Форма.Объект.Ссылка;
	
	СтруктураОтбора = Новый Структура("Владелец, Служебное", Владелец_, Ложь);	
	ЗначенияДопПолей = РегистрыСведений.ESD_ЗначенияДополнительныхПолей.Таблица(СтруктураОтбора);
	
	ЗначенияВходящихДопПолей = ЗначенияДопПолей.НайтиСтроки(Новый Структура("Направление", Перечисления.ESD_Направление.Входящий));
	Для Каждого ОписаниеЗначения Из ЗначенияВходящихДопПолей Цикл
		СтруктураОбъекта = РегистрыСведений.ESD_ЗначенияДополнительныхПолей.СтруктураОбъекта();
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта, ОписаниеЗначения);
		
		НоваяСтрока = Форма[ИмяРеквизитаТаблицы].Добавить();
		ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ЗаполнитьСтрокуТаблицы_ВходящееЗначение(
			НоваяСтрока, СтруктураОбъекта);
		НоваяСтрока.Значение = ОписаниеЗначения.Значение;
		НоваяСтрока.ТипТитула = ОписаниеЗначения.ТипТитула;
	КонецЦикла;
	
	ЗначенияИсходящихДопПолей = ЗначенияДопПолей.Скопировать(Новый Структура("Направление", Перечисления.ESD_Направление.Исходящий));
	
	Метаданные_ = Владелец_.Метаданные().ПолноеИмя();
	СтруктураОтбора_ = Новый Структура("ВладелецМетаданные, ПометкаУдаления", Новый Массив, Ложь);
	СтруктураОтбора_.ВладелецМетаданные.Добавить(Метаданные_);
	СтруктураОтбора_.ВладелецМетаданные.Добавить("");
	ДоступныеДополнительныеПоля = Справочники.ESD_ДополнительныеПоля.ОбъектыПоОтбору(СтруктураОтбора_);
	Для Каждого ОписаниеЗначения Из ДоступныеДополнительныеПоля Цикл
		СтруктураОтбора_ = Новый Структура("Идентификатор", ОписаниеЗначения.Идентификатор);
		ТекущиеЗначения = ЗначенияИсходящихДопПолей.НайтиСтроки(СтруктураОтбора_);
		Если Не ТекущиеЗначения.Количество() Тогда
			ТекущиеЗначения = Новый Массив;
			Значение_ = Новый Структура("Значение", Неопределено);
			ТекущиеЗначения.Добавить(Значение_);
		КонецЕсли;
		
		Для Каждого ТекущееЗначение Из ТекущиеЗначения Цикл
			СтруктураОбъекта = Справочники.ESD_ДополнительныеПоля.СтруктураОбъекта();
			ЗаполнитьЗначенияСвойств(СтруктураОбъекта, ОписаниеЗначения);
			
			НоваяСтрока = Форма[ИмяРеквизитаТаблицы].Добавить();
			ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ЗаполнитьСтрокуТаблицы_ИсходящееЗначение(
				НоваяСтрока, СтруктураОбъекта);
			НоваяСтрока.Значение = ТекущееЗначение.Значение;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Подключаемый обработчик события "ПередЗаписьюНаСервере" формы
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//	ТекущийОбъект - ДокументОбъект - объект ЭПД (ЭТрН, ЭПЛ, ЭЗЗ и прочие)
//	Отказ - Булево - признак отмены продолжения выполнения
//
Процедура ДополнительныеПоля_ПередЗаписьюНаСервере(Форма, ТекущийОбъект, Отказ = Ложь) Экспорт
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита();
	ТаблицаДопПолей_ = Форма[ИмяРеквизита_];
	Для i = 0 По ТаблицаДопПолей_.Количество() - 1 Цикл
		Строка_ = ТаблицаДопПолей_[i];
		Если Строка_.ПроверятьЗаполнение И Не ЗначениеЗаполнено(Строка_.Значение) Тогда
			Сообщение_ = Новый СообщениеПользователю;
			Сообщение_.Поле = ИмяРеквизита_ + "[" + Формат(i, "ЧГ=0") + "].Значение";
			Сообщение_.Текст = "Не заполнено значение дополнительного поля!";
			Сообщение_.Сообщить();
			
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;

	Если Не Отказ Тогда
		ЗначенияДополнительныхПолей_ = ТаблицаДопПолей_.Выгрузить();
		НовыеЗначения_ = ЗначенияДополнительныхПолей_.НайтиСтроки(Новый Структура("Направление", 2));
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДополнительныеПоля", НовыеЗначения_);
	КонецЕсли;
КонецПроцедуры

// Подключаемый обработчик события "ПриЗаписи" объекта
//
// Параметры:
//	ТекущийОбъект - ДокументОбъект - объект ЭПД (ЭТрН, ЭПЛ, ЭЗЗ и прочие)
//
Процедура ДополнительныеПоля_ПриЗаписи(ТекущийОбъект) Экспорт
	Перем ДополнительныеПоля_;
	
	Если Не ТекущийОбъект.ДополнительныеСвойства.Свойство("ДополнительныеПоля", ДополнительныеПоля_)
		Или Не ЗначениеЗаполнено(ДополнительныеПоля_) 
	Тогда
		ДополнительныеПоля_ = Новый Массив;
	КонецЕсли;
	
	РегистрыСведений.ESD_ЗначенияДополнительныхПолей.ЗаписатьЗначения(ТекущийОбъект.Ссылка,
		ДополнительныеПоля_, Перечисления.ESD_Направление.Исходящий);	
КонецПроцедуры

Процедура ДополнительныеПоля_НастроитьВидимостьЭлементов(Форма) Экспорт
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита();
	ИмяСтраницы_ = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяСтраницы();
	Форма.Элементы[ИмяСтраницы_].Видимость = Форма[ИмяРеквизита_].Количество();
КонецПроцедуры

