
// Общая точка подключения функционала на документы ESD
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//	ВладелецСтраницы - ГруппаФормы - родительский элемент "ГруппаФормы" с видом "Страница"
//
Процедура ДополнительныеПоля_Инициализация(Форма, ВладелецСтраницы) Экспорт
	ДополнительныеПоля_СоздатьСтраницу(Форма, ВладелецСтраницы);
	ДополнительныеПоля_ЗагрузитьДанныеНаСервере(Форма);
КонецПроцедуры

// Создание страницы формы для работы с функицоналом "Дополнительные поля" 
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//  ВладелецСтраницы - ГруппаФормы - родительский элемент "ГруппаФормы" с видом "Страница"
//
// Возвращаемое значение:
//	ГруппаФормы - созданная основная страница формы
//
Функция ДополнительныеПоля_СоздатьСтраницу(Форма, ВладелецСтраницы) Экспорт
	ЭлементыФормы = ДополнительныеПоля_ЭлементыФормы(Форма);
	
	ИмяСтраницы = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяСтраницы();
	Страница_ = ЭлементыФормы.Найти(ИмяСтраницы);
	Если Страница_ = Неопределено Тогда
		Страница_ = ЭлементыФормы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), ВладелецСтраницы);
		Страница_.Заголовок = "Дополнительные поля";
		Страница_.Вид = ВидГруппыФормы.Страница;
		Страница_.Видимость = Истина;	
		
		ДополнительныеПоля_ДобавитьРеквизиты(Форма);
		ДополнительныеПоля_СоздатьЭлементы(Форма, Страница_);
	КонецЕсли;
	
	Страница_.ТолькоПросмотр = Форма.ТолькоПросмотр; 
	Страница_.Доступность = Форма.Доступность;
	
	Возврат Страница_;
КонецФункции

// Создание элементов формы для работы с функционалом "Дополнительные поля"
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//  ГруппаВладелец - ГруппаФормы - родительский элемент "ГруппаФормы"
//
// Возвращаемое значение:
//	ГруппаФормы - созданная основная группа формы
//
Функция ДополнительныеПоля_СоздатьЭлементы(Форма, ГруппаВладелец) Экспорт
	ЭлементыФормы_ = ДополнительныеПоля_ЭлементыФормы(Форма);
	
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита();
	ЭлементФормы_ = ЭлементыФормы_.Найти(ИмяРеквизита_);
	Если ЭлементФормы_ = Неопределено Тогда
		// Добавим таблицу
		ЭлементФормы = ЭлементыФормы_.Добавить(ИмяРеквизита_
			, Тип("ТаблицаФормы"), ГруппаВладелец);
		ЭлементФормы.ПутьКДанным = ИмяРеквизита_;
		ЭлементФормы.Отображение = ОтображениеТаблицы.Список;
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормы.РастягиватьПоГоризонтали = Истина;
		ЭлементФормы.РастягиватьПоВертикали = Истина;
	    ЭлементФормы.ИзменятьСоставСтрок = Ложь;
		ЭлементФормы.ИзменятьПорядокСтрок = Ложь;
		ЭлементФормы.АвтоВводНовойСтроки = Ложь;
		Если Метаданные.ОсновнойРежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда 
			// Для управляемого приложения уберем командную панель табличной части
			ЭлементФормы["ПоложениеКоманднойПанели"] = Вычислить("ПоложениеКоманднойПанелиЭлементаФормы.Нет");
		КонецЕсли;
		ЭлементФормы.УстановитьДействие("ПриАктивизацииСтроки", "ДополнительныеПоля_Подключаемый_ПриАктивизацииСтроки");
		
		// Добавим колонку "Значение" таблицы параметров обработчика 
		ЭлементФормыКолонка = ЭлементыФормы_.Добавить(ИмяРеквизита_ + "Направление", 
			Тип("ПолеФормы"), 
			ЭлементФормы);       
		ЭлементФормыКолонка.Вид = ВидПоляФормы.ПолеКартинки;
		ЭлементФормыКолонка.РастягиватьПоГоризонтали = Ложь;
		ЭлементФормыКолонка.Ширина = 2;
		ЭлементФормыКолонка.КартинкаЗначений = БиблиотекаКартинок.ESD_Направление;
		ЭлементФормыКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормыКолонка.ТолькоПросмотр = Истина;
		ЭлементФормыКолонка.ПутьКДанным = ИмяРеквизита_ + "." + "Направление";
		
		// Добавим колонку "Ключ" таблицы параметров обработчика 
		ЭлементФормыКолонка = ЭлементыФормы_.Добавить(ИмяРеквизита_ + "Наименование"
			, Тип("ПолеФормы")
			, ЭлементФормы);       
		ЭлементФормыКолонка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормыКолонка.ПутьКДанным = ИмяРеквизита_ + "." + "Наименование";
		ЭлементФормыКолонка.ТолькоПросмотр = Истина;
		ЭлементФормыКолонка.УстановитьДействие("НачалоВыбора", "ДополнительныеПоля_Подключаемый_Наименование_НачалоВыбора");
		
		// Добавим колонку "Значение" таблицы параметров обработчика 
		ЭлементФормыКолонка = ЭлементыФормы_.Добавить(ИмяРеквизита_ + "Значение", 
			Тип("ПолеФормы"), 
			ЭлементФормы);       
		ЭлементФормыКолонка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормыКолонка.ПутьКДанным = ИмяРеквизита_ + "." + "Значение";
		ЭлементФормыКолонка.УстановитьДействие("ПриИзменении", "ДополнительныеПоля_Подключаемый_Значение_ПриИзменении");
		
		ЭлементФормыКолонка = ЭлементыФормы_.Добавить(ИмяРеквизита_ + "ТипТитула", 
			Тип("ПолеФормы"), 
			ЭлементФормы);       
		ЭлементФормыКолонка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормыКолонка.ТолькоПросмотр = Истина;
		ЭлементФормыКолонка.Заголовок = "Этап";
		ЭлементФормыКолонка.ПутьКДанным = ИмяРеквизита_ + "." + "ТипТитула";	
	КонецЕсли;
	
	ЭлементФормы.Доступность = Форма.Доступность;
	ЭлементФормы.ТолькоПросмотр = Форма.ТолькоПросмотр;
	
	Возврат ЭлементФормы;
КонецФункции

// Создание реквизитов формы для работы с функционалом "Дополнительные поля"
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//
// Возвращаемое значение:
//	Массив - список созданных реквизитов формы
//
Функция ДополнительныеПоля_ДобавитьРеквизиты(Форма) Экспорт
	ДобавляемыеРеквизиты = Новый Массив;
	
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита();
	Если ESD_ТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(Форма, ИмяРеквизита_) Тогда
		Возврат ДобавляемыеРеквизиты;		
	КонецЕсли;
	
	// Добавим таблицу значений
	РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита_
		, Новый ОписаниеТипов("ТаблицаЗначений"));
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	
	// Добавим колонки
	РеквизитТЗ = Новый РеквизитФормы("Идентификатор"
		, Новый ОписаниеТипов("Строка"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Значение"
		, Новый ОписаниеТипов(Новый Массив), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Тип"
		, Новый ОписаниеТипов("Строка"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Наименование"
		, Новый ОписаниеТипов("Строка"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Направление"
		, Новый ОписаниеТипов("Число"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("ПроверятьЗаполнение"
		, Новый ОписаниеТипов("Булево"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("РежимВыбораИзСписка"
		, Новый ОписаниеТипов("Булево"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("ТипТитула"
		, Новый ОписаниеТипов(Новый Массив), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	
	ИмяРеквизитаСписокВыбора_ = "СписокВыбора";
	РеквизитТЗ = Новый РеквизитФормы(ИмяРеквизитаСписокВыбора_
		, Новый ОписаниеТипов("ТаблицаЗначений"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Значение"
		, Новый ОписаниеТипов(Новый Массив), ИмяРеквизита_ + "." + ИмяРеквизитаСписокВыбора_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
		
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Возврат ДобавляемыеРеквизиты;
КонецФункции

// Загрузка данных "дополнительных полей" на форму
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//
Процедура ДополнительныеПоля_ЗагрузитьДанныеНаСервере(Форма) Экспорт
	ИмяРеквизитаТаблицы = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита();
	Форма[ИмяРеквизитаТаблицы].Очистить();
	
	Владелец_ = Форма.Объект.Ссылка;
	
	СтруктураОтбора = Новый Структура("Владелец, Служебное", Владелец_, Ложь);	
	ЗначенияДопПолей = РегистрыСведений.ESD_ЗначенияДополнительныхПолей.Таблица(СтруктураОтбора);
	
	ЗначенияВходящихДопПолей = ЗначенияДопПолей.НайтиСтроки(Новый Структура("Направление", Перечисления.ESD_Направление.Входящий));
	Для Каждого ОписаниеЗначения Из ЗначенияВходящихДопПолей Цикл
		СтруктураОбъекта = РегистрыСведений.ESD_ЗначенияДополнительныхПолей.СтруктураОбъекта();
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта, ОписаниеЗначения);
		СтруктураОбъекта.Направление = 1;
		
		НоваяСтрока = Форма[ИмяРеквизитаТаблицы].Добавить();
		ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ЗаполнитьСтрокуТаблицы(НоваяСтрока, СтруктураОбъекта);
		НоваяСтрока.Значение = ОписаниеЗначения.Значение;
		НоваяСтрока.ТипТитула = ОписаниеЗначения.ТипТитула;
	КонецЦикла;
	
	ЗначенияИсходящихДопПолей = ЗначенияДопПолей.Скопировать(Новый Структура("Направление", Перечисления.ESD_Направление.Исходящий));
	
	Метаданные_ = Владелец_.Метаданные().ПолноеИмя();
	СтруктураОтбора_ = Новый Структура("ВладелецМетаданные, ПометкаУдаления", Новый Массив, Ложь);
	СтруктураОтбора_.ВладелецМетаданные.Добавить(Метаданные_);
	СтруктураОтбора_.ВладелецМетаданные.Добавить("");
	ДоступныеДополнительныеПоля = Справочники.ESD_ДополнительныеПоля.ОбъектыПоОтбору(СтруктураОтбора_);
	Для Каждого ОписаниеЗначения Из ДоступныеДополнительныеПоля Цикл
		СтруктураОбъекта = Справочники.ESD_ДополнительныеПоля.СтруктураОбъекта();
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта, ОписаниеЗначения);
		СтруктураОбъекта.Вставить("Направление", 2);
		
		НоваяСтрока = Форма[ИмяРеквизитаТаблицы].Добавить();
		ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ЗаполнитьСтрокуТаблицы(НоваяСтрока, СтруктураОбъекта);
		НоваяСтрока.РежимВыбораИзСписка = ОписаниеЗначения.РежимВыбораИзСписка;
		
		ТекущееЗначение = ЗначенияИсходящихДопПолей.Найти(ОписаниеЗначения.Идентификатор, "Идентификатор");
		Если ТекущееЗначение <> Неопределено Тогда
			НоваяСтрока.Значение = ТекущееЗначение.Значение;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Подключаемый обработчик события "ПриЗаписиНаСервере" формы
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//	СсылкаОснования - ПроизвольноеЗначение - Ссылка на ЭПД
//
Процедура ДополнительныеПоля_ПриЗаписиНаСервере(Форма, Знач СсылкаОснования = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(СсылкаОснования) Тогда
		СсылкаОснования = Форма.Объект.Ссылка;
	КонецЕсли;
	
	ЗначенияДополнительныхПолей_ = Форма[ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита()]
		.Выгрузить();
	НовыеЗначения_ = ЗначенияДополнительныхПолей_.НайтиСтроки(Новый Структура("Направление", 2));
	РегистрыСведений.ESD_ЗначенияДополнительныхПолей.ЗаписатьЗначения(СсылкаОснования,
		НовыеЗначения_, Перечисления.ESD_Направление.Исходящий);
КонецПроцедуры

// Подключаемый обработчик события "ПередЗаписьюНаСервере" формы
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с подключенным функционалом "Дополнительные поля"
//	Отказ - Булево - признак отмены продолжения выполнения
//
Процедура ДополнительныеПоля_ПередЗаписьюНаСервере(Форма, Отказ = Ложь) Экспорт
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.ДополнительныеПоля_ИмяРеквизита();
	Для i = 0 По Форма[ИмяРеквизита_].Количество() - 1 Цикл
		Строка_ = Форма[ИмяРеквизита_][i];
		Если Строка_.ПроверятьЗаполнение И Не ЗначениеЗаполнено(Строка_.Значение) Тогда
			Сообщение_ = Новый СообщениеПользователю;
			Сообщение_.Поле = ИмяРеквизита_ + "[" + Формат(i, "ЧГ=0") + "].Значение";
			Сообщение_.Текст = "Не заполнено значение дополнительного поля!";
			Сообщение_.Сообщить();
			
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

