
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").УстановитьНастройкиСпискаДокументов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДвоичныеДанныеОбработки", Неопределено);
	ДополнительныеПараметры.Вставить("НаКлиенте",               Ложь);
	ДополнительныеПараметры.Вставить("ОтветНаКлиенте",          Неопределено);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ВыполнитьКомандуСбис(
		ЭтаФорма, "АктуальныйСтатусВерсии", Неопределено, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбработатьОповещенияДляФормы(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтказВПриемкеГруза(Команда)
		
	Подсказка    = "Укажите причину отказа от приемки груза"; 
	ДопПараметры = Новый Структура;  	
	Оповещение   = Новый ОписаниеОповещения("ПослеВводаПричиныОтказа", ЭтаФорма, ДопПараметры);
	
	ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина);
					
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВСбис(Команда)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(
		ЭтаФорма,
		Команда.Имя + "ИзСписка",
		Новый Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДокумент(Команда)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВСбис(Команда)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументИзСбис(Команда)
			
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбновитьДокументыСБИС(
		ЭтаФорма, Команда.Имя, ТранспортнаяНакладнаяКлиент());
			
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументИзСбисЗаПериод(Команда)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбновитьДокументыЗаПериод(ЭтаФорма, "ОбновитьДокументИзСбис", Истина);

КонецПроцедуры

&НаКлиенте
Процедура Просмотрено(Команда)
	
	МассивДокументов = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ДокументыДляОбработки(ЭтаФорма);
	ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.СбросСтатусаНеПросмотрено", МассивДокументов);
	ОповеститьОбИзменении(Тип("ДокументСсылка." + ТранспортнаяНакладнаяКлиент()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИзмененныхДокументов(Команда)
	
	УстановленОтборИзмененныхДокументов = Не УстановленОтборИзмененныхДокументов;
	Если УстановленОтборИзмененныхДокументов Тогда		
		Значение = Ложь;		
	Иначе		
		Значение = Неопределено;		
	КонецЕсли;
		
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Значение,
		"Просмотрен");
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПечатьДокумента(ЭтаФорма, Команда.Имя, "", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновлениеНажатие(Элемент)
	// Совместимость со старыми платформами
	// BSLLS:UsingSynchronousCalls-off
    ЗапуститьПриложение(Элемент.Подсказка);
    // BSLLS:UsingSynchronousCalls-on
КонецПроцедуры 

&НаКлиенте
Процедура МассовоеСоздание(Команда)
	
	// Типы основания
	ЗаполнитьСписокОснованийТранспортнойНакладной();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДокумента",          "ESD_ТранспортнаяНакладная");
	ПараметрыФормы.Вставить("МножественноеСоздание", Истина);
	
    МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ВыбратьТипДокументаОснования(ЭтаФорма, ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОтборДокументовСОшибками(Команда)
	
	УстановленОтборДокументовСОшибками = Не УстановленОтборДокументовСОшибками;
	Если УстановленОтборДокументовСОшибками Тогда		
		Значение = Истина;		
	Иначе		
		Значение = Неопределено;		
	КонецЕсли;
		
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Значение,
		"ЕстьОшибки");
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьДокументВСбис(Ссылка, context_params, Ошибки)
	
	МодульКода("Документы." + ТранспортнаяНакладная()).ЗаписатьДокументВСбис(Ссылка, context_params, Ошибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПричиныОтказа(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	// ToDo: обработать документы
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда 
						
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для отказа от приемки груза укажите причину";
		Сообщение.Поле  = "ФормаОтказВПриемкеГруза";
		Сообщение.Сообщить();
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
		
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Тип,
		"Направление");
	
КонецПроцедуры

#Область ОбработкаОповещений

&НаКлиенте
Процедура ОбработатьОповещениеВыполнитьПереходНаФорме(ПараметрыПерехода = Неопределено) Экспорт
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, "ОбновитьАктивныйЭтап");
	
КонецПроцедуры

#КонецОбласти // ОбработкаОповещений

&НаСервере
Процедура ЗаполнитьСписокОснованийТранспортнойНакладной()
	
	// Заполнить список оснований Транспортной накладной
	Если ЭтоУниверсальноеРасширение() Тогда
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ОграничитьТипыДокументовОснований(ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции  

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере 
#КонецОбласти // includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область include_etrn_base_CommonModule_Метаданные
#КонецОбласти // include_etrn_base_CommonModule_Метаданные

#Область include_etrn_base_CommonModule_МетаданныеКлиент
#КонецОбласти // include_etrn_base_CommonModule_МетаданныеКлиент

