
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Переопределяемый_ПриСозданииНаСервере();
	НастройкаВидимостиЭлементовНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗагрузитьАктуальныйСтатусВерсии();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ОбработатьОповещенияДляФормы(ЭтаФорма, ИмяСобытия, Параметр, Источник);
		
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Если Не Строки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	СписокДокументов = Строки.ПолучитьКлючи();
	ДополнительныеПараметры = МодульКода("ESD_ТНОбщегоНазначенияСервер").ДинСписокДокументов_ДополнительныеПараметрыЗаполнения(СписокДокументов);
	
	Для Каждого Строка Из Строки Цикл
		Ссылка = Строка.Ключ;
		ДанныеСтроки = Строка.Значение.Данные;
		ЗаполнитьТекущийЭтапСтрокиДС(ДанныеСтроки, Ссылка, ДополнительныеПараметры);
	КонецЦикла;
КонецПроцедуры 

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ESD_ТНОбщегоНазначенияКлиент.ОткрытьДокументРасширенияЭПД(
				ВыбраннаяСтрока, "ESD_ТранспортнаяНакладная", Найти(Нрег(Элемент.ТекущиеДанные.Комментарий), "форматно-логический контроль")>0);
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
		
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Тип,
		"Направление");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтказВПриемкеГруза(Команда)
		
	Подсказка    = "Укажите причину отказа от приемки груза"; 
	ДопПараметры = Новый Структура;  	
	Оповещение   = Новый ОписаниеОповещения("ПослеВводаПричиныОтказа", ЭтаФорма, ДопПараметры);
	
	ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина);
					
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВСбис(Команда)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(
		ЭтаФорма,
		Команда.Имя + "ИзСписка",
		Новый Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДокумент(Команда)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВСбис(Команда)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументИзСбис(Команда)
			
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ОбновитьДокументыСБИС(
		ЭтаФорма, Команда.Имя, ТранспортнаяНакладная());
			
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументИзСбисЗаПериод(Команда)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ОбновитьДокументыЗаПериод(ЭтаФорма, "ОбновитьДокументИзСбис", Истина);

КонецПроцедуры

&НаКлиенте
Процедура Просмотрено(Команда)
	
	МассивДокументов = МодульКода("ESD_ТНОбщегоНазначенияКлиент").ДокументыДляОбработки(ЭтаФорма);
	ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.СбросСтатусаНеПросмотрено", МассивДокументов);
	ОповеститьОбИзменении(Тип("ДокументСсылка." + ТранспортнаяНакладная()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИзмененныхДокументов(Команда)
	
	УстановленОтборИзмененныхДокументов = Не УстановленОтборИзмененныхДокументов;
	Если УстановленОтборИзмененныхДокументов Тогда		
		Значение = Ложь;		
	Иначе		
		Значение = Неопределено;		
	КонецЕсли;
		
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Значение,
		"Просмотрен");
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ПечатьДокумента(ЭтаФорма, Команда.Имя, "", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВложенияВ1С(Команда)
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ЗагрузитьАрхивДокумента(ЭтаФорма, Истина);
	ОповеститьОбИзменении(ЭтаФорма.Элементы.Список.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновлениеНажатие(Элемент)
	// Совместимость со старыми платформами
	// BSLLS:UsingSynchronousCalls-off
    ЗапуститьПриложение(Элемент.Подсказка);
    // BSLLS:UsingSynchronousCalls-on
КонецПроцедуры 

&НаКлиенте
Процедура МассовоеСоздание(Команда)
	
	// Типы основания
	ЗаполнитьСписокОснованийТранспортнойНакладной();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДокумента",          "ESD_ТранспортнаяНакладная");
	ПараметрыФормы.Вставить("МножественноеСоздание", Истина);
	
    МодульКода("ESD_ТНОбщегоНазначенияКлиент").ВыбратьТипДокументаОснования(ЭтаФорма, ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОтборДокументовСОшибками(Команда)
	
	УстановленОтборДокументовСОшибками = Не УстановленОтборДокументовСОшибками;
	Если УстановленОтборДокументовСОшибками Тогда		
		Значение = Истина;		
	Иначе		
		Значение = Неопределено;		
	КонецЕсли;
		
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		Значение,
		"ЕстьОшибки");
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура НастройкаВидимостиЭлементовНаСервере()
	ЭлементДоступен = ПравоДоступа("Редактирование", Метаданные.Документы.ESD_ТранспортнаяНакладная);
	Элементы.ФормаЗагрузитьВСбис.Видимость = ЭлементДоступен;
	Элементы.ФормаОбновитьДокументИзСбис.Видимость = ЭлементДоступен;
	Элементы.ФормаОбновитьДокументИзСбисЗаПериод.Видимость = ЭлементДоступен;
	Элементы.ФормаЗагрузитьВложенияВ1С.Видимость = ЭлементДоступен;
	Элементы.ФормаМассовоеСоздание.Видимость = ЭлементДоступен;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокументВСбис(Ссылка, context_params, Ошибки)
	
	МодульКода("Документы." + ТранспортнаяНакладная()).ЗаписатьДокументВСбис(Ссылка, context_params, Ошибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПричиныОтказа(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	// ToDo: обработать документы
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда 
						
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для отказа от приемки груза укажите причину";
		Сообщение.Поле  = "ФормаОтказВПриемкеГруза";
		Сообщение.Сообщить();
		
	КонецЕсли;
			
КонецПроцедуры

#Область ОбработкаОповещений

&НаКлиенте
Процедура ОбработатьОповещениеВыполнитьПереходНаФорме(ПараметрыПерехода = Неопределено) Экспорт
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(ЭтаФорма, "ОбновитьАктивныйЭтап");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОповещениеВыход() Экспорт
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДинСписокДокументов_УстановитьНастройки(ЭтаФорма);
КонецПроцедуры

#КонецОбласти // ОбработкаОповещений

&НаСервере
Процедура ЗаполнитьСписокОснованийТранспортнойНакладной()
	
	// Заполнить список оснований Транспортной накладной
	Если ЭтоУниверсальноеРасширение() Тогда
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ОграничитьТипыДокументовОснований(ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьТекущийЭтапСтрокиДС(ДанныеСтроки, Ссылка, ДополнительныеПараметры)
	Если ЗначениеЗаполнено(ДанныеСтроки.ТекущийЭтап) 
		Или (ДанныеСтроки.Состояние <> ДополнительныеПараметры.КодЗавершенПоложительно
		И ДанныеСтроки.Состояние <> ДополнительныеПараметры.КодЗавершенОтрицательно)
	Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеТитула = ДополнительныеПараметры.ДанныеПоследнихТитулов.Найти(Ссылка, "СсылкаНаДокумент");
	Если ДанныеТитула <> Неопределено И Не ПустаяСтрока(ДанныеТитула.Данные) Тогда
		ДанныеПоследнегоТитула = ЗначениеИзСтрокиВнутр(ДанныеТитула.Данные);
		ДанныеПоследнегоТитула.Свойство("КомментарийУведомление", ДанныеСтроки.ТекущийЭтап);
		Если ЗначениеЗаполнено(ДанныеСтроки.ТекущийЭтап) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеСостояния = ДополнительныеПараметры.СоответствиеСостояний.Получить(ДанныеСтроки.Состояние);
	Если ОписаниеСостояния <> Неопределено Тогда
		ДанныеСтроки.ТекущийЭтап = ОписаниеСостояния.Наименование;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПрименитьДополнительныеПрава(Результат) Экспорт
	
	ЭтаФорма.Элементы.ГруппаОбновление.Видимость = Результат.СкачиваниеОбновления;
	
КонецПроцедуры

#Область include_etrn_base_Document_ОбщийФункционал_ФормаСписка_ЗагрузитьАктуальныйСтатусВерсии
#КонецОбласти

#Область include_etrn_base_Document_ОбщийФункционал_ФормаСписка_Переопределяемый_ПриСозданииНаСервере
#КонецОбласти

#КонецОбласти // СлужебныеПроцедурыИФункции  

#Область include_etrn_base_Document_ОбщийФункционал_Подключаемые_ДлительныеОперации
#КонецОбласти

#Область include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере //&НаСервере
#КонецОбласти // include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти

#Область include_etrn_base_CommonModule_ОпределениеМодуляКода //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти // include_etrn_base_CommonModule_ОпределениеМодуляКода

#Область include_etrn_base_CommonModule_Метаданные //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти // include_etrn_base_CommonModule_Метаданные

