
Функция РезультатЗаполненияНаОснованииINI(ПараметрыЗаполнения) Экспорт
	
	Если ПараметрыЗаполнения.НаКлиенте Тогда
		РезультатРасчета = ПараметрыЗаполнения.РезультатРасчетаИНИ;
	Иначе
		РезультатРасчета = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатРасчетаINI(ПараметрыЗаполнения, ОбъектОбработки());
	КонецЕсли;
	
	Если РезультатРасчета.Результат.Ошибка Тогда
		Возврат РезультатРасчета.Результат;
	Иначе
		РезультатФункции = РезультатРасчета.Результат;
		ДанныеИзИНИ      = РезультатРасчета.ДанныеИзИНИ;
	КонецЕсли;
	
	МодульКода("Документы." + ПараметрыЗаполнения.ИмяМетаданных).СформироватьНовыеОснования(РезультатФункции, ДанныеИзИНИ);
	МодульКода("Документы." + ПараметрыЗаполнения.ИмяМетаданных).ДополнитьПодстановки(ДанныеИзИНИ, ПараметрыЗаполнения);
	
	ТитулДляЗаполнения = РезультатФункцииТитулов(ПараметрыЗаполнения.ИмяМетаданных, "ПервыйТитул");
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.Этап) Тогда
		ТитулДляЗаполнения = РезультатФункцииТитулов(
			ПараметрыЗаполнения.ИмяМетаданных, "ЗначениеПоПредставлению", ПараметрыЗаполнения.Этап);
	КонецЕсли;
	ПредставленияТитула = РезультатФункцииТитулов(ПараметрыЗаполнения.ИмяМетаданных, "ПредставленияТитула", ТитулДляЗаполнения);
	
	МассивПодстановок = Новый Массив;
	МассивПодстановок.Добавить(ДанныеИзИНИ);
	
	Подстановки = Новый Соответствие;
	ПодстановкаТитула = Новый Соответствие;
	ПодстановкаТитула.Вставить(ПредставленияТитула.ИмяПодстановки, МассивПодстановок);
	Подстановки.Вставить("Подстановки", ПодстановкаТитула);
	
	ПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыЗагрузки();
	ПараметрыЗагрузки.ДанныеДокумента           = Подстановки;
	
	ПараметрыЗагрузки.ИдСбис                    = Неопределено;
	ПараметрыЗагрузки.ИзДокумента               = Истина;
	ПараметрыЗагрузки.ЭтоЗаполнениеСПомощьюINI  = Истина;
	ПараметрыЗагрузки.ЭтоПервоеОснование        = ПараметрыЗаполнения.ЭтоПервоеОснование;
	ПараметрыЗагрузки.ИмяМетаданных             = ПараметрыЗаполнения.ИмяМетаданных;
	ПараметрыЗагрузки.НоменклатураГруза         = ПараметрыЗаполнения.НоменклатураГруза;
	ПараметрыЗагрузки.КлючСтроки                = ПараметрыЗаполнения.КлючСтроки;
	ПараметрыЗагрузки.СопроводительныеДокументы = ПараметрыЗаполнения.СопроводительныеДокументы;
	
	ПараметрыЗаполненияНаОсновании = Новый Структура;
	ПараметрыЗаполненияНаОсновании.Вставить("РольКонтрагента", ПараметрыЗаполнения.РольКонтрагента);
	ПараметрыЗагрузки.ПараметрыОснования = ПараметрыЗаполненияНаОсновании;
	
	Если ПараметрыЗаполнения.ЭтоВыбранныйДокумент Тогда
		ПараметрыЗагрузки.ДокументОснование      = ПараметрыЗаполнения.Основание;
		Если Не ПараметрыЗагрузки.ИзРасширения Тогда
			ПараметрыЗагрузки.ТипИсточника           = ПараметрыЗаполнения.Основание.Метаданные().ПолноеИмя();
			ПараметрыЗагрузки.ИдентификаторИсточника = Строка(ПараметрыЗаполнения.Основание.УникальныйИдентификатор());
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыЗаполнения.Свойство("Объект") Тогда
		ПараметрыЗагрузки.Ссылка = ПараметрыЗаполнения.Объект;
		ПараметрыЗагрузки.Вставить("Объект", ПараметрыЗаполнения.Объект);
	Иначе
		ПараметрыЗагрузки.Ссылка = ПараметрыЗаполнения.Ссылка;
	КонецЕсли;
	
	МодульКода("ESD_ТНЗагрузкаСервер").ЗаписатьДанныеДокумента(ПараметрыЗагрузки);
	
	УстановитьЗапретЗаполнения(ПараметрыЗаполнения);
	
	РезультатФункции.ТекстСообщения = "Заполнение на основании завершено";
	
	Если РезультатФункции.Ошибка Тогда
		ЗаписатьОшибкуВЖурналРегистрации(
			ПараметрыЗаполнения.Ссылка,
			"Заполнение не выполнено",
			РезультатФункции.ТекстСообщения);
	КонецЕсли;
	
	РезультатФункции.Вставить("Ссылка",           ПараметрыЗагрузки.Ссылка);
	РезультатФункции.Вставить("ЗапретЗаполнения", ПараметрыЗаполнения.ЗапретЗаполнения);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДанныеОснованийДляЗаполненияНаОснованииINI(ДокументОснование, ПараметрыЗаполнения = Неопределено) Экспорт
	ШаблонИмениИНИ = "%1";
	Если ПараметрыЗаполнения <> Неопределено Тогда
		ШаблонИмениИНИ = ПараметрыЗаполнения.ШаблонИмениИНИ;
	КонецЕсли;
	
	ИмяМетаданных = ИмяМетаданныхДокумента(ДокументОснование);
	РезультатФункции = Новый Массив;
	ИмяИНИ = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(ШаблонИмениИНИ, ИмяМетаданных);
	РезультатФункции.Добавить(СтруктураОснования(ДокументОснование, ИмяИНИ));
	
	ДобавитьТранспортнуюНакладную(РезультатФункции, ДокументОснование, ШаблонИмениИНИ);
	ДобавитьОснованияПоТранспортнойНакладной(РезультатФункции, ДокументОснование, ШаблонИмениИНИ);
	ДобавитьОснованияПоПоручениюЭкспедитору(РезультатФункции, ДокументОснование, ШаблонИмениИНИ);
	
	Возврат РезультатФункции;
КонецФункции

