
&НаСервере
Функция СтруктураОшибкиМетодаAPI(ИнформацияОбОшибке)
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер")
		.ОбъектОбработки()
		.NewExtExceptionСтруктура(ИнформацияОбОшибке);
КонецФункции

Процедура ЗаполнитьПараметрыЗагрузкиФайловПоСсылке(ПараметрыЗагрузки, ДополнительныеПараметры, ПовторноеПолучение = Ложь)
	ДанныеСостояния = МодульКода("ESD_ТНОбщегоНазначенияСервер")
		.ДанныеСостоянияОбъекта(ПараметрыЗагрузки.СсылкаНаДокумент);

	ПараметрыЗагрузки.Номер = ПараметрыЗагрузки.СсылкаНаДокумент.Номер;
	ПараметрыЗагрузки.Дата  = ПараметрыЗагрузки.СсылкаНаДокумент.Дата;
	Если ДанныеСостояния <> Неопределено Тогда
		ПараметрыЗагрузки.ИдентификаторСБИС = ДанныеСостояния.UID;
		ПараметрыЗагрузки.ЭтоЧерновик = Не ЗначениеЗаполнено(ДанныеСостояния.Состояние) 
			Или Не ЗначениеЗаполнено(ДанныеСостояния.Состояние.ИдентификаторСБИС);
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработатьИзменениеПечатнойФормы(АдресФайла, ПечатнаяФорма)
КонецПроцедуры

