
#Область ПрограммныйИнтерфейс

// Единая точка входа для всего функционала описанного в данном модуле
//
// Параметры:
//  ИмяФункции - Строка - имя функции описанной в данном модуле
//  Параметр1 - Произвольный - первый параметр вызываемой функции
//  Параметр2 - Произвольный - второй параметр вызываемой функции
//  Параметр3 - Произвольный - третий параметр вызываемой функции
//
// Возвращаемое значение:
//   Произвольный - зависит от конкретной вызванной функции
//
Функция РезультатФункцииТитуловЭПЛ(ИмяФункции, Параметр1 = Неопределено,
		Параметр2 = Неопределено, Параметр3 = Неопределено) Экспорт
	
	Если ИмяФункции = "ТитулОтказа" Тогда
		Возврат ТитулОтказаЭПЛ(Параметр1);
	ИначеЕсли ИмяФункции = "ЗначениеПоКоду" Тогда
		Возврат ЗначениеПоКодуЭПЛ(Параметр1);
	ИначеЕсли ИмяФункции = "ЗначениеПоИмениПодстановки" Тогда
		Возврат ЗначениеПоИмениПодстановкиЭПЛ(Параметр1);
	ИначеЕсли ИмяФункции = "ЗначениеПоПредставлению" Тогда
		Возврат ЗначениеПоПредставлениюЭПЛ(Параметр1);
	ИначеЕсли ИмяФункции = "ЗначениеПоЭтапу" Тогда
		Возврат ЗначениеПоЭтапуЭПЛ(Параметр1);
	ИначеЕсли ИмяФункции = "ПредставленияТитула" Тогда
		Возврат ПредставленияТитулаЭПЛ(Параметр1);
	ИначеЕсли ИмяФункции = "ПредставлениеПоИмениПодстановки" Тогда
		Возврат ПредставлениеПоИмениПодстановкиЭПЛ(Параметр1);
	ИначеЕсли ИмяФункции = "ЭтоДинамическийТитул" Тогда
		Возврат ЭтоДинамическийТитулЭПЛ(Параметр1);
	ИначеЕсли ИмяФункции = "ЭтоПервыйТитул" Тогда
		Возврат ЭтоПервыйТитулЭПЛ(Параметр1);
	ИначеЕсли ИмяФункции = "ПервыйТитул" Тогда
		Возврат ПервыйТитулЭПЛ();
	ИначеЕсли ИмяФункции = "СформироватьТаблицуДополнения" Тогда
		СформироватьТаблицуДополненияЭПЛ(Параметр1, Параметр2, Параметр3);
		Возврат Неопределено;
	ИначеЕсли ИмяФункции = "ПустаяСсылка" Тогда
		Возврат ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.ПустаяСсылка");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает для указанного титула данные титула отказа.
// В качестве параметра данной функции чаще всего используется последний успешный титул по документу,
// который был перед титулом отказа (УведомлениеОУточнении).
//
// Параметры:
//  ТипТитула - ПеречислениеСсылка.ESD_ТипТитулаЭПЛ - титул, для которого необходимо получить титул отказа.
//
// Возвращаемое значение:
//   Структура - данные титула отказа:
//     * Тип - ПеречислениеСсылка.ESD_ТипТитулаЭПЛ - титул, который был отменен.
//     * Представление - Строка - строковое представление титула отказа, для вывода пользователю.
//
Функция ТитулОтказаЭПЛ(ТипТитула) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Тип",           ПустаяСсылка());
	РезультатФункции.Вставить("Представление", "");
	
	Возврат РезультатФункции;
	
КонецФункции

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  КодТитула - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ESD_ТипТитулаЭПЛ - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция ЗначениеПоКодуЭПЛ(Знач КодТитула) Экспорт
	
	Если КодТитула = "1110380" Тогда
		Возврат Выпуск;
	ИначеЕсли КодТитула = "1110381" Тогда
		Возврат ПредрейсовыйМедосмотр;
	ИначеЕсли КодТитула = "1110382" Тогда
		Возврат ПредрейсовыйТехосмотр;
	ИначеЕсли КодТитула = "1110383" Тогда
		Возврат Выпускающий;
	ИначеЕсли КодТитула = "1110384" Тогда
		Возврат Принимающий;
	ИначеЕсли КодТитула = "1110385" Тогда
		Возврат ПослерейсовыйМедосмотр;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующее значение перечисления переданному имени подстановки.
//
// Параметры:
//  ИмяПодстановки - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ESD_ТипТитулаЭПЛ - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция ЗначениеПоИмениПодстановкиЭПЛ(Знач ИмяПодстановки) Экспорт
	ИмяПодстановки = НРег(СокрЛП(ИмяПодстановки));
	
	Если ИмяПодстановки = "ответственныйзавыпуск" Тогда
		Возврат Выпуск;
	ИначеЕсли ИмяПодстановки = "предрейсовыймедосмотр" Тогда
		Возврат ПредрейсовыйМедосмотр;
	ИначеЕсли ИмяПодстановки = "предрейсовыйтехосмотр" Тогда
		Возврат ПредрейсовыйТехосмотр;
	ИначеЕсли ИмяПодстановки = "выпускающий" Тогда
		Возврат Выпускающий;
	ИначеЕсли ИмяПодстановки = "принимающий" Тогда
		Возврат Принимающий;
	ИначеЕсли ИмяПодстановки = "послерейсовыймедосмотр" Тогда
		Возврат ПослерейсовыйМедосмотр;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующее значение перечисления переданному представлению.
//
// Параметры:
//  Представление - Строка - строковое представление титула в человекочитаемом формате.
//    Обычно совпадает с синонимом перечисления. Данное представление чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ESD_ТипТитулаЭПЛ - ссылка на перечисление.
//     Если по представлению ссылка не найдена, то возвращается пустая ссылка.
//
Функция ЗначениеПоПредставлениюЭПЛ(Знач Представление) Экспорт
	Представление = НРег(СокрЛП(Представление));
	
	Если Представление = "ответственный за выпуск" Тогда
		Возврат Выпуск;
	ИначеЕсли Представление = "предрейсовый медосмотр" Тогда
		Возврат ПредрейсовыйМедосмотр;
	ИначеЕсли Представление = "предрейсовый техосмотр" Тогда
		Возврат ПредрейсовыйТехосмотр;
	ИначеЕсли Представление = "выпуск в рейс" Тогда
		Возврат Выпускающий;
	ИначеЕсли Представление = "прием из рейса" Тогда
		Возврат Принимающий;
	ИначеЕсли Представление = "послерейсовый медосмотр" Тогда
		Возврат ПослерейсовыйМедосмотр;
	Иначе
		Возврат ЗначениеПоЭтапуЭПЛ(Представление);
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующее значение перечисления переданному этапу.
//
// Параметры:
//  НаименованиеЭтапа - Строка - строковое представление этапа в человекочитаемом формате.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ESD_ТипТитулаЭПЛ - ссылка на перечисление.
//     Если по представлению ссылка не найдена, то возвращается пустая ссылка.
//
Функция ЗначениеПоЭтапуЭПЛ(Знач НаименованиеЭтапа) Экспорт
	Перем Результат;
	
	НаименованиеЭтапа = НРег(СокрЛП(НаименованиеЭтапа));
	Если ЭтоВыпуск(НаименованиеЭтапа) Тогда
		Результат = Выпуск;
	ИначеЕсли ЭтоПредрейсовыйМедосмотрЭПЛ(НаименованиеЭтапа) Тогда
		Результат = ПредрейсовыйМедосмотр;
	ИначеЕсли НаименованиеЭтапа = "внутренний то"
		Или НаименованиеЭтапа = "внешний то"
		Или НаименованиеЭтапа = "техосмотр" 
	Тогда
		Результат = ПредрейсовыйТехосмотр;
	ИначеЕсли НаименованиеЭтапа = "выпуск в рейс" Тогда
		Результат = Выпускающий;
	ИначеЕсли НаименованиеЭтапа = "приемка" Тогда
		Результат = Принимающий;
	ИначеЕсли ЭтоПослерейсовыйМедосмотрЭПЛ(НаименованиеЭтапа) Тогда
		Результат = ПослерейсовыйМедосмотр;
	Иначе
		Результат = ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Возвращает представление титула соответствующее переданному имени подстановки.
//
// Параметры:
//  ИмяПодстановки - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   Структура - структура различных представлений типа титула.
//     Перечень доступных значений см. в функции ESD_ТНОбщегоНазначенияСервер.СтруктураПредставленияТитула
//
Функция ПредставлениеПоИмениПодстановкиЭПЛ(Знач ИмяПодстановки) Экспорт
	Перем Результат;
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	Если ИмяПодстановки = "ОтветственныйЗаВыпуск" Тогда
		Результат = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(
			Выпуск, "1110380", "ОтветственныйЗаВыпуск");
	ИначеЕсли ИмяПодстановки = "ПредрейсовыйМедосмотр" Тогда
		Результат = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(
			ПредрейсовыйМедосмотр, "1110381", "ПредрейсовыйМедосмотр");
	ИначеЕсли ИмяПодстановки = "ПредрейсовыйТехосмотр" Тогда
		Результат = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(
			ПредрейсовыйТехосмотр, "1110382", "ПредрейсовыйТехосмотр");
	ИначеЕсли ИмяПодстановки = "Выпускающий" Тогда
		Результат = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(
			Выпускающий, "1110383", "Выпускающий");
	ИначеЕсли ИмяПодстановки = "Принимающий" Тогда
		Результат = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(
			Принимающий, "1110384", "Принимающий");
	ИначеЕсли ИмяПодстановки = "ПослерейсовыйМедосмотр" Тогда
		Результат = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(
			ПослерейсовыйМедосмотр, "1110385", "ПослерейсовыйМедосмотр");
	Иначе
		Результат = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(ПустаяСсылка(), "", "");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру различных представлений указанной ссылки на тип титула.
// Используется для исключения лишних запросов к базе.
//
// Параметры:
//  СсылкаНаТитул - ПеречислениеСсылка.ESD_ТипТитулаЭПЛ - ссылка на титул,
//    для которого необходимо получить представления.
//
// Возвращаемое значение:
//   Структура - структура различных представлений типа титула.
//     Перечень доступных значений см. в функции ESD_ТНОбщегоНазначенияСервер.СтруктураПредставленияТитула
//
Функция ПредставленияТитулаЭПЛ(СсылкаНаТитул) Экспорт
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	Если ЭтоПервыйТитулЭПЛ(СсылкаНаТитул) Тогда
		РезультатФункции = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(
			Выпуск, "1110380", "ОтветственныйЗаВыпуск");
	ИначеЕсли СсылкаНаТитул = ПредрейсовыйМедосмотр Тогда
		РезультатФункции = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(
			ПредрейсовыйМедосмотр, "1110381", "ПредрейсовыйМедосмотр");
	ИначеЕсли СсылкаНаТитул = ПредрейсовыйТехосмотр Тогда
		РезультатФункции = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(
			ПредрейсовыйТехосмотр, "1110382", "ПредрейсовыйТехосмотр");
	ИначеЕсли СсылкаНаТитул = Выпускающий Тогда
		РезультатФункции = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(
			Выпускающий, "1110383", "Выпускающий");
	ИначеЕсли СсылкаНаТитул = Принимающий Тогда
		РезультатФункции = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(
			Принимающий, "1110384", "Принимающий");
	ИначеЕсли СсылкаНаТитул = ПослерейсовыйМедосмотр Тогда
		РезультатФункции = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(
			ПослерейсовыйМедосмотр, "1110385", "ПослерейсовыйМедосмотр");
	Иначе
		РезультатФункции = МодульТНОбщегоНазначенияСервер.СтруктураПредставленияТитула(ПустаяСсылка(), "", "");
	КонецЕсли;
	
	Возврат РезультатФункции;

КонецФункции

// Проверяет является ли титул динамическим.
//
// Параметры:
//  ТипТитула - ПеречислениеСсылка.ESD_ТипТитулаЭПЛ - титул для проверки
//
// Возвращаемое значение:
//   Булево - Истина, если динамический.
//
Функция ЭтоДинамическийТитулЭПЛ(ТипТитула) Экспорт
	
    Возврат Ложь;
	
КонецФункции

// Проверяет является ли титул первым в документообороте
//
// Параметры:
//  ТипТитула - ПеречислениеСсылка.ESD_ТипТитулаЭПЛ - титул для проверки
//
// Возвращаемое значение:
//   Булево - Истина, если титул погрузки.
//
Функция ЭтоПервыйТитулЭПЛ(ТипТитула) Экспорт
	
	Возврат Не ЗначениеЗаполнено(ТипТитула) Или ТипТитула = Выпуск;
	
КонецФункции

// Возвращает первый титул в документообороте
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ESD_ТипТитулаЭПЛ - первый титул
//
Функция ПервыйТитулЭПЛ() Экспорт
	
	Возврат Выпуск;
	
КонецФункции

// Формирует временную таблицу основных титулов для вывода в ленту
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер для сохранения таблицы дополнений.
//  ТекущиеЭтапыДокумента - Массив - массив ссылок текущих этапов документа
//  СсылкаНаДокумент - ДокументСсылка.ESD_ПутевойЛист - ссылка на конкретный документ
//
Процедура СформироватьТаблицуДополненияЭПЛ(МенеджерВременныхТаблиц, ТекущиеЭтапыДокумента, СсылкаНаДокумент) Экспорт
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ВложенныйЗапрос.ЭтоЗаменаВодителя) КАК ЭтоЗаменаВодителя
	|ПОМЕСТИТЬ ДанныеТекущегоДокумента
	|ИЗ
	|	(ВЫБРАТЬ
	|		ESD_ПутевойЛист.ПЛПредыдущий <> """"
	|			ИЛИ ESD_ПутевойЛист.ДокументОснование_Идентификатор <> """"
	|				И ESD_ПутевойЛист.ДокументОснование_ОбъектМетаданных = &ПутевойЛист КАК ЭтоЗаменаВодителя
	|	ИЗ
	|		#ESD_ПутевойЛист КАК ESD_ПутевойЛист
	|	ГДЕ
	|		ESD_ПутевойЛист.Ссылка = &СсылкаНаДокумент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 1), ДЕНЬ) КАК Период,
	|	&Выпуск КАК ТипТитула,
	|	"""" КАК ИдентификаторТитула,
	|	ИСТИНА КАК Основной,
	|	"""" КАК Данные,
	|	&ПустаяСсылка КАК ТипТитулаОтказа,
	|	0 КАК ТипТитулаПорядок,
	|	ЛОЖЬ КАК ЭтоТекущийЭтап
	|ПОМЕСТИТЬ ТаблицаДополнения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 2), ДЕНЬ),
	|	&ПредрейсовыйМедосмотр,
	|	"""",
	|	ИСТИНА,
	|	"""",
	|	&ПустаяСсылка,
	|	1,
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 3), ДЕНЬ),
	|	&ПредрейсовыйТехосмотр,
	|	"""",
	|	ИСТИНА,
	|	"""",
	|	&ПустаяСсылка,
	|	2,
	|	ЛОЖЬ
	|ИЗ
	|	ДанныеТекущегоДокумента КАК ДанныеТекущегоДокумента
	|ГДЕ
	|	НЕ ДанныеТекущегоДокумента.ЭтоЗаменаВодителя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 4), ДЕНЬ),
	|	&Выпускающий,
	|	"""",
	|	ИСТИНА,
	|	"""",
	|	&ПустаяСсылка,
	|	3,
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 5), ДЕНЬ),
	|	&Принимающий,
	|	"""",
	|	ИСТИНА,
	|	"""",
	|	&ПустаяСсылка,
	|	4,
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 6), ДЕНЬ),
	|	&ПослерейсовыйМедосмотр,
	|	"""",
	|	ИСТИНА,
	|	"""",
	|	&ПустаяСсылка,
	|	5,
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеТекущегоДокумента";
	
	ЗапросДанных.УстановитьПараметр("ПутевойЛист", ПутевойЛист());
	
	ЗапросДанных.УстановитьПараметр("Выпуск",                 Выпуск);
	ЗапросДанных.УстановитьПараметр("ПредрейсовыйМедосмотр",  ПредрейсовыйМедосмотр);
	ЗапросДанных.УстановитьПараметр("ПредрейсовыйТехосмотр",  ПредрейсовыйТехосмотр);
	ЗапросДанных.УстановитьПараметр("Выпускающий",            Выпускающий);
	ЗапросДанных.УстановитьПараметр("Принимающий",            Принимающий);
	ЗапросДанных.УстановитьПараметр("ПослерейсовыйМедосмотр", ПослерейсовыйМедосмотр);
	ЗапросДанных.УстановитьПараметр("ПустаяСсылка",           ПустаяСсылка());
	
	ЗапросДанных.УстановитьПараметр("ТекущаяДата",      ТекущаяДатаСеанса());
	ЗапросДанных.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	
	ТипДокумента = СокрЛП(ТипЗнч(СсылкаНаДокумент));
	Если Найти(ТипДокумента, "SABY") > 0 Тогда
		ТестЗамены = "Документ.SABY_ПутевойЛист";
	Иначе 	
		ТестЗамены = "Документ.ESD_ПутевойЛист";
	КонецЕсли;	
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "#ESD_ПутевойЛист", ТестЗамены);
				
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

// Проверим что титул предрейсовый медосмотр дистанционный
//
// Параметры:
//  НаименованиеЭтапа - Строка - Наименование титула
//
// Возвращаемое значение:
//   Булево - Это предрейсовый медосмотр дистанционный
//
Функция ЭтоПредрейсовыйМедосмотрЭПЛДистанционный(НаименованиеЭтапа) Экспорт
	Возврат НаименованиеЭтапа = "медосмотр дистанционный";	
КонецФункции

// Проверим что титул послерейсовый медосмотр дистанционный
//
// Параметры:
//  НаименованиеЭтапа - Строка - Наименование титула
//
// Возвращаемое значение:
//   Булево - Это послерейсовый медосмотр дистанционный
//
Функция ЭтоПослерейсовыйМедосмотрЭПЛДистанционный(НаименованиеЭтапа) Экспорт
	Возврат НаименованиеЭтапа = "медосмотр дистанционный послерейсовый";	
КонецФункции
	
#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ЭтоПредрейсовыйМедосмотрЭПЛ(НаименованиеЭтапа)
	Возврат НаименованиеЭтапа = "внутренний мо"
		Или НаименованиеЭтапа = "внешний мо"
		Или НаименованиеЭтапа = "мо внешней системой"
		Или ЭтоПредрейсовыйМедосмотрЭПЛДистанционный(НаименованиеЭтапа)
		Или НаименованиеЭтапа = "медосмотр";	
КонецФункции

Функция ЭтоПослерейсовыйМедосмотрЭПЛ(НаименованиеЭтапа)	
	Возврат НаименованиеЭтапа = "внутренний послерейсовый мо"
		Или НаименованиеЭтапа = "внешний послерейсовый мо"
		Или НаименованиеЭтапа = "послерейсовый медосмотр"
		Или НаименованиеЭтапа = "послерейсовый мо внешней системой"
		Или ЭтоПослерейсовыйМедосмотрЭПЛДистанционный(НаименованиеЭтапа)
		Или НаименованиеЭтапа = "пост-медосмотр";	
КонецФункции

Функция ЭтоВыпуск(НаименованиеЭтапа)
	Возврат НаименованиеЭтапа = "отправка" 
		Или НаименованиеЭтапа = "ответственный за выпуск";
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область includr_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // includr_etrn_base_CommonModule_ЗначениеМетаданных

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_Метаданные
#КонецОбласти // includr_etrn_base_CommonModule_Метаданные
