
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Новый элемент
	Если Объект.Ссылка.Пустая() Тогда 		
		Объект.СтранаРегистрации = "Россия";		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура СтранаРегистрацииПриИзменении(Элемент)
	
	Если НРег(Объект.СтранаРегистрации) <> "россия" Тогда 
	    Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.Saby_ЮрФизЛицо.ЮрЛицоНеРезидент");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// убираем пробелы
	Объект.ИНН = СокрЛП(Объект.ИНН);
	
	ДлинаИНН = СтрДлина(Объект.ИНН);
	
	ДлинаИННЮрЛица  = 10;
	ДлинаИННФизЛица = 12;
	
	ЭтоЮрЛицо  = Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.Saby_ЮрФизЛицо.ЮрЛицо"); 
	
	ИП      = ПредопределенноеЗначение("Перечисление.Saby_ЮрФизЛицо.ИндивидуальныйПредприниматель");
	ФизЛицо = ПредопределенноеЗначение("Перечисление.Saby_ЮрФизЛицо.ФизЛицо");
	
    ЭтоИПФизЛицо = Объект.ЮрФизЛицо = ИП Или Объект.ЮрФизЛицо = ФизЛицо;
	
	ОшибкаЮрЛица  = ЭтоЮрЛицо И ДлинаИНН <> ДлинаИННЮрЛица;
	ОшибкаФизЛица = ЭтоИПФизЛицо И ДлинаИНН <> ДлинаИННФизЛица;
	Ошибка        = Макс(ОшибкаЮрЛица, ОшибкаФизЛица);
					
	Если Ошибка Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не верно указан ИНН! Для юр лиц - 10 символов, для ИП и физ лиц - 12 символов";
		Сообщение.Поле  = "Объект.ИНН";
		Сообщение.Сообщить();		
		Отказ = Истина;
				
	КонецЕсли;
	
КонецПроцедуры
