
#Область ПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ОбщиеСтруктуры
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ОбщиеСтруктуры

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_РаботаСЮрЛицами
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_РаботаСЮрЛицами

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ПредставлениеДанных
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ПредставлениеДанных

#Область ТранспортныеСредстваИнтерфейс

//DynamicDirective

// Возвращает строки транспортных средств по виду транспортного средства
//
// Параметры:
//  ТранспортныеСредства - ТабличнаяЧасть - табличная часть транспортных средств
//  ВидТС - ПеречислениеСсылка.Saby_ВидыТС - вид транспортного средства для получения строк
//
// Возвращаемое значение:
//   Массив - массив строк табличной части
//
Функция СтрокиТС(ТранспортныеСредства, ВидТС) Экспорт
	
	РезультатФункции = Новый Массив;
	
	Для Каждого СтрокаТС Из ТранспортныеСредства Цикл
		Если СтрокаТС.Вид = ВидТС Тогда
			РезультатФункции.Добавить(СтрокаТС);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective

// Обновляет реквизиты формы связанные с транспортными средствами.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для обновления реквизитов
//
Процедура ОбновитьТранспортныеСредстваНаФорме(Форма) Экспорт
	
	ОтборПрицепов = Новый Структура;
	ОтборПрицепов.Вставить("Вид", ЗначениеМетаданных("ESD_ВидыТС.Прицеп"));
	ОтборПрицепов = Новый ФиксированнаяСтруктура(ОтборПрицепов);
	
	Форма.Элементы.Прицепы.ОтборСтрок = ОтборПрицепов;
	
	СформироватьНадписьПрицепыСтрокой(Форма);
	
	СформироватьНадписьТранспортноеСредствоСтрокой(Форма);
	
КонецПроцедуры

#КонецОбласти // ТранспортныеСредстваИнтерфейс

//DynamicDirective

// Добавить или заменить существующий элемент отбора динамического списка.
//
// Параметры:
//   Список - ДинамическийСписок - список, в котором требуется установить отбор.
//   ЗначениеОтбора - Произвольный - значение отбора.
//   ИмяПоляДинамическогоСписка - Строка - поле, по которому необходимо установить отбор.
//
Процедура УстановитьЭлементОтбораДинамическогоСписка(Список, ЗначениеОтбора, ИмяПоляДинамическогоСписка) Экспорт
	
	Если ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
		СпособСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Иначе
		СпособСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ПараметрыУстановки = ПараметрыУстановкиЭлементаДинамическогоСписка(Список, ИмяПоляДинамическогоСписка, ЗначениеОтбора);
	ПараметрыУстановки.ВидСравнения  = СпособСравнения;
	ПараметрыУстановки.Использование = ЗначениеЗаполнено(ЗначениеОтбора);
	
	УстановитьЭлементОтбораДинамическогоСпискаБСП(ПараметрыУстановки);
	
КонецПроцедуры

//DynamicDirective

// Обновляет представление водителей на форме
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для обновления данных
//
Процедура ОбновитьВодителейНаФорме(Форма) Экспорт
	
	ФормаОбъект = ФормаОбъект(Форма);
	
	РольВодитель = ЗначениеМетаданных("ESD_РолиОтветственных.Водитель");
	
	МассивСтрокПредставления = Новый Массив;
	
	Для Каждого СтрокаОтветственного Из ФормаОбъект.ОтветственныеЛица Цикл
		Если СтрокаОтветственного.Роль <> РольВодитель Тогда
			Продолжить;
		КонецЕсли;
		СтрокаОтветственного.ФИО = ПредставлениеФИО(СтрокаОтветственного);
		СтрокаОтветственного.ВУ  = ПредставлениеВУ(СтрокаОтветственного);
		МассивСтрокПредставления.Добавить(СокрЛП(СтрокаОтветственного.ФИО));
	КонецЦикла;
	
	Форма.ВодителиСтрокой = СтрСоединитьЭПД(МассивСтрокПредставления, ", ");
	Если Не ЗначениеЗаполнено(Форма.ВодителиСтрокой) Тогда
		Форма.ВодителиСтрокой = "Заполнить";
	КонецЕсли;
	
КонецПроцедуры

//DynamicDirective

// Ищет документ ЭПД по ключу строки
//
// Параметры:
//  ДокументыЭПД - ТаблицаЗначений - таблица документов для поиска
//  КлючСтроки - Число - значение для поиска по ключу
//
// Возвращаемое значение:
//   Строка - найденная строка по ключу
//
Функция ПоискДокументаЭПДПоКлючу(ДокументыЭПД, КлючСтроки) Экспорт
	
	// найдем строку документа ЭПД
	ОтборЭПД = Новый Структура;
	ОтборЭПД.Вставить("КлючСтроки", КлючСтроки);
	
	НайденныеСтрокиЭПД = НайтиСтрокиУниверсально(ДокументыЭПД, ОтборЭПД);
	Если НайденныеСтрокиЭПД.Количество() Тогда
		Результат =  НайденныеСтрокиЭПД[0];
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

// Создает массив и помещает в него переданное значение.
//
// Параметры:
//  Значение - Произвольный - любое значение.
//
// Возвращаемое значение:
//  Массив - массив из одного элемента.
//
Функция ЗначениеВМассиве(Знач Значение) Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Значение);
	Возврат Результат;
	
КонецФункции

#Область ОтветственныеЛицаИнтерфейс

// Найдем ответсвенного по роли или идентификатору строки
// Параметры:
// 	ОтветственныеЛица   - ТаблицаЗначений - ответсвенные лица документа ЭПД  
// 	РольСтрокой         - Строка          - представление роли из перечисления "Saby_РолиОтветственных"  
//  ИдентификаторСтроки - Число           - идентификатор строки ТаблицыЗначений
//   
// Возвращаемое значение:
// 	СтрокаТаблицыЗначений - строка с нужной ролью
//
Функция СтруктураОтветственного(Знач ОтветственныеЛица, Знач РольСтрокой, Знач ИдентификаторСтроки = Неопределено) Экспорт
	
	РезультатФункции = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОтветственногоЛица();
	
	Если ИдентификаторСтроки = Неопределено Тогда
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Роль", ЗначениеМетаданных("ESD_РолиОтветственных." + РольСтрокой));
		
		НайденныеСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(
			ОтветственныеЛица, СтруктураПоиска);
			
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(РезультатФункции, НайденныеСтроки[0]);
			ИдентификаторСтроки = ИдентификаторКоллекции(ОтветственныеЛица, НайденныеСтроки[0]);
			РезультатФункции.ИдентификаторСтроки = ИдентификаторСтроки;
		Иначе
			РезультатФункции.Роль = СтруктураПоиска.Роль;
		КонецЕсли;
		
	Иначе
		
		СтрокаОтветственного = НайтиПоИдентификаторуУниверсально(ОтветственныеЛица, ИдентификаторСтроки);
	
		ЗаполнитьЗначенияСвойств(РезультатФункции, СтрокаОтветственного);
		РезультатФункции.ИдентификаторСтроки = ИдентификаторСтроки;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // ОтветственныеЛицаИнтерфейс

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_Общие
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_Общие

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_РолиКонтрагентов
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_РолиКонтрагентов

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ФормаОбъект
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ФормаОбъект

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ФайлВРасширении
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ФайлВРасширении

//DynamicDirective

// Возвращает имя дополнительного свойства Код филиала
//
// Возвращаемое значение:
//   Строка - наименование свойства
//
Функция ИмяСвойстваКодФилиала() Экспорт
	
	Возврат "СБИС_КодФилиала";
	
КонецФункции

//DynamicDirective

// Возвращает имя дополнительного свойства идентификатор
//
// Возвращаемое значение:
//   Строка - наименование свойства
//
Функция ИмяСвойстваИдентификатор() Экспорт
	
	Возврат "СБИС_Идентификатор";
	
КонецФункции

//DynamicDirective

// Возвращает параметры необходимые для выгрузки очередного титула документа
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на выгружаемый документ
//
// Возвращаемое значение:
//   Структура - параметры необходимые для выгрузки очередного титула документа
//
Функция ПараметрыВыгрузки(СсылкаНаДокумент) Экспорт
	
	РезультатФункции = Новый Структура;
	
	РезультатФункции.Вставить("Этап",                 "");
	РезультатФункции.Вставить("ТипТитула",            Неопределено);
	РезультатФункции.Вставить("КодТитула",            "");
	РезультатФункции.Вставить("ИдентификаторСБИС",    "");
	
	РезультатФункции.Вставить("Ссылка",                 СсылкаНаДокумент);
	РезультатФункции.Вставить("ТипИсточника",           "");
	РезультатФункции.Вставить("ИдентификаторИсточника", ""); 
	РезультатФункции.Вставить("ИмяМетаданных",          "");
	РезультатФункции.Вставить("ПараметрыДляАПИ",        Неопределено);
	РезультатФункции.Вставить("СтруктураДокумента",     Неопределено);
	РезультатФункции.Вставить("ДанныеДокумента",        Неопределено);
	
	РезультатФункции.Вставить("ДинамическийТитул",             Ложь);
	РезультатФункции.Вставить("ОтрицательныйПереход",          Ложь);
	РезультатФункции.Вставить("ПричинаОтрицательногоПерехода", "");
	
	// ФЛК
	РезультатФункции.Вставить("ВыполнитьФЛК",            Истина);
	РезультатФункции.Вставить("ПроверятьПоляСОХ",        Ложь);
	РезультатФункции.Вставить("ПроверятьПоляОтгрузчика", Ложь);
	
	РезультатФункции.Вставить("ВыгрузкаНаКлиенте", Ложь);
	РезультатФункции.Вставить("ИзРасширения",      Истина);
	РезультатФункции.Вставить("ЗаменаВодителя",    Ложь);
	
	РезультатФункции.Вставить("ЭтоВыгрузкаЧерновика", Ложь);
	РезультатФункции.Вставить("СоставительЧерновика", Неопределено);
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective

// Возвращает структуру параметров загрузки для дальнейшего вызова функции ЗагрузкаДанныхДокумента
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на выгружаемый документ
//
// Возвращаемое значение:
//   Структура - структура параметров с фиксированными колонками:
//     * ИдСбис - Строка - идентификатор СБИС
//     * ДанныеДокумента - Соответствие - полученные данные с онлайна
//     * Ссылка - ДокументСсылка.Saby_ТранспортнаяНакладная - ссылка на документ в базе,
//       в который будут загружены данные.
//     * ИзДокумента - Булево - признак запуска загрузки из документа. Если ложь, то запуск из списка документов.
//     * ЭтоЗаполнениеСПомощьюINI - Булево - признак загрузки данных из другого документа, а не с онлайна.
//     * ДокументОснование - ДокументСсылка - ссылка на документ, на основании которого загружаются данные.
//     * ТекущийТитул - ПеречислениеСсылка.Saby_ТипТитулаЭтрН - тип титула, который необходимо загрузить.
//       Если Неопределено, то загружаются титулы полученные функцией ТитулыДляЗагрузки()
//
Функция ПараметрыЗагрузки(СсылкаНаДокумент = Неопределено) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ИдСбис",                    "");
	РезультатФункции.Вставить("ДанныеДокумента",           Новый Соответствие);
	РезультатФункции.Вставить("Ссылка",                    СсылкаНаДокумент);
	РезультатФункции.Вставить("ТипИсточника",              "");
	РезультатФункции.Вставить("ИдентификаторИсточника",    ""); 
	РезультатФункции.Вставить("ИзДокумента",               Ложь);
	РезультатФункции.Вставить("ИмяМетаданных",             "");
	
	РезультатФункции.Вставить("ЭтоЗаполнениеСПомощьюINI",  Ложь);
	РезультатФункции.Вставить("ДокументОснование",         Неопределено);
	РезультатФункции.Вставить("ПараметрыОснования",        Новый Структура);
	РезультатФункции.Вставить("ЭтоПервоеОснование",        Истина);
	РезультатФункции.Вставить("НоменклатураГруза",         Новый Соответствие);
	РезультатФункции.Вставить("КлючСтроки",                Новый Структура);
	РезультатФункции.Вставить("СопроводительныеДокументы", Новый Массив);
	
	РезультатФункции.Вставить("ТекущийТитул",              Неопределено);
	РезультатФункции.Вставить("ТолькоАктивныйЭтап",        Ложь);
	
	РезультатФункции.Вставить("ЗагрузкаНаКлиенте", Ложь);
	РезультатФункции.Вставить("ИзРасширения",      Истина);
	
	РезультатФункции.Вставить("ЭтоЗагрузкаЧерновика", Ложь);
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective

// Возвращает параметры документа для использования в методах АПИ
//
// Параметры:
//  ИмяМетаданных - Строка - имя метаданных документа
//  СторонняяОрганизация - Булево - признак того, что титул отправляет сторонняя организация.
//
// Возвращаемое значение:
// 	Структура - параметры документа
//
Функция ПараметрыДокументаДляАПИ(ИмяМетаданных, СторонняяОрганизация = Ложь) Экспорт
		
	Если ИмяМетаданных = ТранспортнаяНакладнаяКлиент() Тогда
		
		ТипДляАПИ             = "ConsignmentNote";
		РегламентДляАПИ       = "Транспортная накладная";
		ИдентификаторДляАПИ   = "ad40d873-9d1e-47d7-b7e9-f39636b36301";
		ТипДляВыгрузкиДляАПИ  = "ЭТрН";		
		ИмяПеречисленияДляАПИ = ТипТитулаЭтрНКлиент();
				
	ИначеЕсли ИмяМетаданных = ПутевойЛистКлиент() Тогда
		
		ТипДляАПИ             = "Waybill";
		ТипДляВыгрузкиДляАПИ  = "Waybill";
		ИмяПеречисленияДляАПИ = ТипТитулаЭПЛКлиент();
		
		Если СторонняяОрганизация Тогда
			РегламентДляАПИ      = "ЭПЛ (Входящий)";
			ИдентификаторДляАПИ  = "48e4c1ba-a877-4f16-8a25-da0cf3209bf8";
		Иначе
			РегламентДляАПИ      = "ЭПЛ";
			ИдентификаторДляАПИ  = "7b589621-deec-488c-ada2-5df9db6c329e";
		КонецЕсли;
		
	ИначеЕсли ИмяМетаданных = ЗаказНаПеревозкуКлиент() Тогда
		
		ТипДляАПИ             = "TransportOrder";
		ТипДляВыгрузкиДляАПИ  = "TransportOrder";
		ИмяПеречисленияДляАПИ = ТипТитулаЗнПКлиент();
		
		Если СторонняяОрганизация Тогда
			РегламентДляАПИ      = "Заказ на перевозку (Входящий)";
			ИдентификаторДляАПИ  = "e000d24d-35a7-4a31-a692-22405b34dfbe";
		Иначе
			РегламентДляАПИ      = "Заказ на перевозку";
			ИдентификаторДляАПИ  = "6c052893-6b54-4f55-baf5-83e515b5aff4";
		КонецЕсли;
		
	Иначе
		
		ТипДляАПИ             = "";
		РегламентДляАПИ       = "";
		ИдентификаторДляАПИ   = "";
		ТипДляВыгрузкиДляАПИ  = "";
		ИмяПеречисленияДляАПИ = "";
		
	КонецЕсли;
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Тип",                     ТипДляАПИ);
	РезультатФункции.Вставить("Регламент",               РегламентДляАПИ);
	РезультатФункции.Вставить("ИдентификаторРегламента", ИдентификаторДляАПИ);
	РезультатФункции.Вставить("ТипДляВыгрузки",          ТипДляВыгрузкиДляАПИ);
	РезультатФункции.Вставить("ИмяПеречисления",         ИмяПеречисленияДляАПИ); 
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective

// Формирует структуру для накопления результата выгрузки или загрузки данных в/из СБИС
//
// ВАЖНО!!! Данная структура ожидается в модуле Saby_ТНОбщегоНазначенияКлиент
//   при обработке результата длительной операции в функции ОбработатьРезультатКоманды.
//   Поэтому при изменении структуры обязательно нужно проверить модуль Saby_ТНОбщегоНазначенияКлиент.
//
// Параметры:
//  Всего - Число - общее количество обрабатываемых документов.
//
// Возвращаемое значение:
//   Структура - данные для накопления результатов выгрузки или загрузки
//
Функция РезультатВзаимодействияСоСБИС(Всего) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Итог", Новый Структура);
	
	РезультатФункции.Итог.Вставить("Успех",      Ложь);
	РезультатФункции.Итог.Вставить("Количество", 0);
	РезультатФункции.Итог.Вставить("Всего",      Всего);
	
	РезультатФункции.Вставить("Ошибки",              Новый Соответствие);
	РезультатФункции.Вставить("ОшибкиОбщие",         Новый Массив);
	РезультатФункции.Вставить("Успешные",            Новый Массив);
	РезультатФункции.Вставить("ОшибкаСопоставления", Новый Структура);
	
	РезультатФункции.Вставить("НовыеОпасныеГрузы",    Новый Массив);
	РезультатФункции.Вставить("НовыеВидыУпаковки",    Новый Массив);
	РезультатФункции.Вставить("ОпасныеГрузыСОнлайна", Неопределено);
	РезультатФункции.Вставить("ВидыУпаковкиСОнлайна", Неопределено);
	
	РезультатФункции.Вставить("Выполнение", Новый Структура);
	РезультатФункции.Выполнение.Вставить("НаКлиенте",            Ложь);
	РезультатФункции.Выполнение.Вставить("ИзРасширения",         Истина);
	РезультатФункции.Выполнение.Вставить("Параметры",            Новый Массив);
	РезультатФункции.Выполнение.Вставить("ЭтапДляПерехода",      Неопределено);
	РезультатФункции.Выполнение.Вставить("ЭтоВыгрузкаЧерновика", Ложь);
	
	Возврат РезультатФункции;
	
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_СвойстваЭлементовФормы
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_СвойстваЭлементовФормы

//DynamicDirective

// Возвращает признак того, что документооборот завершен.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма на которой необходимо показать данные
//
// Возвращаемое значение:
//   Булево - Истина, если завершен
//
Функция ДокументооборотЗавершен(Форма) Экспорт
	
	ДОЗавершенОтрицательно = ИндексКартинки_ДОЗавершенОтрицательно();
	ДОЗавершенПоложительно = ИндексКартинки_ДОЗавершенПоложительно();
	
	Возврат Форма.ИндексКартинки = ДОЗавершенОтрицательно Или Форма.ИндексКартинки = ДОЗавершенПоложительно;
	
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_РаботаСоСвязаннымиТаблицами
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_РаботаСоСвязаннымиТаблицами

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ДинамическиеСписки
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ДинамическиеСписки

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ПолучениеДанныхИзКоллекций
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ПолучениеДанныхИзКоллекций

//DynamicDirective

// Сравнить две версии.
//
// Параметры:
//  Версия1 - Строка,РежимСовместимости - номер версии в формате РР.{П|ПП}.ЗЗ.СС.
//  Версия2 - Строка,РежимСовместимости - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(Знач Версия1, Знач Версия2) Экспорт
	
	СтрокаВерсии1 = ПреобразоватьВерсиюВСтроку(Версия1);
	СтрокаВерсии2 = ПреобразоватьВерсиюВСтроку(Версия2);
	
	КоличествоСоставляющих = 4;
	ВерсияМассив1 = СтрРазделитьЭПД(СтрокаВерсии1, ".");
	Пока ВерсияМассив1.Количество() <> КоличествоСоставляющих Цикл
		ВерсияМассив1.Добавить("0");
	КонецЦикла;
	ВерсияМассив2 = СтрРазделитьЭПД(СтрокаВерсии2, ".");
	Пока ВерсияМассив2.Количество() <> КоличествоСоставляющих Цикл
		ВерсияМассив2.Добавить("0");
	КонецЦикла;
	
	Результат = 0;
	Для Разряд = 0 По КоличествоСоставляющих - 1 Цикл
		Результат = Число(ВерсияМассив1[Разряд]) - Число(ВерсияМассив2[Разряд]);
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_РаботаСоСтроками
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_РаботаСоСтроками

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ЗаполнениеНаОснованииИНИ
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ЗаполнениеНаОснованииИНИ

//DynamicDirective
Процедура ОбновитьЭлементыИныхПолучателей(Форма, КоличествоИныхПолучателей = Неопределено) Экспорт
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	КоличествоПолучателей = 0;
	Если КоличествоИныхПолучателей <> Неопределено Тогда
		КоличествоПолучателей = КоличествоИныхПолучателей;
	Иначе
		ФормаОбъект = МодульТНОбщегоНазначенияКлиентСервер.ФормаОбъект(Форма);
		
		ОтборИныхПолучателей = Новый Структура("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.ИнойПолучатель"));
		ИныеПолучатели = МодульТНОбщегоНазначенияКлиентСервер.НайтиСтрокиУниверсально(ФормаОбъект.ДанныеЮрЛиц, ОтборИныхПолучателей);
		КоличествоПолучателей = ИныеПолучатели.Количество();
	КонецЕсли;
	
	ТекстКоличествоИныхПолучателей = " (%1)";
	Если КоличествоПолучателей > 0 Тогда
		ТекстКоличествоИныхПолучателей = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
			ТекстКоличествоИныхПолучателей, Формат(КоличествоПолучателей, "ЧДЦ=0; ЧГ="));
	Иначе
		ТекстКоличествоИныхПолучателей = "";
	КонецЕсли;
	Форма.Элементы.ФормаИныеПолучателиДокумента.Заголовок = "Иные получатели документа" + ТекстКоличествоИныхПолучателей;
	
КонецПроцедуры

//DynamicDirective
Функция URL_АдресСБИС() Экспорт
	
	Возврат "online.sbis.ru";
	
КонецФункции

//DynamicDirective
Функция АлиасДоменаСБИС() Экспорт
	
	Возврат "ie-1c.saby.ru";
	
КонецФункции

Функция СообщениеПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		ЭтоОбъект = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	
	Если Не ПустаяСтрока(Поле) Тогда
		Сообщение.Поле = Поле;
	КонецЕсли;
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Возврат Сообщение;
	
КонецФункции

#Область ДанныеФункции

Функция ДанныеФункции(ТекстФормулы) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Имя",       "");
	РезультатФункции.Вставить("Параметры", Новый Массив);
	
	ПозицияСкобки = Найти(ТекстФормулы, "(");
	РезультатФункции.Имя = Лев(ТекстФормулы, ПозицияСкобки - 1);
	
	ТекстПараметров = Прав(ТекстФормулы, СтрДлина(ТекстФормулы) - ПозицияСкобки);
	
	Индекс = СтрДлина(ТекстПараметров);
	Пока 0 < Индекс Цикл
		СимволСКонца = Сред(ТекстПараметров, Индекс, 1);
		Если СимволСКонца = ")" Тогда
			ТекстПараметров = Лев(ТекстПараметров, Индекс - 1);
			Прервать;
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	РезультатФункции.Параметры = РазделитьПараметры(ТекстПараметров);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция РазделитьПараметры(ТекстПараметров, Разделитель = ",") Экспорт
	
	РезультатФункции = Новый Массив;
	
	СтрокаПараметров = ТекстПараметров;
	
	// Для проверки на четность
	Два = 2;
	
	НомерСимвола = 1;
	КоличествоКавычек = 0;
	ЧислоСкобок = 0;
	Пока НомерСимвола <= СтрДлина(СтрокаПараметров) Цикл
		ТекущийСимвол = Сред(СтрокаПараметров, НомерСимвола, 1);
		Если ТекущийСимвол = """" Тогда
			КоличествоКавычек = КоличествоКавычек + 1;
		КонецЕсли;
		Если ТекущийСимвол = "(" Тогда
			ЧислоСкобок = ЧислоСкобок + 1;
		КонецЕсли;
		Если ТекущийСимвол = ")" Тогда
			ЧислоСкобок = ЧислоСкобок - 1;
		КонецЕсли;
		Если ТекущийСимвол = Разделитель Тогда
			Если КоличествоКавычек % Два = 0 И ЧислоСкобок = 0 Тогда
				ТекущийПараметр = СокрЛП(Лев(СтрокаПараметров, НомерСимвола - 1));
				РезультатФункции.Добавить(ТекущийПараметр);
				СтрокаПараметров = Прав(СтрокаПараметров, СтрДлина(СтрокаПараметров) - НомерСимвола);
				НомерСимвола = 1;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		НомерСимвола = НомерСимвола + 1;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокаПараметров) Тогда
		РезультатФункции.Добавить(СокрЛП(СтрокаПараметров));
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДопустимыйПараметрФункции(ИмяПараметра) Экспорт
	
	РезультатФункции = СокрЛП(ИмяПараметра);
	
	НедопустимыеСимволы = Новый Массив;
	НедопустимыеСимволы.Добавить(" ");
	НедопустимыеСимволы.Добавить(".");
	
	Для Каждого НедопустимыйСимвол Из НедопустимыеСимволы Цикл
		РезультатФункции = СтрЗаменить(РезультатФункции, НедопустимыйСимвол, "_");
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // ДанныеФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ИндексыКартинокДО
#КонецОбласти

//DynamicDirective
// Проверяет, является ли строка уникальным идентификатором.
// В качестве уникального идентификатора предполагается строка вида
// "XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX", где X = [0..9,a..f].
//
// Параметры:
//  Строка - Строка - проверяемая строка.
//
// Возвращаемое значение:
//  Булево - Истина, если переданная строка является уникальным идентификатором.
Функция ЭтоУникальныйИдентификатор(Знач Строка) Экспорт
	ДлинаСтроки = СтрДлина(Строка);
	Шаблон = "XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX";
	
	Если СтрДлина(Шаблон) <> ДлинаСтроки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КодЦифры_48 	= 48; // 0
	КодЦифры_57 	= 57; // 9
	КодБуквы_97 	= 97; // a
	КодБуквы_102 	= 102; // f
	КодБуквы_65		= 65; // A
	КодБуквы_70		= 70; // F
	КодБуквы_88 	= 88; // X
	КодДефис_45 	= 45; // - 
	
	Для Позиция = 1 По ДлинаСтроки Цикл
		КодСимволаШаблон = КодСимвола(Шаблон, Позиция);
		КодСимволаСтрока = КодСимвола(Строка, Позиция);
		
		Если КодСимволаШаблон = КодБуквы_88 // X
			И ((КодСимволаСтрока < КодЦифры_48 ИЛИ КодСимволаСтрока > КодЦифры_57) // 0..9
				И (КодСимволаСтрока < КодБуквы_97 ИЛИ КодСимволаСтрока > КодБуквы_102) // a..f
				И (КодСимволаСтрока < КодБуквы_65 ИЛИ КодСимволаСтрока > КодБуквы_70) // A..F
			) ИЛИ КодСимволаШаблон = КодДефис_45 И КодСимволаСтрока <> КодДефис_45 // - 
		Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

//DynamicDirective

// Формирование текстового представления прицепов из данных формы 
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - источник данных для формирования надписи
//
Процедура СформироватьНадписьПрицепыСтрокой(Форма)
	
	Если Не ЕстьРеквизитИлиСвойство(Форма, "ПрицепыСтрокой") Тогда
		Возврат;
	КонецЕсли;
	
	ФормаОбъект = ФормаОбъект(Форма);
	
	СтрокиПрицепов = СтрокиТС(
		ФормаОбъект.ТранспортныеСредства,
		ЗначениеМетаданных("ESD_ВидыТС.Прицеп"));
	
	МассивНаименований = Новый Массив;
	Для Каждого СтрокаПрицепа Из СтрокиПрицепов Цикл
		МассивНаименований.Добавить(СтрокаПрицепа.РегистрационныйНомер);
	КонецЦикла;
	
	ПрицепыСтрокой = СтрСоединитьЭПД(МассивНаименований, ", ");
	Если Не ЗначениеЗаполнено(ПрицепыСтрокой) Тогда
		ПрицепыСтрокой = "Заполнить";
	КонецЕсли;
	
	Форма.ПрицепыСтрокой = ПрицепыСтрокой;
	
КонецПроцедуры

//DynamicDirective

// Формирование текстового представления транспортного средства на форме 
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - источник данных для формирования надписи
//
Процедура СформироватьНадписьТранспортноеСредствоСтрокой(Форма)
	
	ФормаОбъект = ФормаОбъект(Форма);
	
	СтрокиАвтомобилей = СтрокиТС(
		ФормаОбъект.ТранспортныеСредства,
		ЗначениеМетаданных("ESD_ВидыТС.Автомобиль"));
	
	Если СтрокиАвтомобилей.Количество() > 0 Тогда
		Форма.ТранспортноеСредствоСтрокой = СтрокиАвтомобилей[0].РегистрационныйНомер;
	Иначе
		Форма.ТранспортноеСредствоСтрокой = "Заполнить";
	КонецЕсли;
	
КонецПроцедуры

Функция ИдентификаторКоллекции(Коллекция, ЭлементКоллекции)
	
	Если ТипЗнч(Коллекция) = Тип("ДанныеФормыКоллекция") Тогда
		Результат = ЭлементКоллекции.ПолучитьИдентификатор();
	ИначеЕсли ТипЗнч(Коллекция) = Тип("Массив") Тогда
		Результат = Коллекция.Найти(ЭлементКоллекции);
	ИначеЕсли ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда
		Результат = Коллекция.Индекс(ЭлементКоллекции);
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиПоИдентификаторуУниверсально(Коллекция, Идентификатор)
	
	Если ТипЗнч(Коллекция) = Тип("ДанныеФормыКоллекция") Тогда
		Возврат Коллекция.НайтиПоИдентификатору(Идентификатор);
	Иначе
		Возврат Коллекция[Идентификатор];
	КонецЕсли;
	
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_КонтактныеДанные
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_КонтактныеДанные

//DynamicDirective

Функция ПреобразоватьВерсиюВСтроку(Версия)
	
	Если ПустаяСтрока(Строка(Версия)) Тогда
		СтрокаВерсии = "0.0.0.0";
	Иначе
		СтрокаВерсии = Версия;
	КонецЕсли;

	Если ТипЗнч(СтрокаВерсии) = Тип("Строка") Тогда
		МассивВерсий = СтрРазделитьЭПД(СтрокаВерсии, "_");
		Если МассивВерсий.Количество() > 0 Тогда
			СтрокаВерсии = МассивВерсий[МассивВерсий.ВГраница()];
		КонецЕсли;
		Возврат СтрокаВерсии;
	КонецЕсли;
	
	РежимСовместимостиСтрокой = Строка(СтрокаВерсии);
	РежимСовместимостиСтрокой = СтрЗаменить(РежимСовместимостиСтрокой, "Версия", "");
	МассивСоставляющих = СтрРазделитьЭПД(РежимСовместимостиСтрокой, "_");
	
	КоличествоСоставляющихВерсии = 4;

	Пока МассивСоставляющих.Количество() < КоличествоСоставляющихВерсии Цикл
		МассивСоставляющих.Добавить("0");
	КонецЦикла;
	
	Возврат СтрСоединитьЭПД(МассивСоставляющих, ".");
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_etrn_base_CommonModule_ОпределениеМодуляКодаКлиентСервер
#КонецОбласти // include_etrn_base_CommonModule_ОпределениеМодуляКодаКлиентСервер

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере
#КонецОбласти // includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_CommonModule_МетаданныеКлиентСервер
#КонецОбласти // include_etrn_base_CommonModule_МетаданныеКлиентСервер

