
// Поиск и замена данных иных получателей в переданном объекте
// 
// Параметры:
//	Объект - Произвольно - объект поиска
//	СписокИныхПолучателей - Массив - список новых иных получателей
//
//DynamicDirective
Процедура ПерезаполнитьИныхПолучателей(Объект, СписокИныхПолучателей) Экспорт
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ОтборИныхПолучателей = Новый Структура("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.ИнойПолучатель"));
	ИныеПолучатели = МодульТНОбщегоНазначенияКлиентСервер.НайтиСтрокиУниверсально(Объект.ДанныеЮрЛиц, ОтборИныхПолучателей);
	
	Для Каждого СтрокаДляУдаления Из ИныеПолучатели Цикл
		Объект.ДанныеЮрЛиц.Удалить(СтрокаДляУдаления);
	КонецЦикла;
	
	Для Каждого СтруктураЮрЛица Из СписокИныхПолучателей Цикл
		СтрокаЮрЛица = Объект.ДанныеЮрЛиц.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЮрЛица, СтруктураЮрЛица);
		СтрокаЮрЛица.КлючСтроки = МодульТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(Объект, "ДанныеЮрЛиц");
	КонецЦикла;
	
КонецПроцедуры 

// Поиск иных получателей в таблице "ДанныеЮрЛиц" переданного объекта
//
// Параметры:
//	Объект - Произвольно - объект поиска
//
// Возвращаемое значение:
//	Массив - список найденных иных получателей
// 
//DynamicDirective
Функция НайтиИныхПолучателей(Объект) Экспорт 
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	МассивИныхПолучателей = Новый Массив;
	
	ОтборИныхПолучателей = Новый Структура("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.ИнойПолучатель"));
	ИныеПолучатели = МодульТНОбщегоНазначенияКлиентСервер.НайтиСтрокиУниверсально(Объект.ДанныеЮрЛиц, ОтборИныхПолучателей);
	
	Для Каждого СтрокаЮрЛица Из ИныеПолучатели Цикл
		СтруктураЮрЛица = МодульТНОбщегоНазначенияКлиентСервер.ШаблонДанныхЮрЛица();
		ЗаполнитьЗначенияСвойств(СтруктураЮрЛица, СтрокаЮрЛица);
		МассивИныхПолучателей.Добавить(СтруктураЮрЛица);
	КонецЦикла;
	
	Возврат МассивИныхПолучателей;
КонецФункции

