
// Возвращает индекс картинки при отрицательном завершении ДО
//
// Возвращаемое значение:
//  Число - индекс картинки
//
//DynamicDirective
Функция ИндексКартинки_ДОЗавершенОтрицательно() Экспорт
	Возврат 5;
КонецФункции

// Возвращает индекс картинки при положительном завершении ДО
//
// Возвращаемое значение:
//  Число - индекс картинки
//
//DynamicDirective
Функция ИндексКартинки_ДОЗавершенПоложительно() Экспорт
	Возврат 6;
КонецФункции

// Возвращает индекс картинки при завершении ДО с ошибкой
//
// Возвращаемое значение:
//  Число - индекс картинки
//
//DynamicDirective
Функция ИндексКартинки_ДОЗавершенСОшибкой() Экспорт
	Возврат 3;
КонецФункции

