
//DynamicDirective

// Возвращает с структуру данных юр лица
//
// Возвращаемое значение:
//   Структура - см. в самой функции
//
Функция СтруктураДанныхЮрЛица() Экспорт

	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Роль",                    "");
	РезультатФункции.Вставить("ЮрФизЛицо",               "");
	РезультатФункции.Вставить("ЮрФизЛицоСтрокой",        "");
	РезультатФункции.Вставить("ИНН",                     "");
	РезультатФункции.Вставить("КПП",                     "");
	РезультатФункции.Вставить("ОГРН",                    "");
	РезультатФункции.Вставить("СтруктураФИО",            "");
	РезультатФункции.Вставить("Адрес",                   "");
	РезультатФункции.Вставить("АдресСтруктура",          "");
	РезультатФункции.Вставить("СтранаРегистрации",       "");
	РезультатФункции.Вставить("КодФилиала",              "");
	РезультатФункции.Вставить("НаименованиеОрганизации", "");
	РезультатФункции.Вставить("Полномочия",              "");
	РезультатФункции.Вставить("Основание",               "");
	РезультатФункции.Вставить("КлючСтроки",              0);
	
	РезультатФункции.Вставить("Заполнена",               Ложь);
	
	РезультатФункции.Вставить("КонтактныеДанные",        Новый Массив);
	
	Возврат РезультатФункции;
		
КонецФункции 

//DynamicDirective

// Контракт контактных данных юр лица для использования в процедурах и функциях
//
// Возвращаемое значение:
//   Структура - см. в функции
//
Функция СтруктураКонтактныхДанных() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Роль",                   "");
	РезультатФункции.Вставить("Тип",                    "");
	РезультатФункции.Вставить("Значение",               "");
	РезультатФункции.Вставить("Структура",              "");
	РезультатФункции.Вставить("КлючСтроки_ДанныеЮрЛиц", "");
	РезультатФункции.Вставить("Основной",               "");
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective

// Контракт данных ответственного лица
//
// Возвращаемое значение:
//   Структура - см. в функции
//
Функция СтруктураОтветственногоЛица() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("КлючСтроки",            "");
	РезультатФункции.Вставить("ИНН",                   "");
	РезультатФункции.Вставить("Серия",                 "");
	РезультатФункции.Вставить("Номер",                 "");
	РезультатФункции.Вставить("ДатаВыдачи",            "");
	РезультатФункции.Вставить("Фамилия",               "");
	РезультатФункции.Вставить("Имя",                   "");
	РезультатФункции.Вставить("Отчество",              "");
	РезультатФункции.Вставить("Телефоны",              "");
	РезультатФункции.Вставить("Роль",                  "");
	РезультатФункции.Вставить("ДатаОкончанияДействия", "");
	РезультатФункции.Вставить("ЭлектроннаяПочта",      "");
	РезультатФункции.Вставить("Должность",             "");
	РезультатФункции.Вставить("ШтатныйСотрудник",      "");
	РезультатФункции.Вставить("ИдентификаторСтроки",   Неопределено);
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective

// Шаблон Документа ЭПД для использования в процедурах и функциях
//
// Возвращаемое значение:
//   Структура - см. в функции
//
Функция СтруктураДокументовЭПД() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Тип",          "");
	РезультатФункции.Вставить("Номер",        "");
	РезультатФункции.Вставить("Дата",         "");	
	РезультатФункции.Вставить("Наименование", "");
	РезультатФункции.Вставить("КлючСтроки",   "");	
	РезультатФункции.Вставить("ИД",           "");
	РезультатФункции.Вставить("ДопСведения",  "");
	
	Возврат РезультатФункции;
	
КонецФункции

