
// Возвращает найденные строки в коллекции. Функция аналогична НайтиСтроки для таблицы значений,
// но можно передать массив структур.
//
// Параметры:
//  КоллекцияСтрок - МассивСтруктур,ТаблицаЗначений,ДанныеФормыКоллекция - коллекция для поиска
//  Отбор - Структура - отбор для поиска
//
// Возвращаемое значение:
//   Массив - массив найденных элементов коллекции
//
//DynamicDirective
Функция НайтиСтрокиУниверсально(КоллекцияСтрок, Отбор) Экспорт	
	Если КоллекцияСтрок = Неопределено Тогда
		РезультатФункции = Новый Массив;
	ИначеЕсли ТипЗнч(КоллекцияСтрок) = Тип("Массив") Тогда
		РезультатФункции = НайтиСтрокиВМассивеСтруктур(КоллекцияСтрок, Отбор);
	Иначе
		РезультатФункции = КоллекцияСтрок.НайтиСтроки(Отбор);
	КонецЕсли;
	
	Возврат РезультатФункции;	
КонецФункции

//DynamicDirective
Функция ИтогУниверсально(КоллекцияСтрок, ИмяКолонки) Экспорт
	
	Если КоллекцияСтрок = Неопределено Тогда
		РезультатФункции = 0;
	ИначеЕсли ТипЗнч(КоллекцияСтрок) = Тип("Массив") Тогда
		РезультатФункции = 0;
		Для Каждого ЭлементКоллекции Из КоллекцияСтрок Цикл
			РезультатФункции = РезультатФункции + ЭлементКоллекции[ИмяКолонки];
		КонецЦикла;
	Иначе
		РезультатФункции = КоллекцияСтрок.Итог(ИмяКолонки);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Поиск и отбор структур в отдельный массив по отбору
//
// Параметры:
//	КоллекцияСтрок - Массив - массив структур/строк
//	Отбор - Структура - структура отбора
//
// Возвращаемое значение:
//	Массив - сформированный список удовлетворяющих отбору структур/строк
//
//DynamicDirective
Функция НайтиСтрокиВМассивеСтруктур(КоллекцияСтрок, Отбор)
	
	РезультатФункции = Новый Массив;
	
	Для Каждого СтруктураСтроки Из КоллекцияСтрок Цикл
		
		УдовлетворяетОтбору = Истина;
		Для Каждого СоставОтбора Из Отбор Цикл
			УдовлетворяетОтбору = УдовлетворяетОтбору И СтруктураСтроки[СоставОтбора.Ключ] = СоставОтбора.Значение;
		КонецЦикла;
		
		Если УдовлетворяетОтбору Тогда
			РезультатФункции.Добавить(СтруктураСтроки);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

// Проверяет наличие реквизита или свойства у произвольного объекта без обращения к метаданным.
//
// Параметры:
//  Объект - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  Имя - Строка - имя реквизита или свойства.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
//DynamicDirective
Функция ЕстьРеквизитИлиСвойство(Объект, Имя) Экспорт
	
	УИД = Новый УникальныйИдентификатор();
	ВременнаяСтруктура = Новый Структура(Имя, УИД);
	ЗаполнитьЗначенияСвойств(ВременнаяСтруктура, Объект);
	
	Возврат ВременнаяСтруктура[Имя] <> УИД;
	
КонецФункции

// Формирует массив из одиночного значения
//
// Параметры:
//  Значение - ПроизвольныйТип - значение любого типа
//
// Возвращаемое значение:
//  Массив
//
//DynamicDirective
Функция ЗначениеВМассив(Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Возврат Значение;
	Иначе
		НовыйМассив = Новый Массив;
		НовыйМассив.Добавить(Значение);
		Возврат НовыйМассив;
	КонецЕсли;
	
КонецФункции

// Создает объект ОписаниеТипов, содержащий тип Строка.
//
// Параметры:
//  ДлинаСтроки - Число - длина строки.
//
// Возвращаемое значение:
//  ОписаниеТипов - описание типа Строка.
//
//DynamicDirective
Функция ОписаниеТипаСтрока(ДлинаСтроки) Экспорт
	
	Возврат Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(ДлинаСтроки));
	
КонецФункции

// Создает объект ОписаниеТипов, содержащий тип Дата.
//
// Параметры:
//  ЧастиДаты - ЧастиДаты - набор вариантов использования значений типа Дата.
//
// Возвращаемое значение:
//  ОписаниеТипов - описание типа Дата.
//
//DynamicDirective
Функция ОписаниеТипаДата(ЧастиДаты) Экспорт
	
	Возврат Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты));
	
КонецФункции

// Формирование структуры параметров для рекурсивного поиска
//
// Параметры:
//	ИмяПоля - Строка - имя поля компоновки данных
//	Представление - Строка - значение поиска
//
// Возвращаемое значение
//	Структура - сфорованные параметры
//
//DynamicDirective
Функция ПараметрыПоискаРекурсивно(ИмяПоля, Представление)
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ЗначениеПоиска",        Представление);
	РезультатФункции.Вставить("ИскатьПоПредставлению", Истина);
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		РезультатФункции.ЗначениеПоиска        = Новый ПолеКомпоновкиДанных(ИмяПоля);
		РезультатФункции.ИскатьПоПредставлению = Ложь;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Рекурсивный поиск в коллекции элементов
//
// Параметры:
//	КоллекцияЭлементов - Массив, ТаблицаЗначений - коллекция элементов, где производится поиск
//	МассивЭлементов - Массив - результирующая коллекция, куда будут добавлены найденные элементы
//	ИскатьПоПредставлению - Булево - признак поиска по представлению
//	ЗначениеПоиска - Произвольно - значение поиска в коллекции
//
//DynamicDirective
Процедура НайтиРекурсивно(КоллекцияЭлементов, МассивЭлементов, ИскатьПоПредставлению, ЗначениеПоиска)
	
	Для Каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			ЭлементНайден = (Не ИскатьПоПредставлению И ЭлементОтбора.ЛевоеЗначение = ЗначениеПоиска)
				Или (ИскатьПоПредставлению И ЭлементОтбора.Представление = ЗначениеПоиска);
			
			Если ЭлементНайден Тогда
				МассивЭлементов.Добавить(ЭлементОтбора);
			КонецЕсли;
		Иначе
			
			НайтиРекурсивно(ЭлементОтбора.Элементы, МассивЭлементов, ИскатьПоПредставлению, ЗначениеПоиска);
			
			Если ИскатьПоПредставлению И ЭлементОтбора.Представление = ЗначениеПоиска Тогда
				МассивЭлементов.Добавить(ЭлементОтбора);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
КонецПроцедуры

// Создает структуру параметров реквизита формы
//
// Параметры:
//  ИмяРеквизита - Строка - имя реквизита формы
//  ИмяЭлемента - Строка - имя элемента на форме
//  ИдентификаторСтроки - Строка - идентификатор строки
//  ЭтоВО - Булево - реквизит находится в во или нет
//
// Возвращаемое значение:
//  Структура
//
//DynamicDirective
Функция ПараметрыРеквизитаФормы(ИмяРеквизита, ИмяЭлемента, ИдентификаторСтроки = Неопределено, ЭтоВО = Ложь) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ЭтоСтрокаТаблицы",    ИдентификаторСтроки <> Неопределено);
	РезультатФункции.Вставить("ИмяРеквизита",        ИмяРеквизита);
	РезультатФункции.Вставить("ИмяЭлемента",         ИмяЭлемента);
	РезультатФункции.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	
	// Таблицы
	РезультатФункции.Вставить("ИмяИсходнойТаблицы",          "");
	РезультатФункции.Вставить("ИдентификаторИсходнойСтроки", 0);
	
	РезультатФункции.Вставить("ДополнительныеПоля",  "");
	
	РезультатФункции.Вставить("ТолькоПросмотр", Ложь);
	РезультатФункции.Вставить("ЭтоВО"         , ЭтоВО);       
	
	Возврат РезультатФункции;	
КонецФункции

// Формирование ключа по ссылке
//
// Параметры:
//	Ссылка - ДокументСсылка, СправочникСсылка - основание формирования ключа
//	Идентификатор - Строка - идентификатор ссылки/ключа
//
// Возвращаемое значение:
//	Строка, Структура - сформированный ключ
//
//DynamicDirective
Функция КлючСсылка(Ссылка, Идентификатор = Неопределено) Экспорт	
	Если ТипЗнч(Ссылка) = Тип("Структура")
		Или ЗначениеЗаполнено(Ссылка) Тогда
		КлючСоответствия = Ссылка;
	Иначе
		КлючСоответствия = Идентификатор;
	КонецЕсли;
	
	Возврат КлючСоответствия;
КонецФункции

// Возвращает имя метаданных из имени формы
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма источник вызова
//
// Возвращаемое значение:
//   Строка - имя метаданных родителя формы
//
//DynamicDirective
Функция ИмяМетаданныхПоФорме(Форма) Экспорт
	
	МассивИмен = СтрРазделитьЭПД(Форма.ИмяФормы, ".");
	
	РезультатФункции = МассивИмен[1];
	Если РезультатФункции = "SABY" Или РезультатФункции = "СБИС" Тогда
		РезультатФункции = МассивИмен[МассивИмен.ВГраница()];
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Шаблон имени алгоритма INI
//
// Параметры:
//	ИмяМетаданных - Строка - имя метаданных объекта ESD
//
// Возвращаемое значение:
//	Строка - шаблон имени алгоритма INI
//
//DynamicDirective
Функция ШаблонИмениINI(ИмяМетаданных) Экспорт
	Если ИмяМетаданных = ТранспортнаяНакладнаяКлиент() Тогда
		РезультатФункции = "Blockly_%1_ЭТрН_read";
	ИначеЕсли ИмяМетаданных = ПутевойЛистКлиент() Тогда
		РезультатФункции = "Blockly_%1_ЭПЛ_read";
	ИначеЕсли ИмяМетаданных = ЗаказНаПеревозкуКлиент() Тогда
		РезультатФункции = "Blockly_%1_ЗнП_read";	
	Иначе
		РезультатФункции = "";
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

// Получение шаблона структуры ключа строки
//
// Возвращаемое значение:
//	Структура - структура ключа строки
//
//DynamicDirective
Функция СтруктураКлючСтроки() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ДанныеЮрЛиц",  0);
	РезультатФункции.Вставить("ДокументыЭПД", 0);
	
	Возврат РезультатФункции;
	
КонецФункции

// Преобразует исходную строку в число без вызова исключений.
//
// Параметры:
//   ЧислоСтрокой - Строка - строка, которую необходимо привести к числу.
//                       Например, "10", "+10", "010", вернет 10;
//                                 "(10)", "-10",вернет -10;
//                                 "10,2", "10.2",вернет 10.2;
//                                 "000", " ", "",вернет 0;
//                                 "10текст", вернет Неопределено.
//
// Возвращаемое значение:
//   Число, Неопределено - полученное число, либо Неопределено, если строка не является числом.
//
//DynamicDirective
Функция ЧислоИзСтроки(ЧислоСтрокой) Экспорт	
	Значение = СтрЗаменить(ЧислоСтрокой, " ", "");

	Если СтрНачинаетсяСЭПД(Значение, "(") Тогда
		Значение = СтрЗаменить(Значение, "(", "-");
		Значение = СтрЗаменить(Значение, ")", "");
	КонецЕсли;
	
	СтрокаБезНулей = СтрЗаменить(Значение, "0", "");
	Если ПустаяСтрока(СтрокаБезНулей) Или СтрокаБезНулей = "-" Тогда
		Возврат 0;
	КонецЕсли;
	
	ТипЧисло  = Новый ОписаниеТипов("Число");
	Результат = ТипЧисло.ПривестиЗначение(Значение);
	
	Возврат ?(Результат <> 0 И Не ПустаяСтрока(СтрокаБезНулей), Результат, Неопределено);	
КонецФункции

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения.
//  МассивИсточник - Массив - массив значений для заполнения.
//  ТолькоУникальныеЗначения - Булево - если истина, то в массив будут включены только уникальные значения.
//
//DynamicDirective
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь) Экспорт
	Если ТолькоУникальныеЗначения Тогда		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;		
	Иначе
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;		
	КонецЕсли;	
КонецПроцедуры

