
// Возвращает с структуру данных юр лица
//
// Возвращаемое значение:
//   Структура - см. в самой функции
//
//DynamicDirective
Функция ШаблонДанныхЮрЛица() Экспорт

	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Роль",                    "");
	РезультатФункции.Вставить("ЮрФизЛицо",               "");
	РезультатФункции.Вставить("ЮрФизЛицоСтрокой",        "");
	РезультатФункции.Вставить("ИНН",                     "");
	РезультатФункции.Вставить("КПП",                     "");
	РезультатФункции.Вставить("ОГРН",                    "");
	РезультатФункции.Вставить("СтруктураФИО",            "");
	РезультатФункции.Вставить("Адрес",                   "");
	РезультатФункции.Вставить("АдресСтруктура",          "");
	РезультатФункции.Вставить("СтранаРегистрации",       "");
	РезультатФункции.Вставить("КодФилиала",              "");
	РезультатФункции.Вставить("НаименованиеОрганизации", "");
	РезультатФункции.Вставить("Полномочия",              "");
	РезультатФункции.Вставить("Основание",               "");
	РезультатФункции.Вставить("ИдентификаторЭДО",        "");
	
	РезультатФункции.Вставить("КлючСтроки",              0);
	РезультатФункции.Вставить("КлючСтроки_ДокументыЭПД", 0);
	
	РезультатФункции.Вставить("Заполнена",               Ложь);
	
	РезультатФункции.Вставить("КонтактныеДанные",        Новый Массив);
	
	Возврат РезультатФункции;
		
КонецФункции 

// Контракт контактных данных юр лица для использования в процедурах и функциях
//
// Возвращаемое значение:
//   Структура - см. в функции
//
//DynamicDirective
Функция СтруктураКонтактныхДанных() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Роль",                   "");
	РезультатФункции.Вставить("Тип",                    "");
	РезультатФункции.Вставить("Значение",               "");
	РезультатФункции.Вставить("Структура",              "");
	РезультатФункции.Вставить("КлючСтроки_ДанныеЮрЛиц", "");
	РезультатФункции.Вставить("Основной",               "");
	
	Возврат РезультатФункции;
	
КонецФункции

// Контракт данных ответственного лица
//
// Возвращаемое значение:
//   Структура - см. в функции
//
//DynamicDirective
Функция СтруктураОтветственногоЛица() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("КлючСтроки",            "");
	РезультатФункции.Вставить("ИНН",                   "");
	РезультатФункции.Вставить("Серия",                 "");
	РезультатФункции.Вставить("Номер",                 "");
	РезультатФункции.Вставить("ДатаВыдачи",            "");
	РезультатФункции.Вставить("Фамилия",               "");
	РезультатФункции.Вставить("Имя",                   "");
	РезультатФункции.Вставить("Отчество",              "");
	РезультатФункции.Вставить("Телефоны",              "");
	РезультатФункции.Вставить("Роль",                  "");
	РезультатФункции.Вставить("ДатаОкончанияДействия", "");
	РезультатФункции.Вставить("ЭлектроннаяПочта",      "");
	РезультатФункции.Вставить("Должность",             "");
	РезультатФункции.Вставить("ШтатныйСотрудник",      "");
	РезультатФункции.Вставить("СНИЛС",                 "");
	РезультатФункции.Вставить("ТабельныйНомер",        "");
	РезультатФункции.Вставить("ИдентификаторСтроки",   Неопределено);
	
	РезультатФункции.Вставить("Заполнена",             Ложь);
	
	Возврат РезультатФункции;
	
КонецФункции

// Шаблон Документа ЭПД для использования в процедурах и функциях
//
// Возвращаемое значение:
//   Структура - см. в функции
//
//DynamicDirective
Функция СтруктураДокументаЭПД() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Тип",          Неопределено);
	РезультатФункции.Вставить("Номер",        "");
	РезультатФункции.Вставить("Дата",         "");
	РезультатФункции.Вставить("Наименование", "");
	РезультатФункции.Вставить("ИД",           "");
	РезультатФункции.Вставить("ДопСведения",  "");
	РезультатФункции.Вставить("ДанныеЮрЛиц",  Новый Массив);
	
	РезультатФункции.Вставить("ЭтоСопроводительныйДокумент", Ложь);
	
	РезультатФункции.Вставить("КлючСтроки",                       "");
	РезультатФункции.Вставить("КлючСтроки_ТранспортногоСредства", "");
	РезультатФункции.Вставить("КлючСтроки_ОтветственныеЛица",     "");
	
	РезультатФункции.Вставить("Ссылка",       "");
	
	РезультатФункции.Вставить("Заполнена",    Ложь);
	
	Возврат РезультатФункции;
	
КонецФункции

// Возвращает с структуру данных транспортного средства
//
// Возвращаемое значение:
//   Структура - см. в самой функции
//
//DynamicDirective
Функция СтруктураТранспортногоСредства() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Вид",                  ЗначениеМетаданных("ESD_ВидыТС.ПустаяСсылка"));
	РезультатФункции.Вставить("РегистрационныйНомер", "");
	РезультатФункции.Вставить("ИнвентарныйНомер",     "");
	РезультатФункции.Вставить("Тип",                  "");
	РезультатФункции.Вставить("Марка",                "");
	РезультатФункции.Вставить("Модель",               "");
	РезультатФункции.Вставить("ВИН",                  "");
	РезультатФункции.Вставить("НомерСТС",             "");
	РезультатФункции.Вставить("Грузоподъемность",     0);
	РезультатФункции.Вставить("Вместимость",          0);
	РезультатФункции.Вставить("ТипВладения",          ЗначениеМетаданных("ESD_ТипыВладенияТС.ПустаяСсылка"));
	РезультатФункции.Вставить("ОснованияВладения",    "");
	РезультатФункции.Вставить("Идентификатор",        "");
	
	РезультатФункции.Вставить("КлючСтроки",           0);
	
	Возврат РезультатФункции;
	
КонецФункции

// Возвращает структуру параметров настроек группировок позиций после заполнения на основании
//
// Возвращаемое значение:
//   Структура - см. в функции
//
Функция ПараметрыГруппировкиПозицийОснований() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ГруппироватьТоварыИзДокументовОснований", Ложь);
	РезультатФункции.Вставить("ГруппироватьПоРеквизитуНоменклатуры",     Ложь);
	РезультатФункции.Вставить("РеквизитНоменклатуры",                      "");
	РезультатФункции.Вставить("ГруппироватьВОднуПозицию",                Ложь);
	РезультатФункции.Вставить("НаименованиеОбщейПозиции",                  "");
	РезультатФункции.Вставить("ПользовательФоновыхЗаданий",                "");
	
	Возврат РезультатФункции;
	
КонецФункции

// Структура для накопления возникающих ошибок. Используется как интерфейс для
// ESD_ТНОбщегоНазначенияСервер.ДобавитьОшибкуПользователю
//
// Параметры:
//  ИмяМетаданных - Строка - имя метаданных документа
//
// Возвращаемое значение:
//   Структура - структура описывающая возникшие ошибки
//
Функция СтруктураОшибок(ИмяМетаданных) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("СписокОшибок",  Новый Массив);
	РезультатФункции.Вставить("ГруппыОшибок",  Новый Соответствие);
	РезультатФункции.Вставить("ИмяМетаданных", ИмяМетаданных);
	
	Возврат РезультатФункции;
	
КонецФункции

// Формирует и возвращает общий текст ошибки, собранный из составляющих
// 
// Параметры:
//	ДанныеОшибки - Структура - данные ошибки
//
// Возвращаемое значение:
//	Строка - общий текст ошибки
//
Функция ОбщийТекстОшибки(ДанныеОшибки) Экспорт
	ТекстОшибки = "";
	
	Если Не ЗначениеЗаполнено(ДанныеОшибки) Тогда
		Возврат ТекстОшибки;
	КонецЕсли;
	
	СписокОшибок = Неопределено;
	Если Не (ДанныеОшибки.Свойство("СписокОшибок", СписокОшибок) И ЗначениеЗаполнено(СписокОшибок)) Тогда
		Возврат ТекстОшибки;
	КонецЕсли;
	
	ТекстОшибки = СписокОшибок[0].ТекстДляОднойОшибки;
	Для i = 1 По СписокОшибок.Количество() - 1 Цикл
		ТекстОшибки = ТекстОшибки + "
			|" + СокрЛП(СписокОшибок[i].ТекстДляОднойОшибки);
	КонецЦикла;
	
	Возврат ТекстОшибки;
КонецФункции

// Структура дополнительных параметров печати
//
// Параметры:
//  ЭтоПечатьQRКода 				- Булево 						- если печать QRКода
//  УникальныйИдентификаторФормы 	- УникальныйИдентификатор	 	- уникальный идентификатор формы
//  Заголовок 						- Строка 						- заголовок печатной формы
//  ЭтоФормаСписка 					- Булево 						- если печать из формы списка
//  ВыгрузкаАрхива 					- Булево 						- если это выгрузка архива
//  ВыборПечатнойФормы 				- Булево 						- если использовать выбор печатной формы
//
// Возвращаемое значение:
//   Структура - Структура дополнительные параметры печати
//
Функция ДополнительныеПараметрыПечати(ЭтоПечатьQRКода, УникальныйИдентификаторФормы, Заголовок, ЭтоФормаСписка,
																			ВыгрузкаАрхива, ВыборПечатнойФормы) Экспорт
	
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ЭтоПечатьQRКода",              ЭтоПечатьQRКода);
		ДополнительныеПараметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
		ДополнительныеПараметры.Вставить("Заголовок",                    Заголовок);
		ДополнительныеПараметры.Вставить("ЭтоФормаСписка",               ЭтоФормаСписка);
		ДополнительныеПараметры.Вставить("ВыгрузкаАрхива",				 ВыгрузкаАрхива);
		ДополнительныеПараметры.Вставить("ВыборПечатнойФормы",           ВыборПечатнойФормы);
		
		Возврат ДополнительныеПараметры;
КонецФункции

