
//DynamicDirective
// Получает значение из соответствия или структуры по указанному пути, учитывая вложенность.
// Например: ДанныеСоответствия(Вложение, "1110339.Файл.Документ.ДатИнфГО") получит данные по ключу ДатИнфГО,
//           учитывая вложенность.
//           Если какого-либо ключа не существует, вернется значение указанное в параметре ЗначениеПоУмолчанию.
//
// Параметры:
//  Коллекция - Соответствие,Структура - коллекция, данные которой нужно получить
//  Путь - Строка,Массив - имена ключей через точку, либо готовый массив с именами ключей
//  ЗначениеПоУмолчанию - Произвольный - значение, которое нужно присвоить в случае незаполненного значения.
//
// Возвращаемое значение:
//   Произвольный - значение полученное из коллекции с учетом вложенности.
//
Функция ЗначениеИзКоллекции(Коллекция, Путь, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если ТипЗнч(Путь) = Тип("Массив") Тогда
		МассивКлючей = Путь;
	Иначе
		МассивКлючей = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(Путь, ".");
	КонецЕсли;
	
	Если МассивКлючей.Количество() = 0 Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	РезультатФункции = Коллекция;
	
	Для Каждого Ключ Из МассивКлючей Цикл
		Если ТипЗнч(РезультатФункции) = Тип("Структура") Тогда
			РезультатФункции.Свойство(Ключ, РезультатФункции);
		ИначеЕсли ТипЗнч(РезультатФункции) = Тип("Соответствие") Тогда
			РезультатФункции = РезультатФункции.Получить(Ключ);
		Иначе
			РезультатФункции = ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

