
//DynamicDirective

// Возвращает строковое представление водительского удостоверения
//
// Параметры:
//  Данные - Структура - структура данных водительского удостоверения
//
// Возвращаемое значение:
//   Строка - текстовое представление водительского удостоверения
//
Функция ПредставлениеВУ(Данные) Экспорт
		
	Массив = Новый Массив;
	Массив.Добавить("Серия");
	Массив.Добавить("Номер");
		
	СерияНомер = ТекстовоеПредставлениеДанных(Данные, Массив, " №");
	
	НовыеДанные = Новый Структура;
	НовыеДанные.Вставить("СерияНомер", СерияНомер);
	НовыеДанные.Вставить("ДатаВыдачи", Формат(Данные.ДатаВыдачи, "ДФ=dd.MM.yyyy"));
	
	Массив = Новый Массив;
	Массив.Добавить("СерияНомер");
	Массив.Добавить("ДатаВыдачи");
	
	СерияНомерДатаВУ = ТекстовоеПредставлениеДанных(НовыеДанные, Массив, " от ");
	Возврат СерияНомерДатаВУ;
	
КонецФункции

//DynamicDirective

// Возвращает строковое представление ФИО
//
// Параметры:
//  Данные - Структура - структура данных ФИО
//
// Возвращаемое значение:
//   Строка - текстовое представление ФИО
//
Функция ПредставлениеФИО(Данные) Экспорт
	
	ЕстьНеобходимыеСвойства = ЕстьРеквизитИлиСвойство(Данные, "Фамилия")
		И ЕстьРеквизитИлиСвойство(Данные, "Имя")
		И ЕстьРеквизитИлиСвойство(Данные, "Отчество");
	
	Если Не ЕстьНеобходимыеСвойства Тогда
		Возврат "";
	КонецЕсли;
	
	Массив = Новый Массив;
	Массив.Добавить("Фамилия");
	Массив.Добавить("Имя");
	Массив.Добавить("Отчество");
	
	Возврат ТекстовоеПредставлениеДанных(Данные, Массив, " ");
	
КонецФункции

//DynamicDirective

// Для сборки текстового представления из структуры
//
// Параметры: 
// 	Данные - Структура - данные для представления
// 	Реквизиты - Массив - реквизиты, участвующие в представлении
// 	Разделитель - Строка - разделитель реквизитов в представлении
// 	ВключаяПустые - Булево - признак включения пустых значений в представление
//
// Возвращаемое значение:
//	Строка - представление данных строкой
//
Функция ТекстовоеПредставлениеДанных(Данные, Реквизиты, Разделитель, ВключаяПустые = Ложь) Экспорт
	
	МассивСтрок = Новый Массив;
	
	Для Каждого Реквизит Из Реквизиты Цикл 
		
		Если Не ВключаяПустые И Не ЗначениеЗаполнено(Данные[Реквизит]) Тогда 
			Продолжить;
		КонецЕсли;
				
		МассивСтрок.Добавить(СокрЛП(Данные[Реквизит]));
		
	КонецЦикла;
	
	Если МассивСтрок.Количество() Тогда 		
		Представление = СтрСоединить(МассивСтрок, Разделитель);			
	Иначе 		
		Представление = "";
	КонецЕсли;
	
	Возврат  Представление;
	
КонецФункции

