
//DynamicDirective

Функция СтрРазделитьЭПД(Знач ИсходнаяСтрока, Разделитель, ВключатьПустые = Истина) Экспорт
	Возврат СтрРазделить(ИсходнаяСтрока, Разделитель, ВключатьПустые);
КонецФункции

//DynamicDirective

Функция СтрСоединитьЭПД(Знач Строки, Разделитель = "") Экспорт
	Возврат СтрСоединить(Строки, Разделитель);
КонецФункции

//DynamicDirective

// BSLLS:NumberOfParams-off
// BSLLS:NumberOfOptionalParams-off

Функция СтрШаблонЭПД(Знач Шаблон, Параметр1 = Неопределено, Параметр2 = Неопределено, Параметр3 = Неопределено,
			Параметр4 = Неопределено, Параметр5 = Неопределено, Параметр6 = Неопределено, Параметр7 = Неопределено,
			Параметр8 = Неопределено, Параметр9 = Неопределено) Экспорт

	Возврат СтрШаблон(
		Шаблон, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);

КонецФункции

// BSLLS:NumberOfOptionalParams-on
// BSLLS:NumberOfParams-on

//DynamicDirective

Функция СтрНачинаетсяСЭПД(Строка, СтрокаПоиска) Экспорт
	Возврат СтрНачинаетсяС(Строка, СтрокаПоиска);
КонецФункции

//DynamicDirective

Функция СтрЗаканчиваетсяНаЭПД(Строка, СтрокаПоиска) Экспорт
	Возврат СтрЗаканчиваетсяНа(Строка, СтрокаПоиска);
КонецФункции

