
// Установливает отборы по связанным таблицам
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для обновления данных
//  СтруктураСвязанныхТаблиц - Структура - описание связанных таблиц
//  ИмяКлючаОсновнойТаблицы - Строка - имя колонки с ключом строки
//
//DynamicDirective
Процедура УстановитьОтборПоСвязаннымТаблицам(Форма, СтруктураСвязанныхТаблиц, ИмяКлючаОсновнойТаблицы = "КлючСтроки") Экспорт
		
	ФормаОбъект = ФормаОбъект(Форма);
	
	Для Каждого КлючЗначение Из СтруктураСвязанныхТаблиц Цикл
		ИмяОсновнойТаблицы = КлючЗначение.Ключ;
		
		СтрокаОсновнойТаблицы = Форма.Элементы[ИмяОсновнойТаблицы].ТекущаяСтрока;
		Если СтрокаОсновнойТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаОсновнойТаблицы = ФормаОбъект[ИмяОсновнойТаблицы].НайтиПоИдентификатору(СтрокаОсновнойТаблицы);
		
		ИмяКлючаСвязаннойТаблицы = ИмяКлючаОсновнойТаблицы + "_" + ИмяОсновнойТаблицы;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить(ИмяКлючаСвязаннойТаблицы, СтрокаОсновнойТаблицы[ИмяКлючаОсновнойТаблицы]);
		
		Отбор = Новый ФиксированнаяСтруктура(СтруктураПоиска);
		
		Для Каждого ИмяСвязаннойТаблицы Из КлючЗначение.Значение Цикл
			Форма.Элементы[ИмяСвязаннойТаблицы].ОтборСтрок = Отбор;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Удалить строки по связанным таблицам
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для обновления данных
//  СтруктураСвязанныхТаблиц - Структура - описание связанных таблиц
//
//DynamicDirective
Процедура УдалитьСтрокиСвязанныхТаблиц(Форма, СтруктураСвязанныхТаблиц) Экспорт
	ФормаОбъект = ФормаОбъект(Форма);
	
	Для Каждого КлючЗначение Из СтруктураСвязанныхТаблиц Цикл
		ИмяОсновнойТаблицы = КлючЗначение.Ключ;
		
		Для Каждого ИдентификаторСтроки Из Форма.Элементы[ИмяОсновнойТаблицы].ВыделенныеСтроки Цикл
			СтрокаОсновнойТаблицы = ФормаОбъект[ИмяОсновнойТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
			Если СтрокаОсновнойТаблицы = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			УдалитьСтрокиСвязанныхТаблицПоСтроке(ФормаОбъект, 
				ИмяОсновнойТаблицы, СтрокаОсновнойТаблицы, КлючЗначение.Значение);
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

// Удаление строк из связанных таблиц по данным "основной" строки
//
// Параметры:
//  ФормаОбъект - Произвольно - форма для обновления данных
//	ИмяОсновнойТаблицы - Строка - имя основной таблицы, по строке которой выполняется удаление из связанных
//	СтрокаОсновнойТаблицы - СтрокаТаблицыЗначений - "основная" строка таблицы значений или табличной части формы
//	ОписанияСвязейТаблиц - Строка, Структура - описание связи "основной" и "подчиненной" таблицы
//
//DynamicDirective
Процедура УдалитьСтрокиСвязанныхТаблицПоСтроке(ФормаОбъект, 
	ИмяОсновнойТаблицы, 
	СтрокаОсновнойТаблицы, 
	ОписанияСвязейТаблиц
) Экспорт
	Для Каждого ОписаниеСвязи Из ОписанияСвязейТаблиц Цикл
		Если ТипЗнч(ОписаниеСвязи) = Тип("Строка") Тогда
			// Если указана в качестве описания связи указана строка, то считаем использование "прямого подчинения"
			//	- указанная таблица подчинена основной таблице
			ИмяСвязаннойТаблицы = ОписаниеСвязи;
			ИмяКлючаОсновнойТаблицы = "КлючСтроки";
			ИмяКлючаСвязаннойТаблицы = ИмяКлючаОсновнойТаблицы + "_" + ИмяОсновнойТаблицы;
			ОписаниеПодчиненныхСвязейТаблицы = Новый Массив;
		Иначе
			// Иначе предполагаем передачу параметров установки связи
			ИмяСвязаннойТаблицы = ОписаниеСвязи.ИмяСвязаннойТаблицы;
			ИмяКлючаСвязаннойТаблицы = ОписаниеСвязи.ИмяКлючаСвязаннойТаблицы;
			ИмяКлючаОсновнойТаблицы = ОписаниеСвязи.ИмяКлючаОсновнойТаблицы;
			ОписаниеПодчиненныхСвязейТаблицы = ОписаниеСвязи.ОписаниеСвязейТаблицы;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура(ИмяКлючаСвязаннойТаблицы, СтрокаОсновнойТаблицы[ИмяКлючаОсновнойТаблицы]);
		СтрокиДляУдаления = ФормаОбъект[ИмяСвязаннойТаблицы].НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			УдалитьСтрокиСвязанныхТаблицПоСтроке(ФормаОбъект, 
				ИмяСвязаннойТаблицы, СтрокаДляУдаления, ОписаниеПодчиненныхСвязейТаблицы);			
				
			ФормаОбъект[ИмяСвязаннойТаблицы].Удалить(СтрокаДляУдаления);
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

// Формирование и возврат структуры описания связи таблицы
//
// Параметры:
//  ИмяСвязаннойТаблицы - Строка - имя связанной таблицы
//	ИмяКлючаОсновнойТаблицы - Строка - имя ключа (колонки) основной таблицы
//	ИмяКлючаСвязаннойТаблицы - Строка - имя ключа (колонки) связанной таблицы
//
// Возвращаемое значение:
//	Структура - описание связи таблицы	
//
//DynamicDirective
Функция ОписаниеСвязиТаблицы(ИмяСвязаннойТаблицы, ИмяКлючаОсновнойТаблицы, ИмяКлючаСвязаннойТаблицы) Экспорт
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ИмяСвязаннойТаблицы", ИмяСвязаннойТаблицы);
	РезультатФункции.Вставить("ИмяКлючаОсновнойТаблицы", ИмяКлючаОсновнойТаблицы);
	РезультатФункции.Вставить("ИмяКлючаСвязаннойТаблицы", ИмяКлючаСвязаннойТаблицы);
	РезультатФункции.Вставить("ОписаниеСвязейТаблицы", Новый Массив);

	Возврат РезультатФункции;
КонецФункции

// Возвращает новый уникальный ключ строки
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для обновления данных
//  ИмяОсновнойТаблицы - Строка - имя таблицы, в которой устанавливается ключ
//  ИмяКлючаОсновнойТаблицы - Строка - имя колонки с ключом строки
//
// Возвращаемое значение:
//   Число - новый ключ для строки таблицы
//
//DynamicDirective
Функция НовыйКлючОсновнойСтроки(Форма, ИмяОсновнойТаблицы, ИмяКлючаОсновнойТаблицы = "КлючСтроки") Экспорт
	
	ФормаОбъект = ФормаОбъект(Форма);
	
	ПоследнийКлюч = 0;
	
	Для Каждого СтрокаОсновнойТаблицы Из ФормаОбъект[ИмяОсновнойТаблицы] Цикл
		КлючСтроки = СтрокаОсновнойТаблицы[ИмяКлючаОсновнойТаблицы];
		Если КлючСтроки = Неопределено Тогда
			КлючСтроки = 0;
		КонецЕсли;
		ПоследнийКлюч = Макс(ПоследнийКлюч, КлючСтроки);
	КонецЦикла;
	
	ЕстьКлючПоТаблице = ТипЗнч(Форма) = Тип("Структура")
		И Форма.Свойство("КлючСтроки")
		И Форма.КлючСтроки.Свойство(ИмяОсновнойТаблицы);
	
	Если ПоследнийКлюч = 0 И ЕстьКлючПоТаблице Тогда
		ПоследнийКлюч = Форма.КлючСтроки[ИмяОсновнойТаблицы];
	КонецЕсли;
	
	ПоследнийКлюч = ПоследнийКлюч + 1;
	
	Если ЕстьКлючПоТаблице Тогда
		Форма.КлючСтроки.Вставить(ИмяОсновнойТаблицы, ПоследнийКлюч);
	КонецЕсли;
	
	Возврат ПоследнийКлюч;
	
КонецФункции

// Возвращает ключ строки основной таблицы
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для обновления данных
//  ИмяОсновнойТаблицы - Строка - имя таблицы, в которой устанавливается ключ
//  ИмяКлючаОсновнойТаблицы - Строка - имя колонки с ключом строки
//
// Возвращаемое значение:
//   Число - новый ключ для строки таблицы
//
//DynamicDirective
Функция НовыйКлючСвязаннойСтроки(Форма, ИмяОсновнойТаблицы, ИмяКлючаОсновнойТаблицы = "КлючСтроки") Экспорт
	
	ФормаОбъект = ФормаОбъект(Форма);
	
	ИдентификаторСтроки   = Форма.Элементы[ИмяОсновнойТаблицы].ТекущаяСтрока;
	СтрокаОсновнойТаблицы = ФормаОбъект[ИмяОсновнойТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Возврат СтрокаОсновнойТаблицы[ИмяКлючаОсновнойТаблицы];
	
КонецФункции

