
//DynamicDirective

// Возвращает массив ссылок ролей из строкового представления
//
// Параметры:
//  Роли - Строка - роли перечисленные через запятую
//
// Возвращаемое значение:
//   Массив - массив ссылок ПеречислениеСсылка.Saby_РолиКонтрагентов
//
Функция МассивРолей(Роли) Экспорт
	
	Если ТипЗнч(Роли) = Тип("Массив") Тогда
		Возврат Роли;
	КонецЕсли;
	
	РезультатФункции = Новый Массив;
	
	МассивСтрок = СтрРазделитьЭПД(Роли, ",");
	
	ШаблонИмениПеречисления = "Saby_РолиКонтрагентов.%1";
	
	Для Каждого РольСтрокой Из МассивСтрок Цикл
		
		СтруктураДанных = СтруктураДанныхРолей();
		СтруктураДанных.РольСтрокой = РольСтрокой;
		Если РольСтрокой = "" Или РольСтрокой = "Оформил" Тогда
			РольСтрокой = "ПустаяСсылка";
		КонецЕсли;
		СтруктураДанных.Роль = ЗначениеМетаданных(СтрШаблонЭПД(ШаблонИмениПеречисления, РольСтрокой));
		СтруктураДанных.КлючСтроки = 0;
		
		РезультатФункции.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective

// Формирует структуру роли для табличных частей где задействованы роли
//
// Возвращаемое значение:
//   Структура
//
Функция СтруктураДанныхРолей() Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("РольСтрокой",             "");
	РезультатФункции.Вставить("Роль",                    "");
	РезультатФункции.Вставить("КлючСтроки",              0);
	РезультатФункции.Вставить("ПараметрыРеквизитаФормы", ПараметрыРеквизитаФормы("", ""));
	
	Возврат РезультатФункции;
	
КонецФункции

