
//DynamicDirective

// Получает объект формы если он есть, иначе саму форму
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для получения объекта
//
// Возвращаемое значение:
//   Произвольный - форма или объект формы
//
Функция ФормаОбъект(Форма) Экспорт
	
	ЕстьОбъектДокумента = ЕстьРеквизитИлиСвойство(Форма, "Объект")
		И Форма.Объект <> Неопределено
		И Форма.Объект.Свойство("Ссылка")
		И ТипЗнч(Форма.Объект.Ссылка) <> Тип("Структура");
	
	Если ЕстьОбъектДокумента Тогда
		Возврат Форма.Объект;
	Иначе
		Возврат Форма;
	КонецЕсли;
	
КонецФункции

