
Функция ЗагрузитьАрхивВложенийВоВложенныеФайлы(ПараметрыЗагрузки) Экспорт
	ДанныеЗагрузкиАрхиваSaby = SabyДанныеЗагрузкиАрхиваВложений(ПараметрыЗагрузки);
	Если ЗначениеЗаполнено(ДанныеЗагрузкиАрхиваSaby.ОписаниеОшибки) Тогда
		Возврат ДанныеЗагрузкиАрхиваSaby;				
	КонецЕсли;
	
	СохранитьАрхивВложенийВПрисоединенныеФайлы(ДанныеЗагрузкиАрхиваSaby.АдресДвоичныхДанных, ПараметрыЗагрузки);
	
	Возврат ДанныеЗагрузкиАрхиваSaby;
КонецФункции

Процедура СохранитьАрхивВложенийВПрисоединенныеФайлы(АдресДвоичныхДанных, ПараметрыСохранения) Экспорт
	// Выполним поиск созданного ранее присоединенного файла
	ОписаниеФайла = "Автоматически Saby";
	СсылкаНаПрисоединенныйФайл = ПрисоединенныйФайлПоВладельцуИОписанию(
		ПараметрыСохранения.СсылкаНаДокумент, ОписаниеФайла);

	// Сравним файлы по ДД, если совпадают, то пропустим загрузку
	СтрДвоичныеДанныеФайлаSaby = Строка(ПолучитьИзВременногоХранилища(АдресДвоичныхДанных));
	Если СсылкаНаПрисоединенныйФайл <> Неопределено 
		И Строка(СсылкаНаПрисоединенныйФайл.ДвоичныеДанныеФайла.Получить()) = СтрДвоичныеДанныеФайлаSaby
	Тогда
		УдалитьИзВременногоХранилища(АдресДвоичныхДанных);
	Иначе
		СтруктураДокумента = ЗначенияРеквизитовОбъекта(ПараметрыСохранения.СсылкаНаДокумент, 
			"Ссылка, Номер, Дата, НомерСбис", Истина);
		СтруктураДокумента.Дата = Формат(СтруктураДокумента.Дата, "ДФ=yyyy-MM-dd"); 
		
		ПараметрыФайла = Новый Структура;
		ПараметрыФайла.Вставить("ВладелецФайлов", ПараметрыСохранения.СсылкаНаДокумент);
		ПараметрыФайла.Вставить("ИмяБезРасширения", ПредставлениеДокумента(СтруктураДокумента));
		ПараметрыФайла.Вставить("РасширениеБезТочки", "zip");
		ПараметрыФайла.Вставить("ВремяИзменения", "");
		ПараметрыФайла.Вставить("СсылкаНаПрисоединенныйФайл", СсылкаНаПрисоединенныйФайл);
		
		МодульКода("ESD_РаботаСФайлами").ДобавитьФайл(ПараметрыФайла, АдресДвоичныхДанных, "", ОписаниеФайла);
	КонецЕсли;
КонецПроцедуры

Функция SabyДанныеЗагрузкиАрхиваВложений(ПараметрыЗагрузки) Экспорт
	SabyОбработатьПараметрыЗагрузкиДанных(ПараметрыЗагрузки);
	
	РезультатФункции = SabyОбщийРезультатЗагрузкиДанных(ПараметрыЗагрузки.СсылкаНаДокумент);
	РезультатФункции.Вставить("АдресДвоичныхДанных", Неопределено);
	
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.СсылкаНаДокумент) Тогда
		РезультатФункции.ОписаниеОшибки = "Документ еще ни разу не сохранен. Архив документа недоступен.";
		Возврат РезультатФункции;
	КонецЕсли;
	
	ПараметрыЗагрузкиФайловSaby = МодульКода("ESD_ТНЗагрузкаСервер").SabyСформироватьПараметрыЗагрузкиФайлов(
		ПараметрыЗагрузки, , Ложь);
	
	Если ПараметрыЗагрузкиФайловSaby.ЭтоЧерновик Или Не ЗначениеЗаполнено(ПараметрыЗагрузкиФайловSaby.ИдентификаторСБИС) Тогда
		РезультатФункции.ОписаниеОшибки   = "Документ не выгружен в SABY. Архив документа недоступен.";
		РезультатФункции.СписокДокументов = ПараметрыЗагрузкиФайловSaby.СписокДокументов;
		РезультатФункции.ОшибкиОбщие      = ПараметрыЗагрузкиФайловSaby.ОшибкиОбщие;
		Возврат РезультатФункции;
	КонецЕсли;
	
	SabyЗагрузитьДанныеАрхиваВложений(РезультатФункции, ПараметрыЗагрузкиФайловSaby);
	
	Возврат РезультатФункции;	
КонецФункции

Процедура SabyЗагрузитьДанныеАрхиваВложений(РезультатФункции, ПараметрыЗагрузкиФайловSaby) Экспорт
	АдресФайла = ПараметрыЗагрузкиФайловSaby["СсылкаНаАрхив"];
	РезультатЗагрузкиSaby = МодульКода("ESD_ТНЗагрузкаСервер")
		.АдресДвоичныхДанныхАрхиваВложений(ПараметрыЗагрузкиФайловSaby, АдресФайла);
		
	ТекстОшибки = "Не удалось получить архив документа из Saby.";
	Если РезультатЗагрузкиSaby.Ошибка Тогда
		РезультатФункции.ОписаниеОшибки = ТекстОшибки + "
			|" + РезультатЗагрузкиSaby.Данные;
	ИначеЕсли Не ЗначениеЗаполнено(РезультатЗагрузкиSaby.Данные) Тогда
		РезультатФункции.ОписаниеОшибки = ТекстОшибки;
	Иначе
		РезультатФункции.АдресДвоичныхДанных = РезультатЗагрузкиSaby.Данные;
	КонецЕсли;
КонецПроцедуры

