
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.РольСтрокой               = Параметры.РольСтрокой;
	ЭтаФорма.ЭтоВО                     = Параметры.ЭтоВО;
	ЭтаФорма.ОтключитьИдентификаторЭДО = Параметры.ОтключитьИдентификаторЭДО;
	
	ЗаполнениеРеквизитовФормы(Параметры, Истина);
	УстановитьТипыРеквизитов();
	ОбновитьВидимостьИДоступностьЭлементов();
	НастроитьФормуДляСтарыхПлатформ();
	
	Если ЭтаФорма.РольСтрокой = "Составитель" Тогда
		Элементы.ФормаЗаписатьИЗакрыть.Заголовок = "Отправить черновик";
		Элементы.ФормаЗаписатьИЗакрыть.Картинка = МодульКода("ESD_ТНОбщегоНазначенияСервер").КартинкаИнтерфейсаСервер(
			ЭтаФорма, "Задача");
	КонецЕсли;

	ПриСозданииНаСервереПереопределенный();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// решение проблемы установки фокуса в ОФ на форме источнике
	Если Не ЭтаФорма.ВводДоступен() Тогда
	    ВремяАктивации = 0.5;
		ЭтаФорма.ПодключитьОбработчикОжидания("АктивизироватьФормуОрганизации", ВремяАктивации, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьПоСсылке(Команда)
	
	ОбновитьДанныеПоСсылке();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовыеДанные(Команда)
	
	Если ЭтаФорма.ЭтоИП Тогда
		
		ФИО = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПредставлениеФИО(ЭтаФорма);
		ЭтаФорма.НаименованиеОрганизации = "ИП " + ФИО;
		
		СтруктураФИО = ФИОСтрокой(ЭтаФорма.Фамилия, ЭтаФорма.Имя, ЭтаФорма.Отчество);
		
	Иначе
		СтруктураФИО = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.РольСтрокой) Тогда
		Роль = ЗначениеМетаданныхКлиент("ESD_РолиКонтрагентов." + ЭтаФорма.РольСтрокой);
	Иначе
		Роль = ЗначениеМетаданныхКлиент("ESD_РолиКонтрагентов.ПустаяСсылка");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.ЮрФизЛицоСтрокой) Тогда
		ЮрФизЛицо = ЗначениеМетаданныхКлиент("ESD_ЮрФизЛицо." + ЭтаФорма.ЮрФизЛицоСтрокой);
	Иначе
		ЮрФизЛицо = ЗначениеМетаданныхКлиент("ESD_ЮрФизЛицо.ПустаяСсылка");
	КонецЕсли;
	
	Если ЭтаФорма.ЭтоВО Тогда
		ДокументыЮрЛиц = МодульКодаКлиент("ЭтаФорма").СформироватьДокументыЭПД(ЭтаФорма.ДокументыЭПД, ЭтаФорма.ДанныеЮрЛиц);
	Иначе
		ДокументыЮрЛиц = Новый Массив;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("Роль",                    Роль);
	Структура.Вставить("РольСтрокой",             ЭтаФорма.РольСтрокой);
	Структура.Вставить("ИНН",                     ЭтаФорма.ИНН);
	Структура.Вставить("КПП",                     ЭтаФорма.КПП);
	Структура.Вставить("ОГРН",                    ЭтаФорма.ОГРН);
	Структура.Вставить("ЮрФизЛицо",               ЮрФизЛицо);
	Структура.Вставить("ЮрФизЛицоСтрокой",        ЭтаФорма.ЮрФизЛицоСтрокой);
	Структура.Вставить("СтруктураФИО",            СтруктураФИО);
	Структура.Вставить("Адрес",                   ЭтаФорма.Адрес);
	Структура.Вставить("АдресСтруктура",          ЭтаФорма.АдресСтруктура);
	Структура.Вставить("СтранаРегистрации",       ЭтаФорма.СтранаРегистрации);
	Структура.Вставить("КодФилиала",              ЭтаФорма.КодФилиала);
	Структура.Вставить("Полномочия",              ЭтаФорма.Полномочия);
	Структура.Вставить("Основание",               ЭтаФорма.Основание);
	Структура.Вставить("НаименованиеОрганизации", ЭтаФорма.НаименованиеОрганизации);
	Структура.Вставить("ЭлементФормы",            ЭтаФорма.ЭлементФормы);
	Структура.Вставить("КонтактныеДанные",        КонтактныеДанные(ЭтаФорма.КонтактныеДанные));
	Структура.Вставить("ДокументыЭПД",            ДокументыЮрЛиц);
	Структура.Вставить("Удалить",                 УдалитьЗапись());
	Структура.Вставить("ИдентификаторЭДО",        ЭтаФорма.ИдентификаторЭДО);
	
	ЗаписатьИдентификаторЭДО(КонтрагентОрганизация, ЭтаФорма.ИдентификаторЭДО);
	
	Если ЭтаФорма.РольСтрокой = "Составитель" И Не ДанныеЮрЛицаЗаполнены() Тогда
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
			.СообщитьПользователю("Необходимо заполнить данные организации для отправки черновика.");
		Возврат;
	КонецЕсли;
	
    ОтправитьСтатистикуФормыОрганизацииЭПД();
	
	УстановитьНовыеДанныеПереопределенный(Структура);

	ЭтаФорма.Закрыть(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСтатистикуФормыОрганизацииЭПД()
	
	Если ЭтаФорма.ЭтоВО Тогда
		Форма = ЭтаФорма;
	Иначе
		Форма = Неопределено;
	КонецЕсли;
	
	// Запись статистики выбора абонентского ящика
	Если ЗначениеЗаполнено(ЭтаФорма.ИдентификаторЭДО) И ЭтаФорма.ИдентификаторЭДОИзменен Тогда
		МодульКодаКлиент("ESD_ТНЗагрузкаСервер").ЗаписатьСтатистикуВызоваВОблако("ВыборАбонентскогоЯщика", "АбонентскийЯщик", Форма);
	КонецЕсли;
	
	// Запись статистики отправки черновика
	Если ЭтаФорма.РольСтрокой = "Составитель" Тогда 
		МодульКодаКлиент("ESD_ТНЗагрузкаСервер").ЗаписатьСтатистикуВызоваВОблако("ОтправкаЧерновика", "1С ConsignmentNote", Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеЮрЛицаЗаполнены()
	
	Если ЮрФизЛицоСтрокой = "ЮрЛицо" Тогда
		Возврат ЗначениеЗаполнено(ЭтаФорма.НаименованиеОрганизации)
			И (ЗначениеЗаполнено(ЭтаФорма.ИНН)
				ИЛИ ЗначениеЗаполнено(ЭтаФорма.КПП));
	Иначе
		Возврат ЗначениеЗаполнено(ЭтаФорма.ИНН)
			И (ЗначениеЗаполнено(ЭтаФорма.Фамилия)
				Или ЗначениеЗаполнено(ЭтаФорма.Имя)
				Или ЗначениеЗаполнено(ЭтаФорма.Отчество));
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьВсеПоля(Команда)
	ОчиститьРеквизитыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЯщик(Команда)
    УстановитьДанныеВыбранногоЯщика();
КонецПроцедуры

&НаКлиенте
Процедура ОтменаВыбораЯщика(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновная;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентОрганизацияПриИзменении(Элемент)
	ОбновитьДанныеПоСсылке(); 
	Основание_Очистить();
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНажатие(Элемент)
	ИзменитьАдрес(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура АдресНажатие(Элемент, СтандартнаяОбработка)
	ИзменитьАдрес(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторЭДОПриИзменении(Элемент)
	
	ЭтаФорма.ИдентификаторЭДОИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторЭДОНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗаполненыРеквизитыЮрЛица = ЗначениеЗаполнено(ЭтаФорма.ИНН) И ЗначениеЗаполнено(ЭтаФорма.НаименованиеОрганизации);
	ЗаполненыРеквизитыФизЛица = ЗначениеЗаполнено(ЭтаФорма.ИНН)
		И ЗначениеЗаполнено(ЭтаФорма.Фамилия) И ЗначениеЗаполнено(ЭтаФорма.Имя);
		
	ТекстСообщения = "";
	Если ЭтаФорма.ЮрФизЛицоСтрокой = "ЮрЛицо" И Не ЗаполненыРеквизитыЮрЛица Тогда
		ТекстСообщения = "Необходимо заполнить ИНН и название организации!";
	КонецЕсли;
	Если ЭтаФорма.ЮрФизЛицоСтрокой <> "ЮрЛицо" И Не ЗаполненыРеквизитыФизЛица Тогда
		ТекстСообщения = "Необходимо заполнить ИНН, фамилию и имя индивидуального предпринимателя!";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	СформируемТаблицуЯщиков();
	
КонецПроцедуры

&НаКлиенте
Процедура АбонентскиеЯщикиЭДОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	УстановитьДанныеВыбранногоЯщика();
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	Основание_Очистить();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыКонтактныеДанные

&НаКлиенте
Процедура КонтактныеДанныеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЗначениеКонтактныхДанныхНачалоВыбора(
		ЭтаФорма, Элементы.КонтактныеДанные.ТекущиеДанные, ЭтаФорма.РольСтрокой, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеДанныеЗначениеПриИзменении(Элемент)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЗначениеКонтактныхДанныхПриИзменении(
		ЭтаФорма, Элементы.КонтактныеДанные.ТекущиеДанные, ЭтаФорма.РольСтрокой);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Если Копирование Тогда
			Элементы.КонтактныеДанные.ТекущиеДанные.Основной = Ложь;
		КонецЕсли;
		ОбработатьНовуюСтрокуКонтактнойИнформации(Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыКонтактныеДанные

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ОчиститьРеквизитыФормы()
	
	РеквизитыИсключения = Новый Массив;
	РеквизитыИсключения.Добавить("РольСтрокой");
	РеквизитыИсключения.Добавить("ЭлементФормы");
	РеквизитыИсключения.Добавить("Объект");
	РеквизитыИсключения.Добавить("ЭтоВО");
	РеквизитыИсключения.Добавить("ИмяИНИ");
	РеквизитыИсключения.Добавить("ТипДокументаИсточника");
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОчиститьРеквизитыФормы(ЭтаФорма, РеквизитыИсключения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьИДоступностьЭлементов()
	
	УстановитьДоступНаЭлементы();
	
	МассивСкрыть   = Новый Массив;
	МассивПоказать = Новый Массив;
	
	ЭтаФорма.ЭтоИП = (ЭтаФорма.ЮрФизЛицоСтрокой = "ИндивидуальныйПредприниматель");
	
	Если ЭтаФорма.ЭтоИП Тогда
		
		МассивСкрыть.Добавить("НаименованиеОрганизации");
		МассивСкрыть.Добавить("КодФилиала");
		МассивСкрыть.Добавить("КПП");
		
		МассивПоказать.Добавить("ГруппаФИО");
		
	Иначе
		
		МассивСкрыть.Добавить("ГруппаФИО");
		
		МассивПоказать.Добавить("НаименованиеОрганизации");
		МассивПоказать.Добавить("КодФилиала");
		МассивПоказать.Добавить("КПП");
		
	КонецЕсли;
	
	МассивСкрыть.Добавить("СтранаРегистрации");
	
	Если ЗначениеЗаполнено(ЭтаФорма.Адрес) Тогда
		МассивСкрыть.Добавить("ДекорацияЗаполнитьАдресДоставки");
	Иначе
		МассивПоказать.Добавить("ДекорацияЗаполнитьАдресДоставки");
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьПоРолям(МассивПоказать, МассивСкрыть);
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", Истина, МассивПоказать);
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", Ложь, МассивСкрыть);
		
	Если ЭтоУниверсальноеРасширение() Тогда
		Элементы.КонтактныеДанныеЗначение.КнопкаВыбора = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьПоРолям(МассивПоказать, МассивСкрыть)
	
	// Для ВО форма используется для сторон документов ЭПД
	Если ЭтаФорма.РольСтрокой = "СторонаДокумента"
		Или ЭтаФорма.РольСтрокой = "ПустаяСсылка" Тогда
		ОбновитьВидимостьДоступностьСтороныДокумента(МассивПоказать, МассивСкрыть);
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.РольСтрокой = "ИнойПолучатель" Тогда
		ОбновитьВидимостьДоступностьИнойПолучатель(МассивПоказать, МассивСкрыть);
		Возврат;
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьПоОформителю(МассивПоказать, МассивСкрыть);
	
	Если ЭтаФорма.РольСтрокой = "УполномоченноеЛицо"
		Или ЭтаФорма.РольСтрокой = "УполномоченноеЛицоПеревозчика" Тогда
		
		МассивПоказать.Добавить("ГруппаПолномочия");
		
		Если ЭтаФорма.РольСтрокой = "УполномоченноеЛицоПеревозчика" Тогда
			Элементы.Полномочия.Доступность = Ложь;
		КонецЕсли;
	
	Иначе
		МассивСкрыть.Добавить("ГруппаПолномочия");
	КонецЕсли;
	
	Если ЭтаФорма.РольСтрокой = "МедосмотрВыезд" Или ЭтаФорма.РольСтрокой = "МедосмотрЗаезд" Тогда
		МассивСкрыть.Добавить("ГруппаАдрес");
		МассивСкрыть.Добавить("КодФилиала");
	КонецЕсли;
	
	СкрытьИдентификаторЭДО = ЭтаФорма.ОтключитьИдентификаторЭДО
		Или (ЭтаФорма.РольСтрокой <> "Отправитель"
			И ЭтаФорма.РольСтрокой <> "Получатель"
			И ЭтаФорма.РольСтрокой <> "Перевозчик"
			И ЭтаФорма.РольСтрокой <> "Клиент"
			И ЭтаФорма.РольСтрокой <> "Экспедитор");
	
	Если СкрытьИдентификаторЭДО Тогда
		
		МассивСкрыть.Добавить("ИдентификаторЭДО");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьПоОформителю(МассивПоказать, МассивСкрыть)
	
	ЭтоПутевойЛист = (ЭтаФорма.ТипДокументаИсточника = ПутевойЛист());
	РольОформитель = "Оформитель";
	
	Если (ЭтоПутевойЛист И ЭтаФорма.РольСтрокой <> РольОформитель) Или ЭтаФорма.РольСтрокой = "СторонаДокумента" Тогда
		МассивСкрыть.Добавить("ГруппаКонтакты");
	КонецЕсли;
	
	ПоказатьОснование = ЭтаФорма.РольСтрокой = РольОформитель И Не ЭтаФорма.ЭтоВО И Не ЭтоПутевойЛист;
	
	Если ПоказатьОснование Тогда
		МассивПоказать.Добавить("ГруппаОснованиеОформителя");
	Иначе
		МассивСкрыть.Добавить("ГруппаОснованиеОформителя");
	КонецЕсли;
	
	Если ЭтаФорма.РольСтрокой <> РольОформитель И ЭтаФорма.РольСтрокой <> "Отправитель" Тогда
		МассивСкрыть.Добавить("КодФилиала");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьСтороныДокумента(МассивПоказать, МассивСкрыть)
	
	МассивСкрыть.Добавить("ГруппаПолномочия");
	МассивСкрыть.Добавить("ГруппаОснованиеОформителя");
	МассивСкрыть.Добавить("ГруппаАдрес");
	МассивСкрыть.Добавить("КПП");
	МассивСкрыть.Добавить("КодФилиала");
	МассивСкрыть.Добавить("ГруппаКонтакты");
	МассивСкрыть.Добавить("ИдентификаторЭДО");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьИнойПолучатель(МассивПоказать, МассивСкрыть)
	
	МассивСкрыть.Добавить("ГруппаПолномочия");
	МассивСкрыть.Добавить("ГруппаОснованиеОформителя");
	МассивСкрыть.Добавить("ГруппаАдрес");
	МассивСкрыть.Добавить("ГруппаКонтакты");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступНаЭлементы()
	
	МассивТолькоПросмотр = Новый Массив;
	МассивТолькоПросмотр.Добавить("ФормаЗаписатьИЗакрыть");
	МассивТолькоПросмотр.Добавить("ФормаОчиститьВсеПоля");
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", Не ЭтаФорма.ТолькоПросмотрФормы, МассивТолькоПросмотр);
	
	МассивТолькоПросмотр.Очистить();
	МассивТолькоПросмотр.Добавить("ЮрФизЛицоСтрокой");
	МассивТолькоПросмотр.Добавить("НаименованиеОрганизации");
	МассивТолькоПросмотр.Добавить("ГруппаФИО");
	МассивТолькоПросмотр.Добавить("ГруппаКоды");
	МассивТолькоПросмотр.Добавить("СтранаРегистрации");
	МассивТолькоПросмотр.Добавить("ГруппаАдрес");
	МассивТолькоПросмотр.Добавить("ГруппаКонтакты");
	МассивТолькоПросмотр.Добавить("ГруппаПолномочия");
	МассивТолькоПросмотр.Добавить("ГруппаОснованиеОформителя");
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "ТолькоПросмотр", ЭтаФорма.ТолькоПросмотрФормы, МассивТолькоПросмотр);
	
	Элементы.ГруппаЗаполнениеДанных.Видимость            = Не ЭтаФорма.ТолькоПросмотрФормы;
	Элементы.ДекорацияЗаполнитьАдресДоставки.Доступность = Не ЭтаФорма.ТолькоПросмотрФормы;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеРеквизитовФормы(Знач ДанныеЗаполнения, Знач ВызовПриСозданииНаСервере = Ложь)
	
	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		ЭтаФорма.ТолькоПросмотрФормы = Параметры.ТолькоПросмотр;
	КонецЕсли;
	
	Если Параметры.Свойство("Наименование") Тогда
		ЭтаФорма.Заголовок = Параметры.Наименование;
	КонецЕсли;
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ESD_ЗаполнитьРеквизитыФормы(ЭтаФорма, ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.ЮрФизЛицо) Тогда
		ЭтаФорма.ЮрФизЛицоСтрокой = ДанныеЗаполнения.ЮрФизЛицоСтрокой;
	Иначе
		ЭтаФорма.ЮрФизЛицоСтрокой = "ЮрЛицо";
	КонецЕсли;
	
	ЭтаФорма.ЭтоИП = (ЭтаФорма.ЮрФизЛицоСтрокой = "ИндивидуальныйПредприниматель");
	Если ЭтоИП И ДанныеЗаполнения.Свойство("СтруктураФИО") Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.СтруктураФИО) Тогда
			СтруктураФИО = ЗначениеИзСтрокиВнутр(ДанныеЗаполнения.СтруктураФИО);
			ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураФИО);
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ЭлементФормы") Тогда
		ЭтаФорма.ЭлементФормы = ДанныеЗаполнения.ЭлементФормы;
	КонецЕсли;
	
	Если ЭтаФорма.РольСтрокой = "УполномоченноеЛицоПеревозчика" Тогда
		ЭтаФорма.Полномочия = 1;
	КонецЕсли;
	
	МожемПопробоватьЗаполнитьСсылку = Не ЭтаФорма.ТолькоПросмотрФормы
		И ВызовПриСозданииНаСервере
		И (ЗначениеЗаполнено(ЭтаФорма.ИНН)
			ИЛИ ЗначениеЗаполнено(ЭтаФорма.КПП)
			Или ЗначениеЗаполнено(ЭтаФорма.НаименованиеОрганизации));
	
	Если МожемПопробоватьЗаполнитьСсылку Тогда
		ЭтаФорма.КонтрагентОрганизация = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОрганизацияКонтрагент(
			ЭтаФорма.ИНН, ЭтаФорма.КПП, ЭтаФорма.НаименованиеОрганизации).Ссылка;
	КонецЕсли;
	
КонецПроцедуры

#Область Телефоны

&НаКлиенте
Процедура ТелефоныТелефонПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ТелефоныСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.ТекущийЭлемент = Элементы.Телефоны;
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефоныПослеУдаления(Элемент)
КонецПроцедуры

#КонецОбласти // Телефоны

&НаКлиенте
Процедура ОбработкаВыбораВодителя(ВыбранныйЭлемент, ДопПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ЭтаФорма.Водитель = ВыбранныйЭлемент;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаПриИзменении(Элемент)
	
	ОбновитьДанныеПоСсылке();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоСсылке()
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.КонтрагентОрганизация) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ОбновитьДанныеЮрЛиц();
	
	Если Результат.Ошибка Тогда
		
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОповеститьПользователяОРезультатах(
			ЭтаФорма, "ЗаполнитьИзINI", Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьИДоступностьЭлементовНаКлиенте() Экспорт
	ОбновитьВидимостьИДоступностьЭлементов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФИОСтрокой(Знач Фамилия, Знач Имя, Знач Отчество)
	
	СтруктураФИО = Новый Структура;
	СтруктураФИО.Вставить("Фамилия",  Фамилия);
	СтруктураФИО.Вставить("Имя",      Имя);
	СтруктураФИО.Вставить("Отчество", Отчество);
	
	Возврат ЗначениеВСтрокуВнутр(СтруктураФИО);
	
КонецФункции

&НаКлиенте
Функция КонтактныеДанные(ТаблицаКонтактныхДанных)
	
	РезультатФункции = Новый Массив;
	
	Для Каждого СтрокаКонтактныхДанных Из ТаблицаКонтактныхДанных Цикл
		
		СтруктураКонтактныхДанных = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураКонтактныхДанных();
		ЗаполнитьЗначенияСвойств(СтруктураКонтактныхДанных, СтрокаКонтактныхДанных);
		
		РезультатФункции.Добавить(СтруктураКонтактныхДанных);
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьНовуюСтрокуКонтактнойИнформации(ИмяТЧ)
	
	Отбор = Новый Структура;
	Отбор.Вставить("РольСтрокой", "");
	
	НайденныеСтроки = КонтактныеДанные.НайтиСтроки(Отбор);
	Для Каждого Строка Из НайденныеСтроки Цикл
		Строка.РольСтрокой            = ЭтаФорма.РольСтрокой;
		Строка.КлючСтроки_ДанныеЮрЛиц = ЭтаФорма.КлючСтроки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция УдалитьЗапись()
	
	Если ЭтаФорма.ЭтоИП Тогда
		Возврат Не ЗначениеЗаполнено(ЭтаФорма.Фамилия)
			И Не ЗначениеЗаполнено(ЭтаФорма.Имя)
			И Не ЗначениеЗаполнено(ЭтаФорма.Отчество)
			И Не ЗначениеЗаполнено(ЭтаФорма.ИНН);
	Иначе
		Возврат Не ЗначениеЗаполнено(ЭтаФорма.ИНН)
			И Не ЗначениеЗаполнено(ЭтаФорма.КПП)
			И Не ЗначениеЗаполнено(ЭтаФорма.НаименованиеОрганизации);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьАдрес(СтандартнаяОбработка)
	
	ПараметрыВыбораАдреса = Новый Структура;
	ПараметрыВыбораАдреса.Вставить("РольСтрокой",    ЭтаФорма.РольСтрокой);
	ПараметрыВыбораАдреса.Вставить("Значение",       ЭтаФорма.АдресСтруктура);
	ПараметрыВыбораАдреса.Вставить("Текст",          ЭтаФорма.Адрес);
	ПараметрыВыбораАдреса.Вставить("ТолькоПросмотр", ЭтаФорма.ТолькоПросмотрФормы);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").АдресНачалоВыбора(ЭтаФорма, ПараметрыВыбораАдреса, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыРеквизитов()	
	УстановитьТипыКонтрагентовОрганизаций();
	
	УстановитьОграничениеТипов();	
	
	Элементы.КонтактныеДанныеТип.СписокВыбора.Очистить();
	Элементы.КонтактныеДанныеТип.СписокВыбора.Добавить(
		ЗначениеМетаданных(ТипыКонтактнойИнформации() + ".Телефон"), "Телефон");
	Элементы.КонтактныеДанныеТип.СписокВыбора.Добавить(
		ЗначениеМетаданных(ТипыКонтактнойИнформации() + ".АдресЭлектроннойПочты"), "Адрес электронной почты");	
КонецПроцедуры     

Процедура УстановитьПараметрОтбора(ЭлементФормы, Имя, Значение)
	
	ПараметрВыбора = Новый ПараметрВыбора(Имя, Значение);
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(ПараметрВыбора);
	ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	ЭлементФормы.ПараметрыВыбора = ПараметрыВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьФормуОрганизации() Экспорт
	
	Если Не ЭтаФорма.ВводДоступен() Тогда
		ЭтаФорма.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

#Область АбонентскиеЯщики

&НаКлиенте
Процедура СформируемТаблицуЯщиков()

	ДопПоля = "СписокИдентификаторов";
	
	Участник = Новый Структура;
	Участник.Вставить("ДопПоля", ДопПоля);
	
	Если ЭтаФорма.ЮрФизЛицоСтрокой = "ЮрЛицо" Тогда
		СвЮЛ = Новый Структура;
		СвЮЛ.Вставить("ИНН",      ЭтаФорма.ИНН);
		СвЮЛ.Вставить("КПП",      ЭтаФорма.КПП); 
		СвЮЛ.Вставить("Название", ЭтаФорма.НаименованиеОрганизации);
		Участник.Вставить("СвЮЛ", СвЮЛ);
	Иначе
		СвФЛ = Новый Структура;
		Если ЭтаФорма.ЮрФизЛицоСтрокой = "ИндивидуальныйПредприниматель" Тогда
			ЧастноеЛицо = "Нет";
		Иначе
			ЧастноеЛицо = "Да";
		КонецЕсли;
		СвФЛ.Вставить("ЧастноеЛицо", ЧастноеЛицо);
		СвФЛ.Вставить("ИНН",         ЭтаФорма.ИНН);
		СвФЛ.Вставить("Фамилия",     ЭтаФорма.Фамилия);
		СвФЛ.Вставить("Имя",         ЭтаФорма.Имя);
		Участник.Вставить("СвФЛ",    СвФЛ);
	КонецЕсли;
	
	context_params = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД", Истина);
	
	ПараметрыМетода = Новый Структура("Участник", Участник);
	ПараметрыМетода.Вставить("context_params", context_params);
	ПараметрыМетода.Вставить("ОтветНаКлиенте", Неопределено);
	
	Если ЭтаФорма.ЭтоВО Тогда
		ТранспортВО = ТранспортВО(ЭтаФорма);
		ОбщиеПараметрыЗагрузки = Новый Структура;
		ОбщиеПараметрыЗагрузки.Вставить("context_params",  context_params);
		ОбщиеПараметрыЗагрузки.Вставить("ОбъектОбработки", ТранспортВО.ТранспортИнтеграции);
		ОбщиеПараметрыЗагрузки.Вставить("ТранспортБлокли", ТранспортВО.ТранспортБлокли);
		Результат = ЗагрузитьПочтовыеЯщикиКонтрагента(ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	Иначе
		Результат = ВыполнитьНаСервере("ESD_ТНЗагрузкаСервер.ЗагрузитьПочтовыеЯщикиКонтрагента", ПараметрыМетода);
	КонецЕсли;
	
	Если ТипЗнч(Результат) <> Тип("Строка") Тогда 
		ЗаполнитьЯщики(Результат);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Результат;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ЗаполнитьЯщики(Результат)
	
	ЭтаФорма.АбонентскиеЯщикиЭДО.Очистить();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Идентификаторы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
			Результат, "Идентификатор", Новый Массив);
			
		Если Не ЗначениеЗаполнено(Идентификаторы) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "У организации отсутствуют абонентские ящики для выбора.";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;	
							
		Для Каждого Описание Из Идентификаторы Цикл
			
			НоваяСтрока = ЭтаФорма.АбонентскиеЯщикиЭДО.Добавить();
			НоваяСтрока.Идентификатор = Описание["ИдентификаторУчастника"];
			НоваяСтрока.Оператор      = Описание["Оператор"]["Название"];
			НоваяСтрока.Роуминг       = Булево(Описание["Роуминг"]);
			НоваяСтрока.Основной      = Булево(Описание["Основной"]);
			НоваяСтрока.Комментарий   = ОписаниеКодаСостояния(Описание["СостояниеПодключения"]["Код"], Описание["Комментарий"]);
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВыборЯщика;
	
КонецПроцедуры 

&НаКлиенте
Функция ОписаниеКодаСостояния(Код, ОписаниеАбонентскогоЯщика)

	Если Код = "1" Тогда
		Описание = "Контрагент отключен от ЭДО";
	ИначеЕсли Код = "2" Тогда
		Описание = "Нет подключения к ЭДО. При отправке будет отправлено приглашение";
	Иначе
		Описание = ОписаниеАбонентскогоЯщика;
	КонецЕсли;
	
	Возврат Описание;
КонецФункции

&НаКлиенте
Процедура УстановитьДанныеВыбранногоЯщика() 
	
	ТекущиеДанные = Элементы.АбонентскиеЯщикиЭДО.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.ИдентификаторЭДОИзменен = Истина;
		ЭтаФорма.ИдентификаторЭДО = ТекущиеДанные.Идентификатор;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновная;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана строка для установки абонентского ящика";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // АбонентскиеЯщики

#Область include_etrn_base_CommonForm_ОрганизацииЭПД_ИдентификаторЭДО
#КонецОбласти // include_etrn_base_CommonForm_ОрганизацииЭПД_ИдентификаторЭДО

#Область include_etrn_base_CommonForm_ОрганизацииЭПД_ТипыКонтрагентовОрганизаций
#КонецОбласти // include_etrn_base_CommonForm_ОрганизацииЭПД_ТипыКонтрагентовОрганизаций

#Область include_etrn_base_CommonForm_ОрганизацииЭПД_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_CommonForm_ОрганизацииЭПД_СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

