
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.РольСтрокой               = Параметры.РольСтрокой;
	ЭтаФорма.ЭтоВО                     = Параметры.ЭтоВО;
	ЭтаФорма.ОтключитьИдентификаторЭДО = Параметры.ОтключитьИдентификаторЭДО;
	
	ЗаполнениеРеквизитовФормы(Параметры, Истина);
	УстановитьТипыРеквизитов();
	ОбновитьВидимостьИДоступностьЭлементов();
	НастроитьФормуДляСтарыхПлатформ();
	
	Если ЭтаФорма.РольСтрокой = "Составитель" Тогда
		Элементы.ФормаЗаписатьИЗакрыть.Заголовок = "Отправить черновик";
		Элементы.ФормаЗаписатьИЗакрыть.Картинка = МодульКода("ESD_ТНОбщегоНазначенияСервер").КартинкаИнтерфейсаСервер(
			ЭтаФорма, "Задача");
	КонецЕсли;

	ПриСозданииНаСервереПереопределенный();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// решение проблемы установки фокуса в ОФ на форме источнике
	Если Не ЭтаФорма.ВводДоступен() Тогда
	    ВремяАктивации = 0.5;
		ЭтаФорма.ПодключитьОбработчикОжидания("АктивизироватьФормуОрганизации", ВремяАктивации, Истина);
	КонецЕсли;
	
	ИдентификаторЭДО_ОбновитьДанные();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьПоСсылке(Команда)
	
	ОбновитьДанныеПоСсылке();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовыеДанные(Команда)
	ЗаписатьИдентификаторЭДО(КонтрагентОрганизация, ЭтаФорма.ИдентификаторЭДО);
	Если ЭтаФорма.РольСтрокой = "Составитель" И Не ДанныеЮрЛицаЗаполнены() Тогда
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
			.СообщитьПользователю("Необходимо заполнить данные организации для отправки черновика.");
		Возврат;
	КонецЕсли;
	
	НовыеДанные_ = СформироватьСтруктуруНовыхДанных();
	
    УстановитьНовыеДанныеПереопределенный(НовыеДанные_);
	ОтправитьСтатистикуФормыОрганизацииЭПД();
	
	ЭтаФорма.Закрыть(НовыеДанные_);	
КонецПроцедуры

&НаКлиенте
Функция СформироватьСтруктуруНовыхДанных()
	РезультатФункции = СтруктураНовыхДанных();
	
	Если ЭтаФорма.ЮрФизЛицоСтрокой = "ИндивидуальныйПредприниматель" Тогда
		ДополнитьСтруктуруНовыхДанных_ИндивидуальныйПредприниматель(РезультатФункции);		
	ИначеЕсли ЭтаФорма.ЮрФизЛицоСтрокой = "ФизЛицо" Тогда
		ДополнитьСтруктуруНовыхДанных_ФизическоеЛицо(РезультатФункции);	
	ИначеЕсли ЭтаФорма.ЮрФизЛицоСтрокой = "ЮрЛицоНеРезидент" Тогда
		ДополнитьСтруктуруНовыхДанных_ИностранноеЛицо(РезультатФункции);	
	Иначе
		ДополнитьСтруктуруНовыхДанных_ЮридическоеЛицо(РезультатФункции);	
	КонецЕсли;
	
	// Прочие данные (зависит от роли лица)
	РезультатФункции.Полномочия = ЭтаФорма.Полномочия;
	РезультатФункции.Основание = ЭтаФорма.Основание;
	
	// Контактные данные
	РезультатФункции.КонтактныеДанные = КонтактныеДанные(ЭтаФорма.КонтактныеДанные);
	РезультатФункции.Адрес = ЭтаФорма.Адрес;
	РезультатФункции.АдресСтруктура = ЭтаФорма.АдресСтруктура;
	
	// Документы ЭПД
	ДополнитьСтруктуруНовыхДанных_ДокументыЭПД(РезультатФункции);
	
	Возврат РезультатФункции;
КонецФункции

&НаКлиенте
Процедура ДополнитьСтруктуруНовыхДанных_ИностранноеЛицо(СтруктураИЛ)
	СтруктураИЛ.СтранаРегистрации = ЭтаФорма.СтранаРегистрации;
	СтруктураИЛ.СтранаРегистрации_Код = ЭтаФорма.СтранаРегистрации_Код;
	СтруктураИЛ.ИностранноеЛицо_Идентификатор = ЭтаФорма.ИностранноеЛицо_Идентификатор;
	СтруктураИЛ.НаименованиеОрганизации = ЭтаФорма.НаименованиеОрганизации;
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСтруктуруНовыхДанных_ФизическоеЛицо(СтруктураФЛ)
	СтруктураФЛ.ИНН = ЭтаФорма.ИНН;
	
	ФИО = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПредставлениеФИО(ЭтаФорма);
	СтруктураФЛ.НаименованиеОрганизации = "ФЛ " + ФИО;
	
	ДополнитьСтруктуруНовыхДанных_СтруктураФИО(СтруктураФЛ);
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСтруктуруНовыхДанных_ЮридическоеЛицо(СтруктураЮЛ)
	СтруктураЮЛ.НаименованиеОрганизации = ЭтаФорма.НаименованиеОрганизации;
	СтруктураЮЛ.ИНН = ЭтаФорма.ИНН;
	СтруктураЮЛ.КПП = ЭтаФорма.КПП;
	СтруктураЮЛ.ОГРН = ЭтаФорма.ОГРН;
	СтруктураЮЛ.КодФилиала = ЭтаФорма.КодФилиала;
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСтруктуруНовыхДанных_ИндивидуальныйПредприниматель(СтруктураИП)
	СтруктураИП.ИНН = ЭтаФорма.ИНН;
	
	ФИО = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПредставлениеФИО(ЭтаФорма);
	СтруктураИП.НаименованиеОрганизации = "ИП " + ФИО;
	
	ДополнитьСтруктуруНовыхДанных_СтруктураФИО(СтруктураИП);
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСтруктуруНовыхДанных_СтруктураФИО(СтруктураДанных)
	СтруктураДанных.СтруктураФИО = ФИОСтрокой(ЭтаФорма.Фамилия, ЭтаФорма.Имя, ЭтаФорма.Отчество);
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСтруктуруНовыхДанных_ДокументыЭПД(СтруктураДанных)
	Если ЭтаФорма.ЭтоВО Тогда
		ДокументыЮрЛиц = МодульКодаКлиент("ЭтаФорма").СформироватьДокументыЭПД(ЭтаФорма.ДокументыЭПД, ЭтаФорма.ДанныеЮрЛиц);
	Иначе
		ДокументыЮрЛиц = Новый Массив;
	КонецЕсли;
	
	СтруктураДанных.ДокументыЭПД = ДокументыЮрЛиц;
КонецПроцедуры

&НаКлиенте
Функция СтруктураНовыхДанных()
	Если ЗначениеЗаполнено(ЭтаФорма.РольСтрокой) Тогда
		Роль = ЗначениеМетаданныхКлиент("ESD_РолиКонтрагентов." + ЭтаФорма.РольСтрокой);
	Иначе
		Роль = ЗначениеМетаданныхКлиент("ESD_РолиКонтрагентов.ПустаяСсылка");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.ЮрФизЛицоСтрокой) Тогда
		ЮрФизЛицо = ЗначениеМетаданныхКлиент("ESD_ЮрФизЛицо." + ЭтаФорма.ЮрФизЛицоСтрокой);
	Иначе
		ЮрФизЛицо = ЗначениеМетаданныхКлиент("ESD_ЮрФизЛицо.ПустаяСсылка");
	КонецЕсли;
	
	РезультатФункции = Новый Структура("Удалить", УдалитьЗапись());
	РезультатФункции.Вставить("Роль",                          Роль);
	РезультатФункции.Вставить("ЮрФизЛицо",                     ЮрФизЛицо);
	РезультатФункции.Вставить("РольСтрокой",                   ЭтаФорма.РольСтрокой);
	РезультатФункции.Вставить("ЮрФизЛицоСтрокой",              ЭтаФорма.ЮрФизЛицоСтрокой);
	РезультатФункции.Вставить("ЭлементФормы",                  ЭтаФорма.ЭлементФормы);
	РезультатФункции.Вставить("ИдентификаторЭДО",              ЭтаФорма.ИдентификаторЭДО);
	
	РезультатФункции.Вставить("ИНН",                           Неопределено);
	РезультатФункции.Вставить("КПП",                           Неопределено);
	РезультатФункции.Вставить("ОГРН",                          Неопределено);
	РезультатФункции.Вставить("Адрес",                         Неопределено);
	РезультатФункции.Вставить("АдресСтруктура",                Неопределено);
	РезультатФункции.Вставить("КодФилиала",                    Неопределено);
	РезультатФункции.Вставить("Полномочия",                    Неопределено);
	РезультатФункции.Вставить("Основание",                     Неопределено);
	РезультатФункции.Вставить("НаименованиеОрганизации",       Неопределено);
	РезультатФункции.Вставить("КонтактныеДанные",              Новый Массив);
	РезультатФункции.Вставить("ДокументыЭПД",                  Новый Массив);
	РезультатФункции.Вставить("СтранаРегистрации",             Неопределено);
	РезультатФункции.Вставить("СтранаРегистрации_Код",         Неопределено);
	РезультатФункции.Вставить("ИностранноеЛицо_Идентификатор", Неопределено);
	РезультатФункции.Вставить("СтруктураФИО",                  Неопределено);
	
	Возврат РезультатФункции;
КонецФункции

&НаКлиенте
Процедура ОтправитьСтатистикуФормыОрганизацииЭПД()
	
	Если ЭтаФорма.ЭтоВО Тогда
		Форма = ЭтаФорма;
	Иначе
		Форма = Неопределено;
	КонецЕсли;
	
	// Запись статистики выбора абонентского ящика
	Если ЗначениеЗаполнено(ЭтаФорма.ИдентификаторЭДО) И ЭтаФорма.ИдентификаторЭДОИзменен Тогда
		МодульКодаКлиент("ESD_ТНЗагрузкаСервер").ЗаписатьСтатистикуВызоваВОблако("ВыборАбонентскогоЯщика", "АбонентскийЯщик", Форма);
	КонецЕсли;
	
	// Запись статистики отправки черновика
	Если ЭтаФорма.РольСтрокой = "Составитель" Тогда 
		МодульКодаКлиент("ESD_ТНЗагрузкаСервер").ЗаписатьСтатистикуВызоваВОблако("ОтправкаЧерновика", "1С ConsignmentNote", Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеЮрЛицаЗаполнены()
	
	Если ЮрФизЛицоСтрокой = "ЮрЛицо" Тогда
		Возврат ЗначениеЗаполнено(ЭтаФорма.НаименованиеОрганизации)
			И (ЗначениеЗаполнено(ЭтаФорма.ИНН)
				ИЛИ ЗначениеЗаполнено(ЭтаФорма.КПП));
	Иначе
		Возврат ЗначениеЗаполнено(ЭтаФорма.ИНН)
			И (ЗначениеЗаполнено(ЭтаФорма.Фамилия)
				Или ЗначениеЗаполнено(ЭтаФорма.Имя)
				Или ЗначениеЗаполнено(ЭтаФорма.Отчество));
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьВсеПоля(Команда)
	ОчиститьРеквизитыФормы();
	ИдентификаторЭДО_ЗаполнитьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЯщик(Команда)
    УстановитьДанныеВыбранногоЯщика();
КонецПроцедуры

&НаКлиенте
Процедура ОтменаВыбораЯщика(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновная;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентОрганизацияПриИзменении(Элемент)
	ОбновитьДанныеПоСсылке(); 
	Основание_Очистить();
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНажатие(Элемент)
	ИзменитьАдрес(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура АдресНажатие(Элемент, СтандартнаяОбработка)
	ИзменитьАдрес(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторЭДОПриИзменении(Элемент)
	
	ЭтаФорма.ИдентификаторЭДОИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторЭДОНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеКорректноЗаполнены_ = ИдентификаторыЭДО_ПроверитьПередВыбором();
	Если Не ДанныеКорректноЗаполнены_.Успешно Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ДанныеКорректноЗаполнены_.Описание;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Попытка
		ТаблицаЯщиковЭДО_Сформировать(Истина);
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВыборЯщика;
КонецПроцедуры

&НаКлиенте
Функция ИдентификаторыЭДО_ПроверитьПередВыбором()
	РезультатФункции = Новый Структура("Успешно, Описание", Истина, "");
	
	Если ЭтаФорма.ЮрФизЛицоСтрокой = "ЮрЛицо" Тогда
		Если Не (ЗначениеЗаполнено(ЭтаФорма.ИНН) И ЗначениеЗаполнено(ЭтаФорма.НаименованиеОрганизации)) Тогда
			РезультатФункции.Успешно = Ложь;
			РезультатФункции.Описание = "Необходимо заполнить ИНН и название организации!";
		КонецЕсли;
	Иначе
		Если Не (ЗначениеЗаполнено(ЭтаФорма.ИНН)
			И ЗначениеЗаполнено(ЭтаФорма.Фамилия) И ЗначениеЗаполнено(ЭтаФорма.Имя)
		) Тогда
			РезультатФункции.Успешно = Ложь;
			РезультатФункции.Описание = "Необходимо заполнить ИНН, фамилию и имя индивидуального предпринимателя!";
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

&НаКлиенте
Процедура АбонентскиеЯщикиЭДОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	УстановитьДанныеВыбранногоЯщика();
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	Основание_Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторЭДО_ПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	ЭтаФорма.ИдентификаторЭДО = "";
	ИдентификаторЭДО_ЗаполнитьПредставление();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыКонтактныеДанные

&НаКлиенте
Процедура КонтактныеДанныеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЗначениеКонтактныхДанныхНачалоВыбора(
		ЭтаФорма, Элементы.КонтактныеДанные.ТекущиеДанные, ЭтаФорма.РольСтрокой, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеДанныеЗначениеПриИзменении(Элемент)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЗначениеКонтактныхДанныхПриИзменении(
		ЭтаФорма, Элементы.КонтактныеДанные.ТекущиеДанные, ЭтаФорма.РольСтрокой);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Если Копирование Тогда
			Элементы.КонтактныеДанные.ТекущиеДанные.Основной = Ложь;
		КонецЕсли;
		ОбработатьНовуюСтрокуКонтактнойИнформации(Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыКонтактныеДанные

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ОчиститьРеквизитыФормы()
	
	РеквизитыИсключения = Новый Массив;
	РеквизитыИсключения.Добавить("РольСтрокой");
	РеквизитыИсключения.Добавить("ЭлементФормы");
	РеквизитыИсключения.Добавить("Объект");
	РеквизитыИсключения.Добавить("ЭтоВО");
	РеквизитыИсключения.Добавить("ИмяИНИ");
	РеквизитыИсключения.Добавить("ТипДокументаИсточника");
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОчиститьРеквизитыФормы(ЭтаФорма, РеквизитыИсключения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьИДоступностьЭлементов()
	УстановитьДоступНаЭлементы();
	
	МассивСкрыть   = Новый Массив;
	МассивПоказать = Новый Массив;
	
	ЭтаФорма.ЭтоИП = (ЭтаФорма.ЮрФизЛицоСтрокой = "ИндивидуальныйПредприниматель")
		Или ЭтаФорма.ЮрФизЛицоСтрокой = "ФизЛицо";
	Если ЭтаФорма.ЭтоИП Тогда	
		МассивСкрыть.Добавить("НаименованиеОрганизации");
		МассивСкрыть.Добавить("КодФилиала");
		МассивСкрыть.Добавить("КПП");
		
		МассивПоказать.Добавить("ГруппаФИО");	
	Иначе	
		МассивСкрыть.Добавить("ГруппаФИО");
		
		МассивПоказать.Добавить("НаименованиеОрганизации");
		МассивПоказать.Добавить("КодФилиала");
		МассивПоказать.Добавить("КПП");	
	КонецЕсли;
	
	Если ЭтаФорма.ЮрФизЛицоСтрокой = "ЮрЛицоНеРезидент" Тогда
		МассивПоказать.Добавить("ГруппаИностранноеЛицо");
		МассивПоказать.Добавить("ГруппаСтранаРегистрации");
		МассивСкрыть.Добавить("ГруппаКоды");
	Иначе
		МассивСкрыть.Добавить("ГруппаИностранноеЛицо");
		МассивСкрыть.Добавить("ГруппаСтранаРегистрации");
		МассивПоказать.Добавить("ГруппаКоды");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Адрес) Тогда
		МассивСкрыть.Добавить("ДекорацияЗаполнитьАдресДоставки");
	Иначе
		МассивПоказать.Добавить("ДекорацияЗаполнитьАдресДоставки");
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьПоРолям(МассивПоказать, МассивСкрыть);
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", Истина, МассивПоказать);
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", Ложь, МассивСкрыть);
		
	Если ЭтоУниверсальноеРасширение() Тогда
		Элементы.КонтактныеДанныеЗначение.КнопкаВыбора = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьПоРолям(МассивПоказать, МассивСкрыть)
	// Для ВО форма используется для сторон документов ЭПД
	Если ЭтаФорма.РольСтрокой = "СторонаДокумента"
		Или ЭтаФорма.РольСтрокой = "ПустаяСсылка" 
	Тогда
		ОбновитьВидимостьДоступностьСтороныДокумента(МассивПоказать, МассивСкрыть);
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.РольСтрокой = "ИнойПолучатель" Тогда
		ОбновитьВидимостьДоступностьИнойПолучатель(МассивПоказать, МассивСкрыть);
		Возврат;
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьПоОформителю(МассивПоказать, МассивСкрыть);
	
	Если ЭтаФорма.РольСтрокой = "УполномоченноеЛицо"
		Или ЭтаФорма.РольСтрокой = "УполномоченноеЛицоПеревозчика" 
	Тогда	
		МассивПоказать.Добавить("ГруппаПолномочия");
		
		Если ЭтаФорма.РольСтрокой = "УполномоченноеЛицоПеревозчика" Тогда
			Элементы.Полномочия.Доступность = Ложь;
		КонецЕсли;
	Иначе
		МассивСкрыть.Добавить("ГруппаПолномочия");
	КонецЕсли;
	
	Если ЭтаФорма.РольСтрокой = "МедосмотрВыезд" Или ЭтаФорма.РольСтрокой = "МедосмотрЗаезд" Тогда
		МассивСкрыть.Добавить("ГруппаАдрес");
		МассивСкрыть.Добавить("КодФилиала");
	КонецЕсли;
	
	СкрытьИдентификаторЭДО = ЭтаФорма.ОтключитьИдентификаторЭДО
		Или (ЭтаФорма.РольСтрокой <> "Отправитель"
			И ЭтаФорма.РольСтрокой <> "Получатель"
			И ЭтаФорма.РольСтрокой <> "Перевозчик"
			И ЭтаФорма.РольСтрокой <> "Клиент"
			И ЭтаФорма.РольСтрокой <> "Экспедитор");
	
	Если СкрытьИдентификаторЭДО Тогда
		МассивСкрыть.Добавить("ИдентификаторЭДО_Представление");	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьПоОформителю(МассивПоказать, МассивСкрыть)
	
	ЭтоПутевойЛист = (ЭтаФорма.ТипДокументаИсточника = ПутевойЛист());
	РольОформитель = "Оформитель";
	
	Если (ЭтоПутевойЛист И ЭтаФорма.РольСтрокой <> РольОформитель) Или ЭтаФорма.РольСтрокой = "СторонаДокумента" Тогда
		МассивСкрыть.Добавить("ГруппаКонтакты");
	КонецЕсли;
	
	ПоказатьОснование = ЭтаФорма.РольСтрокой = РольОформитель И Не ЭтаФорма.ЭтоВО И Не ЭтоПутевойЛист;
	
	Если ПоказатьОснование Тогда
		МассивПоказать.Добавить("ГруппаОснованиеОформителя");
	Иначе
		МассивСкрыть.Добавить("ГруппаОснованиеОформителя");
	КонецЕсли;
	
	Если ЭтаФорма.РольСтрокой <> РольОформитель И ЭтаФорма.РольСтрокой <> "Отправитель" Тогда
		МассивСкрыть.Добавить("КодФилиала");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьСтороныДокумента(МассивПоказать, МассивСкрыть)
	
	МассивСкрыть.Добавить("ГруппаПолномочия");
	МассивСкрыть.Добавить("ГруппаОснованиеОформителя");
	МассивСкрыть.Добавить("ГруппаАдрес");
	МассивСкрыть.Добавить("КПП");
	МассивСкрыть.Добавить("КодФилиала");
	МассивСкрыть.Добавить("ГруппаКонтакты");
	МассивСкрыть.Добавить("ИдентификаторЭДО_Представление");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьИнойПолучатель(МассивПоказать, МассивСкрыть)
	
	МассивСкрыть.Добавить("ГруппаПолномочия");
	МассивСкрыть.Добавить("ГруппаОснованиеОформителя");
	МассивСкрыть.Добавить("ГруппаАдрес");
	МассивСкрыть.Добавить("ГруппаКонтакты");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступНаЭлементы()
	
	МассивТолькоПросмотр = Новый Массив;
	МассивТолькоПросмотр.Добавить("ФормаЗаписатьИЗакрыть");
	МассивТолькоПросмотр.Добавить("ФормаОчиститьВсеПоля");
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", Не ЭтаФорма.ТолькоПросмотрФормы, МассивТолькоПросмотр);
	
	МассивТолькоПросмотр.Очистить();
	МассивТолькоПросмотр.Добавить("ЮрФизЛицоСтрокой");
	МассивТолькоПросмотр.Добавить("НаименованиеОрганизации");
	МассивТолькоПросмотр.Добавить("ГруппаФИО");
	МассивТолькоПросмотр.Добавить("ГруппаКоды");
	МассивТолькоПросмотр.Добавить("ГруппаСтранаРегистрации");
	МассивТолькоПросмотр.Добавить("ГруппаИностранноеЛицо");
	МассивТолькоПросмотр.Добавить("ГруппаАдрес");
	МассивТолькоПросмотр.Добавить("ГруппаКонтакты");
	МассивТолькоПросмотр.Добавить("ГруппаПолномочия");
	МассивТолькоПросмотр.Добавить("ГруппаОснованиеОформителя");
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "ТолькоПросмотр", ЭтаФорма.ТолькоПросмотрФормы, МассивТолькоПросмотр);
	
	Элементы.ГруппаЗаполнениеДанных.Видимость            = Не ЭтаФорма.ТолькоПросмотрФормы;
	Элементы.ДекорацияЗаполнитьАдресДоставки.Доступность = Не ЭтаФорма.ТолькоПросмотрФормы;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеРеквизитовФормы(Знач ДанныеЗаполнения, Знач ВызовПриСозданииНаСервере = Ложь)
	ОбработатьПараметрыФормы(Параметры);
	
	МодульESD_ОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	МодульESD_ОбщегоНазначенияСервер.ESD_ЗаполнитьРеквизитыФормы(ЭтаФорма, ДанныеЗаполнения);
	
	ЭтаФорма.ЮрФизЛицоСтрокой = ЗаполнениеРеквизитовФормы_ЮрФизЛицоСтрокой(ДанныеЗаполнения);
	
	ЭтаФорма.ЭтоИП = (ЭтаФорма.ЮрФизЛицоСтрокой = "ИндивидуальныйПредприниматель")
		Или (ЭтаФорма.ЮрФизЛицоСтрокой = "ФизЛицо");
	
	Если ЭтоИП И ДанныеЗаполнения.Свойство("СтруктураФИО") Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.СтруктураФИО) Тогда
			СтруктураФИО = ЗначениеИзСтрокиВнутр(ДанныеЗаполнения.СтруктураФИО);
			ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураФИО);
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ЭлементФормы") Тогда
		ЭтаФорма.ЭлементФормы = ДанныеЗаполнения.ЭлементФормы;
	КонецЕсли;
	
	Если ЭтаФорма.РольСтрокой = "УполномоченноеЛицоПеревозчика" Тогда
		ЭтаФорма.Полномочия = 1;
	КонецЕсли;
	
	МожемПопробоватьЗаполнитьСсылку = Не ЭтаФорма.ТолькоПросмотрФормы
		И ВызовПриСозданииНаСервере
		И (ЗначениеЗаполнено(ЭтаФорма.ИНН)
			ИЛИ ЗначениеЗаполнено(ЭтаФорма.КПП)
			Или ЗначениеЗаполнено(ЭтаФорма.НаименованиеОрганизации));
	
	Если МожемПопробоватьЗаполнитьСсылку Тогда
		ЭтаФорма.КонтрагентОрганизация = МодульESD_ОбщегоНазначенияСервер.ОрганизацияКонтрагент(
			ЭтаФорма.ИНН, ЭтаФорма.КПП, ЭтаФорма.НаименованиеОрганизации).Ссылка;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнениеРеквизитовФормы_ЮрФизЛицоСтрокой(ДанныеЗаполнения)
	РезультатФункции = "ЮрЛицо";
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.ЮрФизЛицоСтрокой) Тогда
		// Найдем Строковое имя юр. лица в списке выбора
		ЭлементВыбора_ = Элементы.ЮрФизЛицоСтрокой.СписокВыбора
			.НайтиПоЗначению(ДанныеЗаполнения.ЮрФизЛицоСтрокой);
		Если ЭлементВыбора_ <> Неопределено Тогда
			// При наличии элемента выбора установим новое значение
			РезультатФункции = ДанныеЗаполнения.ЮрФизЛицоСтрокой;
		Иначе
			// При отсутствии элемента выбора приведем тип к "доступным"
			Если ДанныеЗаполнения.ЮрФизЛицоСтрокой = "ФизЛицо" Тогда
				// Если "ФизЛицо" отсутствует в списке выбора, то приводим его к "ИндивидуальныйПредприниматель"
				РезультатФункции = "ИндивидуальныйПредприниматель";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

&НаСервере
Процедура ОбработатьПараметрыФормы(ПараметрыФормы)
	Если Параметры.Свойство("ДоступныеВидыЛиц") Тогда
		ЮрФизЛицо_ЗагрузитьДоступныеЗначенияНаСервере(Параметры.ДоступныеВидыЛиц);		
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		ЭтаФорма.ТолькоПросмотрФормы = Параметры.ТолькоПросмотр;
	КонецЕсли;
	
	Если Параметры.Свойство("Наименование") Тогда
		ЭтаФорма.Заголовок = Параметры.Наименование;
	КонецЕсли;	
КонецПроцедуры

#Область Телефоны

&НаКлиенте
Процедура ТелефоныТелефонПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ТелефоныСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.ТекущийЭлемент = Элементы.Телефоны;
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефоныПослеУдаления(Элемент)
КонецПроцедуры

#КонецОбласти // Телефоны

&НаКлиенте
Процедура ОбработкаВыбораВодителя(ВыбранныйЭлемент, ДопПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ЭтаФорма.Водитель = ВыбранныйЭлемент;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаПриИзменении(Элемент)
	
	ОбновитьДанныеПоСсылке();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоСсылке()
	Если Не ЗначениеЗаполнено(ЭтаФорма.КонтрагентОрганизация) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ОбновитьДанныеЮрЛиц();
	
	Если Результат.Ошибка Тогда
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОповеститьПользователяОРезультатах(
			ЭтаФорма, "ЗаполнитьИзINI", Результат);
	Иначе
		ИдентификаторЭДО_ОбновитьДанные();
	КонецЕсли;
КонецПроцедуры

#Область ЮрФизЛицо

&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)	
	ОбновитьВидимостьИДоступностьЭлементов();	
КонецПроцедуры

&НаСервере
Процедура ЮрФизЛицо_ЗагрузитьДоступныеЗначенияНаСервере(Знач ДоступныеВидыЛиц)
	Если Не ЗначениеЗаполнено(ДоступныеВидыЛиц) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ЮрФизЛицоСтрокой.СписокВыбора.Очистить();
	
	Если ТипЗнч(ДоступныеВидыЛиц) = Тип("Строка") Тогда
		ДоступныеВидыЛиц = Новый Структура(ДоступныеВидыЛиц);
	КонецЕсли;
	
	Для Каждого ЗначениеВыбора_ Из ЮрФизЛицо_ДоступныеЗначения() Цикл
		Если Не ДоступныеВидыЛиц.Свойство(ЗначениеВыбора_.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы.ЮрФизЛицоСтрокой.СписокВыбора.Добавить(ЗначениеВыбора_.Значение, ЗначениеВыбора_.Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЮрФизЛицо_ДоступныеЗначения()
	РезультатФункции = Новый СписокЗначений;
	РезультатФункции.Добавить("ЮрЛицо", 
		"Юридическое лицо");
	РезультатФункции.Добавить("ЮрЛицоНеРезидент", 
		"Юридическое лицо (не резидент)");
	РезультатФункции.Добавить("ФизЛицо", 
		"Физическое лицо");
	РезультатФункции.Добавить("ИндивидуальныйПредприниматель", 
		"Индивидуальный предприниматель");
	
	Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ЮрФизЛицо

&НаКлиенте
Процедура ОбновитьВидимостьИДоступностьЭлементовНаКлиенте() Экспорт
	ОбновитьВидимостьИДоступностьЭлементов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФИОСтрокой(Знач Фамилия, Знач Имя, Знач Отчество)
	
	СтруктураФИО = Новый Структура;
	СтруктураФИО.Вставить("Фамилия",  Фамилия);
	СтруктураФИО.Вставить("Имя",      Имя);
	СтруктураФИО.Вставить("Отчество", Отчество);
	
	Возврат ЗначениеВСтрокуВнутр(СтруктураФИО);
	
КонецФункции

&НаКлиенте
Функция КонтактныеДанные(ТаблицаКонтактныхДанных)
	
	РезультатФункции = Новый Массив;
	
	Для Каждого СтрокаКонтактныхДанных Из ТаблицаКонтактныхДанных Цикл
		
		СтруктураКонтактныхДанных = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураКонтактныхДанных();
		ЗаполнитьЗначенияСвойств(СтруктураКонтактныхДанных, СтрокаКонтактныхДанных);
		
		РезультатФункции.Добавить(СтруктураКонтактныхДанных);
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьНовуюСтрокуКонтактнойИнформации(ИмяТЧ)
	
	Отбор = Новый Структура;
	Отбор.Вставить("РольСтрокой", "");
	
	НайденныеСтроки = КонтактныеДанные.НайтиСтроки(Отбор);
	Для Каждого Строка Из НайденныеСтроки Цикл
		Строка.РольСтрокой            = ЭтаФорма.РольСтрокой;
		Строка.КлючСтроки_ДанныеЮрЛиц = ЭтаФорма.КлючСтроки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция УдалитьЗапись()
	
	Если ЭтаФорма.ЭтоИП Тогда
		Возврат Не ЗначениеЗаполнено(ЭтаФорма.Фамилия)
			И Не ЗначениеЗаполнено(ЭтаФорма.Имя)
			И Не ЗначениеЗаполнено(ЭтаФорма.Отчество)
			И Не ЗначениеЗаполнено(ЭтаФорма.ИНН);
	Иначе
		Возврат Не ЗначениеЗаполнено(ЭтаФорма.ИНН)
			И Не ЗначениеЗаполнено(ЭтаФорма.КПП)
			И Не ЗначениеЗаполнено(ЭтаФорма.НаименованиеОрганизации);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьАдрес(СтандартнаяОбработка)
	
	ПараметрыВыбораАдреса = Новый Структура;
	ПараметрыВыбораАдреса.Вставить("РольСтрокой",    ЭтаФорма.РольСтрокой);
	ПараметрыВыбораАдреса.Вставить("Значение",       ЭтаФорма.АдресСтруктура);
	ПараметрыВыбораАдреса.Вставить("Текст",          ЭтаФорма.Адрес);
	ПараметрыВыбораАдреса.Вставить("ТолькоПросмотр", ЭтаФорма.ТолькоПросмотрФормы);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").АдресНачалоВыбора(ЭтаФорма, ПараметрыВыбораАдреса, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыРеквизитов()	
	УстановитьТипыКонтрагентовОрганизаций();
	УстановитьОграничениеТиповНаСервере();	
	
	Элементы.КонтактныеДанныеТип.СписокВыбора.Очистить();
	ТипКИ_Телефон = ЗначениеМетаданных(ТипыКонтактнойИнформации() + ".Телефон"); 
	Элементы.КонтактныеДанныеТип.СписокВыбора.Добавить(ТипКИ_Телефон, "Телефон");
	ТипКИ_Email = ЗначениеМетаданных(ТипыКонтактнойИнформации() + ".АдресЭлектроннойПочты");
	Элементы.КонтактныеДанныеТип.СписокВыбора.Добавить(ТипКИ_Email, "Адрес электронной почты");	
КонецПроцедуры     

Процедура УстановитьПараметрОтбора(ЭлементФормы, Имя, Значение)
	
	ПараметрВыбора = Новый ПараметрВыбора(Имя, Значение);
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(ПараметрВыбора);
	ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	ЭлементФормы.ПараметрыВыбора = ПараметрыВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьФормуОрганизации() Экспорт
	
	Если Не ЭтаФорма.ВводДоступен() Тогда
		ЭтаФорма.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

#Область АбонентскиеЯщики

&НаКлиенте
Процедура ИдентификаторЭДО_ОбновитьДанные()
	Если ЗначениеЗаполнено(ЭтаФорма.ИдентификаторЭДО) 
		И Элементы.ИдентификаторЭДО_Представление.Видимость 
		И ИдентификаторыЭДО_ПроверитьПередВыбором().Успешно 
	Тогда
		ТаблицаЯщиковЭДО_Сформировать();
	КонецЕсли;
	ИдентификаторЭДО_ЗаполнитьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторЭДО_ЗаполнитьПредставление(Знач ДанныеЭДО = Неопределено)
	Перем Оператор_;
	
	Если ДанныеЭДО = Неопределено Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ИдентификаторЭДО) Тогда
			СтруктураОтбора = Новый Структура("Идентификатор", ЭтаФорма.ИдентификаторЭДО);
			ДанныеЭДО = ЭтаФорма.АбонентскиеЯщикиЭДО.НайтиСтроки(СтруктураОтбора);
			Если ДанныеЭДО.Количество() Тогда
				Оператор_ = ДанныеЭДО[0].Оператор;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Оператор_ = ДанныеЭДО.Оператор;
	КонецЕсли;
	
	Элементы.ИдентификаторЭДО_Представление.Подсказка = "";
	
	Если ЗначениеЗаполнено(ЭтаФорма.ИдентификаторЭДО) И ЗначениеЗаполнено(Оператор_) Тогда
		Попытка
			ЭтаФорма.ИдентификаторЭДО_Представление = Оператор_;
			Элементы.ИдентификаторЭДО_Представление.Подсказка = ЭтаФорма.ИдентификаторЭДО;
			Элементы.ИдентификаторЭДО_Представление.ОтображениеПодсказки 
				= Вычислить("ОтображениеПодсказки.Кнопка");
		Исключение
			ЭтаФорма.ИдентификаторЭДО_Представление = Оператор_ + " (" + ЭтаФорма.ИдентификаторЭДО + ")";
		КонецПопытки;
	Иначе
		ЭтаФорма.ИдентификаторЭДО_Представление = ЭтаФорма.ИдентификаторЭДО;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЯщиковЭДО_Сформировать(ВызыватьИсключение = Ложь)
	context_params = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД", ВызыватьИсключение);
	Если Не ВызыватьИсключение И context_params = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыМетода_ = ТаблицаЯщиковЭДО_Параметры();
	ПараметрыМетода_.Вставить("context_params", context_params);
	Результат = ТаблицаЯщиковЭДО_ВыполнитьЗапрос(ПараметрыМетода_);
	
	Если ТипЗнч(Результат) <> Тип("Строка") Тогда 
		ЗаполнитьЯщики(Результат);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Результат;
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ТаблицаЯщиковЭДО_ВыполнитьЗапрос(ПараметрыМетода)
	Если ЭтаФорма.ЭтоВО Тогда
		ТранспортВО = ТранспортВО(ЭтаФорма);
		ОбщиеПараметрыЗагрузки = Новый Структура;
		ОбщиеПараметрыЗагрузки.Вставить("context_params",  ПараметрыМетода.context_params);
		ОбщиеПараметрыЗагрузки.Вставить("ОбъектОбработки", ТранспортВО.ТранспортИнтеграции);
		ОбщиеПараметрыЗагрузки.Вставить("ТранспортБлокли", ТранспортВО.ТранспортБлокли);
		Результат = ЗагрузитьПочтовыеЯщикиКонтрагента(ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	Иначе
		Результат = ВыполнитьНаСервере("ESD_ТНЗагрузкаСервер.ЗагрузитьПочтовыеЯщикиКонтрагента", ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ТаблицаЯщиковЭДО_Параметры()
	ДопПоля = "СписокИдентификаторов";
	ДанныеУчастника_ = Новый Структура("ДопПоля", ДопПоля);
	
	Если ЭтаФорма.ЮрФизЛицоСтрокой = "ЮрЛицо" Тогда
		СвЮЛ = Новый Структура;
		СвЮЛ.Вставить("ИНН",      ЭтаФорма.ИНН);
		СвЮЛ.Вставить("КПП",      ЭтаФорма.КПП); 
		СвЮЛ.Вставить("Название", ЭтаФорма.НаименованиеОрганизации);
		ДанныеУчастника_.Вставить("СвЮЛ", СвЮЛ);
	Иначе
		СвФЛ = Новый Структура;
		Если ЭтаФорма.ЮрФизЛицоСтрокой = "ИндивидуальныйПредприниматель" Тогда
			ЧастноеЛицо = "Нет";
		Иначе
			ЧастноеЛицо = "Да";
		КонецЕсли;
		СвФЛ.Вставить("ЧастноеЛицо", ЧастноеЛицо);
		СвФЛ.Вставить("ИНН",         ЭтаФорма.ИНН);
		СвФЛ.Вставить("Фамилия",     ЭтаФорма.Фамилия);
		СвФЛ.Вставить("Имя",         ЭтаФорма.Имя);
		ДанныеУчастника_.Вставить("СвФЛ",    СвФЛ);
	КонецЕсли;
	
	РезультатФункции = Новый Структура("ОтветНаКлиенте", Неопределено);
	РезультатФункции.Вставить("Участник", ДанныеУчастника_);
		
	Возврат РезультатФункции;
КонецФункции
 
&НаКлиенте
Процедура ЗаполнитьЯщики(Результат)
	ЭтаФорма.АбонентскиеЯщикиЭДО.Очистить();
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Идентификаторы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		Результат, "Идентификатор", Новый Массив);
		
	Если Не ЗначениеЗаполнено(Идентификаторы) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У организации отсутствуют абонентские ящики для выбора.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
						
	Для Каждого Описание Из Идентификаторы Цикл	
		НоваяСтрока = ЭтаФорма.АбонентскиеЯщикиЭДО.Добавить();
		НоваяСтрока.Идентификатор = Описание["ИдентификаторУчастника"];
		НоваяСтрока.Оператор      = Описание["Оператор"]["Название"];
		НоваяСтрока.Роуминг       = Булево(Описание["Роуминг"]);
		НоваяСтрока.Основной      = Булево(Описание["Основной"]);
		НоваяСтрока.Комментарий   = ОписаниеКодаСостояния(Описание["СостояниеПодключения"]["Код"], Описание["Комментарий"]);	
	КонецЦикла;
КонецПроцедуры 

&НаКлиенте
Функция ОписаниеКодаСостояния(Код, ОписаниеАбонентскогоЯщика)

	Если Код = "1" Тогда
		Описание = "Контрагент отключен от ЭДО";
	ИначеЕсли Код = "2" Тогда
		Описание = "Нет подключения к ЭДО. При отправке будет отправлено приглашение";
	Иначе
		Описание = ОписаниеАбонентскогоЯщика;
	КонецЕсли;
	
	Возврат Описание;
КонецФункции

&НаКлиенте
Процедура УстановитьДанныеВыбранногоЯщика() 
	
	ТекущиеДанные = Элементы.АбонентскиеЯщикиЭДО.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.ИдентификаторЭДОИзменен = Истина;
		ЭтаФорма.ИдентификаторЭДО = ТекущиеДанные.Идентификатор;
		ИдентификаторЭДО_ЗаполнитьПредставление(ТекущиеДанные);
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновная;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана строка для установки абонентского ящика";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // АбонентскиеЯщики

#Область include_etrn_base_CommonForm_ОрганизацииЭПД_ИдентификаторЭДО
#КонецОбласти // include_etrn_base_CommonForm_ОрганизацииЭПД_ИдентификаторЭДО

#Область include_etrn_base_CommonForm_ОрганизацииЭПД_ТипыКонтрагентовОрганизаций
#КонецОбласти // include_etrn_base_CommonForm_ОрганизацииЭПД_ТипыКонтрагентовОрганизаций

#Область include_etrn_base_CommonForm_ОрганизацииЭПД_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_CommonForm_ОрганизацииЭПД_СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

