
&НаКлиенте
Функция ОбновитьДанныеЮрЛиц()
	ПараметрыРасчета = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыЗаполненияНаОснованииINI();
	ПараметрыРасчета.Вставить("ini_name",  ЭтаФорма.ИмяИНИ);
	ПараметрыРасчета.Вставить("Основание", ЭтаФорма.КонтрагентОрганизация);
	
	РезультатРасчета = Неопределено;
	ТранспортВО = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
		.ТранспортВО(ЭтаФорма);
	РезультатРасчета = МодульКодаКлиент("ESD_ТНОбщегоНазначенияСервер")
		.РезультатРасчетаINI(ПараметрыРасчета, ТранспортВО.ТранспортБлокли);
	
	Возврат ОбновитьДанныеЮрЛицНаСервере(ПараметрыРасчета, РезультатРасчета);
КонецФункции

&НаСервере
Функция ОбновитьДанныеЮрЛицНаСервере(Знач ПараметрыРасчета, Знач РезультатРасчета = Неопределено)
	// зачистка данных перед обновлением
	ЭтаФорма.ДанныеЮрЛиц.Очистить();
	ЭтаФорма.КонтактныеДанные.Очистить();
	
	Результат = ЗаполнитьДанныеЮрЛицНаОснованииINI(ПараметрыРасчета, РезультатРасчета);
	Если ЭтаФорма.ДанныеЮрЛиц.Количество() Тогда	
		Строка    = ЭтаФорма.ДанныеЮрЛиц[0];
		Структура = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ШаблонДанныхЮрЛица();
		Структура.Удалить("КонтактныеДанные");
		
		Строка.РольСтрокой = ЭтаФорма.РольСтрокой;
		ЗаполнитьЗначенияСвойств(Структура, Строка);
		ЗаполнениеРеквизитовФормы(Структура);
		
		Структура.Заполнена = Истина;	
	Иначе
		ОчиститьРеквизитыФормы();
	КонецЕсли;
	
	Для Каждого СтруктураКонтактныхДанных Из ЭтаФорма.КонтактныеДанные Цикл
		СтруктураКонтактныхДанных.РольСтрокой            = ЭтаФорма.РольСтрокой;
		СтруктураКонтактныхДанных.КлючСтроки_ДанныеЮрЛиц = ЭтаФорма.КлючСтроки;
	КонецЦикла;
	
	ОбновитьВидимостьИДоступностьЭлементов();

	Возврат Результат;
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеЮрЛицНаОснованииINI(Знач ПараметрыРасчета, Знач РезультатРасчета)
	Если РезультатРасчета = Неопределено Тогда
		ОбъектОбработки = ОбъектОбработки();
		РезультатРасчета = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатРасчетаINI(ПараметрыРасчета, ОбъектОбработки);
	КонецЕсли;
	
	Если РезультатРасчета.Результат.Ошибка Тогда	
		Возврат РезультатРасчета.Результат;	
	ИначеЕсли НЕ ЗначениеЗаполнено(РезультатРасчета.ДанныеИзИНИ) Тогда	
		РезультатРасчета.Результат.Ошибка          = Истина;
		РезультатРасчета.Результат.ТекстСообщения  = Нстр("ru = 'Не удалось получить данные с сервера.
			|Обратитесь к администратору системы'");	
	Иначе	
		ДанныеИНИ = РезультатРасчета.ДанныеИзИНИ;
		
		ДляДокумента = Новый Структура;
		ДляДокумента.Вставить("ДанныеЮрЛиц",      Новый Массив);
		ДляДокумента.Вставить("КонтактныеДанные", Новый Массив);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьДанныеЮрЛиц(ДляДокумента, ДанныеИНИ, ЭтаФорма.РольСтрокой);
		
		Для Каждого ЭлементЮрЛиц Из ДляДокумента.ДанныеЮрЛиц Цикл
			НС = ЭтаФорма.ДанныеЮрЛиц.Добавить();
			ЗаполнитьЗначенияСвойств(НС, ЭлементЮрЛиц);
		КонецЦикла;

		Для Каждого ЭлементКИ Из ДляДокумента.КонтактныеДанные Цикл
			НС = ЭтаФорма.КонтактныеДанные.Добавить();
			ЗаполнитьЗначенияСвойств(НС, ЭлементКИ);
			
			// правка косяка с текущими типами перечисления
			Если НС.Тип = "Адрес электронной почты" Тогда
				НС.Тип = "АдресЭлектроннойПочты";
			КонецЕсли;		
		КонецЦикла;	
	КонецЕсли;
	
	Возврат РезультатРасчета.Результат;
КонецФункции

