
&НаСервере
Процедура ЗаписатьИдентификаторЭДО(Знач СсылкаНаОбъект, Знач ЗначениеДляЗаписи)
	
	Если Не ЭтаФорма.ИдентификаторЭДОИзменен
		Или Не ЗначениеЗаполнено(СсылкаНаОбъект)
		Или Метаданные.РегистрыСведений.Найти("ДополнительныеСведения") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСвойстваИдентификатор = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИмяСвойстваИдентификатор();
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	СвойствоДляЗаписи = СвойствоДляЗаписи(ИмяСвойстваИдентификатор);
	Если СвойствоДляЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект	= СсылкаНаОбъект;
	МенеджерЗаписи.Свойство	= СвойствоДляЗаписи;
	МенеджерЗаписи.Значение	= ЗначениеДляЗаписи;
	
	Попытка
		МенеджерЗаписи.Записать(Истина);
	Исключение
		МенеджерЗаписи = Неопределено;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция СвойствоДляЗаписи(ИмяСвойства)
	
	РезультатФункции = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", ИмяСвойства);
	Если Не ЗначениеЗаполнено(РезультатФункции) Тогда
		РезультатФункции = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		РезультатФункции.Наименование              = ИмяСвойства;
		РезультатФункции.Заголовок                 = ИмяСвойства;
		РезультатФункции.Имя                       = ИмяСвойства;
		РезультатФункции.ТипЗначения               = Новый ОписаниеТипов("Строка", , РезультатФункции.ТипЗначения.КвалификаторыСтроки);
		РезультатФункции.ЭтоДополнительноеСведение = Истина;
		Попытка
			РезультатФункции.Записать();
			РезультатФункции = РезультатФункции.Ссылка;
		Исключение
			РезультатФункции = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

