
&НаКлиенте
Процедура ОснованиеОформителяОткрытие(Элемент, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеОткрытие(Элемент, СтандартнаяОбработка)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределенный()
    Параметры.Свойство("ДокументОснование", ДокументОснование);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовыеДанныеПереопределенный(СтруктураДанных)
	Если ЗначениеЗаполнено(ЭтаФорма.ДокументОснование) Тогда
		СохранитьПолучателяЧерновикаНаСервере(СтруктураДанных);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьПолучателяЧерновикаНаСервере(Знач Результат)
	 МодульКода("ESD_ТНОбщегоНазначенияСервер").СохранитьСоставителя(Результат, ДокументОснование);
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуДляСтарыхПлатформ()
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяКлиентскогоТранспортаБлокли()
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Функция ЗагрузитьПочтовыеЯщикиКонтрагента(ПараметрыМетода, ОбщиеПараметрыЗагрузки)
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ТранспортВО(Форма)
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОснованиеОформителяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Настройки_ = Новый НастройкиКомпоновкиДанных;

	ОтборТип = Настройки_.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборТип.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Тип");
	ОтборТип.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборТип.ПравоеЗначение = ЗначениеМетаданныхКлиент("ESD_ТипыДокумента.СоставительНаОсновании");
	ОтборТип.Использование  = Истина;

	ОтборИНН = Настройки_.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборИНН.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДанныеЮрЛиц.ИНН");
	ОтборИНН.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборИНН.ПравоеЗначение = ЭтаФорма.ИНН;
	ОтборИНН.Использование  = Истина; 
	
	ПараметрыФормы = Новый Структура("ФиксированныеНастройки", Настройки_);
	Если ЗначениеЗаполнено(ЭтаФорма.Основание) Тогда
		ПараметрыФормы.Вставить("ТекущаяСтрока", ЭтаФорма.Основание);
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
		// BSLLS:GetFormMethod-off
		ФормаДокументЭПД = ПолучитьФорму("Справочник.ESD_ДокументыЭПД.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
		// BSLLS:GetFormMethod-on
		ОснованиеОформителяОбработкаВыбора(ФормаДокументЭПД.ОткрытьМодально());	
	#Иначе		
		ОписаниеВыбора = Новый ОписаниеОповещения("ОснованиеОформителяОбработкаВыбора", ЭтотОбъект);
		ОткрытьФорму("Справочник.ESD_ДокументыЭПД.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеВыбора);
	#КонецЕсли	
КонецПроцедуры 

&НаКлиенте		
Процедура ОснованиеОформителяОбработкаВыбора(Результат, ДопПараметры = Неопределено) Экспорт 	
	Если Результат <> Неопределено Тогда
		ЭтаФорма.Основание = Результат;	
	КонецЕсли;       
КонецПроцедуры  

&НаКлиенте
Процедура Основание_Очистить()  
	Если Элементы.ГруппаОснованиеОформителя.Видимость Тогда
		ЭтаФорма.Основание = Неопределено;		
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Процедура УстановитьОграничениеТипов() 
	МассивТиповОснований = Новый Массив;
	МассивТиповОснований.Добавить("Справочники." + ДокументыЭПД()); 
	
	УстановитьПараметрОтбора(
			Элементы.ОснованиеОформителя, "Отбор.Тип", ЗначениеМетаданных("ESD_ТипыДокумента.УполномоченныйНаОсновании"));
	УстановитьПараметрОтбора(
			Элементы.Основание, "Отбор.Тип", ЗначениеМетаданных("ESD_ТипыДокумента.УполномоченныйНаОсновании"));
	
	ESD_ТНОбщегоНазначенияСервер.УстановитьОграниченияТипов(Элементы.Основание, МассивТиповОснований);
	ESD_ТНОбщегоНазначенияСервер.УстановитьОграниченияТипов(Элементы.ОснованиеОформителя, МассивТиповОснований);	
КонецПроцедуры

#Область include_etrn_base_CommonForm_ОрганизацииЭПД_ЗаполнениеНаОсновании
#КонецОбласти // include_etrn_base_CommonForm_ОрганизацииЭПД_ЗаполнениеНаОсновании

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область includr_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // includr_etrn_base_CommonModule_ЗначениеМетаданных

#Область includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере 
#КонецОбласти // includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область includr_etrn_base_CommonModule_КартинкаИнтерфейсаСервер
#КонецОбласти // includr_etrn_base_CommonModule_КартинкаИнтерфейсаСервер

#Область includr_etrn_base_CommonModule_Метаданные
#КонецОбласти // includr_etrn_base_CommonModule_Метаданные

#Область includr_etrn_base_CommonModule_ОбъектОбработки
#КонецОбласти // includr_etrn_base_CommonModule_ОбъектОбработки

