
&НаКлиенте
Процедура ОснованиеОформителяОткрытие(Элемент, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеОткрытие(Элемент, СтандартнаяОбработка)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределенный()
    Параметры.Свойство("ДокументОснование", ДокументОснование);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовыеДанныеПереопределенный(СтруктураДанных)
	Если ЗначениеЗаполнено(ЭтаФорма.ДокументОснование) Тогда
		СохранитьПолучателяЧерновикаНаСервере(СтруктураДанных);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьПолучателяЧерновикаНаСервере(Знач Результат)
	 МодульКода("ESD_ТНОбщегоНазначенияСервер").СохранитьСоставителя(Результат, ДокументОснование);
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуДляСтарыхПлатформ()
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Функция РезультатРасчетаINI(ПараметрыРасчета, ТранспортБлокли)
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ИмяКлиентскогоТранспортаБлокли()
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Функция ЗагрузитьПочтовыеЯщикиКонтрагента(ПараметрыМетода, ОбщиеПараметрыЗагрузки)
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ТранспортВО(Форма)
	
	Возврат Неопределено;
	
КонецФункции

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область includr_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // includr_etrn_base_CommonModule_ЗначениеМетаданных

#Область includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере 
#КонецОбласти // includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область includr_etrn_base_CommonModule_КартинкаИнтерфейсаСервер
#КонецОбласти // includr_etrn_base_CommonModule_КартинкаИнтерфейсаСервер

#Область includr_etrn_base_CommonModule_Метаданные
#КонецОбласти // includr_etrn_base_CommonModule_Метаданные

#Область includr_etrn_base_CommonModule_ОбъектОбработки
#КонецОбласти // includr_etrn_base_CommonModule_ОбъектОбработки

