
&НаСервере
Процедура УстановитьТипыКонтрагентовОрганизаций()
	
	// Контрагенты и организации
	МассивПроверяемыхТипов = Новый Массив;
	МассивПроверяемыхТипов.Добавить("Справочники.Контрагенты");
	МассивПроверяемыхТипов.Добавить("Справочники.Организации");
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").УстановитьОграниченияТипов(Элементы.КонтрагентОрганизация, МассивПроверяемыхТипов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИмяИНИИзНастроекСопоставления(Организация)
	
	Возврат;
	
КонецПроцедуры

