
&НаКлиенте
Процедура Показать(ДокументСБИС, ДокуметИС, context_param, ДопПараметры) Экспорт
	
	// оповещение для обновления данных открытой формы
	Оповестить("ПереоткрытьФормуЭПД");
	
	ПараметрыФормыЭПД = Новый Структура;
	Если ЗначениеЗаполнено(ДокуметИС) Тогда
		ПараметрыФормыЭПД.Вставить("ДокументОснование", ДокуметИС);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументСБИС) Тогда
		ПараметрыФормыЭПД.Вставить("Идентификатор", ДокументСБИС["Идентификатор"]);
	КонецЕсли;
	
	ОткрытьФорму(ПутьКФормамОбработки() + "Saby_ТранспортнаяНакладная", ПараметрыФормыЭПД, ЭтаФорма.ВладелецФормы);
	
КонецПроцедуры

&НаКлиенте
Функция ПутьКФормамОбработки()
	ИмяФормыПС = СтрЗаменить(ЭтаФорма.ИмяФормы, ".", Символы.ПС);
	ПутьКФормам = "";
	Для Счетчик = 1 По СтрЧислоСтрок(ИмяФормыПС)-1 Цикл
	    ПутьКФормам = ПутьКФормам + СтрПолучитьСтроку(ИмяФормыПС, Счетчик) + ".";
	КонецЦикла;
	Возврат ПутьКФормам;
КонецФункции
