
&НаКлиенте
Процедура Показать(ДокументСБИС, ДокуметИС, context_param, ДопПараметры) Экспорт
	
	// оповещение для обновления данных открытой формы
	Оповестить("ПереоткрытьФормуЭПД");
	
	ПараметрыФормыЭПД = Новый Структура;
	Если ЗначениеЗаполнено(ДокуметИС) Тогда
		ПараметрыФормыЭПД.Вставить("ДокументОснование", ДокуметИС);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументСБИС) Тогда
		ПараметрыФормыЭПД.Вставить("Идентификатор", ДокументСБИС["Идентификатор"]);
	КонецЕсли;
	
	ОткрытьФорму("ВнешняяОбработка.СБИС.Форма.Saby_ТранспортнаяНакладная", ПараметрыФормыЭПД, ЭтаФорма.ВладелецФормы);
	
КонецПроцедуры
