
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Форма = ПараметрыВыполненияКоманды.Источник;
	Если Найти(Форма.ИмяФормы, "ФормаСписка") > 0 Тогда
		ОбработкаКоманды_ФормаСписка(Форма);
	Иначе
		ОбработкаКоманды_ФормаЭлемента(Форма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды_ФормаСписка(Форма)
	Если ТипЗнч(Форма.ТекущийЭлемент) <> Тип("ТаблицаФормы") Тогда
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").СообщитьПользователю("Выделите строку для выполнения команды");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Форма.ТекущийЭлемент.ВыделенныеСтроки;
	Для Каждого Ссылка Из ВыделенныеСтроки Цикл
		ОткрытьДокументВSABY(Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды_ФормаЭлемента(Форма)
	Если Форма.Объект.Ссылка.Пустая() Тогда
		Форма.Модифицированность = Истина;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Форма", Форма);
	ОткрытьДокументВSABY = Новый ОписаниеОповещения(
		"ОткрытьДокументВSABY",
		ЭтотОбъект, ДополнительныеПараметры);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПроверитьМодифицированностьИПродолжитьВыполнение(
		ОткрытьДокументВSABY);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ОткрытьДокументВSABY(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	Перем ДополнительныеПараметрыОткрытия;

	Если ТипЗнч(Результат) = Тип("КодВозвратаДиалога") Тогда
		// Открытие из формы документа
		ФормаЭПД = ДополнительныеПараметры.Форма;	
		СсылкаНаДокумент = ФормаЭПД.Объект.Ссылка;

		Попытка
			ДополнительныеПараметрыОткрытия = ФормаЭПД.ВыгрузкаДанных_ДополнительныеПараметры();
		Исключение
			ДополнительныеПараметрыОткрытия = Неопределено;
		КонецПопытки;	
	Иначе
		// Открытие из формы списка, внешних источников или при отсутствии изменения документа	
		СсылкаНаДокумент = Результат;	
	КонецЕсли;
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОткрытьДокументВSABY(СсылкаНаДокумент, , ДополнительныеПараметрыОткрытия);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
