
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Форма = ПараметрыВыполненияКоманды.Источник;
	Если Найти(Форма.ИмяФормы, "ФормаСписка") > 0 Тогда
		ВыделенныеСтроки = Форма.ТекущийЭлемент.ВыделенныеСтроки;
		Для Каждого Ссылка Из ВыделенныеСтроки Цикл	
			ОткрытьДокументВSABY(Ссылка);	
		КонецЦикла;
	Иначе
		Если Форма.Объект.Ссылка.Пустая() Тогда
			Форма.Модифицированность = Истина;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура("Форма", Форма);
		ОткрытьДокументВSABY = Новый ОписаниеОповещения(
			"ОткрытьДокументВSABY",
			ЭтотОбъект, ДополнительныеПараметры);
		
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПроверитьМодифицированностьИПродолжитьВыполнение(
			ОткрытьДокументВSABY);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ОткрытьДокументВSABY(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	Если ТипЗнч(Результат) = Тип("КодВозвратаДиалога") Тогда
		// Открытие из формы документа	
		СсылкаНаДокумент = ДополнительныеПараметры.Форма.Объект.Ссылка;	
	Иначе
		// Открытие из формы списка, внешних источников или при отсутствии изменения документа	
		СсылкаНаДокумент = Результат;	
	КонецЕсли;
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОткрытьДокументВSABY(СсылкаНаДокумент, Ложь);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
