
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма          = ПараметрыВыполненияКоманды.Источник;
	ЭтоФормаСписка = Найти(Форма.ИмяФормы, "ФормаСписка") > 0;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	Если ЭтоФормаСписка Тогда
		
		ВыделенныеСтроки = Форма.ТекущийЭлемент.ВыделенныеСтроки;
		Для Каждого Ссылка Из ВыделенныеСтроки Цикл
			
			ОткрытьДокументВSABY(Ссылка, ДополнительныеПараметры);
			
		КонецЦикла;
		
	Иначе
		
		Если Форма.Объект.Ссылка.Пустая() Тогда
			Форма.Модифицированность = Истина;
		КонецЕсли;
		
		ОткрытьДокументВSABY = Новый ОписаниеОповещения(
			"ОткрытьДокументВSABY",
			ЭтотОбъект, ДополнительныеПараметры);
		
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПроверитьМодифицированностьИПродолжитьВыполнение(
			ОткрытьДокументВSABY);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ОткрытьДокументВSABY(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат)  = Тип("КодВозвратаДиалога") Тогда
		
		СсылкаНаДокумент    = ДополнительныеПараметры.Форма.Объект.Ссылка;
		
	Иначе
		
		СсылкаНаДокумент    = Результат;
		
	КонецЕсли;
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОткрытьДокументВSABY(СсылкаНаДокумент, Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
