Перем СтруктураДопПараметров; // Переменная хранения значения реквизита "ДополнительныеПараметры"

// BSLLS:ExportVariables-off
Перем Основание Экспорт; // Используется при работе с функционалом запуска и выполнения
// BSLLS:ExportVariables-on

#Область События

Процедура ПередЗаписью(Отказ)
	Если ПометкаУдаления Тогда
		// BSLLS:UnusedLocalVariable-off
		Активно = Ложь;
		// BSLLS:UnusedLocalVariable-on
	Иначе
		Если ЭтоНовый() Тогда
			Активно = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = ОснованиеМетаданные;
	КонецЕсли;
	
	ЗаполнитьСтруктуруДополнительныхПараметров();
	
	ПередЗаписью_НастроитьСобственноеРегламентноеЗадание();
	ПередЗаписью_ЗаписьСтатистикиИспользования();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ПриЗаписи_НастроитьСобственноеРегламентноеЗадание();
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Запуск автоматического сценария
//
// Параметры:
//  ПараметрыЗапуска - Структура - параметры запуска автоматического сценария
//
// Возвращаемое значение:
//	Строка - строковый идентификатор запущенного автоматического сценария
//
Функция Запустить(Знач ПараметрыЗапуска = Неопределено) Экспорт
	ЗаполнитьСтруктуруДополнительныхПараметров();
	
	// Проверим параметры запуска и настройки автоматического сценария
	Отказ = Ложь;
	ПередЗапускомАвтоматическогоСценария(Отказ);
	// Прерываем выполнение, если проверка не пройдена
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Добавим запись о запуске АС
	// Получим идентификатор запущенного автоматического сценария
	Идентификатор = МодульКода("РегистрыСведений.АвтоматическиеСценарии").Добавить(Ссылка, Основание);
	Если Идентификатор = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Вернем полученный идентификатор запущенного АС
	Возврат Идентификатор;
КонецФункции

// Выполнение действия и его обработчиков
//
// Параметры:
//	ID - Строка - уникальный идентификатор запущенного автоматического сценария
//	Действие - Ссылка - ссылка на выполняемое действие
//
Процедура ВыполнитьДействие(ID, Действие) Экспорт
	Перем Комментарий, СтатусВыполнения, ЗначенияРезультата;
	
	// Получим менеджер перечисления статусов выполнения
	МодульСтатусыВыполнения = МодульКода("Перечисления.АвтоматическиеСценарииСтатусыВыполнения");
	// Сразу зарегистрируем начало выполнения действия
	МодульКода("РегистрыСведений.АвтоматическиеСценарииЖурнал").ДобавитьНовыйСтатус(
		Ссылка, ID, Действие, ТекущаяДатаСеанса(), МодульСтатусыВыполнения.Выполняется 
	);
	
	// Если основание не было передано в момент выполнения действия - получим его по идентификатору
	Если Не ЗначениеЗаполнено(Основание) Тогда
		Основание = МодульКода("РегистрыСведений.АвтоматическиеСценарии").Основание(Ссылка, ID);	
	КонецЕсли;
	
	Попытка
		СписокДействий = Действия.НайтиСтроки(Новый Структура("Действие", Действие));
		Если Не СписокДействий.Количество() Тогда
			ВызватьИсключение "Действие не найдено! Выполнение автоматического сценария невозможно!";
		КонецЕсли;
		
		ДанныеДействия = СписокДействий[0];	
		ПараметрыДействия = ДанныеДействия.Параметры.Получить();
		
		РезультатВыполнения = МодульКода("Справочники.АвтоматическиеСценарииДействия").ВыполнитьОбработчики(Действие, Основание, ПараметрыДействия);
		Если РезультатВыполнения.Ошибка Тогда
			СтатусВыполнения = МодульСтатусыВыполнения.ОшибкаВыполнения;
		ИначеЕсли РезультатВыполнения.Отказ Тогда
			СтатусВыполнения = МодульСтатусыВыполнения.Отменено;
		Иначе
			СтатусВыполнения = МодульСтатусыВыполнения.Выполнено;
		КонецЕсли;
		Комментарий = РезультатВыполнения.Комментарий;
		ЗначенияРезультата = РезультатВыполнения.Значения;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		СтатусВыполнения = МодульСтатусыВыполнения.ОшибкаВыполнения;
		Комментарий = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	ДатаВыполнения = ТекущаяДатаСеанса() + 1; // На всякий случай сдвинем секунду для "среза" РС
	МодульКода("РегистрыСведений.АвтоматическиеСценарииЖурнал").ДобавитьНовыйСтатус(
		Ссылка, ID, Действие, ДатаВыполнения, СтатусВыполнения, Комментарий, ЗначенияРезультата 
	);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Проверка данных запуска автоматического сценария
//
// Параметры:
//	Отказ - Булево - признак отмены запуска
//
Процедура ПередЗапускомАвтоматическогоСценария(Отказ = Ложь) Экспорт
	Проверка_АктивныйАвтоматическийСценарий(Отказ);
	Проверка_КратностьЗапуска(Отказ);
	Проверка_Отбор(Отказ);
	Проверка_ОбработчикПередЗапуском(Отказ);
КонецПроцедуры

// Проверка установленного отбора автоматического сценария
//
// Возвращаемое значение:
//	Булево - признак соответствия основания установленному в автоматическом сценарии отбору
//
Функция ОснованиеСоответствуетОтбору() Экспорт
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НастройкиКомпоновщика = НастройкиОтбора.Получить();
	
	Структура = НастройкиКомпоновщика.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ВыбранноеПоле = Структура.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
	
	НовыйЭлементОтбора = НастройкиКомпоновщика.Отбор.Элементы.Вставить(0, Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	НовыйЭлементОтбора.ПравоеЗначение = Основание;
	НовыйЭлементОтбора.Использование  = Истина;
	
	ИмяМетаданных = Основание.Метаданные().ПолноеИмя();
	СхемаКомпоновкиДанных = МодульКода("АвтоматическиеСценарииСерверСлужебный").СхемаКомпоновкиДанных(ИмяМетаданных);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщика, , ,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
			
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ТаблицаЗначений);

	ТЗ = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Возврат ТЗ.Количество() > 0;
КонецФункции

// Признак синхронного выполнения действий
//
// Возвращаемое значение:
//	Булево - сам признак
//
Функция ВыполнятьДействияСинхронно() Экспорт
	Возврат ВариантВыполнения = МодульКода("Перечисления.АвтоматическиеСценарииВариантыВыполнения").Синхронно; 
КонецФункции

// Признак выполнения действий собственным регламентным заданием
//
// Возвращаемое значение:
//	Булево - сам признак
//
Функция ВыполнятьДействияСобственнымРегламентнымЗаданием() Экспорт
	Возврат ВариантВыполнения = МодульКода("Перечисления.АвтоматическиеСценарииВариантыВыполнения").СобственноеРегламентноеЗадание;	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Проверка_АктивныйАвтоматическийСценарий(Отказ)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("АвтоматическийСценарий, ОснованиеID, Завершен", 
		Ссылка, Строка(Основание.УникальныйИдентификатор()), Ложь);
	АктивныеАС = МодульКода("РегистрыСведений.АвтоматическиеСценарии").НайтиПоОтбору(ПараметрыОтбора);
	Если АктивныеАС.Количество() > 0 Тогда
		Отказ = Истина;
	КонецЕсли;		
КонецПроцедуры

Процедура Проверка_КратностьЗапуска(Отказ)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если КратностьЗапуска = МодульКода("Перечисления.АвтоматическиеСценарииВидыЗапуска").Однократный Тогда
		// Для "однократных" АС проверим запускался ли ранее на текущее основание
		ПараметрыОтбора = Новый Структура("АвтоматическийСценарий,ОснованиеID", Ссылка, Строка(Основание.УникальныйИдентификатор()));
		ЗапущенныеАС = МодульКода("РегистрыСведений.АвтоматическиеСценарии").НайтиПоОтбору(ПараметрыОтбора);
		Если ЗапущенныеАС.Количество() > 0 Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура Проверка_Отбор(Отказ)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОснованиеСоответствуетОтбору() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура Проверка_ОбработчикПередЗапуском(Отказ)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОбработчика = СтруктураДопПараметров.Обработчики.ПередЗапуском.Текст;
	ПараметрыОбработчика = СтруктураДопПараметров.Обработчики.ПередЗапуском.Параметры;
	
	МодульАвтоматическиеСценарииСервер = МодульКода("АвтоматическиеСценарииСервер");
	
	РезультатВыполнения = МодульАвтоматическиеСценарииСервер.РезультатВыполнения();
	МодульАвтоматическиеСценарииСервер.ВыполнитьОбработчик(ТекстОбработчика, Основание, ПараметрыОбработчика, РезультатВыполнения);
	Если РезультатВыполнения.Ошибка Или РезультатВыполнения.Отказ Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#Область НастройкаСобственногоРегламентногоЗадания

Процедура ПередЗаписью_НастроитьСобственноеРегламентноеЗадание()
	Если ВыполнятьДействияСобственнымРегламентнымЗаданием() Тогда
		СобственноеРегламентноеЗаданиеСоздать();
	Иначе
		СобственноеРегламентноеЗаданиеУдалить();
		Если ДополнительныеСвойства.Свойство("РегламентноеЗадание") Тогда
			ДополнительныеСвойства.Удалить("РегламентноеЗадание");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи_НастроитьСобственноеРегламентноеЗадание()
	СобственноеРегламентноеЗаданиеОбновить();
КонецПроцедуры

Процедура СобственноеРегламентноеЗаданиеСоздать()
	Если ЗначениеЗаполнено(СтруктураДопПараметров.РегламентноеЗадание.Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	МодульАвтоматическиеСценарииСервер = МодульКода("АвтоматическиеСценарииСервер");
	
	ПараметрыРегЗадания = МодульАвтоматическиеСценарииСервер.РегламентноеЗаданиеПараметры();
	ПараметрыРегЗадания.Вставить("Метаданные", МодульАвтоматическиеСценарииСервер.РегламентноеЗаданиеМетаданные());
	
	РегЗадание = МодульАвтоматическиеСценарииСервер.РегламентноеЗаданиеСоздать(ПараметрыРегЗадания);
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Ложь);
	// BSLLS:SetPrivilegedMode-on
	
	// Добавим идентификатор в "доп. параметры" объекта
	СтруктураДопПараметров.РегламентноеЗадание.Идентификатор = РегЗадание.УникальныйИдентификатор;

	// BSLLS:UnusedLocalVariable-off
	ДополнительныеПараметры = Новый ХранилищеЗначения(СтруктураДопПараметров);
	// BSLLS:UnusedLocalVariable-on
КонецПроцедуры

Процедура СобственноеРегламентноеЗаданиеУдалить()
	ИдентификаторРегЗадания = СтруктураДопПараметров.РегламентноеЗадание.Идентификатор;
	Если Не ЗначениеЗаполнено(ИдентификаторРегЗадания) Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	МодульКода("АвтоматическиеСценарииСервер").РегламентноеЗаданиеУдалить(ИдентификаторРегЗадания);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Уберем идентификатор из "доп. параметров" объекта
	СтруктураДопПараметров.РегламентноеЗадание.Идентификатор = Неопределено;

	// BSLLS:UnusedLocalVariable-off
	ДополнительныеПараметры = Новый ХранилищеЗначения(СтруктураДопПараметров);
	// BSLLS:UnusedLocalVariable-on
КонецПроцедуры

Процедура СобственноеРегламентноеЗаданиеОбновить()
	ИдентификаторРегЗадания = СтруктураДопПараметров.РегламентноеЗадание.Идентификатор;
	Если Не ЗначениеЗаполнено(ИдентификаторРегЗадания) Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	МодульАвтоматическиеСценарииСервер = МодульКода("АвтоматическиеСценарииСервер");
	
	ПараметрыРегЗадания = МодульАвтоматическиеСценарииСервер.РегламентноеЗаданиеПараметры();
	Если ДополнительныеСвойства.Свойство("РегламентноеЗадание") Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыРегЗадания, ДополнительныеСвойства.РегламентноеЗадание);
	Иначе
		РегламентноеЗадание = МодульАвтоматическиеСценарииСервер.РегламентноеЗадание(ИдентификаторРегЗадания);
		ЗаполнитьЗначенияСвойств(ПараметрыРегЗадания, РегламентноеЗадание);
	КонецЕсли;
	
	ПараметрыРегЗадания.Использование = Активно;
	Если ТипЗнч(ПараметрыРегЗадания.Расписание) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		ПараметрыРегЗадания.Расписание = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	ПараметрыРегЗадания.Наименование = МодульАвтоматическиеСценарииСервер.РегламентноеЗаданиеНаименование(Наименование);
		
	ПараметрыВыполнения = Новый Массив;
	ПараметрыВыполнения.Добавить(Ссылка);
	ПараметрыРегЗадания.Параметры = ПараметрыВыполнения;	

	МодульКода("АвтоматическиеСценарииСервер").РегламентноеЗаданиеОбновить(ИдентификаторРегЗадания, ПараметрыРегЗадания);
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Ложь);
	// BSLLS:SetPrivilegedMode-on
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьСтруктуруДополнительныхПараметров()
	СтруктураДопПараметров = ДополнительныеПараметры.Получить();
	Если СтруктураДопПараметров = Неопределено Тогда
		СтруктураДопПараметров = МодульКода("Справочники.АвтоматическиеСценарии").ДополнительныеПараметры();
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью_ЗаписьСтатистикиИспользования()
	Если Не ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ИспользуетсяПредопределенноеДействие_ЗакрытиеФазы = Ложь;
	ИспользуетсяПредопределенноеДействие_СозданиеЧерезРедактор = Ложь;
	
	МодульПредопределенныхДействий = МодульКода("Перечисления.АвтоматическиеСценарииПредопределенныеДействия");
	Для Каждого ОписаниеДействия Из Действия Цикл
		Если Не ИспользуетсяПредопределенноеДействие_ЗакрытиеФазы 
			И ОписаниеДействия.Действие = МодульПредопределенныхДействий.Saby_ЗакрытиеФазыДокумента 
		Тогда
			ESD_ТНЗагрузкаСервер.ЗаписатьСтатистикуВызоваВОблако("СценарийОбработки", "АвтоматическиеСценарии");
			ИспользуетсяПредопределенноеДействие_ЗакрытиеФазы = Истина;
			Продолжить;
		КонецЕсли;
		
		Если Не ИспользуетсяПредопределенноеДействие_СозданиеЧерезРедактор 
			И ОписаниеДействия.Действие = МодульПредопределенныхДействий.Saby_ЗаполнениеДокументаЧерезРедакторСопоставлений 
		Тогда
			ESD_ТНЗагрузкаСервер.ЗаписатьСтатистикуВызоваВОблако("СценарийСоздания", "АвтоматическиеСценарии");
			ИспользуетсяПредопределенноеДействие_СозданиеЧерезРедактор = Истина;
			Продолжить;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти