Перем СтруктураДопПараметров; // Переменная хранения значения реквизита "ДополнительныеПараметры"

// BSLLS:ExportVariables-off
Перем Основание Экспорт; // Используется при работе с функционалом запуска и выполнения
// BSLLS:ExportVariables-on

#Область События

Процедура ПередЗаписью(Отказ)
	Если ЭтотОбъект.ПометкаУдаления Тогда
		ЭтотОбъект.Активно = Ложь;
	Иначе
		Если ЭтоНовый() Тогда
			ЭтотОбъект.Активно = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ЭтотОбъект.Наименование) Тогда
		ЭтотОбъект.Наименование = ОснованиеМетаданные;
	КонецЕсли;
	
	СтруктураДопПараметров = ДополнительныеПараметры();
	
	КлиентСерверАС_ = МодульКода("АвтоматическиеСценарииКлиентСервер");
	Если ЭтотОбъект.ВидЗапуска = КлиентСерверАС_.ВидЗапуска_РегламентноеЗадание() Тогда
		ПередЗаписью_ВидЗапуска_РегламентноеЗадание();
	Иначе
		ПередЗаписью_ВидЗапуска_СобытиеОбъекта();
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеПараметры = Новый ХранилищеЗначения(СтруктураДопПараметров);
	
	ПередЗаписью_ЗаписьСтатистикиИспользования();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	КлиентСерверАС_ = МодульКода("АвтоматическиеСценарииКлиентСервер");
	Если ЭтотОбъект.ВидЗапуска = КлиентСерверАС_.ВидЗапуска_РегламентноеЗадание() Тогда
		ПриЗаписи_ВидЗапуска_РегламентноеЗадание();
	Иначе
		ПриЗаписи_ВидЗапуска_СобытиеОбъекта();
	КонецЕсли;
	
	РегламентноеЗадание_Настроить();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Очистить();
	Если ВидЗапуска = МодульКода("АвтоматическиеСценарииКлиентСервер").ВидЗапуска_СобытиеОбъекта() Тогда
		ПроверяемыеРеквизиты.Добавить("ОснованиеМетаданные");
		ПроверяемыеРеквизиты.Добавить("Событие");
		ПроверяемыеРеквизиты.Добавить("КратностьЗапуска");
		ПроверяемыеРеквизиты.Добавить("ВариантВыполнения");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Запуск автоматического сценария
//
// Параметры:
//  ПараметрыЗапуска - Структура - параметры запуска автоматического сценария
//
// Возвращаемое значение:
//	Строка - строковый идентификатор запущенного автоматического сценария
//
Функция Запустить(Знач ПараметрыЗапуска = Неопределено) Экспорт
	// Проверим параметры запуска и настройки автоматического сценария
	Отказ = Ложь;
	ПередЗапускомАвтоматическогоСценария(Отказ);
	// Прерываем выполнение, если проверка не пройдена
	Если Не Отказ Тогда
		// Добавим запись о запуске АС
		// Получим идентификатор запущенного автоматического сценария
		ДанныеАС = МодульКода("РегистрыСведений.АвтоматическиеСценарии").Добавить(Ссылка, Основание, ПараметрыЗапуска);
	Иначе
		ДанныеАС = МодульКода("РегистрыСведений.АвтоматическиеСценарии").СтруктураДанных();
	КонецЕсли;
	
	// Вернем полученный идентификатор запущенного АС
	Возврат ДанныеАС;
КонецФункции

// Выполнение действия и его обработчиков
//
// Параметры:
//	ID - Строка - уникальный идентификатор запущенного автоматического сценария
//	Действие - Ссылка - ссылка на выполняемое действие
//	БезОснования - Булево - признак отсутствия "основания" выполнения действия
//
// Возвращаемое значение:
//	Структура - результат выполнения действия
//
Функция ВыполнитьДействие(ID, Действие, БезОснования = Ложь) Экспорт
	Перем Комментарий, СтатусВыполнения, ЗначенияРезультата;
	
	МодульESD_Действия = МодульКода("Справочники.АвтоматическиеСценарииДействия");
	Если МодульESD_Действия.ТребуетсяАвторизацияSaby(Действие) Тогда
		context_params = ESD_Core.ПроверитьНаличиеПараметровПодключения();
		Если Не ЗначениеЗаполнено(context_params) Тогда
			ВызватьИсключение "Не заполнены параметры подключения Saby. 
				|Проверьте авторизацию пользователя в Saby, из под которого запускается выполнение и повторите попытку";
		КонецЕсли;	
	КонецЕсли;	
	
	// Получим менеджер перечисления статусов выполнения
	МодульСтатусыВыполнения = МодульКода("Перечисления.АвтоматическиеСценарииСтатусыВыполнения");
	// Сразу зарегистрируем начало выполнения действия
	МодульКода("РегистрыСведений.АвтоматическиеСценарииЖурнал").ДобавитьНовыйСтатус(
		Ссылка, ID, Действие, ТекущаяДатаСеанса(), МодульСтатусыВыполнения.Выполняется);
	
	// Если основание не было передано в момент выполнения действия - получим его по идентификатору
	Если Не БезОснования И Не ЗначениеЗаполнено(Основание) Тогда
		Основание = МодульКода("РегистрыСведений.АвтоматическиеСценарии").Основание(Ссылка, ID);	
	КонецЕсли;
	
	Попытка
		СписокДействий = Действия.НайтиСтроки(Новый Структура("Действие", Действие));
		Если Не СписокДействий.Количество() Тогда
			ВызватьИсключение "Действие не найдено! Выполнение автоматического сценария невозможно!";
		КонецЕсли;
		
		ДанныеДействия = СписокДействий[0];	
		ПараметрыДействия = ДанныеДействия.Параметры.Получить();
		
		СлужебныеПараметры = МодульКода("Справочники.АвтоматическиеСценарии").СлужебныеПараметры(Ссылка, ID, Действие);
		
		РезультатВыполнения = МодульESD_Действия.ВыполнитьОбработчики(Действие, Основание, ПараметрыДействия, СлужебныеПараметры);
		Если РезультатВыполнения.Ошибка Тогда
			СтатусВыполнения = МодульСтатусыВыполнения.ОшибкаВыполнения;
		ИначеЕсли РезультатВыполнения.Отказ Тогда
			СтатусВыполнения = МодульСтатусыВыполнения.Отменено;
		Иначе
			СтатусВыполнения = МодульСтатусыВыполнения.Выполнено;
		КонецЕсли;
		Комментарий = РезультатВыполнения.Комментарий;
		ЗначенияРезультата = РезультатВыполнения.Значения;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		СтатусВыполнения = МодульСтатусыВыполнения.ОшибкаВыполнения;
		Комментарий = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	ДатаВыполнения = ТекущаяДатаСеанса() + 1; // На всякий случай сдвинем секунду для "среза" РС
	МодульКода("РегистрыСведений.АвтоматическиеСценарииЖурнал").ДобавитьНовыйСтатус(
		Ссылка, ID, Действие, ДатаВыполнения, СтатусВыполнения, Комментарий, ЗначенияРезультата);
	
	Возврат РезультатВыполнения;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Проверка данных запуска автоматического сценария
//
// Параметры:
//	Отказ - Булево - признак отмены запуска
//
Процедура ПередЗапускомАвтоматическогоСценария(Отказ = Ложь) Экспорт
	Если ВидЗапуска = МодульКода("АвтоматическиеСценарииКлиентСервер").ВидЗапуска_СобытиеОбъекта() Тогда
		ПроверкаЗапуска_АктивныйАвтоматическийСценарий(Отказ);
		ПроверкаЗапуска_КратностьЗапуска(Отказ);
		ПроверкаЗапуска_Отбор(Отказ);
	КонецЕсли;
	
	ПроверкаЗапуска_ОбработчикПередЗапуском(Отказ);
КонецПроцедуры

// Проверка установленного отбора автоматического сценария
//
// Возвращаемое значение:
//	Булево - признак соответствия основания установленному в автоматическом сценарии отбору
//
Функция ОснованиеСоответствуетОтбору() Экспорт
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НастройкиКомпоновщика = НастройкиОтбора.Получить();
	
	Структура = НастройкиКомпоновщика.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ВыбранноеПоле = Структура.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
	
	НовыйЭлементОтбора = НастройкиКомпоновщика.Отбор.Элементы.Вставить(0, Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	НовыйЭлементОтбора.ПравоеЗначение = Основание;
	НовыйЭлементОтбора.Использование  = Истина;
	
	ИмяМетаданных = Основание.Метаданные().ПолноеИмя();
	СхемаКомпоновкиДанных = МодульКода("АвтоматическиеСценарииСерверСлужебный").СхемаКомпоновкиДанных(ИмяМетаданных);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщика, , ,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
			
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ТаблицаЗначений);

	ТЗ = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Возврат ТЗ.Количество() > 0;
КонецФункции

// Признак синхронного выполнения действий
//
// Возвращаемое значение:
//	Булево - сам признак
//
Функция ВыполнятьДействияСинхронно() Экспорт
	Возврат ВариантВыполнения = МодульКода("Перечисления.АвтоматическиеСценарииВариантыВыполнения").Синхронно; 
КонецФункции

#Область ВидЗапуска_РегламентноеЗадание

Функция ВидЗапуска_РегламентноеЗадание_Найти() Экспорт
	СтруктураОтбора_ = Новый Структура("АвтоматическийСценарий", Ссылка);
	СтруктураОтбора_.Вставить("Завершен", Ложь);
	
	ОснованиеID_ = МодульКода("АвтоматическиеСценарииКлиентСервер").ОснованиеID_РегламентноеЗадание();
	СтруктураОтбора_.Вставить("ОснованиеID", ОснованиеID_);
	
	Возврат МодульКода("РегистрыСведений.АвтоматическиеСценарии").НайтиПоОтбору(СтруктураОтбора_);
КонецФункции

Функция ВидЗапуска_РегламентноеЗадание_Запустить() Экспорт
	ТекущиеАктивные_ = ВидЗапуска_РегламентноеЗадание_Найти();
	Если ТекущиеАктивные_.Количество() Тогда
		Возврат ТекущиеАктивные_[0].ID;
	КонецЕсли;
	
	ПараметрыЗапуска_ = МодульКода("АвтоматическиеСценарииКлиентСервер")
		.ПараметрыЗапуска(ЭтотОбъект.ВидЗапуска);
	Возврат Запустить(ПараметрыЗапуска_);
КонецФункции

Процедура ВидЗапуска_РегламентноеЗадание_НайтиИЗавершитьАктивные() Экспорт
	СписокАС = ВидЗапуска_РегламентноеЗадание_Найти();
	Комментарий_ = "Завершено по причине изменения ""Вида запуска"" автоматического сценария";
	МодульКода("АвтоматическиеСценарииВызовСервера").ЗавершитьНесколько(СписокАС, Комментарий_);	
КонецПроцедуры

#КонецОбласти // ВидЗапуска_РегламентноеЗадание

Функция ДополнительныеПараметры() Экспорт
	РезультатФункции = ЭтотОбъект.ДополнительныеПараметры.Получить();
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = МодульКода("Справочники.АвтоматическиеСценарии").ДополнительныеПараметры();
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаЗапуска

Процедура ПроверкаЗапуска_АктивныйАвтоматическийСценарий(Отказ)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("АвтоматическийСценарий, ОснованиеID, Завершен", 
		Ссылка, Строка(Основание.УникальныйИдентификатор()), Ложь);
	АктивныеАС = МодульКода("РегистрыСведений.АвтоматическиеСценарии").НайтиПоОтбору(ПараметрыОтбора);
	Если АктивныеАС.Количество() > 0 Тогда
		Отказ = Истина;
	КонецЕсли;		
КонецПроцедуры

Процедура ПроверкаЗапуска_КратностьЗапуска(Отказ)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если КратностьЗапуска = МодульКода("Перечисления.АвтоматическиеСценарииВидыЗапуска").Однократный Тогда
		// Для "однократных" АС проверим запускался ли ранее на текущее основание
		ПараметрыОтбора = Новый Структура("АвтоматическийСценарий,ОснованиеID", Ссылка, Строка(Основание.УникальныйИдентификатор()));
		ЗапущенныеАС = МодульКода("РегистрыСведений.АвтоматическиеСценарии").НайтиПоОтбору(ПараметрыОтбора);
		Если ЗапущенныеАС.Количество() > 0 Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ПроверкаЗапуска_Отбор(Отказ)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОснованиеСоответствуетОтбору() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаЗапуска_ОбработчикПередЗапуском(Отказ)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДопПараметров = ДополнительныеПараметры();
	ТекстОбработчика = СтруктураДопПараметров.Обработчики.ПередЗапуском.Текст;
	ПараметрыОбработчика = СтруктураДопПараметров.Обработчики.ПередЗапуском.Параметры;
	
	МодульАвтоматическиеСценарииСервер = МодульКода("АвтоматическиеСценарииСервер");
	
	РезультатВыполнения = МодульАвтоматическиеСценарииСервер.РезультатВыполнения();
	МодульАвтоматическиеСценарииСервер.ВыполнитьОбработчик(ТекстОбработчика, Основание, ПараметрыОбработчика, РезультатВыполнения);
	Если РезультатВыполнения.Ошибка Или РезультатВыполнения.Отказ Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // ПроверкаЗапуска

#Область РегламентноеЗадание

Процедура РегламентноеЗадание_Создать()
	Если ЗначениеЗаполнено(СтруктураДопПараметров.РегламентноеЗадание.Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	МодульАвтоматическиеСценарииСервер = МодульКода("АвтоматическиеСценарииСервер");
	
	ПараметрыРегЗадания = МодульАвтоматическиеСценарииСервер.РегламентноеЗаданиеПараметры();
	ПараметрыРегЗадания.Вставить("Метаданные", МодульАвтоматическиеСценарииСервер.РегламентноеЗаданиеМетаданные());
	
	РегЗадание = МодульАвтоматическиеСценарииСервер.РегламентноеЗаданиеСоздать(ПараметрыРегЗадания);
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Ложь);
	// BSLLS:SetPrivilegedMode-on
	
	// Добавим идентификатор в "доп. параметры" объекта
	СтруктураДопПараметров.РегламентноеЗадание.Идентификатор = РегЗадание.УникальныйИдентификатор;
КонецПроцедуры

Процедура РегламентноеЗадание_Удалить()
	ИдентификаторРегЗадания = СтруктураДопПараметров.РегламентноеЗадание.Идентификатор;
	Если Не ЗначениеЗаполнено(ИдентификаторРегЗадания) Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	МодульКода("АвтоматическиеСценарииСервер").РегламентноеЗаданиеУдалить(ИдентификаторРегЗадания);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Уберем идентификатор из "доп. параметров" объекта
	СтруктураДопПараметров.РегламентноеЗадание.Идентификатор = Неопределено;
КонецПроцедуры

Процедура РегламентноеЗадание_Настроить()
	ИдентификаторРегЗадания = СтруктураДопПараметров.РегламентноеЗадание.Идентификатор;
	Если Не ЗначениеЗаполнено(ИдентификаторРегЗадания) Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	МодульАвтоматическиеСценарииСервер = МодульКода("АвтоматическиеСценарииСервер");
	
	ПараметрыРегЗадания = МодульАвтоматическиеСценарииСервер.РегламентноеЗаданиеПараметры();
	Если ДополнительныеСвойства.Свойство("РегламентноеЗадание") Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыРегЗадания, ДополнительныеСвойства.РегламентноеЗадание);
	Иначе
		РегламентноеЗадание = МодульАвтоматическиеСценарииСервер.РегламентноеЗадание(ИдентификаторРегЗадания);
		ЗаполнитьЗначенияСвойств(ПараметрыРегЗадания, РегламентноеЗадание);
	КонецЕсли;
	
	ПараметрыРегЗадания.Использование = Активно;
	Если ТипЗнч(ПараметрыРегЗадания.Расписание) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		ПараметрыРегЗадания.Расписание = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	ПараметрыРегЗадания.Наименование = МодульАвтоматическиеСценарииСервер.РегламентноеЗаданиеНаименование(Наименование);
		
	ПараметрыВыполнения = Новый Массив;
	ПараметрыВыполнения.Добавить(Ссылка);
	ПараметрыРегЗадания.Параметры = ПараметрыВыполнения;	

	МодульКода("АвтоматическиеСценарииСервер").РегламентноеЗаданиеОбновить(ИдентификаторРегЗадания, ПараметрыРегЗадания);
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Ложь);
	// BSLLS:SetPrivilegedMode-on
КонецПроцедуры

#КонецОбласти // РегламентноеЗадание

Процедура ПередЗаписью_ЗаписьСтатистикиИспользования()
	Если Не ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ИспользуетсяПредопределенноеДействие_ЗакрытиеФазы = Ложь;
	ИспользуетсяПредопределенноеДействие_СозданиеЧерезРедактор = Ложь;
	
	МодульПредопределенныхДействий = МодульКода("Перечисления.АвтоматическиеСценарииПредопределенныеДействия");
	Для Каждого ОписаниеДействия Из Действия Цикл
		Если Не ИспользуетсяПредопределенноеДействие_ЗакрытиеФазы 
			И ОписаниеДействия.Действие = МодульПредопределенныхДействий.Saby_ЗакрытиеФазыДокумента 
		Тогда
			ESD_ТНЗагрузкаСервер.ЗаписатьСтатистикуВызоваВОблако("СценарийОбработки", "АвтоматическиеСценарии");
			ИспользуетсяПредопределенноеДействие_ЗакрытиеФазы = Истина;
			Продолжить;
		КонецЕсли;
		
		Если Не ИспользуетсяПредопределенноеДействие_СозданиеЧерезРедактор 
			И ОписаниеДействия.Действие = МодульПредопределенныхДействий.Saby_ЗаполнениеДокументаЧерезРедакторСопоставлений 
		Тогда
			ESD_ТНЗагрузкаСервер.ЗаписатьСтатистикуВызоваВОблако("СценарийСоздания", "АвтоматическиеСценарии");
			ИспользуетсяПредопределенноеДействие_СозданиеЧерезРедактор = Истина;
			Продолжить;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью_ВидЗапуска_РегламентноеЗадание()
	ЭтотОбъект.ОснованиеМетаданные = "";
	ЭтотОбъект.Событие = Неопределено;
	ЭтотОбъект.КратностьЗапуска = Неопределено;
	ЭтотОбъект.ВариантВыполнения = Неопределено;
	ЭтотОбъект.Приоритет = 0;
	ЭтотОбъект.НастройкиОтбора = Новый ХранилищеЗначения(Неопределено);
	
	РегламентноеЗадание_Создать();
КонецПроцедуры

Процедура ПередЗаписью_ВидЗапуска_СобытиеОбъекта()
	Если ЭтотОбъект.ВариантВыполнения = МодульКода("Перечисления.АвтоматическиеСценарииВариантыВыполнения")
		.СобственноеРегламентноеЗадание
	Тогда
		РегламентноеЗадание_Создать();
	Иначе
		РегламентноеЗадание_Удалить();
		Если ДополнительныеСвойства.Свойство("РегламентноеЗадание") Тогда
			ДополнительныеСвойства.Удалить("РегламентноеЗадание");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи_ВидЗапуска_РегламентноеЗадание()
	Если ЭтотОбъект.ПометкаУдаления Тогда
		ВидЗапуска_РегламентноеЗадание_НайтиИЗавершитьАктивные();
	Иначе
		ВидЗапуска_РегламентноеЗадание_Запустить();
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи_ВидЗапуска_СобытиеОбъекта()	
КонецПроцедуры

#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти