#Область ПрограммныйИнтерфейс

// Поиск записей справочника, удовлетворяющие установленному отбору
//
// Параметры:
//	СтруктураОтбора - Структура - структура параметров отбора	
//
// Возвращаемое значение:
//	Массив - массив найденных элементов
//
Функция НайтиПоОтбору(СтруктураОтбора) Экспорт
	ТипЗнчОтбора = ТипЗнч(СтруктураОтбора);
	Если Не (ТипЗнчОтбора = Тип("Структура") Или ТипЗнчОтбора = Тип("Соответствие")) И Не СтруктураОтбора.Количество() Тогда
		ВызватьИсключение "Необходимо указать отбор";
	КонецЕсли;
	
	// BSLLS:QueryParseError-off
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	АвтоматическиеСценарии.Ссылка КАК Ссылка,
		|	АвтоматическиеСценарии.Активно КАК Активно,
		|	АвтоматическиеСценарии.ОснованиеМетаданные КАК ОснованиеМетаданные,
		|	АвтоматическиеСценарии.Событие КАК Событие,
		|	АвтоматическиеСценарии.КратностьЗапуска КАК КратностьЗапуска,
		|	АвтоматическиеСценарии.ДополнительныеПараметры КАК ДополнительныеПараметры,
		|	АвтоматическиеСценарии.Описание КАК Описание,
		|	АвтоматическиеСценарии.НастройкиОтбора КАК НастройкиОтбора
		|ИЗ
		|	Справочник." + ИмяОбъекта() + " КАК АвтоматическиеСценарии
		|ГДЕ
		|	ИСТИНА И #УсловиеОтбора
		|УПОРЯДОЧИТЬ ПО
		|	АвтоматическиеСценарии.Приоритет ВОЗР	
		|";
	// BSLLS:QueryParseError-on
	
	МодульКода("АвтоматическиеСценарииСервер")
		.ЗапросОтбора_ПрименитьСтруктуруОтбора(Запрос, СтруктураОтбора, "АвтоматическиеСценарии", "#УсловиеОтбора");
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СледующиеДействия(АвтоматическийСценарий, Знач ЗавершенноеДействие = Неопределено) Экспорт
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	// BSLLS:QueryParseError-off
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ДействияАвтоматическихСценариев.Действие,
		|	ДействияАвтоматическихСценариев.Параметры
		|ИЗ
		|	Справочник." + ИмяОбъекта() + ".Действия КАК ДействияАвтоматическихСценариев
		|ГДЕ
		|	ДействияАвтоматическихСценариев.Ссылка = &Ссылка
		|   И ДействияАвтоматическихСценариев.Родитель В(&РодителиДействия)
		|";
	// BSLLS:QueryParseError-on
	Запрос.УстановитьПараметр("Ссылка", АвтоматическийСценарий);
	
	РодителиДействия = Новый Массив;
	Если Не ЗначениеЗаполнено(ЗавершенноеДействие) Тогда
		// Так как поле составное, определим список доступных "пустых" значений
		РодителиДействия.Добавить(Неопределено);
		РодителиДействия.Добавить(МодульКода("Справочники.АвтоматическиеСценарииДействия").ПустаяСсылка());
		РодителиДействия.Добавить(МодульКода("Перечисления.АвтоматическиеСценарииПредопределенныеДействия").ПустаяСсылка());
	Иначе
		РодителиДействия.Добавить(ЗавершенноеДействие);	
	КонецЕсли;	
	Запрос.УстановитьПараметр("РодителиДействия", РодителиДействия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеДействия = Новый Структура("Действие,Параметры");
		ЗаполнитьЗначенияСвойств(ДанныеДействия, Выборка);
		ДанныеДействия.Параметры = ДанныеДействия.Параметры.Получить();
		Результат.Добавить(ДанныеДействия);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Формирование структуры дополнительных параметров автоматического сценария
//
// Возвращаемое значение:
//  Структура - дополнительные параметры автоматического сценария
//
Функция ДополнительныеПараметры() Экспорт  
	Результат = Новый Структура;
	Обработчики = Новый Структура;
	
	ОбработчикПередЗапуском = Новый Структура;
	ОбработчикПередЗапуском.Вставить("Текст", "");
	ОбработчикПередЗапуском.Вставить("Параметры", Новый ТаблицаЗначений);
	Обработчики.Вставить("ПередЗапуском", ОбработчикПередЗапуском);
	Результат.Вставить("Обработчики", Обработчики);
	
	РегламентноеЗадание = Новый Структура;
	РегламентноеЗадание.Вставить("Идентификатор");
	Результат.Вставить("РегламентноеЗадание", РегламентноеЗадание);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область include_etrn_base_Modules_АвтоматическиеСценарии_Catalog_АвтоматическиеСценарии_ИмяОбъекта
#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти