#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТекстовоеОписание") Тогда
		ЗагрузитьДействиеИзТекстовогоОписанияНаСервере(Параметры.ТекстовоеОписание);
	Иначе
		ПрочитатьОбработчикиНаСервере();	
	КонецЕсли;
	
	ЗаполнитьСписокВыбораВладельца();
	Элементы.Владельцы.Видимость = Не Объект.БезВладельцев;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
			
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПередЗаписьюНаСервереПредобработкаДанных();
	Если Не ПередЗаписьюНаСервереДанныеФормыЗаполненыКорректно() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущийОбъект.ОбработчикПередВыполнением = ЗакодироватьОбработчикНаСервере("ОбработчикПередВыполнением");
	ТекущийОбъект.ОбработчикПриВыполнении = ЗакодироватьОбработчикНаСервере("ОбработчикПриВыполнении");
	ТекущийОбъект.ОбработчикПослеВыполнения = ЗакодироватьОбработчикНаСервере("ОбработчикПослеВыполнения");
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ВладельцыВладелецПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Владельцы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Владельцы.НайтиСтроки(Новый Структура("Владелец", ТекущиеДанные.Владелец)).Количество() > 1 Тогда
		ТекущиеДанные.Владелец = "";
		Сообщить("Выбранный владелец действия уже присутствует в таблице");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БезВладельцевПриИзменении(Элемент)
	Элементы.Владельцы.Видимость = Не Объект.БезВладельцев;
	Объект.Владельцы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытия.Каталог = "";
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	ДиалогОткрытия.Заголовок = "Выберите каталог сохранения";
	
	Если ДиалогОткрытия.Выбрать() Тогда
		ПутьККаталогу = ДиалогОткрытия.Каталог;
	Иначе
		Возврат;
	КонецЕсли;
		
	Путь = ПутьККаталогу + "\" + Объект.Наименование + ".txt";
	
	Файл = Новый ТекстовыйДокумент;
	Файл.УстановитьТекст(ТекстВыгрузкиДействияНаСервере());
	Файл.Записать(Путь, КодировкаТекста.UTF8);
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.Фильтр = "Текстовый документ (*.txt)|*.txt";
	Диалог.МножественныйВыбор = Ложь;

	Если Диалог.Выбрать() Тогда
		ПолноеИмяФайла = Диалог.ПолноеИмяФайла;
	Иначе
		Возврат;
	КонецЕсли;

	ТекстовоеОписаниеДействия = Новый ТекстовыйДокумент;
	ТекстовоеОписаниеДействия.Прочитать(ПолноеИмяФайла, КодировкаТекста.UTF8);
	ЗагрузитьДействиеИзТекстовогоОписанияНаСервере(ТекстовоеОписаниеДействия.ПолучитьТекст());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьОбработчикиНаСервере()
	ПрочитатьОбработчикНаСервере("ОбработчикПередВыполнением");
	ПрочитатьОбработчикНаСервере("ОбработчикПриВыполнении");
	ПрочитатьОбработчикНаСервере("ОбработчикПослеВыполнения");
КонецПроцедуры

&НаСервере
Процедура ПрочитатьОбработчикНаСервере(ИмяОбработчика)
	Попытка
		ОписаниеОбработчика = МодульКода("Справочники.АвтоматическиеСценарииДействия")
			.ДекодироватьОписаниеОбработчика(Объект[ИмяОбработчика]);
		ЭтаФорма[ИмяОбработчика].УстановитьТекст(ОписаниеОбработчика.Текст);
		ЭтаФорма[ИмяОбработчика + "Параметры"].Загрузить(ОписаниеОбработчика.Параметры);
	Исключение
		ЭтаФорма[ИмяОбработчика].УстановитьТекст(Объект[ИмяОбработчика]);
		ЭтаФорма[ИмяОбработчика + "Параметры"].Очистить();
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ЗакодироватьОбработчикНаСервере(ИмяОбработчика)
	Возврат МодульКода("Справочники.АвтоматическиеСценарииДействия").ЗакодироватьОписаниеОбработчика( 
		ЭтаФорма[ИмяОбработчика].ПолучитьТекст(),
		ЭтаФорма[ИмяОбработчика + "Параметры"].Выгрузить()
	);	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораВладельца()
	Элементы.ВладельцыВладелец.СписокВыбора.Очистить();
	Для Каждого Строка Из МодульКода("АвтоматическиеСценарииСервер").СписокДоступныхОбъектовМетаданных() Цикл
		Элементы.ВладельцыВладелец.СписокВыбора.Добавить(Строка.Значение, Строка.Представление);	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ТекстВыгрузкиДействияНаСервере()
	ДействиеОбъект = РеквизитФормыВЗначение("Объект");
	Возврат МодульКода("Справочники.АвтоматическиеСценарииДействия").ВыгрузитьДействиеТекстовымОписанием(ДействиеОбъект);
КонецФункции

&НаСервере
Процедура ЗагрузитьДействиеИзТекстовогоОписанияНаСервере(Знач Текст)
	Попытка
		СтруктураОписания = ЗначениеИзСтрокиВнутр(Текст);
		Если ТипЗнч(СтруктураОписания) <> Тип("Структура") Тогда
			ВызватьИсключение "";	
		КонецЕсли;
		
		Для Каждого Обработчик Из СтруктураОписания Цикл
			Префикс = "Обработчик" + Обработчик.Ключ;
			Объект[Префикс] = Обработчик.Значение;	
		КонецЦикла;
		ПрочитатьОбработчикиНаСервере();
	Исключение
		Сообщить("Ошибка чтения и загрузки обработчика!");
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервереПредобработкаДанных()
	i = Объект.Владельцы.Количество() - 1;
	Пока i >= 0 Цикл
		Строка = Объект.Владельцы[i];
		Если Не ЗначениеЗаполнено(Строка.Владелец) Тогда
			Объект.Владельцы.Удалить(i);
		КонецЕсли;
		
		i = i - 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПередЗаписьюНаСервереДанныеФормыЗаполненыКорректно()
	Корректно = Истина;
	Если Не Объект.БезВладельцев И Не Объект.Владельцы.Количество() Тогда
		Корректно = Ложь;
		Сообщить("Не заполнены владельцы действия!");
	КонецЕсли;
	
	Возврат Корректно;
КонецФункции

#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти