
#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  Код - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.Saby_РолиКонтрагентов - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция ЗначениеПоКоду(Код) Экспорт
	
	Если Код = "1" Тогда
		Возврат Отправитель;
	ИначеЕсли Код = "2" Тогда
		Возврат Получатель;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующий код по указанному значению перечисления.
//
// Параметры:
//  Значение  - ПеречислениеСсылка.Saby_РолиКонтрагентов - значение перечисления
//
// Возвращаемое значение:
//   Строка - Строковое представление кода.
//
Функция КодПоЗначению(Значение) Экспорт
	
	Если Значение = Отправитель Тогда
		Возврат "1";
	ИначеЕсли Значение = Получатель Тогда
		Возврат "2";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Возвращает имя указанной роли.
//
// Параметры:
//  Роль - ПеречислениеСсылка.Saby_РолиКонтрагентов - значение перечисления
//
// Возвращаемое значение:
//   Строка - имя роли как в конфигураторе.
//
Функция ИмяРоли(Роль) Экспорт
	
	ИндексТипа = Индекс(Роль);
	МетаданныеПеречисления = Роль.Метаданные().ЗначенияПеречисления[ИндексТипа];
	Возврат МетаданныеПеречисления.Имя;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
