
#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  Код - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.Saby_РолиКонтрагентов - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция РольПоКоду(Код) Экспорт
	
	Если Код = "1" Тогда
		Возврат ЗначениеМетаданных("Saby_РолиКонтрагентов.Отправитель");
	ИначеЕсли Код = "2" Тогда
		Возврат ЗначениеМетаданных("Saby_РолиКонтрагентов.Получатель");
	Иначе
		Возврат ЗначениеМетаданных("Saby_РолиКонтрагентов.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующий код по указанному значению перечисления.
//
// Параметры:
//  Значение  - ПеречислениеСсылка.Saby_РолиКонтрагентов - значение перечисления
//
// Возвращаемое значение:
//   Строка - Строковое представление кода.
//
Функция КодПоРоли(Значение) Экспорт
	
	Если Значение = ЗначениеМетаданных("Saby_РолиКонтрагентов.Отправитель") Тогда
		Возврат "1";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_РолиКонтрагентов.Получатель") Тогда
		Возврат "2";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Возвращает имя указанной роли.
//
// Параметры:
//  Роль - ПеречислениеСсылка.Saby_РолиКонтрагентов - значение перечисления
//
// Возвращаемое значение:
//   Строка - имя роли как в конфигураторе.
//
Функция ИмяРоли(Роль) Экспорт
	
	Если Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.ВладелецОбъекта") Тогда
		Возврат "ВладелецОбъекта";
	ИначеЕсли Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.Заказчик") Тогда
		Возврат "Заказчик";
	ИначеЕсли Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.МедосмотрВыезд") Тогда
		Возврат "МедосмотрВыезд";
	ИначеЕсли Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.МедосмотрЗаезд") Тогда
		Возврат "МедосмотрЗаезд";
	ИначеЕсли Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.ОтветственныйНаОсновании") Тогда
		Возврат "ОтветственныйНаОсновании";
	ИначеЕсли Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.Отгрузчик") Тогда
		Возврат "Отгрузчик";
	ИначеЕсли Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.Отправитель") Тогда
		Возврат "Отправитель";
	ИначеЕсли Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.Оформитель") Тогда
		Возврат "Оформитель";
	ИначеЕсли Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.Перевозчик") Тогда
		Возврат "Перевозчик";
	ИначеЕсли Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.Получатель") Тогда
		Возврат "Получатель";
	ИначеЕсли Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.УполномоченноеЛицо") Тогда
		Возврат "УполномоченноеЛицо";
	ИначеЕсли Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.УполномоченноеЛицоПеревозчика") Тогда
		Возврат "УполномоченноеЛицоПеревозчика";
	ИначеЕсли Роль = ЗначениеМетаданных("Saby_РолиКонтрагентов.СторонаДокумента") Тогда
		Возврат "СторонаДокумента";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

