
#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  Код - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ESD_РолиКонтрагентов - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция РольПоКоду(Код) Экспорт
	
	Если Код = "1" Тогда
		Возврат ЗначениеМетаданных("ESD_РолиКонтрагентов.Отправитель");
	ИначеЕсли Код = "2" Тогда
		Возврат ЗначениеМетаданных("ESD_РолиКонтрагентов.Получатель");
	Иначе
		Возврат ЗначениеМетаданных("ESD_РолиКонтрагентов.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующий код по указанному значению перечисления.
//
// Параметры:
//  Значение  - ПеречислениеСсылка.ESD_РолиКонтрагентов - значение перечисления
//
// Возвращаемое значение:
//   Строка - Строковое представление кода.
//
Функция КодПоРоли(Значение) Экспорт
	
	Если Значение = ЗначениеМетаданных("ESD_РолиКонтрагентов.Отправитель") Тогда
		Возврат "1";
	ИначеЕсли Значение = ЗначениеМетаданных("ESD_РолиКонтрагентов.Получатель") Тогда
		Возврат "2";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Возвращает имя указанной роли.
//
// Параметры:
//  Роль - ПеречислениеСсылка.ESD_РолиКонтрагентов - значение перечисления
//
// Возвращаемое значение:
//   Строка - имя роли как в конфигураторе.
//
Функция ИмяРоли(Роль) Экспорт
	
	Если Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.ВладелецОбъекта") Тогда
		РезультатФункции = "ВладелецОбъекта";
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.Заказчик") Тогда
		РезультатФункции = "Заказчик";
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрВыезд") Тогда
		РезультатФункции = "МедосмотрВыезд";
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрЗаезд") Тогда
		РезультатФункции = "МедосмотрЗаезд";
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.ОтветственныйНаОсновании") Тогда
		РезультатФункции = "ОтветственныйНаОсновании";
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.Отгрузчик") Тогда
		РезультатФункции = "Отгрузчик";
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.Отправитель") Тогда
		РезультатФункции = "Отправитель";
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.Оформитель") Тогда
		РезультатФункции = "Оформитель";
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.Перевозчик") Тогда
		РезультатФункции = "Перевозчик";
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.Получатель") Тогда
		РезультатФункции = "Получатель";
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицо") Тогда
		РезультатФункции = "УполномоченноеЛицо";
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицоПеревозчика") Тогда
		РезультатФункции = "УполномоченноеЛицоПеревозчика";
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.СторонаДокумента") Тогда
		РезультатФункции = "СторонаДокумента";
	Иначе
		РезультатФункции = ИмяРолиДополнительно(Роль);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Возвращает соответствующее значение перечисления переданному имени.
//
// Параметры:
//  ИмяРоли - Строка - имя роли
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ESD_РолиКонтрагентов - значение перечисления.
//
Функция РольПоИмени(ИмяРоли) Экспорт
	
	СоответствиеЗначений = Новый Соответствие;
	СоответствиеЗначений.Вставить("ВладелецОбъекта", ЗначениеМетаданных("ESD_РолиКонтрагентов.ВладелецОбъекта"));
	СоответствиеЗначений.Вставить("Заказчик", ЗначениеМетаданных("ESD_РолиКонтрагентов.Заказчик"));
	СоответствиеЗначений.Вставить("МедосмотрВыезд", ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрВыезд"));
	СоответствиеЗначений.Вставить("МедосмотрЗаезд", ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрЗаезд"));
	СоответствиеЗначений.Вставить("Отгрузчик", ЗначениеМетаданных("ESD_РолиКонтрагентов.Отгрузчик"));
	СоответствиеЗначений.Вставить("Отправитель", ЗначениеМетаданных("ESD_РолиКонтрагентов.Отправитель"));
	СоответствиеЗначений.Вставить("Оформитель", ЗначениеМетаданных("ESD_РолиКонтрагентов.Оформитель"));
	СоответствиеЗначений.Вставить("Перевозчик", ЗначениеМетаданных("ESD_РолиКонтрагентов.Перевозчик"));
	СоответствиеЗначений.Вставить("Получатель", ЗначениеМетаданных("ESD_РолиКонтрагентов.Получатель"));
	СоответствиеЗначений.Вставить("УполномоченноеЛицо", ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицо"));
	СоответствиеЗначений.Вставить("СторонаДокумента", ЗначениеМетаданных("ESD_РолиКонтрагентов.СторонаДокумента"));
	СоответствиеЗначений.Вставить("ИнойПолучатель", ЗначениеМетаданных("ESD_РолиКонтрагентов.ИнойПолучатель"));
	СоответствиеЗначений.Вставить("Составитель", ЗначениеМетаданных("ESD_РолиКонтрагентов.Оформитель"));
	СоответствиеЗначений.Вставить(
		"ОтветственныйНаОсновании", ЗначениеМетаданных("ESD_РолиКонтрагентов.ОтветственныйНаОсновании"));
	СоответствиеЗначений.Вставить(
		"УполномоченноеЛицоПеревозчика", ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицоПеревозчика"));
	
	Возврат СоответствиеЗначений[ИмяРоли];
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ИмяРолиДополнительно(Роль)
	
	Если Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.ИнойПолучатель") Тогда
		РезультатФункции = "ИнойПолучатель";
	Иначе
		РезультатФункции = "";
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных
