
Процедура КонтактныеДанные_ПередЗаписью()
	Индекс = ЭтотОбъект.КонтактныеДанные.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ДанныеСтроки = ЭтотОбъект.КонтактныеДанные[Индекс];
		ДанныеСтроки.Значение = СокрЛП(ДанныеСтроки.Значение);
		
		Если Не КонтактныеДанные_КонтактЗаполненКорректно(ДанныеСтроки) 
			Или Не КонтактныеДанные_ЕстьСвязьСДаннымиЮрЛиц(ЭтотОбъект.ДанныеЮрЛиц, ДанныеСтроки) 
		Тогда
			ЭтотОбъект.КонтактныеДанные.Удалить(Индекс);
		КонецЕсли;
		
		Индекс = Индекс - 1;
	КонецЦикла;
КонецПроцедуры

Функция КонтактныеДанные_КонтактЗаполненКорректно(ДанныеКонтакта)
	Результат = Истина;
	Если Не(ЗначениеЗаполнено(ДанныеКонтакта.Тип) И ЗначениеЗаполнено(ДанныеКонтакта.Значение)) Тогда
		Результат = Ложь;
	КонецЕсли;
		
	Возврат Результат;
КонецФункции

Функция КонтактныеДанные_ЕстьСвязьСДаннымиЮрЛиц(ТаблицаЮрЛиц, ДанныеКонтакта)
	Результат = Истина;
	
	// Найдем связь контактных данных с данными юр. лица
	СтруктураОтбора = Новый Структура("КлючСтроки", ДанныеКонтакта.КлючСтроки_ДанныеЮрЛиц);
	НайденныеСтроки = ТаблицаЮрЛиц.НайтиСтроки(СтруктураОтбора);
	// Проверим наличие связи между юр. лицом и контактными данными
	Если Не НайденныеСтроки.Количество() Тогда 
		Результат = Ложь;
	Иначе
		ДанныеЮрЛица = НайденныеСтроки[0];
		// Последней проверкой проверяем соответствие ролей контакта и юр. лица
		Результат = ДанныеЮрЛица.Роль = ДанныеКонтакта.Роль;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

