
#Область СлужебныеПроцедурыИФункции

// В качестве параметра передается ссылка на справочник
// Параметры:
// 	ПрисоединенныйФайл - СправочникСсылка - элемент справочника
// Возвращаемое значение:
// 	Булево - Истина, если он справочник присоединенный создан в расширении иначе ложь  
Функция ПрисоединенныйФайлВРасширении(ПрисоединенныйФайл) Экспорт 
	
	Результат = Ложь;  
	Если ТипЗнч(ПрисоединенныйФайл) = Тип("Строка") Тогда
		Возврат Результат;
	КонецЕсли;
		
	МассивТипов = Saby_РаботаСПрисоединеннымиФайламиПовтИсп.МассивТиповПрисоединенныхФайлов();
	
	Если МассивТипов.Найти(ТипЗнч(ПрисоединенныйФайл)) <> Неопределено Тогда 
		Результат = Истина;		
	КонецЕсли;
		   	
	Возврат Результат;
	
КонецФункции 

// Проверяет наличие реквизита или свойства у произвольного объекта без обращения к метаданным.
//
// Параметры:
//  Объект       - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  ИмяРеквизита - Строка       - имя реквизита или свойства.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
Функция ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита) Экспорт
	
	КлючУникальности   = Новый УникальныйИдентификатор;
	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции

#КонецОбласти