
#Область ПрограммныйИнтерфейс   

// Выполнить рег. задание вручную
//
// Параметры:
//	УникальныйИдентификатор - Строка - идентификатор рег. задания
//	Наименование - Строка - наименование рег. задания
//
// Возвращаемое значение:
//	Структура - параметры выполнения рег. задания
//
Функция ВыполнитьРегламентноеЗаданиеВручную(УникальныйИдентификатор, Наименование) Экспорт
	ПараметрыВыполнения = ESD_РегламентныеЗаданияСервер.ВыполнитьРегламентноеЗаданиеВручную(
		УникальныйИдентификатор);
	
	Если ПараметрыВыполнения.ЗапускВыполнен Тогда	
		ШаблонПояснения = ШаблонПояснения_РегламентноеЗаданиеЗапущено();
		Пояснение = ESD_ТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
			ШаблонПояснения,
			Наименование,
			Строка(ПараметрыВыполнения.МоментЗапуска));	
	ИначеЕсли ПараметрыВыполнения.ПроцедураУжеВыполняется Тогда	
		ШаблонПояснения = ШаблонПояснения_РегламентноеЗаданиеУжеВыполняется();
		Пояснение = ESD_ТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
			ШаблонПояснения,
			Наименование,
			ПараметрыВыполнения.ПредставлениеФоновогоЗадания,
			Строка(ПараметрыВыполнения.МоментЗапуска));	
	Иначе
		ШаблонПояснения = ШаблонПояснения_РегламентноеЗаданиеНеВыполняется();
		Пояснение = ESD_ТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
			ШаблонПояснения,
			Наименование);
	КонецЕсли;
	ПараметрыВыполнения.Вставить("Пояснение", Пояснение);
	
	Возврат ПараметрыВыполнения;
КонецФункции

// Изменяет пользователя регламентного задания
//
// Параметры:
//	ТекущиеДанные - ДанныеФормаЭлементКоллекции - Параметры рег. задания с формы настроек
//
Процедура ИзменитьПользователяРегламентныхЗаданий(ТекущиеДанные) Экспорт
	ПараметрыЗадания = ПараметрыИзмененияРегЗадания(ТекущиеДанные);
	ПараметрыИзменения = Новый Структура("ИмяПользователя", ПараметрыЗадания.ИмяПользователя);
	
	ESD_РегламентныеЗаданияСервер.ИзменитьРегламентноеЗадание(ПараметрыЗадания.УникальныйИдентификатор,
		ПараметрыИзменения);
КонецПроцедуры 

// Изменяет автивность регламентного задания
//
// Параметры:
//	ТекущиеДанные - ДанныеФормаЭлементКоллекции - Параметры рег. задания с формы настроек
//
Процедура ИзменитьАктивностьРегламентныхЗаданий(ТекущиеДанные) Экспорт
	ПараметрыЗадания = ПараметрыИзмененияРегЗадания(ТекущиеДанные);
	ПараметрыИзменения = Новый Структура("Использование", ПараметрыЗадания.Использование);
	
	ESD_РегламентныеЗаданияСервер.ИзменитьРегламентноеЗадание(ПараметрыЗадания.УникальныйИдентификатор,
		ПараметрыИзменения);
КонецПроцедуры 

// Изменяет расписание регламентного заданияя
//
// Параметры:
//	УникальныйИдентификатор - Строка - УникальныйИдентификатор рег. задание
//	ОповещениеФормы - ОповещениеФормы - вызываемое оповещение после изменения расписания
//
Процедура ИзменитьРасписаниеРегламентныхЗаданий(УникальныйИдентификатор, ОповещениеФормы = Неопределено) Экспорт
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
	    Расписание = ESD_РегламентныеЗаданияСлужебный.РасписаниеРегламентногоЗадания(УникальныйИдентификатор);
		УстановитьПривилегированныйРежим(Ложь);
	#Иначе
		Расписание = ESD_РегламентныеЗаданияСервер.РасписаниеРегламентногоЗадания(УникальныйИдентификатор);	
	#КонецЕсли
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	
	ДополнительныеПараметры = Новый Структура("УникальныйИдентификатор", УникальныйИдентификатор);
	Если ОповещениеФормы <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("ОповещениеФормы", ОповещениеФормы);
	КонецЕсли;
	
	Диалог.Показать(Новый ОписаниеОповещения("ПослеНастройкиРасписанияРегЗадания",
		ESD_РегламентныеЗаданияКлиент,
		ДополнительныеПараметры));
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс 

Процедура ПослеНастройкиРасписанияРегЗадания(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыИзменения = Новый Структура("Расписание", Результат);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
	    ESD_РегламентныеЗаданияСлужебный
			.ИзменитьРегламентноеЗадание(ДополнительныеПараметры.УникальныйИдентификатор, ПараметрыИзменения);
		УстановитьПривилегированныйРежим(Ложь);
	#Иначе
		ESD_РегламентныеЗаданияСервер
			.ИзменитьРегламентноеЗадание(ДополнительныеПараметры.УникальныйИдентификатор, ПараметрыИзменения);
	#КонецЕсли
	
	
    Если ДополнительныеПараметры.Свойство("ОповещениеФормы") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеФормы, Результат);
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыИзмененияРегЗадания(ТекущиеДанные)
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("УникальныйИдентификатор", 	ТекущиеДанные.УникальныйИдентификатор);
	ПараметрыЗадания.Вставить("Использование", 				ТекущиеДанные.Использование);
	ПараметрыЗадания.Вставить("ИмяПользователя", 			ТекущиеДанные.ИмяПользователя);
	Возврат ПараметрыЗадания;
КонецФункции

Функция ШаблонПояснения_РегламентноеЗаданиеЗапущено() 
	Возврат НСтр("ru = 'Процедура запущена в фоновом задании ""%1"" в %2.';
			|en = 'The scheduled job has been started in the background job ""%1"" at %2.'");
КонецФункции

Функция ШаблонПояснения_РегламентноеЗаданиеУжеВыполняется()
	Возврат НСтр("ru = 'Процедура регламентного задания ""%1""
			|уже выполняется в фоновом задании ""%2"", начатом %3.';
			|en = 'The scheduled job ""%1"" is running in
			|the background job ""%2""  started on %3.'");
КонецФункции

Функция ШаблонПояснения_РегламентноеЗаданиеНеВыполняется()
	Возврат НСтр("ru = 'Процедура регламентного задания ""%1"" не запущена.';
			|en = 'The scheduled job ""%1"" is not running.'");
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции  

