#Область ПрограммныйИнтерфейс

// Получение имени значения перечисления для обращения к подчиненным элементам
//
// Параметры:
//	Значение - ПеречислениеСсылка.АвтоматическиеСценарииПредопределенныеДействия - ссылка на элемент перечисления
//
// Возвращаемое значение:
//	Строка - Имя значения
//
Функция ИмяЗначения(Значение) Экспорт
	Индекс = Перечисления[ИмяОбъекта()].Индекс(Значение);
	Возврат Метаданные.Перечисления[ИмяОбъекта()].ЗначенияПеречисления[Индекс].Имя;	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция Обработчики(Действие) Экспорт
	ИмяДействия = ИмяЗначения(Действие);
	ТекстовоеОписаниеОбработчиков = МодульКода("Перечисления.АвтоматическиеСценарииПредопределенныеДействия")
		.ПолучитьМакет(ИмяДействия)
		.ПолучитьТекст();
		
	СтруктураОписания = ЗначениеИзСтрокиВнутр(ТекстовоеОписаниеОбработчиков); 
	Возврат МодульКода("Справочники.АвтоматическиеСценарииДействия").ДекодироватьОписаниеОбработчиков(СтруктураОписания);
КонецФункции

Функция ЕстьФормаНастройки(Действие) Экспорт
	Возврат (Действие <> Saby_ОтправкаЧерновика);
КонецФункции

#КонецОбласти

#Область include_etrn_base_Modules_АвтоматическиеСценарии_Enum_АвтоматическиеСценарииПредопределенныеДействия_ИмяОбъекта
#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти