
Процедура ДобавитьСсылочныеКолонкиТаблицыВидовУпаковки(ТаблицаВидовУпаковки)
	
	ТаблицаВидовУпаковки.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.Saby_ВидыУпаковки"));
	
КонецПроцедуры

Процедура ПолучитьТаблицуСправочникВидыУпаковки(МенеджерВременныхТаблиц)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	Saby_ВидыУпаковки.Ссылка КАК Ссылка,
	|	Saby_ВидыУпаковки.Код КАК Код,
	|	Saby_ВидыУпаковки.Наименование КАК Наименование,
	|	Saby_ВидыУпаковки.Идентификатор КАК Идентификатор,
	|	Saby_ВидыУпаковки.ТехническоеНаименование КАК ТехническоеНаименование
	|ПОМЕСТИТЬ СправочникВидыУпаковки
	|ИЗ
	|	Справочник.Saby_ВидыУпаковки КАК Saby_ВидыУпаковки";
	
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

#Область include_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // include_etrn_base_CommonModule_ОпределениеМодуляКода

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

