
Процедура ДобавитьСсылочныеКолонкиТаблицыВидовУпаковки(ТаблицаВидовУпаковки)
	
	ТаблицаВидовУпаковки.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка." + ВидыУпаковки()));
	
КонецПроцедуры

Процедура ПолучитьТаблицуСправочникВидыУпаковки(МенеджерВременныхТаблиц)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ESD_ВидыУпаковки.Ссылка КАК Ссылка,
	|	ESD_ВидыУпаковки.Код КАК Код,
	|	ESD_ВидыУпаковки.Наименование КАК Наименование,
	|	ESD_ВидыУпаковки.Идентификатор КАК Идентификатор,
	|	ESD_ВидыУпаковки.ТехническоеНаименование КАК ТехническоеНаименование
	|ПОМЕСТИТЬ СправочникВидыУпаковки
	|ИЗ
	|	Справочник.ESD_ВидыУпаковки КАК ESD_ВидыУпаковки";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ВидыУпаковки", ВидыУпаковки());
	
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // includr_etrn_base_CommonModule_ЗначениеМетаданных

#Область includr_etrn_base_CommonModule_Метаданные
#КонецОбласти // includr_etrn_base_CommonModule_Метаданные

