
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	ЭтотОбъект.ТранспортноеСредство_РегНомер = 
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ТранспортныеСредстваСтрокой(ЭтотОбъект);
	
	ЗаполнитьРеквизитыДляФормыСписка();
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").УстановитьНомерДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТитулыДляПривязки") Тогда
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ПривязатьТитулыКДокументу(
			Ссылка,
			ДополнительныеСвойства.ТитулыДляПривязки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РеквизитыДляОчистки = Новый Массив;
	
	// Служебные
	РеквизитыДляОчистки.Добавить("ПЛПредыдущий");
	РеквизитыДляОчистки.Добавить("ПЛСледующий");
	РеквизитыДляОчистки.Добавить("ДатаИзменения");
	РеквизитыДляОчистки.Добавить("НомерСбис");
	РеквизитыДляОчистки.Добавить("Комментарий");
	РеквизитыДляОчистки.Добавить("КомментарийУведомление");
	РеквизитыДляОчистки.Добавить("ТекущиеЭтапы");
	РеквизитыДляОчистки.Добавить("ДокументОснование_Идентификатор");
	РеквизитыДляОчистки.Добавить("ДокументОснование_ОбъектМетаданных");
	
	// Предрейсовый МО
	РеквизитыДляОчистки.Добавить("ДоРейса_ДатаВремяМедосмотра");
	РеквизитыДляОчистки.Добавить("ДоРейса_КомментарииМедосмотра");
	РеквизитыДляОчистки.Добавить("ДоРейса_НеДопущенПослеМедосмотра");
	
	// ТО
	РеквизитыДляОчистки.Добавить("ТО_ДатаВремя");
	РеквизитыДляОчистки.Добавить("ТО_ДатаВремяВыпускаВРейс");
	РеквизитыДляОчистки.Добавить("ТО_Комментарий");
	РеквизитыДляОчистки.Добавить("ТО_НеРазрешенВыпускПосле");
	
	// Выезд
	РеквизитыДляОчистки.Добавить("Выезд_ДатаВремя");
	РеквизитыДляОчистки.Добавить("Выезд_Одометр");
	РеквизитыДляОчистки.Добавить("Выезд_ОдометрКомментарии");
	
	// Заезд
	РеквизитыДляОчистки.Добавить("Заезд_ДатаВремя");
	РеквизитыДляОчистки.Добавить("Заезд_Одометр");
	РеквизитыДляОчистки.Добавить("Заезд_ОдометрКомментарии");

	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОчисткаРеквизитовОбъекта(ЭтотОбъект, РеквизитыДляОчистки);
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	// Записи по ответственным
	МодульТНОбщегоНазначенияКлиентСервер.УдалитьСтрокиПоРоли(ЭтотОбъект.ОтветственныеЛица, "ОдометрВыезд", Истина);
	МодульТНОбщегоНазначенияКлиентСервер.УдалитьСтрокиПоРоли(ЭтотОбъект.ОтветственныеЛица, "ОдометрЗаезд", Истина);
	
	Если ДоРейса_МедосмотрСторонняяОрганизация Тогда
		МодульТНОбщегоНазначенияКлиентСервер.УдалитьСтрокиПоРоли(ЭтотОбъект.ОтветственныеЛица, "МедосмотрВыезд", Истина);		
	КонецЕсли;	
		
	Если ПослеРейса_МедосмотрСторонняяОрганизация Тогда
		МодульТНОбщегоНазначенияКлиентСервер.УдалитьСтрокиПоРоли(ЭтотОбъект.ОтветственныеЛица, "МедосмотрЗаезд", Истина);
	КонецЕсли;	
	
	// Установим дефолтные значения
	ЭтотОбъект.ПризнакНачалаРейса = ЗначениеМетаданных("ESD_ПризнакНачалаРейса.ВыездСПарковки");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипЗначенияЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗначенияЗаполнения = Тип("ДокументСсылка." + ПутевойЛист()) Тогда
		ЗаполнитьНаОснованииПутевогоЛиста(ДанныеЗаполнения);
	ИначеЕсли ТипЗначенияЗаполнения = Тип("Массив") Тогда
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьНаОснованииИспользуяНастройкиСопоставления(ЭтотОбъект, ДанныеЗаполнения);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = "00";
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий 

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыДляФормыСписка()
	
	ЗаполнитьОтветственныхЛиц();
	
	ЭтотОбъект.Организация = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Оформитель").НаименованиеОрганизации;
	
КонецПроцедуры

Процедура ЗаполнитьОтветственныхЛиц()
	
	ЗаполнитьОтветственногоМедосмотр();
	
	РольВодитель = ЗначениеМетаданных("ESD_РолиОтветственных.Водитель");
	РольМеханик  = ЗначениеМетаданных("ESD_РолиОтветственных.Техосмотр");
	
	СтруктураОтветственных = Новый Структура;
	СтруктураОтветственных.Вставить("Водитель",  Новый Массив);
	СтруктураОтветственных.Вставить("Техосмотр", Новый Массив);
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

	Для Каждого ОтветственноеЛицо Из ОтветственныеЛица Цикл		
		
		ПодходящаяРоль = (ОтветственноеЛицо.Роль = РольВодитель 
			Или ОтветственноеЛицо.Роль = РольМеханик);
		
		Если ПодходящаяРоль Тогда			
			
			РольСтрокой = СокрЛП(ОтветственноеЛицо.Роль);
			НаименованиеСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеФИО(ОтветственноеЛицо);
			
			СтруктураОтветственных[РольСтрокой].Добавить(НаименованиеСтрокой);
			
		Иначе 		
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтотОбъект.Водитель = МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(СтруктураОтветственных.Водитель,  ",");
	ЭтотОбъект.Механик  = МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(СтруктураОтветственных.Техосмотр, ",");
	
КонецПроцедуры

Процедура ЗаполнитьОтветственногоМедосмотр()
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Если ЭтотОбъект.ДоРейса_МедосмотрСторонняяОрганизация Тогда
		ЭтотОбъект.Медик = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
			ЭтотОбъект.ДанныеЮрЛиц, "МедосмотрВыезд").НаименованиеОрганизации;
	Иначе
		
		РольМедик = ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрВыезд");
		
		Отбор = Новый Структура;
		Отбор.Вставить("Роль", РольМедик);
		
		НайденныеСтроки = МодульТНОбщегоНазначенияКлиентСервер.НайтиСтрокиУниверсально(ЭтотОбъект.ОтветственныеЛица, Отбор);
		Если НайденныеСтроки.Количество() Тогда
			Значение = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеФИО(НайденныеСтроки[0]);
		Иначе 	
			Значение = "";
		КонецЕсли;	
		
		ЭтотОбъект.Медик = Значение;
		
	КонецЕсли;
		
КонецПроцедуры

#Область ЗаполнениеНаОснованииПутевогоЛиста

Процедура ЗаполнитьНаОснованииПутевогоЛиста(ДанныеЗаполнения)
		
	ДанныеСостояния = МодульКода("ESD_ТНОбщегоНазначенияСервер").ДанныеСостоянияОбъекта(ДанныеЗаполнения);		
	
	НеНайденыДанные = Не ЗначениеЗаполнено(ДанныеСостояния);						
	Если Не НеНайденыДанные Тогда
				
		Если МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ДанныеСостояния, "UID") Тогда 
			ИДСбис = ДанныеСостояния.UID;
		Иначе 
			ИДСбис = ДанныеСостояния.ИД;
		КонецЕсли;	
		
		ЭтотОбъект.ПЛПредыдущий = ИДСбис;
		
		НеНайденыДанные = Не ЗначениеЗаполнено(ИДСбис);
					
	КонецЕсли;	
		
	Если НеНайденыДанные Тогда
		ВызватьИсключение("Документ не найден в SABY! Проверьте данные авторизации и статус документа");
    КонецЕсли;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ESD_ПутевойЛист.ВидПеревозки КАК ВидПеревозки,
	|	ESD_ПутевойЛист.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	ESD_ПутевойЛист.МестоОтправления КАК МестоОтправления,
	|	ESD_ПутевойЛист.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ESD_ПризнакНачалаРейса.ПриемСдачаПослеСмены) КАК ПризнакНачалаРейса,
	|	ESD_ПутевойЛист.ПослерейсовыйМедосмотрТребуется КАК ПослерейсовыйМедосмотрТребуется,
	|	ESD_ПутевойЛист.ВидКоммерческойПеревозки КАК ВидКоммерческойПеревозки,
	|	ESD_ПутевойЛист.ДатаНачалаИсполнения КАК ДатаНачалаИсполнения,
	|	ESD_ПутевойЛист.ДатаОкончанияИсполнения КАК ДатаОкончанияИсполнения,
	|	ESD_ПутевойЛист.ДоРейса_МедосмотрСторонняяОрганизация КАК ДоРейса_МедосмотрСторонняяОрганизация,
	|	ESD_ПутевойЛист.ПослеРейса_МедосмотрСторонняяОрганизация КАК ПослеРейса_МедосмотрСторонняяОрганизация
	|ИЗ
	|	Документ.ESD_ПутевойЛист КАК ESD_ПутевойЛист
	|ГДЕ
	|	ESD_ПутевойЛист.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ОтветственныеЛица"" КАК ИмяТабличнойЧасти,
	|	ESD_ПутевойЛистОтветственныеЛица.НомерСтроки КАК НомерСтроки,
	|	ESD_ПутевойЛистОтветственныеЛица.КлючСтроки КАК КлючСтроки,
	|	ESD_ПутевойЛистОтветственныеЛица.ИНН КАК ИНН,
	|	ESD_ПутевойЛистОтветственныеЛица.Серия КАК Серия,
	|	ESD_ПутевойЛистОтветственныеЛица.Номер КАК Номер,
	|	ESD_ПутевойЛистОтветственныеЛица.ДатаВыдачи КАК ДатаВыдачи,
	|	ESD_ПутевойЛистОтветственныеЛица.Фамилия КАК Фамилия,
	|	ESD_ПутевойЛистОтветственныеЛица.Имя КАК Имя,
	|	ESD_ПутевойЛистОтветственныеЛица.Отчество КАК Отчество,
	|	ESD_ПутевойЛистОтветственныеЛица.Телефоны КАК Телефоны,
	|	ESD_ПутевойЛистОтветственныеЛица.Роль КАК Роль,
	|	ESD_ПутевойЛистОтветственныеЛица.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ESD_ПутевойЛистОтветственныеЛица.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
	|	ESD_ПутевойЛистОтветственныеЛица.Должность КАК Должность,
	|	ESD_ПутевойЛистОтветственныеЛица.ШтатныйСотрудник КАК ШтатныйСотрудник
	|ИЗ
	|	Документ.ESD_ПутевойЛист.ОтветственныеЛица КАК ESD_ПутевойЛистОтветственныеЛица
	|ГДЕ
	|	ESD_ПутевойЛистОтветственныеЛица.Ссылка = &Ссылка
	|	И ESD_ПутевойЛистОтветственныеЛица.Роль <> &РольТехосмотр
	|	И ESD_ПутевойЛистОтветственныеЛица.Роль <> &РольВодитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ТранспортныеСредства"" КАК ИмяТабличнойЧасти,
	|	ESD_ПутевойЛистТранспортныеСредства.НомерСтроки КАК НомерСтроки,
	|	ESD_ПутевойЛистТранспортныеСредства.Вид КАК Вид,
	|	ESD_ПутевойЛистТранспортныеСредства.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ESD_ПутевойЛистТранспортныеСредства.Тип КАК Тип,
	|	ESD_ПутевойЛистТранспортныеСредства.Марка КАК Марка,
	|	ESD_ПутевойЛистТранспортныеСредства.Модель КАК Модель,
	|	ESD_ПутевойЛистТранспортныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер
	|ИЗ
	|	Документ.ESD_ПутевойЛист.ТранспортныеСредства КАК ESD_ПутевойЛистТранспортныеСредства
	|ГДЕ
	|	ESD_ПутевойЛистТранспортныеСредства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""АдресаПунктовВыгрузки"" КАК ИмяТабличнойЧасти,
	|	ESD_ПутевойЛистАдресаПунктовВыгрузки.НомерСтроки КАК НомерСтроки,
	|	ESD_ПутевойЛистАдресаПунктовВыгрузки.Значение КАК Значение,
	|	ESD_ПутевойЛистАдресаПунктовВыгрузки.Структура КАК Структура,
	|	ESD_ПутевойЛистАдресаПунктовВыгрузки.КлючСтроки КАК КлючСтроки
	|ИЗ
	|	Документ.ESD_ПутевойЛист.АдресаПунктовВыгрузки КАК ESD_ПутевойЛистАдресаПунктовВыгрузки
	|ГДЕ
	|	ESD_ПутевойЛистАдресаПунктовВыгрузки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ДанныеЮрЛиц"" КАК ИмяТабличнойЧасти,
	|	ESD_ПутевойЛистДанныеЮрЛиц.НомерСтроки КАК НомерСтроки,
	|	ESD_ПутевойЛистДанныеЮрЛиц.Роль КАК Роль,
	|	ESD_ПутевойЛистДанныеЮрЛиц.ИНН КАК ИНН,
	|	ESD_ПутевойЛистДанныеЮрЛиц.КПП КАК КПП,
	|	ESD_ПутевойЛистДанныеЮрЛиц.ОГРН КАК ОГРН,
	|	ESD_ПутевойЛистДанныеЮрЛиц.ЮрФизЛицо КАК ЮрФизЛицо,
	|	ESD_ПутевойЛистДанныеЮрЛиц.СтруктураФИО КАК СтруктураФИО,
	|	ESD_ПутевойЛистДанныеЮрЛиц.Адрес КАК Адрес,
	|	ESD_ПутевойЛистДанныеЮрЛиц.АдресСтруктура КАК АдресСтруктура,
	|	ESD_ПутевойЛистДанныеЮрЛиц.СтранаРегистрации КАК СтранаРегистрации,
	|	ESD_ПутевойЛистДанныеЮрЛиц.КодФилиала КАК КодФилиала,
	|	ESD_ПутевойЛистДанныеЮрЛиц.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	ESD_ПутевойЛистДанныеЮрЛиц.КлючСтроки КАК КлючСтроки
	|ИЗ
	|	Документ.ESD_ПутевойЛист.ДанныеЮрЛиц КАК ESD_ПутевойЛистДанныеЮрЛиц
	|ГДЕ
	|	ESD_ПутевойЛистДанныеЮрЛиц.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""КонтактныеДанные"" КАК ИмяТабличнойЧасти,
	|	ESD_ПутевойЛистКонтактныеДанные.НомерСтроки КАК НомерСтроки,
	|	ESD_ПутевойЛистКонтактныеДанные.Роль КАК Роль,
	|	ESD_ПутевойЛистКонтактныеДанные.Тип КАК Тип,
	|	ESD_ПутевойЛистКонтактныеДанные.Значение КАК Значение,
	|	ESD_ПутевойЛистКонтактныеДанные.Структура КАК Структура,
	|	ESD_ПутевойЛистКонтактныеДанные.КлючСтроки_ДанныеЮрЛиц КАК КлючСтроки_ДанныеЮрЛиц
	|ИЗ
	|	Документ.ESD_ПутевойЛист.КонтактныеДанные КАК ESD_ПутевойЛистКонтактныеДанные
	|ГДЕ
	|	ESD_ПутевойЛистКонтактныеДанные.Ссылка = &Ссылка";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ПутевойЛист", ПутевойЛист());
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ПризнакНачалаРейса", ПризнакНачалаРейса());
	
	ЗапросДанных.УстановитьПараметр("Ссылка",        ДанныеЗаполнения);
	ЗапросДанных.УстановитьПараметр("РольТехосмотр", ЗначениеМетаданных("ESD_РолиОтветственных.Техосмотр"));
	ЗапросДанных.УстановитьПараметр("РольВодитель",  ЗначениеМетаданных("ESD_РолиОтветственных.Водитель"));
	
	Результат = ЗапросДанных.ВыполнитьПакет();
	ВыборкаРеквизитов = Результат[0].Выбрать();
	
	Если ВыборкаРеквизитов.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаРеквизитов);
	КонецЕсли;
	
	Для Индекс = 1 По Результат.ВГраница() Цикл
		
		ВыборкаТабличнойЧасти = Результат[Индекс].Выбрать();
		
		Пока ВыборкаТабличнойЧасти.Следующий() Цикл
			
			СтрокаТабличнойЧасти = ЭтотОбъект[ВыборкаТабличнойЧасти.ИмяТабличнойЧасти].Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыборкаТабличнойЧасти);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЭтотОбъект.ДокументОснование_Идентификатор    = ДанныеЗаполнения.УникальныйИдентификатор();
	ЭтотОбъект.ДокументОснование_ОбъектМетаданных = МодульКода("ESD_ТНОбщегоНазначенияСервер").ИмяМетаданныхДокумента(
		ДанныеЗаполнения);
				
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОснованииПутевогоЛиста

#Область ЗаполнениеНаОснованииИспользуяНастройкиСопоставления

Процедура ЗаполнитьНаОснованииРасчетаСопоставлений(РезультатРасчетаПолей) Экспорт
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьСсылкиНаОбъекты(РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, РезультатРасчетаПолей);
	
	МассивЮрЛиц = Новый Массив;
	МассивЮрЛиц.Добавить("Оформитель");
	МассивЮрЛиц.Добавить("МедосмотрВыезд");
	МассивЮрЛиц.Добавить("МедосмотрЗаезд");
	МодульТНОбщегоНазначенияСервер.ЗаполнитьДанныеЮрЛиц(ЭтотОбъект, РезультатРасчетаПолей, МассивЮрЛиц);
	
	МассивОтветственных = Новый Массив;
	МассивОтветственных.Добавить("Ответственный_МедосмотрВыезд");
	МассивОтветственных.Добавить("Ответственный_МедосмотрЗаезд");
	МассивОтветственных.Добавить("Ответственный_Техосмотр");
	МассивОтветственных.Добавить("Ответственный_ОдометрВыезд");
	МассивОтветственных.Добавить("Ответственный_ОдометрЗаезд");
	МодульТНОбщегоНазначенияСервер.ЗаполнитьОтветственных(ЭтотОбъект, РезультатРасчетаПолей, МассивОтветственных);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьТранспортныеСредства(ЭтотОбъект, РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьВодителей(ЭтотОбъект, РезультатРасчетаПолей);
	
	ЗаполнитьАдресаПунктовВыгрузки(РезультатРасчетаПолей);
	
КонецПроцедуры

Процедура ЗаполнитьАдресаПунктовВыгрузки(РезультатРасчетаПолей)
	
	ДанныеАдресовПунктовВыгрузки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "АдресаПунктовВыгрузки", Новый Массив);
	Для Каждого ДанныеАдресаПунктаВыгрузки Из ДанныеАдресовПунктовВыгрузки Цикл
		СтрокаАдреса = АдресаПунктовВыгрузки.Добавить();
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьЗначенияИзСоответствия(СтрокаАдреса, ДанныеАдресаПунктаВыгрузки);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОтветственного(РезультатРасчетаПолей)
	
	Отгрузка_Ответственный = РезультатРасчетаПолей["Отгрузка_Ответственный"];
	Если Отгрузка_Ответственный = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаОтветственногоЛица = ОтветственныеЛица.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаОтветственногоЛица, РезультатРасчетаПолей["Отгрузка_Ответственный"]);
	СтрокаОтветственногоЛица.КлючСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(
		ЭтотОбъект, "ОтветственныеЛица");
		
	СтрокаОтветственногоЛица.Роль = Перечисления.ESD_РолиОтветственных.Ответственный;
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОснованииИспользуяНастройкиСопоставления

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_CommonModule_Метаданные
#КонецОбласти // include_etrn_base_CommonModule_Метаданные
