
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПредставлениеДокумента(Данные);
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДобавитьПоляПредставления(Поля);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область ПрограммныйИнтерфейс

#Область include_etrn_base_Document_ОбщийФункционал_МодульМенеджера_ПрограммныйИнтерфейс_ТекущиеЭтапыДокумента
#КонецОбласти // include_etrn_base_Document_ОбщийФункционал_МодульМенеджера_ПрограммныйИнтерфейс_ТекущиеЭтапыДокумента

// Интерфейс обработки выгрузки документа в СБИС
//
// Параметры:
//  ПараметрыВыгрузки - Структура - см. ESD_ТНОбщегоНазначенияКлиентСервер.ПараметрыВыгрузки
//
Процедура ПослеВыгрузкиДокументаВСБИС(ПараметрыВыгрузки) Экспорт
	УстановитьСвязьДокументов(ПараметрыВыгрузки);
КонецПроцедуры

// Возвращает массив типов доступных для заполнения на основании.
//
// Параметры:
//  ЗначенияПоУмолчанию - Булево - признак получения типов по умолчанию
//
// Возвращаемое значение:
//   Массив - массив типов выбранных для заполнения на основании.
//
Функция ТипыДляЗаполненияНаОсновании(ЗначенияПоУмолчанию = Ложь) Экспорт
	
	Если Не ЗначенияПоУмолчанию Тогда
		РезультатФункции = ПользовательскиеТипыДляЗаполненияНаОсновании();
	Иначе
		РезультатФункции = Неопределено;
	КонецЕсли;
	
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = ТипыПоУмолчаниюДляЗаполненияНаОсновании();
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Сохраняет выбранные типы документов для заполнения на основании выбранные пользователем.
//
// Параметры:
//  МассивТипов - Массив - массив типов
//
Процедура СохранитьВыбранныеТипыДляЗаполненияНаОсновании(МассивТипов) Экспорт
	ESD_ТНОбщегоНазначенияСервер.ESD_СохранитьНастройкиОбъекта("ТипыДляЗаполненияНаОснованииДокументаЭПЛ", 
		МассивТипов, , "");
КонецПроцедуры

// Возвращает структуру реквизитов документа, относящиеся титулу
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка.ESD_ПутевойЛист - ссылка на документ
//  ТипТитула - ПеречислениеСсылка.ESD_ТипТитулаЭПЛ - ссылка на тип титула
//
// Возвращаемое значение:
//   Структура - структура полученных данных документа
//
Функция ДанныеДокумента(СсылкаНаДокумент, ТипТитула) Экспорт
	
	ТипыТитулов = МодульКода("ESD_ТНОбщегоНазначенияСервер").ВсеЗначенияПеречисления(ТипТитулаЭПЛ());
	
	ЭтоПервыйТитул = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
		ПутевойЛист(), "ЭтоПервыйТитул", ТипТитула);
		
	РезультатФункции = Новый Соответствие;
		
	Если ЭтоПервыйТитул Тогда
		
		РезультатФункции.Вставить(ТипТитула, ВыгрузкаДанныеВыпуск(СсылкаНаДокумент));
		РезультатФункции.Вставить(ТипыТитулов["ПредрейсовыйМедосмотр"], ВыгрузкаДанныеПредрейсовыйМедосмотр(СсылкаНаДокумент));
		РезультатФункции.Вставить(ТипыТитулов["ПредрейсовыйТехосмотр"], ВыгрузкаДанныеПредрейсовыйТехосмотр(СсылкаНаДокумент));
		РезультатФункции.Вставить(ТипыТитулов["Выпускающий"], ВыгрузкаДанныеВыпускающий(СсылкаНаДокумент));
		РезультатФункции.Вставить(ТипыТитулов["Принимающий"], ВыгрузкаДанныеПринимающий(СсылкаНаДокумент));
		РезультатФункции.Вставить(ТипыТитулов["ПослерейсовыйМедосмотр"], ВыгрузкаДанныеПослерейсовыйМедосмотр(СсылкаНаДокумент));
		
	ИначеЕсли ТипТитула = ТипыТитулов["ПредрейсовыйМедосмотр"] Тогда
		
		РезультатФункции.Вставить(ТипТитула, ВыгрузкаДанныеПредрейсовыйМедосмотр(СсылкаНаДокумент));
		
	ИначеЕсли ТипТитула = ТипыТитулов["ПредрейсовыйТехосмотр"] Тогда
		
		РезультатФункции.Вставить(ТипТитула, ВыгрузкаДанныеПредрейсовыйТехосмотр(СсылкаНаДокумент));
		
	ИначеЕсли ТипТитула = ТипыТитулов["Выпускающий"] Тогда
		
		РезультатФункции.Вставить(ТипТитула, ВыгрузкаДанныеВыпускающий(СсылкаНаДокумент));
		
	ИначеЕсли ТипТитула = ТипыТитулов["Принимающий"] Тогда
		
		РезультатФункции.Вставить(ТипТитула, ВыгрузкаДанныеПринимающий(СсылкаНаДокумент));
		
	ИначеЕсли ТипТитула = ТипыТитулов["ПослерейсовыйМедосмотр"] Тогда
		
		РезультатФункции.Вставить(ТипТитула, ВыгрузкаДанныеПослерейсовыйМедосмотр(СсылкаНаДокумент));
		
	Иначе
		
		РезультатФункции.Вставить(ТипТитула, Новый Структура);
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Добавляет данные титулов для выгрузки на онлайн
//
// Параметры:
//  ТекущийЭтап - ПеречислениеСсылка.ESD_ТипТитулаЭПЛ - тип текущего титула
//  ДанныеТитула - Структура - структура реквизитов и таблиц документа для выгрузки
//  ДополнительныеПараметры - Структура - структура дополнительных параметров формирования вложения
//
// Возвращаемое значение:
//   Структура - структура титула для отправки
//
Функция ВложениеНаВыгрузку(ТекущийЭтап, ДанныеТитула, ДополнительныеПараметры) Экспорт
	
	ТипыТитулов = МодульКода("ESD_ТНОбщегоНазначенияСервер").ВсеЗначенияПеречисления(ТипТитулаЭПЛ());
	
	ЭтоПервыйТитул = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
		ПутевойЛист(), "ЭтоПервыйТитул", ТекущийЭтап);
	
	Если ЭтоПервыйТитул Тогда
		
		СтруктураТитула = ТитулВыпуск(ДанныеТитула[ТекущийЭтап]);
		СтруктураТитула = ТитулПредрейсовыйМедосмотр(ДанныеТитула[ТипыТитулов["ПредрейсовыйМедосмотр"]], СтруктураТитула);
		СтруктураТитула = ТитулПредрейсовыйТехосмотр(ДанныеТитула[ТипыТитулов["ПредрейсовыйТехосмотр"]], СтруктураТитула);
		СтруктураТитула = ТитулВыпускающий(ДанныеТитула[ТипыТитулов["Выпускающий"]], СтруктураТитула);
		СтруктураТитула = ТитулПринимающий(ДанныеТитула[ТипыТитулов["Принимающий"]], СтруктураТитула);
		СтруктураТитула = ТитулПослерейсовыйМедосмотр(ДанныеТитула[ТипыТитулов["ПослерейсовыйМедосмотр"]], СтруктураТитула);
		
	ИначеЕсли ТекущийЭтап = ТипыТитулов["ПредрейсовыйМедосмотр"] Тогда
		
		СтруктураТитула = ТитулПредрейсовыйМедосмотр(ДанныеТитула[ТекущийЭтап]);
		
		СтруктураТитула.Вставить("СторонняяОрганизация", Не СтруктураТитула.ШтатныйСотрудник);
		СтруктураТитула.Удалить("ШтатныйСотрудник");
		
	ИначеЕсли ТекущийЭтап = ТипыТитулов["ПредрейсовыйТехосмотр"] Тогда
		
		СтруктураТитула = ТитулПредрейсовыйТехосмотр(ДанныеТитула[ТекущийЭтап]);
		
	ИначеЕсли ТекущийЭтап = ТипыТитулов["Выпускающий"] Тогда
		
		СтруктураТитула = ТитулВыпускающий(ДанныеТитула[ТекущийЭтап]);
		
	ИначеЕсли ТекущийЭтап = ТипыТитулов["Принимающий"] Тогда
		
		СтруктураТитула = ТитулПринимающий(ДанныеТитула[ТекущийЭтап]);
		
	ИначеЕсли ТекущийЭтап = ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.ПослерейсовыйМедосмотр") Тогда
		
		СтруктураТитула = ТитулПослерейсовыйМедосмотр(ДанныеТитула[ТекущийЭтап]);
		
		СтруктураТитула.Вставить("СторонняяОрганизация", Не СтруктураТитула.ШтатныйСотрудник);
		СтруктураТитула.Удалить("ШтатныйСотрудник");
		
	Иначе
		СтруктураТитула = Неопределено;
	КонецЕсли;
	
	Возврат СтруктураТитула;

КонецФункции

// Устанавливает связь между документами - предыдущим и следующим путевым листом
// Параметры:
//  ПараметрыВыгрузки - Структура - данные выгружаемого документа
// 
Процедура УстановитьСвязьДокументов(ПараметрыВыгрузки) Экспорт

	Если ПараметрыВыгрузки.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.Выпуск") Тогда
		
		// проверим есть ли связь с другим документом
	    ПредыдущийИД = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
			ПараметрыВыгрузки, "СтруктураДокумента.Документ.ПредыдущийИдентификаторВИ");
			
		Если ЗначениеЗаполнено(ПредыдущийИД) Тогда
			
			// сохраним ИД
			СсылкаНаПутевойЛист = МодульКода("ESD_ТНОбщегоНазначенияСервер").ДокументПоИдентификаторуСбис(ПредыдущийИД);			
			ЗаписатьИдСледПутевогоЛиста(СсылкаНаПутевойЛист, ПараметрыВыгрузки.ИдентификаторСБИС);
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

#Область Команды

// Заполняет список команд печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти // Команды

// Возвращает параметры для выполнения ФЛК
//
// Параметры:
//  ДанныеДокумента - Структура - структура реквизитов и табличных частей документа
//  ПараметрыВыгрузки - Структура - см. ESD_ТНОбщегоНазначенияКлиентСервер.ПараметрыВыгрузки
//
// Возвращаемое значение:
//   Структура - структура данных для дальнейшей проверки реквизитов
//
Функция ПараметрыПроверкиРеквизитов(ДанныеДокумента, ПараметрыВыгрузки) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ПроверяемыеРеквизиты", Новый Массив);
	
	ТипыТитулов = МодульКода("ESD_ТНОбщегоНазначенияСервер").ВсеЗначенияПеречисления(ТипТитулаЭПЛ());
	
	ЭтоПервыйТитул = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
		ПутевойЛист(), "ЭтоПервыйТитул", ПараметрыВыгрузки.ТипТитула);
	
	Если ЭтоПервыйТитул Тогда
		
		ДополнитьПроверяемыеРеквизитыЭтапаВыпуск(ДанныеДокумента, РезультатФункции.ПроверяемыеРеквизиты);
		
	ИначеЕсли ПараметрыВыгрузки.ТипТитула = ТипыТитулов["ПредрейсовыйМедосмотр"] Тогда
		
		ДополнитьПроверяемыеРеквизитыЭтапаПредрейсовыйМедосмотр(РезультатФункции.ПроверяемыеРеквизиты);
		
	ИначеЕсли ПараметрыВыгрузки.ТипТитула = ТипыТитулов["ПредрейсовыйТехосмотр"] Тогда
		
		ДополнитьПроверяемыеРеквизитыЭтапаПредрейсовыйТехосмотр(РезультатФункции.ПроверяемыеРеквизиты);
		
	ИначеЕсли ПараметрыВыгрузки.ТипТитула = ТипыТитулов["Выпускающий"] Тогда
		
		ДополнитьПроверяемыеРеквизитыЭтапаВыпускающий(РезультатФункции.ПроверяемыеРеквизиты);
		
	ИначеЕсли ПараметрыВыгрузки.ТипТитула = ТипыТитулов["Принимающий"] Тогда
		
		ДополнитьПроверяемыеРеквизитыЭтапаПринимающий(РезультатФункции.ПроверяемыеРеквизиты);
		
	ИначеЕсли ПараметрыВыгрузки.ТипТитула = ТипыТитулов["ПослерейсовыйМедосмотр"] Тогда
		
		ДополнитьПроверяемыеРеквизитыЭтапаПослерейсовыйМедосмотр(РезультатФункции.ПроверяемыеРеквизиты);
		
	Иначе
		РезультатФункции.ПроверяемыеРеквизиты = Новый Массив;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Возвращает имя таблицы документа с учетом специфики
//
// Параметры:
//  ИмяТабличнойЧасти - Строка - наименование табличной части из конфигуратора
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти - строка табличной части документа
//  ДанныеДокумента - Структура - структура реквизитов и табличных частей документа
//
// Возвращаемое значение:
//   Строка - наименование таблицы на форме документа
//
Функция ИмяТЧДокумента(ИмяТабличнойЧасти, СтрокаТабличнойЧасти, ДанныеДокумента) Экспорт
	
	Возврат ИмяТабличнойЧасти;
	
КонецФункции

Функция ПроверятьРеквизитДокумента(ИмяРеквизита, ДанныеДокумента) Экспорт
	
	Если ИмяРеквизита = "ДанныеЮрЛицМедосмотрВыезд" Или ИмяРеквизита = "ДанныеЮрЛицМедосмотрЗаезд" Тогда
		Возврат ПроверятьРеквизитЮрЛиц(Неопределено, ИмяРеквизита, Неопределено, ДанныеДокумента);
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Возвращает признак необходимости ФЛК реквизитов табличной части документа
//
// Параметры:
//  СтрокаТЧ - СтрокаТаблицыЗначений - строка табличной части документа
//  ИмяТЧ - Строка - имя табличной части документа
//  Реквизит - Структура - см. функцию ФЛК()
//  ДанныеДокумента - Структура - структура реквизитов и табличных частей документа
//
// Возвращаемое значение:
//   Булево - Истина, если проверять необходимо
//
Функция ПроверятьРеквизитТЧДокумента(СтрокаТЧ, ИмяТЧ, Реквизит, ДанныеДокумента) Экспорт
	
	Если ИмяТЧ = "ТранспортныеСредства" Тогда
		РезультатФункции = ПроверятьРеквизитТранспортногоСредства(СтрокаТЧ, ИмяТЧ, Реквизит.РеквизитОбъекта);
	ИначеЕсли ИмяТЧ = "ДанныеЮрЛицМедосмотрВыезд" Или ИмяТЧ = "ДанныеЮрЛицМедосмотрЗаезд" Тогда
		РезультатФункции = ПроверятьРеквизитЮрЛиц(СтрокаТЧ, ИмяТЧ, Реквизит.РеквизитОбъекта, ДанныеДокумента);
	ИначеЕсли ИмяТЧ = "ДанныеЮрЛиц" Тогда
		РезультатФункции = ПроверятьРеквизитОформителя(СтрокаТЧ, Реквизит);
	ИначеЕсли ИмяТЧ = "Водители" Тогда
		РезультатФункции = ПроверятьРеквизитВодителя(СтрокаТЧ, Реквизит.РеквизитОбъекта);
	Иначе
		РезультатФункции = Истина;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Изменяет параметры реквизита для отображения ошибки.
//
// Параметры:
//  СтрокаТЧ - СтрокаТаблицыЗначений - строка табличной части документа
//  ИмяТЧ - Строка - имя табличной части документа
//  Реквизит - Структура - см. функцию ФЛК()
//  ДанныеДокумента - Структура - структура реквизитов и табличных частей документа
//
// Возвращаемое значение:
//   Структура - см. функцию ФЛК
//
Функция ИзменитьРеквизитТЧ(СтрокаТЧ, ИмяТЧ, Реквизит, ДанныеДокумента) Экспорт
	
	Возврат Реквизит;
	
КонецФункции

// Выполняет нестандартные проверки ФЛК с логикой сложнее, чем заполнен незаполнен.
//
// Параметры:
//  ДанныеДокумента - Структура - структура реквизитов и табличных частей документа
//  ПараметрыВыгрузки - Структура - см. ESD_ТНОбщегоНазначенияКлиентСервер.ПараметрыВыгрузки
//  Ошибки - Массив,Неопределено - массив для накопления ошибок
//
Процедура ВыполнитьДополнительныеПроверкиФЛК(ДанныеДокумента, ПараметрыВыгрузки, Ошибки) Экспорт
		
	ТипыТитулов = МодульКода("ESD_ТНОбщегоНазначенияСервер").ВсеЗначенияПеречисления(ТипТитулаЭПЛ());
	
	ЭтоПервыйТитул = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
		ПутевойЛист(), "ЭтоПервыйТитул", ПараметрыВыгрузки.ТипТитула);
	
	Если ЭтоПервыйТитул Тогда
		
		ДопПроверкиФЛКВыпуск(ДанныеДокумента, ПараметрыВыгрузки, Ошибки);
		
	ИначеЕсли ПараметрыВыгрузки.ТипТитула = ТипыТитулов["ПредрейсовыйТехосмотр"] Тогда
		
		ДопПроверкиФЛКПредрейсовыйТехосмотр(ДанныеДокумента, ПараметрыВыгрузки, Ошибки);
		
	ИначеЕсли ПараметрыВыгрузки.ТипТитула = ТипыТитулов["Принимающий"] Тогда
		
		ДопПроверкиФЛКПринимающий(ДанныеДокумента, ПараметрыВыгрузки, Ошибки);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ВложенияЗагружены(Вложения, Титул, ОбъектДок, ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Вложения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВложенияМассив = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеВМассив(Вложения);
	
	Если Титул = ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.Выпуск") Тогда
		
		ЗагрузкаТитулаВыпуск(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
		Если Не ДопПараметры.ЗагрузкаСОнлайна И ДопПараметры.ЭтоПервоеОснование Тогда
			ЗагрузкаТитулаПредрейсовыйМедосмотр(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
			ЗагрузкаТитулаПредрейсовыйТехосмотр(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
		    ЗагрузкаТитулаВыпускающий(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
		    ЗагрузкаТитулаПринимающий(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
		    ЗагрузкаТитулаПослерейсовыйМедосмотр(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
		КонецЕсли;
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.ПредрейсовыйМедосмотр") Тогда
		
		ЗагрузкаТитулаПредрейсовыйМедосмотр(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.ПредрейсовыйТехосмотр") Тогда
		
		ЗагрузкаТитулаПредрейсовыйТехосмотр(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.Выпускающий") Тогда
		
		ЗагрузкаТитулаВыпускающий(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.Принимающий") Тогда
		
		ЗагрузкаТитулаПринимающий(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.ПослерейсовыйМедосмотр") Тогда
		
		ЗагрузкаТитулаПослерейсовыйМедосмотр(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ТитулыДляЗагрузки(ОбъектДок, ПараметрыЗагрузки) Экспорт
	
	ТекущиеЗначения = МодульКода("ESD_ТНЗагрузкаСервер").ТекущиеЗначенияДокумента(ОбъектДок, ПараметрыЗагрузки);
	
	Этап = ТекущиеЗначения.Титул;
	
	Если ЗначениеЗаполнено(ТекущиеЗначения.Состояние) Тогда
		КодСостояния = МодульКода("ESD_ТНОбщегоНазначенияСервер").КодСостояния(ТекущиеЗначения.Состояние);
	КонецЕсли;
	
	ТипыТитулов = МодульКода("ESD_ТНОбщегоНазначенияСервер").ВсеЗначенияПеречисления(ТипТитулаЭПЛ());
	
	МассивТитуловДляЗагрузки = Новый Массив;
	
	ДОЗавершенУспешно      = 7;
	ДОЗавершенОтрицательно = 9;
	
	Если КодСостояния = ДОЗавершенУспешно
		Или КодСостояния = ДОЗавершенОтрицательно Тогда
		
		Если ПараметрыЗагрузки.ТолькоАктивныйЭтап Тогда
			МассивТитуловДляЗагрузки.Добавить(Этап);
		Иначе
			ДобавитьВсеТитулыДляЗагрузки(МассивТитуловДляЗагрузки, ТипыТитулов);
		КонецЕсли;
		
		Возврат МассивТитуловДляЗагрузки;	
		
	КонецЕсли;
	
	Если ПараметрыЗагрузки.ТолькоАктивныйЭтап Тогда
		ДобавитьТитулыПоАктивномуЭтапу(МассивТитуловДляЗагрузки, Этап, ТипыТитулов);
	Иначе
		ДобавитьВсеТитулыДляЗагрузки(МассивТитуловДляЗагрузки, ТипыТитулов);
	КонецЕсли;
	
	Возврат МассивТитуловДляЗагрузки;

КонецФункции

Процедура ДобавитьВсеТитулыДляЗагрузки(МассивТитуловДляЗагрузки, ТипыТитулов) Экспорт
	
	МассивТитуловДляЗагрузки.Добавить(ТипыТитулов["Выпуск"]);
	МассивТитуловДляЗагрузки.Добавить(ТипыТитулов["ПредрейсовыйМедосмотр"]);
	МассивТитуловДляЗагрузки.Добавить(ТипыТитулов["ПредрейсовыйТехосмотр"]);
	МассивТитуловДляЗагрузки.Добавить(ТипыТитулов["Выпускающий"]);
	МассивТитуловДляЗагрузки.Добавить(ТипыТитулов["Принимающий"]);
	МассивТитуловДляЗагрузки.Добавить(ТипыТитулов["ПослерейсовыйМедосмотр"]);
	
КонецПроцедуры

#Область ЗаполнениеНаОснованииИНИИнтерфейс

Процедура СформироватьНовыеОснования(СтруктураРезультата, ДанныеИзИНИ) Экспорт
	
	ОформительСсылка = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		ДанныеИзИНИ, "Документ.ОформительСсылка");
	Если ЗначениеЗаполнено(ОформительСсылка) Тогда
		
		СтруктураОснования = МодульКода("ESD_ТНОбщегоНазначенияСервер").СтруктураОснования(ОформительСсылка, "", "Оформитель");
		СтруктураРезультата.НовыеОснования.Добавить(СтруктураОснования);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьПодстановки(ДанныеИзИНИ, ПараметрыЗаполнения) Экспорт
	
	Если ПараметрыЗаполнения.РольКонтрагента = "Оформитель" Тогда
		Документ = Новый Соответствие;
		Документ.Вставить("Оформитель", МодульКода("ESD_ТНОбщегоНазначенияСервер").ДанныеЮрЛицаИзИНИ(ДанныеИзИНИ));
		ДанныеИзИНИ.Вставить("Документ", Документ);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОснованииИНИИнтерфейс

Функция ДоступныеОрганизацииЭтапы(ОбъектДок, ПараметрыЗагрузки) Экспорт
	
	РезультатФункции = Новый Соответствие;
	
	ДанныеНашейОрганизации = МодульКода("ESD_ТНЗагрузкаСервер").ИННКППОрганизации(
		ПараметрыЗагрузки.ДанныеДокумента["НашаОрганизация"]);
	ДанныеКонтрагента      = МодульКода("ESD_ТНЗагрузкаСервер").ИННКППОрганизации(
		ПараметрыЗагрузки.ДанныеДокумента["Контрагент"]);
	
	// Если есть узел контрагент в полученных данных,
	// то ЭПЛ пришел внешней организации на выполнение медосмотра или техосмотра.
	// Если пришел, то считаем , что доступ есть.
	ЭтапыДоступны = ДанныеКонтрагента.ЕстьДанные;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.Оформитель"));
	СтруктураПоиска.Вставить("ИНН",  ДанныеНашейОрганизации.ИНН);
	СтруктураПоиска.Вставить("КПП",  ДанныеНашейОрганизации.КПП);
	
	НайденныеСтроки = ОбъектДок.ДанныеЮрЛиц.НайтиСтроки(СтруктураПоиска);
	
	// Если организация текущего авторизованного пользователя сбис (НашаОрганизация) совпадает с оформителем
	// и организация присутсвует в справочнике организаций,
	// то считаем, что данному пользователю доступно закрытие этапов.
	ЭтоОрганизацияОформитель = НайденныеСтроки.Количество() > 0
		И МодульКода("ESD_ТНОбщегоНазначенияСервер").ОрганизацияПрисутствуетВБазе(СтруктураПоиска.ИНН, СтруктураПоиска.КПП);
	ЭтапыДоступны = ЭтапыДоступны Или ЭтоОрганизацияОформитель;
	
	ВнешниеЭтапы = Новый Массив;
	ВнешниеЭтапы.Добавить("Внешний МО");
	ВнешниеЭтапы.Добавить("Внешний ТО");
	ВнешниеЭтапы.Добавить("Внешний послерейсовый МО");
	
	Для Каждого ТекущийЭтап Из ПараметрыЗагрузки.ДанныеДокумента["ТекущиеЭтапы"] Цикл
		
		НаименованиеЭтапа = ТекущийЭтап["Наименование"];
		
		Если ВнешниеЭтапы.Найти(НаименованиеЭтапа) = Неопределено Тогда
			РезультатФункции.Вставить(НаименованиеЭтапа, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьДополнительныеДанныеВЛенту(МенеджерВременныхТаблиц, СсылкаНаДокумент) Экспорт
	// Пояснения к запросу
	// Если титул в регистре есть то берется период из регистра, иначе берем стандартный период,
	//  соответствующий периоду в Перечисления.ESD_ТипТитулаЭПЛ.СформироватьТаблицуДополнения.
	// Стандартный период титула Выпуск НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 1), ДЕНЬ).
	// Стандартный период титула Выпускающий НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 4), ДЕНЬ).
	//
	// Значение ТипТитулаПорядок выбрано так исходя из значений для основных титулов.
	//  Для титула "Предыдущий путевой лист" -1, так как основной титул "Выпуск" имеет порядковый номер 1,
	//    либо 0 если он есть в регистре. Так как предыдущий путевой лист должен отображаться раньше, то -1.
	//  Для титула "Замена водителя" 4.1, так как основной титул "Выпускающий" имеет порядковый номер 4,
	//    либо 0 если он есть в регистре. Так как замена водителя должна отображаться позже, то 4.1.
	//
	// Период и порядок участвуют в сортировке итоговых данных см. РегистрыСведений.ESD_ДанныеТитулов.ДанныеДляЛенты()
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ВложенныйЗапрос.ПериодПервогоТитула) КАК ПериодПервогоТитула,
	|	ВложенныйЗапрос.СсылкаНаДокумент КАК СсылкаНаДокумент,
	|	МАКСИМУМ(ВложенныйЗапрос.ПериодТитулаВыпускающий) КАК ПериодТитулаВыпускающий
	|ПОМЕСТИТЬ ДатыТитулов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ESD_ДанныеТитуловСрезПоследних.Период КАК ПериодПервогоТитула,
	|		ESD_ДанныеТитуловСрезПоследних.СсылкаНаДокумент КАК СсылкаНаДокумент,
	|		НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 4), ДЕНЬ) КАК ПериодТитулаВыпускающий
	|	ИЗ
	|		РегистрСведений.ESD_ДанныеТитулов.СрезПоследних(
	|				,
	|				СсылкаНаДокумент = &СсылкаНаДокумент
	|					И ТипТитула = &ТипТитулаВыпуск) КАК ESD_ДанныеТитуловСрезПоследних
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 1), ДЕНЬ),
	|		ESD_ДанныеТитуловСрезПоследних.СсылкаНаДокумент,
	|		ESD_ДанныеТитуловСрезПоследних.Период
	|	ИЗ
	|		РегистрСведений.ESD_ДанныеТитулов.СрезПоследних(
	|				,
	|				СсылкаНаДокумент = &СсылкаНаДокумент
	|					И ТипТитула = &ТипТитулаВыпускающий) КАК ESD_ДанныеТитуловСрезПоследних
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 1), ДЕНЬ),
	|		&СсылкаНаДокумент,
	|		НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 4), ДЕНЬ)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.СсылкаНаДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыТитулов.ПериодПервогоТитула КАК Период,
	|	""ПредыдущийПутевойЛист"" КАК ТипТитула,
	|	ВЫБОР
	|		КОГДА ESD_ПутевойЛист.ПЛПредыдущий <> """"
	|			ТОГДА ESD_ПутевойЛист.ПЛПредыдущий
	|		ИНАЧЕ ESD_ПутевойЛист.ДокументОснование_Идентификатор
	|	КОНЕЦ КАК ИдентификаторТитула,
	|	ЛОЖЬ КАК Основной,
	|	&ДанныеПредыдущегоЭПЛ КАК Данные,
	|	ЗНАЧЕНИЕ(Перечисление.ESD_ТипТитулаЭПЛ.ПустаяСсылка) КАК ТипТитулаОтказа,
	|	-0.1 КАК ТипТитулаПорядок,
	|	ЛОЖЬ КАК ЭтоТекущийЭтап
	|ПОМЕСТИТЬ ДополнительныеДанныеТитулов
	|ИЗ
	|	ДатыТитулов КАК ДатыТитулов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ESD_ПутевойЛист КАК ESD_ПутевойЛист
	|		ПО ДатыТитулов.СсылкаНаДокумент = ESD_ПутевойЛист.Ссылка
	|ГДЕ
	|	ESD_ПутевойЛист.Ссылка = &СсылкаНаДокумент
	|	И ИСТИНА В (ESD_ПутевойЛист.ПЛПредыдущий <> """", ESD_ПутевойЛист.ДокументОснование_Идентификатор <> """"
	|				И ESD_ПутевойЛист.ДокументОснование_ОбъектМетаданных = ""ESD_ПутевойЛист"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДатыТитулов.ПериодТитулаВыпускающий,
	|	""ЗаменаВодителя"",
	|	ВЫБОР
	|		КОГДА ESD_ПутевойЛист.ПЛСледующий <> """"
	|			ТОГДА ESD_ПутевойЛист.ПЛСледующий
	|		КОГДА ESD_ПутевойЛист1.Ссылка <> ЗНАЧЕНИЕ(Документ.ESD_ПутевойЛист.ПустаяСсылка)
	|			ТОГДА ESD_ПутевойЛист1.Ссылка
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	&ДанныеСледующегоЭПЛ,
	|	ЗНАЧЕНИЕ(Перечисление.ESD_ТипТитулаЭПЛ.ПустаяСсылка),
	|	4.1,
	|	ЛОЖЬ
	|ИЗ
	|	ДатыТитулов КАК ДатыТитулов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ESD_ПутевойЛист КАК ESD_ПутевойЛист
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ESD_ПутевойЛист КАК ESD_ПутевойЛист1
	|			ПО (ESD_ПутевойЛист1.ДокументОснование_Идентификатор = &УникальныйИдентификаторДокумента)
	|		ПО ДатыТитулов.СсылкаНаДокумент = ESD_ПутевойЛист.Ссылка
	|ГДЕ
	|	ESD_ПутевойЛист.Ссылка = &СсылкаНаДокумент
	|	И ИСТИНА В (ESD_ПутевойЛист.ПЛСледующий <> """", НЕ ESD_ПутевойЛист1.Ссылка ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ДанныеТитулов", ДанныеТитулов());
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ТипТитулаЭПЛ",  ТипТитулаЭПЛ());
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ПутевойЛист",   ПутевойЛист());
	
	
	ЗапросДанных.УстановитьПараметр("ТипТитулаВыпуск",                  ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.Выпуск"));
	ЗапросДанных.УстановитьПараметр("ТипТитулаВыпускающий",             ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.Выпускающий"));
	ЗапросДанных.УстановитьПараметр("СсылкаНаДокумент",                 СсылкаНаДокумент);
	ЗапросДанных.УстановитьПараметр("УникальныйИдентификаторДокумента", Строка(СсылкаНаДокумент.УникальныйИдентификатор()));
	ЗапросДанных.УстановитьПараметр("ТекущаяДата",                      ТекущаяДатаСеанса());
	
	ДанныеПредыдущегоЭПЛ = Новый Структура;
	ДанныеПредыдущегоЭПЛ.Вставить("Представление", "Предыдущий путевой лист");
	ЗапросДанных.УстановитьПараметр("ДанныеПредыдущегоЭПЛ", ЗначениеВСтрокуВнутр(ДанныеПредыдущегоЭПЛ));
	
	ДанныеСледующегоЭПЛ = Новый Структура;
	ДанныеСледующегоЭПЛ.Вставить("Представление", "Замена водителя");
	ЗапросДанных.УстановитьПараметр("ДанныеСледующегоЭПЛ",   ЗначениеВСтрокуВнутр(ДанныеСледующегоЭПЛ));
	
	ЗапросДанных.Выполнить();	
КонецПроцедуры

#Область include_etrn_base_Document_ПутевойЛист_МодульМенеджера_СлужебныйПрограммныйИнтерфейс_Инициализация
#КонецОбласти // include_etrn_base_Document_ПутевойЛист_МодульМенеджера_СлужебныйПрограммныйИнтерфейс_Инициализация

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПользовательскиеТипыДляЗаполненияНаОсновании()
	РезультатФункции = МодульКода("ESD_ТНОбщегоНазначенияСервер")
		.ESD_ЗагрузитьНастройкиОбъекта("ТипыДляЗаполненияНаОснованииДокументаЭПЛ", , "");	
	Возврат РезультатФункции;
КонецФункции

Функция ТипыПоУмолчаниюДляЗаполненияНаОсновании()
	
	РезультатФункции = Новый Массив;
		
	ДоступнаяКонфигурация = МодульКода("ESD_ТНОбщегоНазначенияСервер").ЭтоДоступнаяКонфигурация();		
	Если Не ДоступнаяКонфигурация.Поддержана Тогда
		Возврат РезультатФункции;
	КонецЕсли;

	Если ДоступнаяКонфигурация.Имя = "УАТ" Тогда 
		
		РезультатФункции.Добавить("Документы.уатМаршрутныйЛист");
		РезультатФункции.Добавить("Документы.уатПутевойЛист");
				
	КонецЕсли;	
	
	РезультатФункции = МодульКода("ESD_ТНОбщегоНазначенияСервер").ДоступныеТипыМетаданных(РезультатФункции);
	
	Возврат РезультатФункции.Типы();
		
КонецФункции

Процедура ЗаписатьИдСледПутевогоЛиста(СсылкаНаПутевойЛист, ИдентификаторСБИС)
	
	Если Не ЗначениеЗаполнено(СсылкаНаПутевойЛист)
		Или Не ЗначениеЗаполнено(ИдентификаторСБИС) Тогда		
		Возврат;
	КонецЕсли;	
	
	ТекущееЗначение = МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗначениеРеквизитаОбъекта(СсылкаНаПутевойЛист, "ПЛСледующий");
	Если ТекущееЗначение <> ИдентификаторСБИС Тогда
		
		ОбъектПЛ = СсылкаНаПутевойЛист.ПолучитьОбъект();
		ОбъектПЛ.ПЛСледующий = ИдентификаторСБИС;
		ОбъектПЛ.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры

#Область ФЛК

Функция ФЛК(РеквизитОбъектаЭПЛ, ЭлементФормыЭПЛ, ОшибкаЭПЛ)
	
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").СтруктураФЛК(РеквизитОбъектаЭПЛ, ЭлементФормыЭПЛ, ОшибкаЭПЛ);
	
КонецФункции

Процедура ДополнитьПроверяемыеРеквизитыЭтапаВыпуск(ДанныеДокумента, ПроверяемыеРеквизиты)
	
	ОрганизацияСтрокой = "ОрганизацияСтрокой";
	ПроверяемыеРеквизиты.Добавить(ФЛК("Оформитель", ОрганизацияСтрокой, "Не заполнен оформитель документа"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ДанныеЮрЛиц.ИНН", ОрганизацияСтрокой, "Не заполнен ИНН отправителя"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ДанныеЮрЛиц.Адрес", ОрганизацияСтрокой, "Не заполнен Адрес отправителя"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ДанныеЮрЛиц.Имя", ОрганизацияСтрокой, "Не заполнено Имя отправителя"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ДанныеЮрЛиц.Фамилия", ОрганизацияСтрокой, "Не заполнена Фамилия отправителя"));
	
	ПрицепыРегистрационныйНомер = "ПрицепыРегистрационныйНомер";
	
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ТранспортныеСредства.РегистрационныйНомер", ПрицепыРегистрационныйНомер, "Не заполнен регистрационный номер"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ТранспортныеСредства.Тип", ПрицепыРегистрационныйНомер, "Не заполнен тип"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ТранспортныеСредства.Марка", "ПрицепыМарка", "Не заполнена марка"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ТранспортныеСредства.Модель", "ПрицепыМодель", "Не заполнена модель"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ТранспортныеСредства.ИнвентарныйНомер", ПрицепыРегистрационныйНомер, "Не заполнен инвентарный номер"));
		
	ВодителиФИО = "ВодителиФИО";
	ВодителиВУ  = "ВодителиВУ";
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("Водители",         "Водители",    "В списке водителей не введено ни одной строки"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Водители.Фамилия", ВодителиФИО,   "Не заполнена фамилия водителя"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Водители.Имя",     ВодителиФИО,   "Не заполнено имя водителя")); 
	ПроверяемыеРеквизиты.Добавить(ФЛК("Водители.Серия",   ВодителиВУ,    "Не заполнена серия водительского удостоверения"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Водители.Номер",   ВодителиВУ,    "Не заполнен номер водительского удостоверения"));	
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("Водители.ДатаВыдачи", ВодителиВУ, "Не заполнена дата выдачи водительского удостоверения"));
		
	// СНИЛС	
	ИспользоватьСНИЛС = ESD_ТНОбщегоНазначенияСервер
		.ESD_ЗагрузитьНастройкиОбъекта("ИспользоватьСНИЛС", , "");
	Если ИспользоватьСНИЛС = Истина Тогда
		ПроверяемыеРеквизиты.Добавить(ФЛК("Водители.СНИЛС", "ВодителиСНИЛС", "Не заполнен СНИЛС водителя"));
	КонецЕсли;	
	
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ДатаНачалаИсполнения", "ДатаНачалаИсполнения", "Не заполнена дата начала исполнения путевого листа"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ДатаОкончанияИсполнения", "ДатаОкончанияИсполнения", "Не заполнена дата окончания исполнения путевого листа"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ПризнакНачалаРейса", "ПризнакНачалаРейса", "Не заполнен признак начала рейса"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ВидПеревозки", "ВидПеревозки", "Не заполнен вид перевозки"));
	
	Если ДанныеДокумента.ВидПеревозки = ЗначениеМетаданных("ESD_ВидПеревозки.КоммерческиеПеревозки") Тогда
		ПроверяемыеРеквизиты.Добавить(
			ФЛК("ВидКоммерческойПеревозки", "ВидКоммерческойПеревозки", "Не заполнен вид коммерческой перевозки"));
			
		КоммерческаяПеревозкаНаОснованииДоговора = ЗначениеМетаданных(
			"ESD_ВидКоммерческойПеревозки.ПеревозкаНаОснованииДоговораПеревозки");
		Если ДанныеДокумента.ВидКоммерческойПеревозки = КоммерческаяПеревозкаНаОснованииДоговора Тогда
			ПроверяемыеРеквизиты.Добавить(ФЛК("МестоОтправления", "ДекорацияЗаполнитьМестоОтправления", "Не заполнено место отправления"));
		КонецЕсли;
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ВидТранспортногоСообщения", "ВидТранспортногоСообщения", "Не заполнен вид транспортного сообщения"));
	
	ВидПеревозкаГрузов = ЗначениеМетаданных("ESD_ВидКоммерческойПеревозки.ПеревозкаНаОснованииДоговораПеревозки");
	
	Если ДанныеДокумента.ВидКоммерческойПеревозки = ВидПеревозкаГрузов Тогда
		
		ПроверяемыеРеквизиты.Добавить(ФЛК("АдресаПунктовВыгрузки", "АдресаПунктовВыгрузки", "Не заполнен маршрут следования"));
		ПроверяемыеРеквизиты.Добавить(
			ФЛК("АдресаПунктовВыгрузки.Значение", "АдресаПунктовВыгрузкиЗначение", "Не заполнен адрес пункта"));
			
	КонецЕсли;
	
	// Медосмотры - предрейсовый и послерейсовый
	ДополнитьПроверкуМедосмотра(ДанныеДокумента, ПроверяемыеРеквизиты);
	
	// для замены водителя ТО не нужен
	Если ПустаяСтрока(ДанныеДокумента.ПЛПредыдущий) Тогда
		
		ТехосмотрСтрокой = "ТехосмотрСтрокой";
		ПроверяемыеРеквизиты.Добавить(ФЛК("ОтветственныйТехосмотр", ТехосмотрСтрокой, "Не заполнен ответственный за техосмотр"));
		ПроверяемыеРеквизиты.Добавить(
			ФЛК("ОтветственныйТехосмотр.Фамилия", ТехосмотрСтрокой, "Не заполнена фамилия ответственного за техосмотр"));
		ПроверяемыеРеквизиты.Добавить(
			ФЛК("ОтветственныйТехосмотр.Имя", ТехосмотрСтрокой, "Не заполнено имя ответственного за техосмотр"));
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДополнитьПроверяемыеРеквизитыЭтапаПредрейсовыйМедосмотр(ПроверяемыеРеквизиты)
	
	ВодителиФИО = "ВодителиФИО";
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("Водители", "Водители", "В списке водителей не введено ни одной строки"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Водители.Фамилия", ВодителиФИО, "Не заполнена фамилия водителя"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Водители.Имя", ВодителиФИО, "Не заполнена имя водителя"));
	
	МедосмотрВыездСтрокой = "МедосмотрВыездСтрокой";
	ДекорацияЗаполнитьЛицензияДоРейса = "ДекорацияЗаполнитьЛицензияДоРейса";
	
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйМедосмотрВыезд", МедосмотрВыездСтрокой, "Не заполнен медработник предрейсового медосмотра"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйМедосмотрВыезд.Серия", ДекорацияЗаполнитьЛицензияДоРейса, "Не заполнена серия документа"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйМедосмотрВыезд.Номер", ДекорацияЗаполнитьЛицензияДоРейса, "Не заполнен номер документа"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйМедосмотрВыезд.ДатаВыдачи", ДекорацияЗаполнитьЛицензияДоРейса, "Не заполнена дата выдачи документа"));
	ФЛК = ФЛК("ОтветственныйМедосмотрВыезд.ДатаОкончанияДействия",
		ДекорацияЗаполнитьЛицензияДоРейса,
		"Не заполнен срок действия документа");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ФЛК = ФЛК("ОтветственныйМедосмотрВыезд.Фамилия",
		МедосмотрВыездСтрокой,
		"Не заполнена фамилия медработника предрейсового медосмотра");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйМедосмотрВыезд.Имя", МедосмотрВыездСтрокой, "Не заполнено имя медработника предрейсового медосмотра"));
		
	ДоРейса_ОрганизацияСтрокой = "ДоРейса_ОрганизацияСтрокой";
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ДанныеЮрЛицМедосмотрВыезд", ДоРейса_ОрганизацияСтрокой, "Не заполнена организация медработника выезд"));
	ФЛК = ФЛК("ДанныеЮрЛицМедосмотрВыезд.НаименованиеОрганизации",
		ДоРейса_ОрганизацияСтрокой,
		"Не заполнено наименование организации медработника выезд");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ДанныеЮрЛицМедосмотрВыезд.Адрес", ДоРейса_ОрганизацияСтрокой, "Не заполнен адрес юр. лица"));
	
КонецПроцедуры

Процедура ДополнитьПроверяемыеРеквизитыЭтапаПредрейсовыйТехосмотр(ПроверяемыеРеквизиты)
	
	ТехосмотрСтрокой = "ТехосмотрСтрокой";
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("ОтветственныйТехосмотр", ТехосмотрСтрокой, "Не заполнен ответственный за техосмотр"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйТехосмотр.Фамилия", ТехосмотрСтрокой, "Не заполнена фамилия ответственного за техосмотр"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйТехосмотр.Имя", ТехосмотрСтрокой, "Не заполнено имя ответственного за техосмотр"));
		
КонецПроцедуры

Процедура ДополнитьПроверяемыеРеквизитыЭтапаВыпускающий(ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("Выезд_ДатаВремя", "Выезд_Дата", "Не заполнена дата выезда"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Выезд_Одометр", "Выезд_Одометр", "Не заполнены показания одометра при выезде"));
	
	ОдометрВыездСтрокой = "ОдометрВыездСтрокой";
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("ОтветственныйОдометрВыезд", ОдометрВыездСтрокой, "Не заполнен ответственный за выезд"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйОдометрВыезд.Фамилия", ОдометрВыездСтрокой, "Не заполнена фамилия ответственного за выезд"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйОдометрВыезд.Имя", ОдометрВыездСтрокой, "Не заполнено имя ответственного за выезд"));
		
	ОдометрЗаездСтрокой = "ОдометрЗаездСтрокой";
		
	ПроверяемыеРеквизиты.Добавить(ФЛК("ОтветственныйОдометрЗаезд", ОдометрЗаездСтрокой, "Не заполнен ответственный за заезд"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйОдометрЗаезд.Фамилия", ОдометрЗаездСтрокой, "Не заполнена фамилия ответственного за заезд"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйОдометрЗаезд.Имя", ОдометрЗаездСтрокой, "Не заполнено имя ответственного за заезд"));
	
КонецПроцедуры

Процедура ДополнитьПроверяемыеРеквизитыЭтапаПринимающий(ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("Заезд_ДатаВремя", "Заезд_Дата", "Не заполнена дата заезда"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Заезд_Одометр", "Заезд_Одометр", "Не заполнены показания одометра при заезде"));
	
	ОдометрЗаездСтрокой = "ОдометрЗаездСтрокой";
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("ОтветственныйОдометрЗаезд", ОдометрЗаездСтрокой, "Не заполнен ответственный за заезд"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйОдометрЗаезд.Фамилия", ОдометрЗаездСтрокой, "Не заполнена фамилия ответственного за заезд"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйОдометрЗаезд.Имя", ОдометрЗаездСтрокой, "Не заполнено имя ответственного за заезд"));
			
КонецПроцедуры

Процедура ДополнитьПроверяемыеРеквизитыЭтапаПослерейсовыйМедосмотр(ПроверяемыеРеквизиты)
	
	ВодителиФИО = "ВодителиФИО";
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("Водители", "Водители", "В списке водителей не введено ни одной строки"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Водители.Фамилия", ВодителиФИО, "Не заполнена фамилия водителя"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Водители.Имя", ВодителиФИО, "Не заполнена имя водителя"));
	
	МедосмотрЗаездСтрокой = "МедосмотрЗаездСтрокой";
	ДекорацияЗаполнитьЛицензияПослеРейса = "ДекорацияЗаполнитьЛицензияПослеРейса";
	
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйМедосмотрЗаезд", МедосмотрЗаездСтрокой, "Не заполнен медработник послерейсового медосмотра"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйМедосмотрЗаезд.Серия", ДекорацияЗаполнитьЛицензияПослеРейса, "Не заполнена серия документа"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйМедосмотрЗаезд.Номер", ДекорацияЗаполнитьЛицензияПослеРейса, "Не заполнен номер документа"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйМедосмотрЗаезд.ДатаВыдачи", ДекорацияЗаполнитьЛицензияПослеРейса, "Не заполнена дата выдачи документа"));
	ФЛК = ФЛК("ОтветственныйМедосмотрЗаезд.ДатаОкончанияДействия",
		ДекорацияЗаполнитьЛицензияПослеРейса,
		"Не заполнен срок действия документа");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ФЛК = ФЛК("ОтветственныйМедосмотрЗаезд.Фамилия",
		МедосмотрЗаездСтрокой,
		"Не заполнена фамилия медработника послерейсового медосмотра");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныйМедосмотрЗаезд.Имя", МедосмотрЗаездСтрокой, "Не заполнено имя медработника послерейсового медосмотра"));
		
	ПослеРейса_ОрганизацияСтрокой = "ПослеРейса_ОрганизацияСтрокой";
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ДанныеЮрЛицМедосмотрЗаезд", ПослеРейса_ОрганизацияСтрокой, "Не заполнена организация медработника заезд"));
	ФЛК = ФЛК("ДанныеЮрЛицМедосмотрЗаезд.НаименованиеОрганизации",
		ПослеРейса_ОрганизацияСтрокой,
		"Не заполнено наименование организации медработника заезд");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ДанныеЮрЛицМедосмотрЗаезд.Адрес", ПослеРейса_ОрганизацияСтрокой, "Не заполнен адрес юр. лица"));
	
КонецПроцедуры

Процедура ДопПроверкиФЛКВыпуск(ДанныеДокумента, ПараметрыВыгрузки, Ошибки)
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	Если НачалоДня(ДанныеДокумента.ДатаОкончанияИсполнения) <> ДанныеДокумента.ДатаОкончанияИсполнения
		И ДанныеДокумента.ДатаНачалаИсполнения = ДанныеДокумента.ДатаОкончанияИсполнения Тогда
		ИмяДатаОкончанияИсполнения = "ДатаОкончанияИсполнения";
		СтруктураДанныхОшибки = ФЛК(
			ИмяДатаОкончанияИсполнения,
			ИмяДатаОкончанияИсполнения,
			"В длительности исполнения путевого листа не может быть указано одинаковое время");
		
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ДобавитьОшибкуПользователю(
			Ошибки, 
			ИмяДатаОкончанияИсполнения, 
			СтруктураДанныхОшибки.Ошибка,
			СтруктураДанныхОшибки.РеквизитОбъекта,
			СтруктураДанныхОшибки.ЭлементФормы);
	КонецЕсли;
	
	СтруктураОшибки = ФЛК("ТранспортныеСредства", "ТранспортноеСредствоСтрокой", "Не заполнено транспортное средство");
	МодульТНОбщегоНазначенияСервер.ПроверитьЗаполнениеТранспортногоСредства(ДанныеДокумента, Ошибки, СтруктураОшибки);
	
	СтруктураОшибки = ФЛК("ОрганизацияСтрокой", "ОрганизацияСтрокой", "Не заполнен Телефон отправителя");
	МодульТНОбщегоНазначенияСервер.ПроверитьКонтактныеДанные(ДанныеДокумента, "Оформитель", "Телефон", Ошибки, СтруктураОшибки);
	
	
КонецПроцедуры

Процедура ДопПроверкиФЛКПредрейсовыйТехосмотр(ДанныеДокумента, ПараметрыВыгрузки, Ошибки)
	
	СтруктураОшибки = ФЛК("ТранспортныеСредства", "ТранспортноеСредствоСтрокой", "Не заполнено транспортное средство");
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ПроверитьЗаполнениеТранспортногоСредства(ДанныеДокумента, Ошибки, СтруктураОшибки);
				
КонецПроцедуры

Процедура ДопПроверкиФЛКПринимающий(ДанныеДокумента, ПараметрыВыгрузки, Ошибки)
	
	ПроверитьОдометр(ДанныеДокумента, Ошибки);
	
КонецПроцедуры

Функция ПроверятьРеквизитТранспортногоСредства(СтрокаТЧ, ИмяТЧ, ИмяРеквизита)
	
	ЭтоАвтомобиль = СтрокаТЧ.Вид = ЗначениеМетаданных("ESD_ВидыТС.Автомобиль");
	
	Если ЭтоАвтомобиль Тогда
		
		Если ИмяРеквизита = "РегистрационныйНомер" Тогда
			Возврат Не ЗначениеЗаполнено(СтрокаТЧ.ИнвентарныйНомер);
		ИначеЕсли ИмяРеквизита = "ИнвентарныйНомер" Тогда
			Возврат Не ЗначениеЗаполнено(СтрокаТЧ.РегистрационныйНомер);
		Иначе
			Возврат Истина;
		КонецЕсли;
		
	Иначе
		
		Возврат ИмяРеквизита <> "Тип" И ИмяРеквизита <> "ИнвентарныйНомер";
		
	КонецЕсли;
	
КонецФункции

Функция ПроверятьРеквизитЮрЛиц(СтрокаТЧ, ИмяТЧ, ИмяРеквизита, ДанныеДокумента)
	
	МедосмотрПроводитСторонняяОрганизация = Ложь;
	
	Если ИмяТЧ = "ДанныеЮрЛицМедосмотрВыезд" Тогда
		МедосмотрПроводитСторонняяОрганизация = МедосмотрПроводитСторонняяОрганизация
			Или ДанныеДокумента.ДоРейса_МедосмотрСторонняяОрганизация;
	КонецЕсли;
		
	Если ИмяТЧ = "ДанныеЮрЛицМедосмотрЗаезд" Тогда
		МедосмотрПроводитСторонняяОрганизация = МедосмотрПроводитСторонняяОрганизация
			Или ДанныеДокумента.ПослеРейса_МедосмотрСторонняяОрганизация;
	КонецЕсли;
	
	ПроверятьРеквизиты = Истина;
	Если ИмяРеквизита <> Неопределено Тогда
		ПроверятьРеквизиты = ИмяРеквизита = "ИНН";
		Если СтрокаТЧ <> Неопределено
			И СтрокаТЧ.ЮрФизЛицо = ЗначениеМетаданных("ESD_ЮрФизЛицо.ИндивидуальныйПредприниматель") Тогда
			ПроверятьРеквизиты = ПроверятьРеквизиты Или ИмяРеквизита = "Имя" Или ИмяРеквизита = "Фамилия";
		КонецЕсли;
	КонецЕсли;
	
	Возврат МедосмотрПроводитСторонняяОрганизация И ПроверятьРеквизиты;
	
КонецФункции

Функция ПроверятьРеквизитОформителя(СтрокаТЧ, Реквизит)
	
	ЭтоОформитель = СтрокаТЧ.Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.Оформитель");
	
	ПроверятьРеквизиты = Реквизит.РеквизитОбъекта <> "Имя" И Реквизит.РеквизитОбъекта <> "Фамилия";
	Если Не ПроверятьРеквизиты Тогда
		ПроверятьРеквизиты = СтрокаТЧ.ЮрФизЛицо = ЗначениеМетаданных("ESD_ЮрФизЛицо.ИндивидуальныйПредприниматель");
	КонецЕсли;
	
	Возврат ЭтоОформитель И ПроверятьРеквизиты;
	
КонецФункции

Функция ПроверятьРеквизитВодителя(СтрокаТЧ, ИмяРеквизита)
	
	Если ИмяРеквизита = "Серия" Или ИмяРеквизита = "Номер" Или ИмяРеквизита = "ДатаВыдачи" Тогда
		Возврат ЗначениеЗаполнено(СтрокаТЧ.Серия)
			Или ЗначениеЗаполнено(СтрокаТЧ.Номер)
			Или ЗначениеЗаполнено(СтрокаТЧ.ДатаВыдачи);
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура ДополнитьПроверкуМедосмотра(ДанныеДокумента, ПроверяемыеРеквизиты)
		
	Если ДанныеДокумента.ДоРейса_МедосмотрСторонняяОрганизация Тогда
		Если Не ЗначениеЗаполнено(ДанныеДокумента.ДоРейса_МедицинскаяОрганизация) Тогда
			ДоРейса_ОрганизацияСтрокой = "ДоРейса_ОрганизацияСтрокой";
			ДанныеЮрЛицМедосмотрВыезд = ФЛК("ДанныеЮрЛицМедосмотрВыезд", ДоРейса_ОрганизацияСтрокой,
				"Не заполнена организация медработника выезд");
					
			ДанныеЮрЛицМедосмотрВыездНаименование = ФЛК("ДанныеЮрЛицМедосмотрВыезд.НаименованиеОрганизации",
				ДоРейса_ОрганизацияСтрокой, "Не заполнено наименование организации медработника выезд");
				
			ПроверяемыеРеквизиты.Добавить(
				ФЛК("ДанныеЮрЛицМедосмотрВыезд.ИНН", ДоРейса_ОрганизацияСтрокой, "Не заполнен ИНН организации медработника"));
			ПроверяемыеРеквизиты.Добавить(
				ФЛК("ДанныеЮрЛицМедосмотрВыезд.Имя", ДоРейса_ОрганизацияСтрокой, "Не заполнено Имя организации медработника"));
			ПроверяемыеРеквизиты.Добавить(
				ФЛК("ДанныеЮрЛицМедосмотрВыезд.Фамилия", ДоРейса_ОрганизацияСтрокой, "Не заполнена Фамилия организации медработника"));
				
			ПроверяемыеРеквизиты.Добавить(ДанныеЮрЛицМедосмотрВыезд);
			ПроверяемыеРеквизиты.Добавить(ДанныеЮрЛицМедосмотрВыездНаименование);
		КонецЕсли;
	Иначе
		
		МедосмотрВыездСтрокой = "МедосмотрВыездСтрокой";
		
		МедосмотрВыезд = ФЛК("ОтветственныйМедосмотрВыезд", МедосмотрВыездСтрокой,
			"Не заполнен медработник предрейсового медосмотра");
			
		МедосмотрВыездФамилия = ФЛК("ОтветственныйМедосмотрВыезд.Фамилия", МедосмотрВыездСтрокой,
			"Не заполнена фамилия медработника предрейсового медосмотра");
		
		МедосмотрВыездИмя = ФЛК("ОтветственныйМедосмотрВыезд.Имя", МедосмотрВыездСтрокой,
			"Не заполнено имя медработника предрейсового медосмотра");
			
		ПроверяемыеРеквизиты.Добавить(МедосмотрВыезд);
		ПроверяемыеРеквизиты.Добавить(МедосмотрВыездФамилия);
		ПроверяемыеРеквизиты.Добавить(МедосмотрВыездИмя);
			
	КонецЕсли;
	
	Если ДанныеДокумента.ПослерейсовыйМедосмотрТребуется Тогда
		Если ДанныеДокумента.ПослеРейса_МедосмотрСторонняяОрганизация Тогда
			Если Не ЗначениеЗаполнено(ДанныеДокумента.ПослеРейса_МедицинскаяОрганизация) Тогда
				ПослеРейса_ОрганизацияСтрокой = "ПослеРейса_ОрганизацияСтрокой";
				ДанныеЮрЛицМедосмотрЗаезд = ФЛК("ДанныеЮрЛицМедосмотрЗаезд", ПослеРейса_ОрганизацияСтрокой,
					"Не заполнена организация медработника заезд");
					
				ДанныеЮрЛицМедосмотрЗаездНаименование = ФЛК("ДанныеЮрЛицМедосмотрЗаезд.НаименованиеОрганизации",
					ПослеРейса_ОрганизацияСтрокой, "Не заполнено наименование организации медработника заезд");
					
				ПроверяемыеРеквизиты.Добавить(
					ФЛК("ДанныеЮрЛицМедосмотрЗаезд.ИНН", ПослеРейса_ОрганизацияСтрокой, "Не заполнен ИНН организации медработника"));
				ПроверяемыеРеквизиты.Добавить(
					ФЛК("ДанныеЮрЛицМедосмотрЗаезд.Имя", ПослеРейса_ОрганизацияСтрокой, "Не заполнено Имя организации медработника"));
				ПроверяемыеРеквизиты.Добавить(
					ФЛК("ДанныеЮрЛицМедосмотрЗаезд.Фамилия", ПослеРейса_ОрганизацияСтрокой, "Не заполнена Фамилия организации медработника"));
					
				ПроверяемыеРеквизиты.Добавить(ДанныеЮрЛицМедосмотрЗаезд);
				ПроверяемыеРеквизиты.Добавить(ДанныеЮрЛицМедосмотрЗаездНаименование);
			 КонецЕсли;
		Иначе
			
			МедосмотрЗаездСтрокой = "МедосмотрЗаездСтрокой";
			
			МедосмотрЗаезд = ФЛК("ОтветственныйМедосмотрЗаезд", МедосмотрЗаездСтрокой,
				"Не заполнен медработник послерейсового медосмотра");
				
			МедосмотрЗаездФамилия = ФЛК("ОтветственныйМедосмотрЗаезд.Фамилия", МедосмотрЗаездСтрокой,
				"Не заполнена фамилия медработника послерейсового медосмотра");
			
			МедосмотрЗаездИмя = ФЛК("ОтветственныйМедосмотрЗаезд.Имя", МедосмотрЗаездСтрокой,
				"Не заполнено имя медработника послерейсового медосмотра");
				
			ПроверяемыеРеквизиты.Добавить(МедосмотрЗаезд);	
			ПроверяемыеРеквизиты.Добавить(МедосмотрЗаездФамилия);
			ПроверяемыеРеквизиты.Добавить(МедосмотрЗаездИмя);
				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьОдометр(ДанныеДокумента, Ошибки)
	Если ДанныеДокумента.Выезд_Одометр > ДанныеДокумента.Заезд_Одометр Тогда
		ТекстОшибки = "Значение одометра при заезде не может быть меньше значения одометра при выезде";
	Иначе
		Возврат;
	КонецЕсли;
	
	ИмяЗаездОдометр = "Заезд_Одометр";
	СтруктураДанныхОшибки = ФЛК(ИмяЗаездОдометр, ИмяЗаездОдометр, ТекстОшибки);
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДобавитьОшибкуПользователю(
		Ошибки, 
		ИмяЗаездОдометр, 
		СтруктураДанныхОшибки.Ошибка,
		СтруктураДанныхОшибки.РеквизитОбъекта,
		СтруктураДанныхОшибки.ЭлементФормы);
КонецПроцедуры

#КонецОбласти // ФЛК

#Область ДанныеДокумента

Функция ВыгрузкаДанныеВыпуск(СсылкаНаДокумент)
	
	Реквизиты = Новый Массив;
	
	Реквизиты.Добавить("Номер");
	Реквизиты.Добавить("Дата");
	Реквизиты.Добавить("ВидПеревозки");
	Реквизиты.Добавить("ВидТранспортногоСообщения");
	Реквизиты.Добавить("ДокументОснование_Идентификатор");
	Реквизиты.Добавить("ДокументОснование_ОбъектМетаданных");
	Реквизиты.Добавить("Комментарий");
	Реквизиты.Добавить("МестоОтправления"); 
	Реквизиты.Добавить("ИнформацияДляВодителя");
	Реквизиты.Добавить("Направление");
	Реквизиты.Добавить("НомерСбис");
	Реквизиты.Добавить("Оформитель");
	Реквизиты.Добавить("ПризнакНачалаРейса");
	Реквизиты.Добавить("ПослерейсовыйМедосмотрТребуется");
	Реквизиты.Добавить("ВидКоммерческойПеревозки");
	Реквизиты.Добавить("ДатаНачалаИсполнения");
	Реквизиты.Добавить("ДатаОкончанияИсполнения");
	Реквизиты.Добавить("ДоРейса_МедосмотрСторонняяОрганизация");
	Реквизиты.Добавить("ДоРейса_МедицинскаяОрганизация");
	Реквизиты.Добавить("ПослеРейса_МедосмотрСторонняяОрганизация");
	Реквизиты.Добавить("ПослеРейса_МедицинскаяОрганизация");
	Реквизиты.Добавить("ПЛПредыдущий");
	Реквизиты.Добавить("ПЛСледующий");
	Реквизиты.Добавить("Выезд_Одометр");
	Реквизиты.Добавить("Заезд_Одометр");
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("ТранспортныеСредства");
	Таблицы.Добавить("Водители");
	Таблицы.Добавить("ОтветственныйМедосмотрВыезд");
	Таблицы.Добавить("ОтветственныйМедосмотрЗаезд");
	Таблицы.Добавить("ОтветственныйТехосмотр");
	Таблицы.Добавить("АдресаПунктовВыгрузки");
	Таблицы.Добавить("ДанныеЮрЛиц");
	Таблицы.Добавить("ДанныеЮрЛицМедосмотрВыезд");
	Таблицы.Добавить("ДанныеЮрЛицМедосмотрЗаезд");
	Таблицы.Добавить("КонтактныеДанные");
	
	Возврат ДанныеИзБД(СсылкаНаДокумент, Реквизиты, Таблицы);
	
КонецФункции

Функция ВыгрузкаДанныеПредрейсовыйМедосмотр(СсылкаНаДокумент)
	
	Реквизиты = Новый Массив;
	
	Реквизиты.Добавить("Номер");
	Реквизиты.Добавить("Дата");
	Реквизиты.Добавить("Направление");
	Реквизиты.Добавить("ДоРейса_ДатаВремяМедосмотра");
	Реквизиты.Добавить("ДоРейса_МедосмотрСторонняяОрганизация");
	Реквизиты.Добавить("ДоРейса_МедицинскаяОрганизация");	
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("Водители");
	Таблицы.Добавить("ДанныеЮрЛицМедосмотрВыезд");
	Таблицы.Добавить("ОтветственныйМедосмотрВыезд");
	Таблицы.Добавить("ДанныеЮрЛиц");
	Таблицы.Добавить("КонтактныеДанные");
	
	Возврат ДанныеИзБД(СсылкаНаДокумент, Реквизиты, Таблицы);
	
КонецФункции

Функция ВыгрузкаДанныеПредрейсовыйТехосмотр(СсылкаНаДокумент)
	
	Реквизиты = Новый Массив;
	
	Реквизиты.Добавить("Номер");
	Реквизиты.Добавить("Дата");
	Реквизиты.Добавить("ТО_ДатаВремя");
	Реквизиты.Добавить("ТО_ДатаВремяВыпускаВРейс");
	Реквизиты.Добавить("ТО_Комментарий");
	Реквизиты.Добавить("ТО_НеРазрешенВыпускПосле");
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("ТранспортныеСредства");
	Таблицы.Добавить("ОтветственныйТехосмотр");
	Таблицы.Добавить("ДанныеЮрЛиц");
	Таблицы.Добавить("КонтактныеДанные");
	
	Возврат ДанныеИзБД(СсылкаНаДокумент, Реквизиты, Таблицы);
	
КонецФункции

Функция ВыгрузкаДанныеВыпускающий(СсылкаНаДокумент)
	
	Реквизиты = Новый Массив;
	
	Реквизиты.Добавить("Номер");
	Реквизиты.Добавить("Дата");
	Реквизиты.Добавить("Выезд_ДатаВремя");
	Реквизиты.Добавить("Выезд_Одометр");
	Реквизиты.Добавить("Выезд_ОдометрКомментарии");
	Реквизиты.Добавить("ПризнакНачалаРейса");
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("ОтветственныйОдометрВыезд");
	Таблицы.Добавить("ОтветственныйОдометрЗаезд");
	Таблицы.Добавить("ДанныеЮрЛиц");
	Таблицы.Добавить("КонтактныеДанные");
	
	Возврат ДанныеИзБД(СсылкаНаДокумент, Реквизиты, Таблицы);
	
КонецФункции

Функция ВыгрузкаДанныеПринимающий(СсылкаНаДокумент)
	
	Реквизиты = Новый Массив;
	
	Реквизиты.Добавить("Номер");
	Реквизиты.Добавить("Дата");
	Реквизиты.Добавить("Заезд_ДатаВремя");
	Реквизиты.Добавить("Выезд_Одометр");
	Реквизиты.Добавить("Заезд_Одометр");
	Реквизиты.Добавить("Заезд_ОдометрКомментарии");
	Реквизиты.Добавить("ПризнакНачалаРейса");
	Реквизиты.Добавить("ПЛПредыдущий");
	Реквизиты.Добавить("ПЛСледующий");
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("ОтветственныйОдометрЗаезд");
	Таблицы.Добавить("ДанныеЮрЛиц");
	Таблицы.Добавить("КонтактныеДанные");
	
	Возврат ДанныеИзБД(СсылкаНаДокумент, Реквизиты, Таблицы);
	
КонецФункции

Функция ВыгрузкаДанныеПослерейсовыйМедосмотр(СсылкаНаДокумент)
	
	Реквизиты = Новый Массив;
	
	Реквизиты.Добавить("Номер");
	Реквизиты.Добавить("Дата");
	Реквизиты.Добавить("Направление");
	Реквизиты.Добавить("ПослеРейса_ДатаВремяМедосмотра");
	Реквизиты.Добавить("ПослерейсовыйМедосмотрТребуется");
	Реквизиты.Добавить("ПослеРейса_МедосмотрСторонняяОрганизация");
	Реквизиты.Добавить("ПослеРейса_МедицинскаяОрганизация");
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("Водители");
	Таблицы.Добавить("ДанныеЮрЛицМедосмотрЗаезд");
	Таблицы.Добавить("ОтветственныйМедосмотрЗаезд");
	Таблицы.Добавить("ДанныеЮрЛиц");
	Таблицы.Добавить("КонтактныеДанные");
	
	Возврат ДанныеИзБД(СсылкаНаДокумент, Реквизиты, Таблицы);
	
КонецФункции

Функция ДанныеИзБД(СсылкаНаДокумент, Реквизиты, Таблицы)
	
	РезультатФункции = Новый Структура;
	
	РезультатФункции.Вставить("ИмяМетаданных", ПутевойЛист());
	
	// Ссылка всегда должна быть
	Реквизиты.Добавить("Ссылка");
	
	ТекстЗапросаРеквизитов = ТекстЗапросаРеквизитов();
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДобавитьРеквизитыИзБД(
		РезультатФункции, СсылкаНаДокумент, Реквизиты, ТекстЗапросаРеквизитов);
	
	ДобавитьТаблицыИзБД(РезультатФункции, СсылкаНаДокумент, Таблицы);
	
	РезультатФункции.Вставить("ЭтоВО", Ложь);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТекстЗапросаРеквизитов()
	
	РезультатФункции = 
	"ВЫБРАТЬ
	|	ESD_ПутевойЛист.Ссылка КАК Ссылка,
	|	ESD_ПутевойЛист.Номер КАК Номер,
	|	ESD_ПутевойЛист.Дата КАК Дата,
	|	ESD_ПутевойЛист.ВидПеревозки КАК ВидПеревозки,
	|	ESD_ПутевойЛист.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	ESD_ПутевойЛист.Выезд_ДатаВремя КАК Выезд_ДатаВремя,
	|	ESD_ПутевойЛист.Выезд_Одометр КАК Выезд_Одометр,
	|	ESD_ПутевойЛист.Выезд_ОдометрКомментарии КАК Выезд_ОдометрКомментарии,
	|	ESD_ПутевойЛист.ДокументОснование_Идентификатор КАК ДокументОснование_Идентификатор,
	|	ESD_ПутевойЛист.ДокументОснование_ОбъектМетаданных КАК ДокументОснование_ОбъектМетаданных,
	|	ESD_ПутевойЛист.ДоРейса_ДатаВремяМедосмотра КАК ДоРейса_ДатаВремяМедосмотра,
	|	ESD_ПутевойЛист.ДоРейса_КомментарииМедосмотра КАК ДоРейса_КомментарииМедосмотра,
	|	ESD_ПутевойЛист.Заезд_ДатаВремя КАК Заезд_ДатаВремя,
	|	ESD_ПутевойЛист.Заезд_Одометр КАК Заезд_Одометр,
	|	ESD_ПутевойЛист.Заезд_ОдометрКомментарии КАК Заезд_ОдометрКомментарии,
	|	ESD_ПутевойЛист.Комментарий КАК Комментарий,
	|	ESD_ПутевойЛист.МестоОтправления КАК МестоОтправления,
	|	ESD_ПутевойЛист.ИнформацияДляВодителя КАК ИнформацияДляВодителя,
	|	ESD_ПутевойЛист.Направление КАК Направление,
	|	ESD_ПутевойЛист.НомерСбис КАК НомерСбис,
	|	ESD_ПутевойЛист.Организация КАК Оформитель,
	|	ESD_ПутевойЛист.ПослеРейса_ДатаВремяМедосмотра КАК ПослеРейса_ДатаВремяМедосмотра,
	|	ESD_ПутевойЛист.ПослеРейса_КомментарииМедосмотра КАК ПослеРейса_КомментарииМедосмотра,
	|	ESD_ПутевойЛист.ПризнакНачалаРейса КАК ПризнакНачалаРейса,
	|	ESD_ПутевойЛист.ТО_ДатаВремя КАК ТО_ДатаВремя,
	|	ESD_ПутевойЛист.ТО_ДатаВремяВыпускаВРейс КАК ТО_ДатаВремяВыпускаВРейс,
	|	ESD_ПутевойЛист.ТО_Комментарий КАК ТО_Комментарий,
	|	ESD_ПутевойЛист.ТО_НеРазрешенВыпускПосле КАК ТО_НеРазрешенВыпускПосле,
	|	ESD_ПутевойЛист.ПослерейсовыйМедосмотрТребуется КАК ПослерейсовыйМедосмотрТребуется,
	|	ESD_ПутевойЛист.ВидКоммерческойПеревозки КАК ВидКоммерческойПеревозки,
	|	ESD_ПутевойЛист.ДатаНачалаИсполнения КАК ДатаНачалаИсполнения,
	|	ESD_ПутевойЛист.ДатаОкончанияИсполнения КАК ДатаОкончанияИсполнения,
	|	ESD_ПутевойЛист.ДоРейса_МедосмотрСторонняяОрганизация КАК ДоРейса_МедосмотрСторонняяОрганизация,
	|	ESD_ПутевойЛист.ДоРейса_МедицинскаяОрганизация КАК ДоРейса_МедицинскаяОрганизация,
	|	ESD_ПутевойЛист.ПослеРейса_МедосмотрСторонняяОрганизация КАК ПослеРейса_МедосмотрСторонняяОрганизация,
	|	ESD_ПутевойЛист.ПослеРейса_МедицинскаяОрганизация КАК ПослеРейса_МедицинскаяОрганизация,
	|	ESD_ПутевойЛист.ПЛПредыдущий КАК ПЛПредыдущий,
	|	ESD_ПутевойЛист.ПЛСледующий КАК ПЛСледующий
	|ИЗ
	|	Документ.ESD_ПутевойЛист КАК ESD_ПутевойЛист
	|ГДЕ
	|	ESD_ПутевойЛист.Ссылка = &Ссылка";
	
	РезультатФункции = СтрЗаменить(РезультатФункции, "ESD_ПутевойЛист", ПутевойЛист());
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьТаблицыИзБД(СтруктураДанных, СсылкаНаДокумент, Таблицы)
	
	МассивЗапросов = Новый Массив;
	
	УниверсальныйШаблонЗапроса =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	Документ.ESD_ПутевойЛист.%1 КАК ТЧПутевогоЛиста
	|ГДЕ
	|	ТЧПутевогоЛиста.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	УниверсальныйШаблонЗапроса = СтрЗаменить(УниверсальныйШаблонЗапроса, "ESD_ПутевойЛист", ПутевойЛист());
	
	ЗапросДанных = Новый Запрос;
	
	Для Каждого ИмяТаблицы Из Таблицы Цикл
		
		Если ДобавленаТаблицаОтветственных(МассивЗапросов, ИмяТаблицы, ЗапросДанных)
			Или ДобавленаТаблицаЮрЛиц(МассивЗапросов, ИмяТаблицы, ЗапросДанных) Тогда
			Продолжить;
		КонецЕсли;
			
		ТекстЗапроса = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(УниверсальныйШаблонЗапроса, ИмяТаблицы);
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЦикла;
	
	РазделительЗапросов = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ЗапросДанных.Текст = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(МассивЗапросов, РазделительЗапросов);
	ЗапросДанных.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	Результат = ЗапросДанных.ВыполнитьПакет();
	Индекс = 0;
	Пока Индекс < Таблицы.Количество() Цикл
		СтруктураДанных.Вставить(Таблицы[Индекс], Результат[Индекс].Выгрузить());
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ДобавленаТаблицаОтветственных(МассивЗапросов, ИмяТаблицы, ЗапросДанных)
	
	РезультатФункции = Ложь;
	
	ШаблонЗапросаОтветственныхЛиц =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	Документ.ESD_ПутевойЛист.ОтветственныеЛица КАК ESD_ПутевойЛистОтветственныеЛица
	|ГДЕ
	|	ESD_ПутевойЛистОтветственныеЛица.Ссылка = &Ссылка
	|	И ESD_ПутевойЛистОтветственныеЛица.Роль = &Роль
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ШаблонЗапросаОтветственныхЛиц = СтрЗаменить(ШаблонЗапросаОтветственныхЛиц, "ESD_ПутевойЛист", ПутевойЛист());
	
	Если ИмяТаблицы = "Водители" Тогда
		ИмяПараметра = "РольВодитель";
		Роль = ЗначениеМетаданных("ESD_РолиОтветственных.Водитель");
	ИначеЕсли ИмяТаблицы = "ОтветственныйМедосмотрВыезд" Тогда
		ИмяПараметра = "РольМедосмотрВыезд";
		Роль = ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрВыезд");
	ИначеЕсли ИмяТаблицы = "ОтветственныйТехосмотр" Тогда
		ИмяПараметра = "РольТехосмотр";
		Роль = ЗначениеМетаданных("ESD_РолиОтветственных.Техосмотр");
	ИначеЕсли ИмяТаблицы = "ОтветственныйОдометрВыезд" Тогда
		ИмяПараметра = "РольОдометрВыезд";
		Роль = ЗначениеМетаданных("ESD_РолиОтветственных.ОдометрВыезд");
	ИначеЕсли ИмяТаблицы = "ОтветственныйОдометрЗаезд" Тогда
		ИмяПараметра = "РольОдометрЗаезд";
		Роль = ЗначениеМетаданных("ESD_РолиОтветственных.ОдометрЗаезд");
	ИначеЕсли ИмяТаблицы = "ОтветственныйМедосмотрЗаезд" Тогда
		ИмяПараметра = "РольМедосмотрЗаезд";
		Роль = ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрЗаезд");
	Иначе
		ИмяПараметра = "";
		Роль = Неопределено;
	КонецЕсли;
	
	Если Роль <> Неопределено Тогда
		
		ТекстЗапроса = СтрЗаменить(ШаблонЗапросаОтветственныхЛиц, "&Роль", "&" + ИмяПараметра);
		
		ЗапросДанных.УстановитьПараметр(ИмяПараметра, Роль);
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
		РезультатФункции = Истина;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДобавленаТаблицаЮрЛиц(МассивЗапросов, ИмяТаблицы, ЗапросДанных)
	
	РезультатФункции = Ложь;
	
	ШаблонЗапросаДанныхЮрЛиц =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	Документ.ESD_ПутевойЛист.ДанныеЮрЛиц КАК ESD_ПутевойЛистДанныеЮрЛиц
	|ГДЕ
	|	ESD_ПутевойЛистДанныеЮрЛиц.Ссылка = &Ссылка
	|	И ESD_ПутевойЛистДанныеЮрЛиц.Роль = &Роль
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ШаблонЗапросаДанныхЮрЛиц = СтрЗаменить(ШаблонЗапросаДанныхЮрЛиц, "ESD_ПутевойЛист", ПутевойЛист());
	
	Если ИмяТаблицы = "ДанныеЮрЛицМедосмотрВыезд" Тогда
		ИмяПараметра = "РольЮрМедосмотрВыезд";
		Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрВыезд");
	ИначеЕсли ИмяТаблицы = "ДанныеЮрЛицМедосмотрЗаезд" Тогда
		ИмяПараметра = "РольЮрМедосмотрЗаезд";
		Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрЗаезд");
	Иначе
		ИмяПараметра = "";
		Роль = Неопределено;
	КонецЕсли;
	
	Если Роль <> Неопределено Тогда
		
		ТекстЗапроса = СтрЗаменить(ШаблонЗапросаДанныхЮрЛиц, "&Роль", "&" + ИмяПараметра);
		
		ЗапросДанных.УстановитьПараметр(ИмяПараметра, Роль);
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
		РезультатФункции = Истина;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // ДанныеДокумента

#Область Выгрузка

Функция ТитулВыпуск(ДанныеДокумента)
	
	СтруктураТитула = Новый Структура;
	
	// Отдельно вынесены общие данные документа
	Дата               = МодульКода("ESD_ТНВыгрузкаСервер").ЗначениеДатыВремяДляВыгрузки(ДанныеДокумента.Дата, Истина);
	ПризнакНачалаРейса = МодульКода("Перечисления.ESD_ПризнакНачалаРейса").КодПоЗначению(ДанныеДокумента.ПризнакНачалаРейса);
	ВидПеревозки       = МодульКода("Перечисления.ESD_ВидПеревозки").КодПоЗначению(ДанныеДокумента.ВидПеревозки);
	
	ПослерейсовыйМедосмотрТребуется = ?(ДанныеДокумента.ПослерейсовыйМедосмотрТребуется, "1", "2");
	
	ВидКоммерческойПеревозки = МодульКода("Перечисления.ESD_ВидКоммерческойПеревозки").КодПоЗначению(
		ДанныеДокумента.ВидКоммерческойПеревозки);
		
	ВидТранспортногоСообщения = МодульКода("Перечисления.ESD_ВидСообщенияЭПЛ").КодПоЗначению(
		ДанныеДокумента.ВидТранспортногоСообщения);
		
	// на данном этапе точно не знаем признак окончания рейса
	// но это нужно для корректной загрузки данных по одометру
	ПризнакОкончанияРейса = 1;
		
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("Номер",                    ДанныеДокумента.НомерСбис);
	СтруктураДокумента.Вставить("Дата",                     Дата);
	СтруктураДокумента.Вставить("ПризнакНачалаРейса",       ПризнакНачалаРейса);
	СтруктураДокумента.Вставить("ПризнакОкончанияРейса",    ПризнакОкончанияРейса);
	СтруктураДокумента.Вставить("ПослерейсовыйМедосмотр",   ПослерейсовыйМедосмотрТребуется);
	СтруктураДокумента.Вставить("ВидПеревозки",             ВидПеревозки);
	СтруктураДокумента.Вставить("ВидКоммерческойПеревозки", ВидКоммерческойПеревозки);
	СтруктураДокумента.Вставить("ВидСообщения",             ВидТранспортногоСообщения);
	
	СтруктураДокумента.Вставить(
		"Оформитель",
		МодульКода("ESD_ТНВыгрузкаСервер").ДанныеЮрЛица("Оформитель", ДанныеДокумента, Истина));
	
	ДобавитьСрокПутевогоЛиста(СтруктураДокумента, ДанныеДокумента);
	
	СтруктураТитула.Вставить("Документ", СтруктураДокумента);
	
	СтруктураТитула.Вставить("Маршрут", ДанныеУзлаМаршрут(ДанныеДокумента));
	
	СтруктураТитула.Вставить(
		"ТранспортноеСредство",
		МодульКода("ESD_ТНВыгрузкаСервер").ПодстановкиТранспортногоСредства(ДанныеДокумента, , Истина));
		
	СтруктураТитула.ТранспортноеСредство.Вставить(
		"Прицеп", 
		МодульКода("ESD_ТНВыгрузкаСервер").ПодстановкиПрицепов(ДанныеДокумента, Истина));
	
	СтруктураТитула.Вставить(
		"Водители", 
		МодульКода("ESD_ТНВыгрузкаСервер").ПодстановкиВодителя(ДанныеДокумента.Водители, Новый Массив, , Истина));
	
	ДобавитьДанныеСотрудникаПоВодителям(СтруктураТитула, СтруктураДокумента.Оформитель);
	
	ДобавитьМедосмотрДляОнлайна(СтруктураТитула, ДанныеДокумента, Истина);
	
	ДобавитьТехосмотрДляОнлайна(СтруктураТитула, ДанныеДокумента);
	
	Если ДанныеДокумента.ПослерейсовыйМедосмотрТребуется Тогда
		ДобавитьМедосмотрДляОнлайна(СтруктураТитула, ДанныеДокумента, Ложь);
	КонецЕсли;
	
	ДобавитьЗаменуВодителя(СтруктураТитула, ДанныеДокумента.ПЛПредыдущий);
	
	Возврат СтруктураТитула;
	
КонецФункции

Функция ТитулПредрейсовыйМедосмотр(ДанныеДокумента, СтруктураТитула = Неопределено)
	
	РезультатФункции = СтруктураТитула;
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = Новый Структура;
	КонецЕсли;
	
	ДобавитьМедосмотрДляОнлайна(РезультатФункции, ДанныеДокумента, Истина);
	
	Возврат РезультатФункции;
		
КонецФункции

Функция ТитулПредрейсовыйТехосмотр(ДанныеДокумента, СтруктураТитула = Неопределено)
	
	РезультатФункции = СтруктураТитула;
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = Новый Структура;
	КонецЕсли;
	
	ДобавитьТехосмотрДляОнлайна(РезультатФункции, ДанныеДокумента);
	
	РезультатФункции.Вставить(
		"ТранспортноеСредство",
		МодульКода("ESD_ТНВыгрузкаСервер").ПодстановкиТранспортногоСредства(ДанныеДокумента, , Истина));
		
	РезультатФункции.ТранспортноеСредство.Вставить(
		"Прицеп", 
		МодульКода("ESD_ТНВыгрузкаСервер").ПодстановкиПрицепов(ДанныеДокумента, Истина));
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТитулВыпускающий(ДанныеДокумента, СтруктураТитула = Неопределено)
	
	РезультатФункции = СтруктураТитула;
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = Новый Структура;
	КонецЕсли;
	
	Выпуск = Новый Структура;
	
	Организация = МодульКода("ESD_ТНВыгрузкаСервер").ДанныеЮрЛица("Оформитель", ДанныеДокумента, Истина);
	
	Если ДанныеДокумента.ОтветственныйОдометрВыезд.Количество() Тогда
		ДобавитьОтветственного(РезультатФункции, Выпуск, ДанныеДокумента.ОтветственныйОдометрВыезд[0], Организация);
	КонецЕсли;
	
	ПризнакНачалаРейса = ДанныеДокумента.ПризнакНачалаРейса;
	
	Выезд = Новый Структура;
	Выезд.Вставить("Одометр", Формат(ДанныеДокумента.Выезд_Одометр, "ЧЦ=7; ЧДЦ=0; ЧГ="));
	Выезд.Вставить("ДатаВремя",
		МодульКода("ESD_ТНВыгрузкаСервер").ЗначениеДатыВремяДляВыгрузки(ДанныеДокумента.Выезд_ДатаВремя));
		
	Если ПризнакНачалаРейса = ЗначениеМетаданных("ESD_ПризнакНачалаРейса.ВыездСПарковки") Тогда
		Выпуск.Вставить("Выезд", Выезд);
	Иначе
		Выпуск.Вставить("ПриемТС", Выезд);
	КонецЕсли;
	
	РезультатФункции.Вставить("Выпуск", Выпуск);
	
	Приемка = Новый Структура;
	
	Если ДанныеДокумента.ОтветственныйОдометрЗаезд.Количество() Тогда
		ДобавитьОтветственного(РезультатФункции, Приемка, ДанныеДокумента.ОтветственныйОдометрЗаезд[0], Организация);
	КонецЕсли;
	
	РезультатФункции.Вставить("Приемка", Приемка);
	
	Если Не РезультатФункции.Свойство("Документ") Тогда
		ПризнакНачалаРейса = МодульКода("Перечисления.ESD_ПризнакНачалаРейса").КодПоЗначению(ПризнакНачалаРейса);
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("ПризнакНачалаРейса", ПризнакНачалаРейса);
		РезультатФункции.Вставить("Документ", СтруктураДокумента);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТитулПринимающий(ДанныеДокумента, СтруктураТитула = Неопределено)
	
	РезультатФункции = СтруктураТитула;
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = Новый Структура;
	КонецЕсли;
	
	Приемка = Новый Структура;
	
	ЗаездДатаВремя = МодульКода("ESD_ТНВыгрузкаСервер").ЗначениеДатыВремяДляВыгрузки(ДанныеДокумента.Заезд_ДатаВремя);
	
	Заезд = Новый Структура;
	Заезд.Вставить("Одометр", Формат(ДанныеДокумента.Заезд_Одометр, "ЧЦ=7; ЧДЦ=0; ЧГ="));
	Заезд.Вставить("ДатаВремя", ЗаездДатаВремя);
		
	Если ЗначениеЗаполнено(ДанныеДокумента.ПЛСледующий) Тогда
		Приемка.Вставить("СдачаТС", Заезд);
	Иначе
		Приемка.Вставить("Заезд", Заезд);
	КонецЕсли;
	
	Организация = МодульКода("ESD_ТНВыгрузкаСервер").ДанныеЮрЛица("Оформитель", ДанныеДокумента, Истина);
	
	Если ДанныеДокумента.ОтветственныйОдометрЗаезд.Количество() Тогда
		ДобавитьОтветственного(РезультатФункции, Приемка, ДанныеДокумента.ОтветственныйОдометрЗаезд[0], Организация);
	КонецЕсли;
	
	РезультатФункции.Вставить("Приемка", Приемка);
	
	Если Не РезультатФункции.Свойство("Документ") Тогда
		
		Если ЗначениеЗаполнено(ДанныеДокумента.ПЛСледующий) Тогда
			ПризнакОкончанияРейса = 2; // Сдача след. водителю
		Иначе	
			ПризнакОкончанияРейса = 1; // Заезд в гараж
		КонецЕсли;
		
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("ПризнакОкончанияРейса", ПризнакОкончанияРейса);
		РезультатФункции.Вставить("Документ", СтруктураДокумента);
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТитулПослерейсовыйМедосмотр(ДанныеДокумента, СтруктураТитула = Неопределено)
	РезультатФункции = СтруктураТитула;
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = Новый Структура;
	КонецЕсли;
	
	Если ДанныеДокумента["ПослерейсовыйМедосмотрТребуется"] Тогда
		ДобавитьМедосмотрДляОнлайна(РезультатФункции, ДанныеДокумента, Ложь);
	КонецЕсли;

	Возврат РезультатФункции;
КонецФункции

Функция ДанныеУзлаМаршрут(ДанныеДокумента)
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Отправление", 	  АдресМаршрута(ДанныеДокумента.МестоОтправления, ,
																ДанныеДокумента.ИнформацияДляВодителя));
	РезультатФункции.Вставить("Пункт",            Новый Массив);
	РезультатФункции.Вставить("Грузоотправитель", Новый Массив);
	
	Для Каждого ДанныеАдресаМаршрута Из ДанныеДокумента.АдресаПунктовВыгрузки Цикл
		СтруктураАдреса = МодульКода("ESD_ТНОбщегоНазначенияСервер").ДесериализоватьЗначение(ДанныеАдресаМаршрута.Структура);
		Если ЗначениеЗаполнено(СтруктураАдреса) Тогда
			КодСтраны = СтруктураАдреса.КодСтраны;
		Иначе
			КодСтраны = Неопределено;
		КонецЕсли;
		АдресМаршрута = АдресМаршрута(ДанныеАдресаМаршрута.Значение, КодСтраны, ДанныеАдресаМаршрута.ИнформацияДляВодителя);
		
		РезультатФункции.Пункт.Добавить(АдресМаршрута);

	КонецЦикла;
	
	РольКонтрагента = ЗначениеМетаданных("ESD_РолиКонтрагентов.Отправитель");
	
	Для Каждого СтрокаДанныхЮрЛиц Из ДанныеДокумента.ДанныеЮрЛиц Цикл
		Если СтрокаДанныхЮрЛиц.Роль <> РольКонтрагента Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДанных = МодульКода("ESD_ТНВыгрузкаСервер").ОбщийШаблонЮрЛица(ДанныеДокумента.ИмяМетаданных);
		ДопПараметры = МодульКода("ESD_ТНВыгрузкаСервер").ДопПараметрыЗаполненияОсновныхДанных(Ложь, Неопределено);
		МодульКода("ESD_ТНВыгрузкаСервер").ОсновныеДанныеЮрЛицаИзДокумента(СтрокаДанныхЮрЛиц, СтруктураДанных, ДопПараметры);
		
		РезультатФункции.Грузоотправитель.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция АдресМаршрута(АдресТекст, Знач КодСтраны = Неопределено, Комментарий = "")
	
	Если КодСтраны = Неопределено Тогда
		КодСтраны = "643";
	КонецЕсли;
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("КодСтраны",  КодСтраны);
	РезультатФункции.Вставить("АдресТекст", АдресТекст);
	РезультатФункции.Вставить("Комментарий",  Комментарий);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьСрокПутевогоЛиста(СтруктураДокумента, РеквизитыОбъекта)

	ВремяНачалаИсполнения = Формат(РеквизитыОбъекта.ДатаНачалаИсполнения, "ДФ=ЧЧ:мм");
	ВремяКонцаИсполнения = Формат(РеквизитыОбъекта.ДатаОкончанияИсполнения, "ДФ=ЧЧ:мм");	
	
	Если НачалоДня(РеквизитыОбъекта.ДатаНачалаИсполнения) = НачалоДня(РеквизитыОбъекта.ДатаОкончанияИсполнения) Тогда
		СтруктураДокумента.Вставить("Длительность", "1");
		СтруктураДокумента.Вставить(
			"ДатаИсполнения",
			МодульКода("ESD_ТНВыгрузкаСервер").ЗначениеДатыВремяДляВыгрузки(РеквизитыОбъекта.ДатаНачалаИсполнения, Истина));
			
		Если ВремяНачалаИсполнения <> "00:00" ИЛИ ВремяКонцаИсполнения <> "00:00" Тогда
			СтруктураДокумента.Вставить("ВремяНачалаИсполнения", ВремяНачалаИсполнения);
			СтруктураДокумента.Вставить("ВремяКонцаИсполнения", ВремяКонцаИсполнения);
		КонецЕсли;	
	Иначе
		СтруктураДокумента.Вставить("Длительность", "2");
		СтруктураДокумента.Вставить(
			"ДатаНачалаИсполнения",
			МодульКода("ESD_ТНВыгрузкаСервер").ЗначениеДатыВремяДляВыгрузки(РеквизитыОбъекта.ДатаНачалаИсполнения, Истина));
		СтруктураДокумента.Вставить(
			"ДатаКонцаИсполнения",
			МодульКода("ESD_ТНВыгрузкаСервер").ЗначениеДатыВремяДляВыгрузки(РеквизитыОбъекта.ДатаОкончанияИсполнения, Истина));
			
		СтруктураДокумента.Вставить("ВремяНачалаИсполнения", ВремяНачалаИсполнения);
		СтруктураДокумента.Вставить("ВремяКонцаИсполнения", ВремяКонцаИсполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьМедосмотрДляОнлайна(СтруктураДанных, ДанныеДокумента, ЭтоПредрейсовыйМедосмотр)
	
	КлючДанныхЮрЛиц = "ДанныеЮрЛиц";
	
	Если ЭтоПредрейсовыйМедосмотр Тогда // до рейса
		
		РольЮрЛица               	= "МедосмотрВыезд";
		РеквизитМедОрганизация		= "ДоРейса_МедицинскаяОрганизация";
		ОтветственныйЗаМедосмотр 	= ДанныеДокумента.ОтветственныйМедосмотрВыезд;
		ИмяУзлаМедосмотра        	= "Медосмотр";
		ШтатныйСотрудник         	= Не ДанныеДокумента.ДоРейса_МедосмотрСторонняяОрганизация;
		
		Если Не ДанныеДокумента.Свойство(КлючДанныхЮрЛиц) Тогда
			ДанныеДокумента.Вставить(КлючДанныхЮрЛиц, ДанныеДокумента.ДанныеЮрЛицМедосмотрВыезд);
		КонецЕсли;
		
	Иначе       // после рейса
		
		РольЮрЛица               	= "МедосмотрЗаезд";
		РеквизитМедОрганизация		= "ПослеРейса_МедицинскаяОрганизация";
		ОтветственныйЗаМедосмотр 	= ДанныеДокумента.ОтветственныйМедосмотрЗаезд;
		ИмяУзлаМедосмотра        	= "ПостМедосмотр";
		ШтатныйСотрудник         	= Не ДанныеДокумента.ПослеРейса_МедосмотрСторонняяОрганизация;
		
		Если Не ДанныеДокумента.Свойство(КлючДанныхЮрЛиц) Тогда
			ДанныеДокумента.Вставить(КлючДанныхЮрЛиц, ДанныеДокумента.ДанныеЮрЛицМедосмотрЗаезд);
		КонецЕсли;
		
	КонецЕсли;
	
	ОтветственныйЗаполнен = Истина;
	Если ОтветственныйЗаМедосмотр.Количество() = 0 Тогда
		СтрокаОтветственногоЗаМедосмотр = ОтветственныйЗаМедосмотр.Добавить();
		СтрокаОтветственногоЗаМедосмотр.Серия          = "";
		СтрокаОтветственногоЗаМедосмотр.Номер          = "";
		СтрокаОтветственногоЗаМедосмотр.Фамилия        = "";
		СтрокаОтветственногоЗаМедосмотр.Имя            = "";
		СтрокаОтветственногоЗаМедосмотр.Отчество       = "";
		СтрокаОтветственногоЗаМедосмотр.Должность      = "";
		СтрокаОтветственногоЗаМедосмотр.ТабельныйНомер = "";
		ОтветственныйЗаполнен = Ложь;
	КонецЕсли;
	
	ОтветственныйЗаМедосмотр = ОтветственныйЗаМедосмотр[0];
	
	Медосмотр = Новый Соответствие;
	
	МодульТНВыгрузкаСервер = МодульКода("ESD_ТНВыгрузкаСервер");

	Лицензия = Новый Структура;
	Лицензия.Вставить("Серия", ОтветственныйЗаМедосмотр.Серия);
	Лицензия.Вставить("Номер", ОтветственныйЗаМедосмотр.Номер);
	Лицензия.Вставить(
		"ДатаВыдачи",
		МодульТНВыгрузкаСервер.ЗначениеДатыВремяДляВыгрузки(ОтветственныйЗаМедосмотр.ДатаВыдачи, Истина));
	Лицензия.Вставить(
		"Срок",
		МодульТНВыгрузкаСервер.ЗначениеДатыВремяДляВыгрузки(ОтветственныйЗаМедосмотр.ДатаОкончанияДействия, Истина));
		
	Ответственный = Новый Структура;
	Ответственный.Вставить("Фамилия",         ОтветственныйЗаМедосмотр.Фамилия);
	Ответственный.Вставить("Имя",             ОтветственныйЗаМедосмотр.Имя);
	Ответственный.Вставить("Отчество",        ОтветственныйЗаМедосмотр.Отчество);
	Ответственный.Вставить("Должность",       ОтветственныйЗаМедосмотр.Должность);
	Ответственный.Вставить("ИдентификаторИС", ИдентификаторИССотрудника(ОтветственныйЗаМедосмотр));
	Ответственный.Вставить("ТабельныйНомер",  ОтветственныйЗаМедосмотр.ТабельныйНомер);
	
	Если ШтатныйСотрудник И ДанныеДокумента.Направление = ЗначениеМетаданных("ESD_Направление.Исходящий") Тогда // Сотрудник
		
		Ответственный.Вставить("Лицензия", Лицензия);
		Медосмотр.Вставить("Ответственный", Ответственный);
		
		ОрганизацияМедработника = МодульТНВыгрузкаСервер.ДанныеЮрЛица("Оформитель", ДанныеДокумента, Истина);
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеДокумента[РеквизитМедОрганизация]) Тогда  // ЭСМО
		
		ВнешняяСистема = Новый Структура;
		ВнешняяСистема.Вставить("Идентификатор", МодульКода("Перечисления.ESD_МедицинскиеОрганизации").ИдентификаторПоЗначению(ДанныеДокумента[РеквизитМедОрганизация]));
		
		Медосмотр.Вставить("ВнешняяСистема", ВнешняяСистема);  
		
	Иначе    // Организация 
		
		ОрганизацияМедработника = МодульТНВыгрузкаСервер.ДанныеЮрЛица(РольЮрЛица, ДанныеДокумента, Истина);
		Медосмотр.Вставить("Контрагент", МодульТНВыгрузкаСервер.РеквизитыНашейОрганизации(ОрганизацияМедработника));
		
		Организация = Новый Структура;
		Организация.Вставить("Лицензия",      Лицензия);
		Организация.Вставить("Ответственный", Ответственный);
		Организация.Вставить("Название",      ОрганизацияМедработника.Название.Полное);
		
		Медосмотр.Вставить("Организация", Организация);
		
	КонецЕсли;
	
	Если ОтветственныйЗаполнен Тогда
		ДобавитьДанныеСотрудников(СтруктураДанных, Ответственный, ОрганизацияМедработника);
	КонецЕсли;
	
	Если ДанныеДокумента.Свойство("ДоРейса_ДатаВремяМедосмотра") Тогда
		ДобавитьРезультатОсмотра(
			Медосмотр,
			ДанныеДокумента.ДоРейса_ДатаВремяМедосмотра,
			"");
	КонецЕсли;
	
	Если ДанныеДокумента.Свойство("ПослеРейса_ДатаВремяМедосмотра") Тогда
		ДобавитьРезультатОсмотра(
			Медосмотр,
			ДанныеДокумента.ПослеРейса_ДатаВремяМедосмотра,
			"");
	КонецЕсли;
	
	СтруктураДанных.Вставить(ИмяУзлаМедосмотра, Медосмотр);
	
	СтруктураДанных.Вставить("ШтатныйСотрудник", ШтатныйСотрудник);
	
КонецПроцедуры

Процедура ДобавитьТехосмотрДляОнлайна(СтруктураДанных, ДанныеДокумента)
	
	Если ДанныеДокумента.ОтветственныйТехосмотр.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтветственныйЗаТехосмотр = ДанныеДокумента.ОтветственныйТехосмотр[0];
	
	Техосмотр = Новый Структура;
	
	Ответственный = Новый Структура;
	Ответственный.Вставить("Фамилия",         ОтветственныйЗаТехосмотр.Фамилия);
	Ответственный.Вставить("Имя",             ОтветственныйЗаТехосмотр.Имя);
	Ответственный.Вставить("Отчество",        ОтветственныйЗаТехосмотр.Отчество);
	Ответственный.Вставить("Должность",       ОтветственныйЗаТехосмотр.Должность);
	Ответственный.Вставить("ИдентификаторИС", ИдентификаторИССотрудника(ОтветственныйЗаТехосмотр));
	Ответственный.Вставить("ТабельныйНомер",  ОтветственныйЗаТехосмотр.ТабельныйНомер);
	Техосмотр.Вставить("Ответственный", Ответственный);
	
	Организация = МодульКода("ESD_ТНВыгрузкаСервер").ДанныеЮрЛица("Оформитель", ДанныеДокумента, Истина);
	
	ДобавитьДанныеСотрудников(СтруктураДанных, Ответственный, Организация);
	
	Если ДанныеДокумента.Свойство("ТО_ДатаВремя") Тогда
		ДобавитьРезультатОсмотра(
			Техосмотр,
			ДанныеДокумента.ТО_ДатаВремя,
			ДанныеДокумента.ТО_Комментарий);
	КонецЕсли;
		
	Если ДанныеДокумента.Свойство("ТО_НеРазрешенВыпускПосле") И Не ДанныеДокумента.ТО_НеРазрешенВыпускПосле Тогда
		
		Техосмотр.Вставить("ВыпускНаЛинию", Новый Структура);
		Техосмотр.ВыпускНаЛинию.Вставить(
			"ДатаВремя",
			МодульКода("ESD_ТНВыгрузкаСервер").ЗначениеДатыВремяДляВыгрузки(ДанныеДокумента.ТО_ДатаВремяВыпускаВРейс));
	КонецЕсли;
	
	СтруктураДанных.Вставить("Техосмотр", Техосмотр);
	
КонецПроцедуры

Процедура ДобавитьРезультатОсмотра(СтруктураДанных, ДатаВремя, Отметка)
	
	Если Не ЗначениеЗаполнено(ДатаВремя) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Отметка",   Отметка);
	СтруктураРезультата.Вставить("ДатаВремя", МодульКода("ESD_ТНВыгрузкаСервер").ЗначениеДатыВремяДляВыгрузки(ДатаВремя));
	
	СтруктураДанных.Вставить("Результат", СтруктураРезультата);
	
КонецПроцедуры

Процедура ДобавитьДанныеСотрудникаПоВодителям(СтруктураТитула, Организация)
	
	Для Каждого СтруктураВодителя Из СтруктураТитула.Водители.Водитель Цикл
		СтруктураВодителя.Вставить("ИдентификаторИС", ИдентификаторИССотрудника(СтруктураВодителя));
		ДобавитьДанныеСотрудников(СтруктураТитула, СтруктураВодителя, Организация);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДанныеСотрудников(СтруктураТитула, СтруктураОтветственного, Организация)
	
	Если Не СтруктураТитула.Свойство("ДанныеСотрудников") Тогда
		СтруктураТитула.Вставить("ДанныеСотрудников", Новый Массив);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураОтветственного.Фамилия) Или Не ЗначениеЗаполнено(СтруктураОтветственного.Имя) Тогда
		Возврат;
	КонецЕсли;
	
	Сотрудник = Новый Структура;
	Сотрудник.Вставить("Фамилия",         СтруктураОтветственного.Фамилия);
	Сотрудник.Вставить("Имя",             СтруктураОтветственного.Имя);
	Сотрудник.Вставить("Отчество",        СтруктураОтветственного.Отчество);
	Сотрудник.Вставить("ИдентификаторИС", ИдентификаторИССотрудника(СтруктураОтветственного));
	Сотрудник.Вставить("ТабельныйНомер",  СтруктураОтветственного.ТабельныйНомер);
	Сотрудник.Вставить("Подстановки",     Новый Массив);
	Сотрудник.Вставить("Организация",     МодульКода("ESD_ТНВыгрузкаСервер").РеквизитыНашейОрганизации(Организация));
	
	Для Каждого СтруктураСотрудника Из СтруктураТитула.ДанныеСотрудников Цикл
		СовпадаетТабельныйНомер = ЗначениеЗаполнено(Сотрудник.ТабельныйНомер)
			И СтруктураСотрудника.ТабельныйНомер = Сотрудник.ТабельныйНомер;
		Если СтруктураСотрудника.ИдентификаторИС = Сотрудник.ИдентификаторИС Или СовпадаетТабельныйНомер Тогда
			СтруктураСотрудника.Подстановки.Добавить(СтруктураОтветственного);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Сотрудник.Подстановки.Добавить(СтруктураОтветственного);
	СтруктураТитула.ДанныеСотрудников.Добавить(Сотрудник);
	
КонецПроцедуры

Функция ИдентификаторИССотрудника(СтруктураОтветственного)
	
	МассивФИО = Новый Массив;
	МассивФИО.Добавить(СокрЛП(СтруктураОтветственного.Фамилия));
	МассивФИО.Добавить(СокрЛП(СтруктураОтветственного.Имя));
	МассивФИО.Добавить(СокрЛП(СтруктураОтветственного.Отчество));
	
	Возврат МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(МассивФИО, "");
	
КонецФункции

Процедура ДобавитьОтветственного(СтруктураТитула, СтруктураДанных, СтрокаОтветственного, Организация)
	
	Ответственный = Новый Структура;
	Ответственный.Вставить("Фамилия",         СтрокаОтветственного.Фамилия);
	Ответственный.Вставить("Имя",             СтрокаОтветственного.Имя);
	Ответственный.Вставить("Отчество",        СтрокаОтветственного.Отчество);
	Ответственный.Вставить("Должность",       СтрокаОтветственного.Должность);
	Ответственный.Вставить("ИдентификаторИС", ИдентификаторИССотрудника(СтрокаОтветственного));
	Ответственный.Вставить("ТабельныйНомер",  СтрокаОтветственного.ТабельныйНомер);
	
	ДобавитьДанныеСотрудников(СтруктураТитула, Ответственный, Организация);
	
	СтруктураДанных.Вставить("Ответственный", Ответственный);
	
КонецПроцедуры

Процедура ДобавитьЗаменуВодителя(СтруктураТитула, ПЛПредыдущий)

	Если ПустаяСтрока(ПЛПредыдущий) Тогда 
		Возврат;
	КонецЕсли;	
		
	СтруктураТитула.Документ.Вставить("ПредыдущийИдентификаторВИ", ПЛПредыдущий);
	
КонецПроцедуры

#КонецОбласти // Выгрузка

#Область Загрузка

Процедура ЗагрузкаТитулаВыпуск(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	Если Не Вложения.Количество() Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеВыпуск = ДанныеВыпуск(ОбъектДок, Вложения, Титул, ДопПараметры);
	
	ДанныеТитула = ДанныеВыпуск[ДанныеВыпуск.ВГраница()];
	
	Если Не ДопПараметры.ТолькоАктивныйЭтап Тогда
		
		ЗаполнитьЗначенияСвойств(ОбъектДок, ДанныеТитула.ДляДокумента);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьДанныеЮрЛицИКонтактнуюИнформацию(
			ОбъектДок, ДанныеТитула.ДляДокумента, ЗначениеМетаданных("ESD_РолиКонтрагентов.Оформитель"), ДопПараметры);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьДанныеТСИПрицеповДокумента(ОбъектДок, ДанныеТитула.ДляДокумента);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьОтветственныхЛиц(
			ОбъектДок, ДанныеТитула.ДляДокумента.ОтветственныеЛица, ЗначениеМетаданных("ESD_РолиОтветственных.Водитель"));
			
		ЗаполнитьАдресаПунктовВыгрузки(ОбъектДок, ДанныеТитула.ДляДокумента);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьОтветственныхЛиц(
			ОбъектДок, ДанныеТитула.ДляДокумента.ОтветственныеЗаМедосмотр, ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрВыезд"));
			
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьДанныеЮрЛицИКонтактнуюИнформацию(
			ОбъектДок, ДанныеТитула.ДляДокумента, ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрВыезд"), ДопПараметры);
			
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьОтветственныхЛиц(
			ОбъектДок, ДанныеТитула.ДляДокумента.ОтветственныеЗаТехосмотр, ЗначениеМетаданных("ESD_РолиОтветственных.Техосмотр"));
			
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьОтветственныхЛиц(
			ОбъектДок,
			ДанныеТитула.ДляДокумента.ОтветственныеЗаМедосмотрЗаезд,
			ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрЗаезд"));
			
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьДанныеЮрЛицИКонтактнуюИнформацию(
			ОбъектДок, ДанныеТитула.ДляДокумента, ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрЗаезд"), ДопПараметры);
			
	Иначе
		
		ЗаполнитьЗначенияСвойств(ОбъектДок, ДанныеТитула.ДляДокумента, "НомерСбис");
			
	КонецЕсли;
	
	Если ДопПараметры.ЗагрузкаСОнлайна Тогда
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ЗаписатьДанные(ДанныеВыпуск, ОбъектДок, ДопПараметры.ИмяМетаданных);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузкаТитулаПредрейсовыйМедосмотр(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	Если Не Вложения.Количество() Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеПредрейсовыйМедосмотр = ДанныеПредрейсовыйМедосмотр(ОбъектДок, Вложения, Титул, ДопПараметры);
	
	ДанныеТитула = ДанныеПредрейсовыйМедосмотр[ДанныеПредрейсовыйМедосмотр.ВГраница()];
	ЗаполнитьЗначенияСвойств(ОбъектДок, ДанныеТитула.ДляДокумента);
	
	Если Не ДопПараметры.ТолькоАктивныйЭтап Тогда
		
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьДанныеЮрЛицИКонтактнуюИнформацию(
			ОбъектДок, ДанныеТитула.ДляДокумента, ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрВыезд"), ДопПараметры);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьОтветственныхЛиц(
			ОбъектДок, ДанныеТитула.ДляДокумента.ОтветственныеЗаМедосмотр, ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрВыезд"));
			
	КонецЕсли;
	
	Если ДопПараметры.ЗагрузкаСОнлайна Тогда
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ЗаписатьДанные(
			ДанныеПредрейсовыйМедосмотр, ОбъектДок, ДопПараметры.ИмяМетаданных);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузкаТитулаПредрейсовыйТехосмотр(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	Если Не Вложения.Количество() Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеПредрейсовыйТехосмотр = ДанныеПредрейсовыйТехосмотр(ОбъектДок, Вложения, Титул, ДопПараметры);
	
	ДанныеТитула = ДанныеПредрейсовыйТехосмотр[ДанныеПредрейсовыйТехосмотр.ВГраница()];
	
	Если Не ДопПараметры.ТолькоАктивныйЭтап Тогда
		МодульЗагрузкаСервер = МодульКода("ESD_ТНЗагрузкаСервер");
		ЗаполнитьЗначенияСвойств(ОбъектДок, ДанныеТитула.ДляДокумента);
		МодульЗагрузкаСервер.ЗаполнитьДанныеТСИПрицеповДокумента(ОбъектДок, ДанныеТитула.ДляДокумента);
		МодульЗагрузкаСервер.ЗаполнитьОтветственныхЛиц(
			ОбъектДок, ДанныеТитула.ДляДокумента.ОтветственныеЗаТехосмотр, ЗначениеМетаданных("ESD_РолиОтветственных.Техосмотр"));
	Иначе
		ЗаполнитьЗначенияСвойств(ОбъектДок, ДанныеТитула.ДляДокумента,
			"ТО_НеРазрешенВыпускПосле,ТО_ДатаВремя,ТО_ДатаВремяВыпускаВРейс");
	КонецЕсли;
	
	Если ДопПараметры.ЗагрузкаСОнлайна Тогда
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ЗаписатьДанные(
			ДанныеПредрейсовыйТехосмотр, ОбъектДок, ДопПараметры.ИмяМетаданных);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузкаТитулаВыпускающий(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	Если Не Вложения.Количество() Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеВыпускающий = ДанныеВыпускающий(ОбъектДок, Вложения, Титул, ДопПараметры);
	
	Если Не ДопПараметры.ТолькоАктивныйЭтап Тогда
		
		ДанныеТитула = ДанныеВыпускающий[ДанныеВыпускающий.ВГраница()];
		
		ЗаполнитьЗначенияСвойств(ОбъектДок, ДанныеТитула.ДляДокумента);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьОтветственныхЛиц(
			ОбъектДок, ДанныеТитула.ДляДокумента.ОтветственныеЗаВыпуск, ЗначениеМетаданных("ESD_РолиОтветственных.ОдометрВыезд"));
			
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьОтветственныхЛиц(
			ОбъектДок, ДанныеТитула.ДляДокумента.ОтветственныеЗаПрием, ЗначениеМетаданных("ESD_РолиОтветственных.ОдометрЗаезд"));
			
	КонецЕсли;
	
	Если ДопПараметры.ЗагрузкаСОнлайна Тогда
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ЗаписатьДанные(ДанныеВыпускающий, ОбъектДок, ДопПараметры.ИмяМетаданных);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузкаТитулаПринимающий(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	Если Не Вложения.Количество() Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеПринимающий = ДанныеПринимающий(ОбъектДок, Вложения, Титул, ДопПараметры);
	
	Если Не ДопПараметры.ТолькоАктивныйЭтап Тогда
		
		ДанныеТитула = ДанныеПринимающий[ДанныеПринимающий.ВГраница()];
		
		ЗаполнитьЗначенияСвойств(ОбъектДок, ДанныеТитула.ДляДокумента);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьОтветственныхЛиц(
			ОбъектДок, ДанныеТитула.ДляДокумента.ОтветственныеЗаПрием, ЗначениеМетаданных("ESD_РолиОтветственных.ОдометрЗаезд"));
		
	КонецЕсли;
	
	Если ДопПараметры.ЗагрузкаСОнлайна Тогда
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ЗаписатьДанные(ДанныеПринимающий, ОбъектДок, ДопПараметры.ИмяМетаданных);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузкаТитулаПослерейсовыйМедосмотр(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	Если Не Вложения.Количество() Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеПослерейсовыйМедосмотр = ДанныеПослерейсовыйМедосмотр(ОбъектДок, Вложения, Титул, ДопПараметры);
	
	Если Не ДопПараметры.ТолькоАктивныйЭтап Тогда
		
		ДанныеТитула = ДанныеПослерейсовыйМедосмотр[ДанныеПослерейсовыйМедосмотр.ВГраница()];
		
		ЗаполнитьЗначенияСвойств(ОбъектДок, ДанныеТитула.ДляДокумента);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьДанныеЮрЛицИКонтактнуюИнформацию(
			ОбъектДок, ДанныеТитула.ДляДокумента, ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрЗаезд"), ДопПараметры);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ЗаполнитьОтветственныхЛиц(
			ОбъектДок,
			ДанныеТитула.ДляДокумента.ОтветственныеЗаМедосмотрЗаезд,
			ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрЗаезд"));
		
	КонецЕсли;
	
	Если ДопПараметры.ЗагрузкаСОнлайна Тогда
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ЗаписатьДанные(
			ДанныеПослерейсовыйМедосмотр, ОбъектДок, ДопПараметры.ИмяМетаданных);
	КонецЕсли;
	
КонецПроцедуры

#Область ДанныеТитуловДляЗагрузки

Функция ДанныеВыпуск(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	РезультатФункции = Новый Массив;
	
	ВложенияДляЗагрузки = МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ВложенияДляЗагрузки(
		ОбъектДок, Титул, Вложения, ДопПараметры);
	
	Для Каждого Вложение Из ВложенияДляЗагрузки Цикл
		
		ДляДокумента = Новый Структура;
		ДляДокумента.Вставить("КлючСтроки",       ДопПараметры.КлючСтроки);
		ДляДокумента.Вставить("ДанныеЮрЛиц",      Новый Массив);
		ДляДокумента.Вставить("КонтактныеДанные", Новый Массив);
		ДляДокумента.Вставить("ДокументыЭПД",     Новый Массив);
		
		ЗагрузитьДанныеДокумента(ДляДокумента, Вложение["Документ"], ДопПараметры);
		
		ЗагрузитьДанныеМаршрутов(ДляДокумента, Вложение["Маршрут"]);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ДанныеТСПрицеповСпецРазрешений(ОбъектДок, ДляДокумента, Вложение["ТранспортноеСредство"]);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ДанныеВодителей(ОбъектДок, ДляДокумента, Вложение["Водители"], ДопПараметры);
		
		ЗагрузитьСтороныВыпуск(ДляДокумента, ДопПараметры);
		
		ДляРегистра = СтруктураДанныхДляРегистра(ОбъектДок, Вложение, Титул, ДопПараметры.ИмяМетаданных);
		
		РезультатФункции.Добавить(МодульКода("ESD_ТНЗагрузкаСервер").СтруктураТитула(Титул, ДляДокумента, ДляРегистра));
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДанныеПредрейсовыйМедосмотр(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	РезультатФункции = Новый Массив;
	
	ВложенияДляЗагрузки = МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ВложенияДляЗагрузки(
		ОбъектДок, Титул, Вложения, ДопПараметры);
	
	Для Каждого Вложение Из ВложенияДляЗагрузки Цикл
		
		ДляДокумента = Новый Структура;
		ДляДокумента.Вставить("КлючСтроки",       ДопПараметры.КлючСтроки);
		ДляДокумента.Вставить("ДанныеЮрЛиц",      Новый Массив);
		ДляДокумента.Вставить("КонтактныеДанные", Новый Массив);
		ДляДокумента.Вставить("ДокументыЭПД",     Новый Массив);
		
		ЗагрузитьМедосмотр(ДляДокумента, Вложение["Медосмотр"], Истина, ДопПараметры);
		Если ДляДокумента.ДоРейса_НеДопущенПослеМедосмотра Тогда
			ЗаполнитьДанныеОтрицательногоЗакрытия(Вложение, ДляДокумента, ДопПараметры.Событие, Титул);
		КонецЕсли;
		
		ДляРегистра     = СтруктураДанныхДляРегистра(ОбъектДок, Вложение, Титул, ДопПараметры.ИмяМетаданных);
		СтруктураТитула = МодульКода("ESD_ТНЗагрузкаСервер").СтруктураТитула(Титул, ДляДокумента, ДляРегистра);
		
		РезультатФункции.Добавить(СтруктураТитула);
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДанныеПредрейсовыйТехосмотр(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	РезультатФункции = Новый Массив;
	
	ВложенияДляЗагрузки = МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ВложенияДляЗагрузки(
		ОбъектДок, Титул, Вложения, ДопПараметры);
	
	Для Каждого Вложение Из ВложенияДляЗагрузки Цикл
		
		ДляДокумента = Новый Структура;
		
		ДляДокумента.Вставить("ДанныеЮрЛиц",      Новый Массив);
		ДляДокумента.Вставить("КонтактныеДанные", Новый Массив);
		ДляДокумента.Вставить("ДокументыЭПД",     Новый Массив);
		
		ЗагрузитьТехосмотр(ДляДокумента, Вложение["Техосмотр"]);
		Если ДляДокумента.ТО_НеРазрешенВыпускПосле Тогда
			ЗаполнитьДанныеОтрицательногоЗакрытия(Вложение, ДляДокумента, ДопПараметры.Событие, Титул);
		КонецЕсли;
		
		МодульКода("ESD_ТНЗагрузкаСервер").ДанныеТСПрицеповСпецРазрешений(ОбъектДок, ДляДокумента, Вложение["ТранспортноеСредство"]);
		
		ДляРегистра = СтруктураДанныхДляРегистра(ОбъектДок, Вложение, Титул, ДопПараметры.ИмяМетаданных);
		
		РезультатФункции.Добавить(МодульКода("ESD_ТНЗагрузкаСервер").СтруктураТитула(Титул, ДляДокумента, ДляРегистра));
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДанныеВыпускающий(ОбъектДок, Вложения, Титул, ДопПараметры)
	РезультатФункции = Новый Массив;
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

	ВложенияДляЗагрузки = МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ВложенияДляЗагрузки(
		ОбъектДок, Титул, Вложения, ДопПараметры);
	Для Каждого Вложение Из ВложенияДляЗагрузки Цикл
		ДляДокумента = Новый Структура;
		
		ПризнакНачалаРейса = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			Вложение, "Документ.ПризнакНачалаРейса");
		ДляДокумента.Вставить(
			"ПризнакНачалаРейса",
			МодульКода("Перечисления.ESD_ПризнакНачалаРейса").ЗначениеПоКоду(ПризнакНачалаРейса));
		
		Если ДляДокумента.ПризнакНачалаРейса = ЗначениеМетаданных("ESD_ПризнакНачалаРейса.ВыездСПарковки") Тогда
			ПутьДатаВремя = "Выпуск.Выезд.ДатаВремя";
			ПутьОдометр = "Выпуск.Выезд.Одометр";
		Иначе
			ПутьДатаВремя = "Выпуск.ПриемТС.ДатаВремя";
			ПутьОдометр = "Выпуск.ПриемТС.Одометр";
		КонецЕсли;
		
		ДатаВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Вложение, ПутьДатаВремя);
		ДатаВремя = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(ДатаВремя);
		
		Одометр = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Вложение, ПутьОдометр);
		Одометр = ?(ЗначениеЗаполнено(Одометр), Число(Одометр), 0);
			
		ДляДокумента.Вставить("Выезд_ДатаВремя", ДатаВремя);
		ДляДокумента.Вставить("Выезд_Одометр",   Одометр);
		
		Ответственный = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Вложение, "Выпуск.Ответственный");
		
		СтруктураВыпускающего = Новый Структура;
		МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьОтветственного(СтруктураВыпускающего, Ответственный);
		СтруктураВыпускающего.Вставить("Роль", ЗначениеМетаданных("ESD_РолиОтветственных.ОдометрВыезд"));
		ОтветственныеЗаВыпуск = Новый Массив;
		ОтветственныеЗаВыпуск.Добавить(СтруктураВыпускающего);
		ДляДокумента.Вставить("ОтветственныеЗаВыпуск", ОтветственныеЗаВыпуск);
		
		ЗагрузитьСтороныВыпускающий(ДляДокумента, ДопПараметры.Стороны);
		
		ДляРегистра = СтруктураДанныхДляРегистра(ОбъектДок, Вложение, Титул, ДопПараметры.ИмяМетаданных);
		
		РезультатФункции.Добавить(МодульКода("ESD_ТНЗагрузкаСервер").СтруктураТитула(Титул, ДляДокумента, ДляРегистра));		
	КонецЦикла;
	
	Возврат РезультатФункции;
КонецФункции

Функция ДанныеПринимающий(ОбъектДок, Вложения, Титул, ДопПараметры)
	РезультатФункции = Новый Массив;
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

	ВложенияДляЗагрузки = МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ВложенияДляЗагрузки(
		ОбъектДок, Титул, Вложения, ДопПараметры);
	Для Каждого Вложение Из ВложенияДляЗагрузки Цикл
		
		ДляДокумента = Новый Структура;
		
		ПризнакОкончанияРейса = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			Вложение, "Документ.ПризнакОкончанияРейса");
			
		ДляДокумента.Вставить(
			"ПризнакОкончанияРейса",
			МодульКода("Перечисления.ESD_ПризнакНачалаРейса").ЗначениеПоКоду(ПризнакОкончанияРейса));
		
		Если ДляДокумента.ПризнакОкончанияРейса = ЗначениеМетаданных("ESD_ПризнакНачалаРейса.ВыездСПарковки") Тогда
			ПутьДатаВремя = "Приемка.Заезд.ДатаВремя";
			ПутьОдометр = "Приемка.Заезд.Одометр";
		Иначе
			ПутьДатаВремя = "Приемка.СдачаТС.ДатаВремя";
			ПутьОдометр = "Приемка.СдачаТС.Одометр";
		КонецЕсли;
		
		ДатаВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Вложение, ПутьДатаВремя);
		ДатаВремя = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(ДатаВремя);
		
		Одометр = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Вложение, ПутьОдометр);
		Одометр = ?(ЗначениеЗаполнено(Одометр), Число(Одометр), 0);
			
		ДляДокумента.Вставить("Заезд_ДатаВремя", ДатаВремя);
		ДляДокумента.Вставить("Заезд_Одометр",   Одометр);
		
		Ответственный = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Вложение, "Приемка.Ответственный");
		
		СтруктураПринимающего = Новый Структура;
		МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьОтветственного(СтруктураПринимающего, Ответственный);
		СтруктураПринимающего.Вставить("Роль", ЗначениеМетаданных("ESD_РолиОтветственных.ОдометрЗаезд"));
		ОтветственныеЗаПрием = Новый Массив;
		ОтветственныеЗаПрием.Добавить(СтруктураПринимающего);
		ДляДокумента.Вставить("ОтветственныеЗаПрием", ОтветственныеЗаПрием);
		
		ДляРегистра = СтруктураДанныхДляРегистра(ОбъектДок, Вложение, Титул, ДопПараметры.ИмяМетаданных);
		
		РезультатФункции.Добавить(МодульКода("ESD_ТНЗагрузкаСервер").СтруктураТитула(Титул, ДляДокумента, ДляРегистра));		
	КонецЦикла;
	
	Возврат РезультатФункции;
КонецФункции
	
Функция ДанныеПослерейсовыйМедосмотр(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	РезультатФункции = Новый Массив;
	
	ВложенияДляЗагрузки = МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ВложенияДляЗагрузки(
		ОбъектДок, Титул, Вложения, ДопПараметры);
	
	Для Каждого Вложение Из ВложенияДляЗагрузки Цикл
		
		ДляДокумента = Новый Структура;
		ДляДокумента.Вставить("КлючСтроки",       ДопПараметры.КлючСтроки);
		ДляДокумента.Вставить("ДанныеЮрЛиц",      Новый Массив);
		ДляДокумента.Вставить("КонтактныеДанные", Новый Массив);
		ДляДокумента.Вставить("ДокументыЭПД",     Новый Массив);
		
		ЗагрузитьМедосмотр(ДляДокумента, Вложение["ПостМедосмотр"], Ложь, ДопПараметры);
						
		ДляРегистра     = СтруктураДанныхДляРегистра(ОбъектДок, Вложение, Титул, ДопПараметры.ИмяМетаданных);
		СтруктураТитула = МодульКода("ESD_ТНЗагрузкаСервер").СтруктураТитула(Титул, ДляДокумента, ДляРегистра);
		
		РезультатФункции.Добавить(СтруктураТитула);				
		
	КонецЦикла;
	
	Возврат РезультатФункции;

КонецФункции

Функция СтруктураДанныхДляРегистра(ОбъектДок, Вложение, Титул, ИмяМетаданных, СохранитьДанные = Ложь)
	
	Основной = Не МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
		ПутевойЛист(), "ЭтоДинамическийТитул", Титул);
	
	СтруктураДанныхДляРегистра = МодульКода("ESD_ТНЗагрузкаСервер").ШаблонСтруктурыДанныхДляРегистра(
		ОбъектДок.Ссылка, Титул, Основной);
	СтруктураДанныхДляРегистра.Просмотрено     = Истина;
	СтруктураДанныхДляРегистра.СохранитьДанные = СохранитьДанные;
	
	Вложение.Вставить("ЗагруженВРегистр", Вложение["ЗагруженВРегистр"] Или Вложение["ИдентификаторВложенияТитула"] = "");
	
	Возврат МодульКода("ESD_ТНЗагрузкаСервер").ДанныеДляРегистраТитулов(Вложение, ИмяМетаданных, СтруктураДанныхДляРегистра);
		
КонецФункции

Процедура ЗаполнитьДанныеОтрицательногоЗакрытия(Вложение, ДляДокумента, СобытияСОнлайна, Титул)
	
	СтруктураСобытия = Неопределено;
	
	Для Каждого СобытиеСоответствие Из СобытияСОнлайна Цикл
		
		НазваниеСобытия = СобытиеСоответствие["Название"];
		
		ТитулСобытия = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
			ПутевойЛист(), "ЗначениеПоПредставлению", НазваниеСобытия);
		Если ТитулСобытия = Титул Или НазваниеСобытия = "Уведомление об уточнении" Тогда
			СтруктураСобытия = СобытиеСоответствие;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтруктураСобытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаВремя = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(СтруктураСобытия["ДатаВремя"]);
	
	Вложение.Вставить("ДатаВложенияТитула",          ДатаВремя);
	Вложение.Вставить("ИдентификаторВложенияТитула", СтруктураСобытия["Идентификатор"]);
	
	ДляДокумента.Вставить("КомментарийУведомление", СтруктураСобытия["Комментарий"]);
	
КонецПроцедуры

#КонецОбласти // ДанныеТитуловДляЗагрузки

Процедура ЗаполнитьАдресаПунктовВыгрузки(ОбъектДок, ДляДокумента)
	
	Если Не ДляДокумента.Свойство("АдресаПунктовВыгрузки") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДляДокумента.АдресаПунктовВыгрузки.Количество() > 0 Тогда
		ОбъектДок.АдресаПунктовВыгрузки.Очистить();
	КонецЕсли;
	
	Для Каждого СтрокаПункта Из ДляДокумента.АдресаПунктовВыгрузки Цикл
		НоваяСтрокаПункта = ОбъектДок.АдресаПунктовВыгрузки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПункта, СтрокаПункта);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьДанныеДокумента(ДляДокумента, ДокументСОнлайна, ДопПараметры)
	
	Если Не ЗначениеЗаполнено(ДокументСОнлайна) Тогда
		Возврат;
	КонецЕсли;
		
	ДляДокумента.Вставить("НомерСБИС", ДокументСОнлайна["Номер"]);
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

	ПризнакНачалаРейса = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		ДокументСОнлайна, "ПризнакНачалаРейса", "1");
	ДляДокумента.Вставить("ПризнакНачалаРейса", МодульКода("Перечисления.ESD_ПризнакНачалаРейса").ЗначениеПоКоду(ПризнакНачалаРейса));
		
	Если ДопПараметры.ЗагрузкаСОнлайна Или ДопПараметры.ЭтоПервоеОснование Тогда
		ДляДокумента.Вставить("ПослерейсовыйМедосмотрТребуется", ДокументСОнлайна["ПослерейсовыйМедосмотр"] = "1");
	КонецЕсли;
	
	ДляДокумента.Вставить(
	    "ВидПеревозки",
		МодульКода("Перечисления.ESD_ВидПеревозки").ЗначениеПоКоду(ДокументСОнлайна["ВидПеревозки"]));
	
	ДляДокумента.Вставить(
		"ВидКоммерческойПеревозки",
		МодульКода("Перечисления.ESD_ВидКоммерческойПеревозки").ЗначениеПоКоду(ДокументСОнлайна["ВидКоммерческойПеревозки"]));
		
	ДляДокумента.Вставить(
		"ВидТранспортногоСообщения",
		МодульКода("Перечисления.ESD_ВидСообщенияЭПЛ").ЗначениеПоКоду(ДокументСОнлайна["ВидСообщения"]));
	
	ЗагрузитьДанныеСроковПутевогоЛиста(ДляДокумента, ДокументСОнлайна);
	
	РольОформитель = ЗначениеМетаданных("ESD_РолиКонтрагентов.Оформитель");
	Если ЗначениеЗаполнено(ДопПараметры.СторонняяОрганизация) Тогда
		ПодстановкиЮрЛиц = МодульКода("ESD_ТНЗагрузкаСервер").НормализованныеДанныеЮрЛица(ДопПараметры.СторонняяОрганизация);
		КонтактыОформителя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДокументСОнлайна, "Оформитель.Контакты");
		ПодстановкиЮрЛиц.Вставить("Контакты", КонтактыОформителя);
		АдресОформителя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДокументСОнлайна, "Оформитель.Адрес");
		ПодстановкиЮрЛиц.Вставить("Адрес", АдресОформителя);
		МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьДанныеЮрЛиц(ДляДокумента, ПодстановкиЮрЛиц, РольОформитель);
	Иначе
		МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьДанныеЮрЛиц(ДляДокумента, ДокументСОнлайна["Оформитель"], РольОформитель);
	КонецЕсли;
	
	ЗагрузитьЗаменуВодителя(ДляДокумента, ДопПараметры);
		
	Если Не ДопПараметры.ЗагрузкаСОнлайна Тогда
		ДляДокумента = МодульКода("ESD_ТНОбщегоНазначенияСервер").СтруктураБезПустыхЗначений(ДляДокумента);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьДанныеСроковПутевогоЛиста(ДляДокумента, ДокументСОнлайна)
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");

	Если ДокументСОнлайна["Длительность"] = "1" Тогда
		ДатаНачалаИсполнения = МодульТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД(
			ДокументСОнлайна["ДатаИсполнения"]);
		ДатаОкончанияИсполнения = ДатаНачалаИсполнения;
	Иначе
		ДатаНачалаИсполнения = МодульТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД(
			ДокументСОнлайна["ДатаНачалаИсполнения"]);
		ДатаОкончанияИсполнения = МодульТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД(
			ДокументСОнлайна["ДатаКонцаИсполнения"]);
	КонецЕсли;
		
	Если ДокументСОнлайна["ВремяНачалаИсполнения"] <> Неопределено Тогда
		ВремяНачалаИсполнения = ДокументСОнлайна["ВремяНачалаИсполнения"];
		ДатаНачалаИсполнения = Дата(Формат(ДатаНачалаИсполнения, "ДФ=dd.MM.yyyy") + " " + ВремяНачалаИсполнения + ":00");
	КонецЕсли;
	
	Если ДокументСОнлайна["ВремяКонцаИсполнения"] <> Неопределено Тогда
		ВремяКонцаИсполнения = ДокументСОнлайна["ВремяКонцаИсполнения"];
		ДатаОкончанияИсполнения = Дата(Формат(ДатаОкончанияИсполнения, "ДФ=dd.MM.yyyy") + " " + ВремяКонцаИсполнения + ":00");
	КонецЕсли;
																				
	ДляДокумента.Вставить("ДатаНачалаИсполнения",    ДатаНачалаИсполнения);
	ДляДокумента.Вставить("ДатаОкончанияИсполнения", ДатаОкончанияИсполнения);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеМаршрутов(ДляДокумента, МаршрутСОнлайна)
	
	Если МаршрутСОнлайна = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДляДокумента.Вставить(
		"МестоОтправления",
		МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(МаршрутСОнлайна, "Отправление.АдресТекст"));
		
	ДляДокумента.Вставить(
		"ИнформацияДляВодителя",
		МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(МаршрутСОнлайна, "Отправление.Комментарий"));
	
	КлючСтроки = 1;
	АдресаПунктовВыгрузки = Новый Массив;
	Для Каждого Пункт Из МаршрутСОнлайна["Пункт"] Цикл
		
		СтруктураПункта = Новый Структура;
		СтруктураПункта.Вставить("Значение",   Пункт["АдресТекст"]);
		СтруктураПункта.Вставить("КлючСтроки", КлючСтроки);
		СтруктураПункта.Вставить("ИнформацияДляВодителя", Пункт["Комментарий"]); 
		
		АдресаПунктовВыгрузки.Добавить(СтруктураПункта);
		
		КлючСтроки = КлючСтроки + 1;
		
	КонецЦикла;
	ДляДокумента.Вставить("АдресаПунктовВыгрузки", АдресаПунктовВыгрузки);
	
	МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьДанныеЮрЛиц(ДляДокумента, МаршрутСОнлайна["Грузоотправитель"], "Отправитель");
	
КонецПроцедуры

Процедура ЗагрузитьМедосмотр(ДляДокумента, МедосмотрСОнлайна, ЭтоПредрейсовыйМедосмотр, ДопПараметры)
	
	ИмяТаблицы = ?(ЭтоПредрейсовыйМедосмотр, "ОтветственныеЗаМедосмотр", "ОтветственныеЗаМедосмотрЗаезд");
	
	Если Не ДляДокумента.Свойство(ИмяТаблицы) Тогда
		ДляДокумента.Вставить(ИмяТаблицы, Новый Массив);
	КонецЕсли;
	
	ДляДокумента.Вставить("ДоРейса_НеДопущенПослеМедосмотра", Ложь);
	
	Если Не ЗначениеЗаполнено(МедосмотрСОнлайна) Тогда
		Возврат;
	КонецЕсли;
	
	ШтатныйСотрудник = ЭтоШтатныйМедик(МедосмотрСОнлайна, ДопПараметры);
	
	Ответственный = МедосмотрСОнлайна["Ответственный"];
	
	Если ЗначениеЗаполнено(МедосмотрСОнлайна["Организация"]) Тогда
		
		Если ЭтоПредрейсовыйМедосмотр Тогда
			Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрВыезд");
		Иначе
			Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрЗаезд");
		КонецЕсли;
		
		ПодстановкиЮрЛиц = МодульКода("ESD_ТНЗагрузкаСервер").НормализованныеДанныеЮрЛица(МедосмотрСОнлайна["Организация"]);
		МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьДанныеЮрЛиц(ДляДокумента, ПодстановкиЮрЛиц, Роль);
		
	КонецЕсли;
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

	СтруктураМедика = Новый Структура;
	МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьОтветственного(СтруктураМедика, Ответственный);
	Если Не ПустаяСтрока(СтруктураМедика.Имя) Тогда
		Лицензия      = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Ответственный, "Лицензия");
		ДатаВыдачи    = МодульТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД(Лицензия["ДатаВыдачи"]);
		Срок          = МодульТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД(Лицензия["Срок"]);
		РольМедосмотр = ?(ЭтоПредрейсовыйМедосмотр,
			ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрВыезд"),
			ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрЗаезд"));
		
		СтруктураМедика.Вставить("Серия",                 Лицензия["Серия"]);
		СтруктураМедика.Вставить("Номер",                 Лицензия["Номер"]);
		СтруктураМедика.Вставить("ДатаВыдачи",            ДатаВыдачи);
		СтруктураМедика.Вставить("ДатаОкончанияДействия", Срок);
		СтруктураМедика.Вставить("Роль",                  РольМедосмотр);
		
		ДляДокумента[ИмяТаблицы].Добавить(СтруктураМедика);
	КонецЕсли;
	
	ДатаВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(МедосмотрСОнлайна, "Результат.ДатаВремя");
	ДатаВремя = МодульТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД(ДатаВремя);
	Отметка   = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(МедосмотрСОнлайна, "Результат.Отметка");
	Допущен   = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(МедосмотрСОнлайна, "Результат.Допуск");
	// Допущен = Неопределено так как в узле "Стороны" нет узла "Результат"
	Допущен   = Допущен = Неопределено Или Допущен = "1"; 
	
	// Сторонняя организация
	СторонняяОрганизацияИдентификатор =  МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(МедосмотрСОнлайна,
		"ВнешняяСистема.Идентификатор");
	СторонняяОрганизация = МодульКода("Перечисления.ESD_МедицинскиеОрганизации").ЗначениеПоИдентификатору(
		СторонняяОрганизацияИдентификатор);
	
	Если ЭтоПредрейсовыйМедосмотр Тогда
		ДляДокумента.Вставить("ДоРейса_МедосмотрСторонняяОрганизация", Не ШтатныйСотрудник);
		ДляДокумента.Вставить("ДоРейса_ДатаВремяМедосмотра",           ДатаВремя);
		ДляДокумента.Вставить("ДоРейса_КомментарииМедосмотра",         Отметка);
		ДляДокумента.Вставить("ДоРейса_НеДопущенПослеМедосмотра",      Не Допущен);
		ДляДокумента.Вставить("ДоРейса_МедицинскаяОрганизация",		   СторонняяОрганизация);
	Иначе
		ДляДокумента.Вставить("ПослеРейса_МедосмотрСторонняяОрганизация", Не ШтатныйСотрудник);
		ДляДокумента.Вставить("ПослеРейса_ДатаВремяМедосмотра",           ДатаВремя);
		ДляДокумента.Вставить("ПослеРейса_КомментарииМедосмотра",         Отметка);
		ДляДокумента.Вставить("ПослеРейса_МедицинскаяОрганизация",		  СторонняяОрганизация);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоШтатныйМедик(МедосмотрСОнлайна, ДопПараметры)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

	Если Не ДопПараметры.ЗагрузкаСОнлайна Тогда
		Возврат МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(МедосмотрСОнлайна, "ШтатныйМедик", Ложь);
	КонецЕсли;
	
	ЮрЛица = Новый Структура;
	ЮрЛица.Вставить("ДанныеЮрЛиц",      Новый Массив);
	ЮрЛица.Вставить("КонтактныеДанные", Новый Массив);
	
	// Неважно какая роль, нужно просто получить структуру юр лица в стандартном плоском формате.
	ИскусственнаяРоль = ЗначениеМетаданных("ESD_РолиКонтрагентов.СторонаДокумента");
	
	ПодстановкиЮрЛиц = МодульКода("ESD_ТНЗагрузкаСервер").НормализованныеДанныеЮрЛица(МедосмотрСОнлайна["Организация"]);
	МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьДанныеЮрЛиц(ЮрЛица, ПодстановкиЮрЛиц, ИскусственнаяРоль);
	
	Если ЮрЛица.ДанныеЮрЛиц.Количество() > 0 Тогда
		СтруктураЮрЛицаМедосмотр = ЮрЛица.ДанныеЮрЛиц[0];
	Иначе
		СтруктураЮрЛицаМедосмотр = МодульТНОбщегоНазначенияКлиентСервер.ШаблонДанныхЮрЛица();
	КонецЕсли;
	
	ЮрЛица.ДанныеЮрЛиц.Очистить();
	ЮрЛица.КонтактныеДанные.Очистить();
	
	// Если нет описания сторонней организации, то считаем сторонняя организация указана в данных медосмотра
	СтруктураЮрЛицаСторонняяОрганизация = СтруктураЮрЛицаМедосмотр;
	Если ЗначениеЗаполнено(ДопПараметры.СторонняяОрганизация) Тогда
		ПодстановкиЮрЛиц = МодульКода("ESD_ТНЗагрузкаСервер").НормализованныеДанныеЮрЛица(ДопПараметры.СторонняяОрганизация);
		МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьДанныеЮрЛиц(ЮрЛица, ПодстановкиЮрЛиц, ИскусственнаяРоль);
		
		Если ЮрЛица.ДанныеЮрЛиц.Количество() > 0 Тогда
			СтруктураЮрЛицаСторонняяОрганизация = ЮрЛица.ДанныеЮрЛиц[0];
		КонецЕсли;
	КонецЕсли;
	
	ЮрЛица.ДанныеЮрЛиц.Очистить();
	ЮрЛица.КонтактныеДанные.Очистить();
	
	Если ЗначениеЗаполнено(ДопПараметры.НашаОрганизация) Тогда
		ПодстановкиЮрЛиц = МодульКода("ESD_ТНЗагрузкаСервер").НормализованныеДанныеЮрЛица(ДопПараметры.НашаОрганизация);
		МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьДанныеЮрЛиц(ЮрЛица, ПодстановкиЮрЛиц, ИскусственнаяРоль);
		
		Если ЮрЛица.ДанныеЮрЛиц.Количество() > 0 Тогда
			СтруктураЮрЛицаНашаОрганизация = ЮрЛица.ДанныеЮрЛиц[0];
		КонецЕсли;
	КонецЕсли;
	
	ЭтоНашаОрганизация = МодульТНОбщегоНазначенияКлиентСервер.ЮрЛицаСовпадают(
		СтруктураЮрЛицаНашаОрганизация, СтруктураЮрЛицаСторонняяОрганизация);
	
	Если ЭтоНашаОрганизация Тогда
		СтруктураЮрЛицаСторонняяОрганизация = СтруктураЮрЛицаМедосмотр;
	КонецЕсли;
	
	// Сторонняя организация
	СторонняяОрганизацияИдентификатор =  МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(МедосмотрСОнлайна,
		"ВнешняяСистема.Идентификатор");
	
	ЮрЛицаСовпадают = МодульТНОбщегоНазначенияКлиентСервер.ЮрЛицаСовпадают(
		СтруктураЮрЛицаМедосмотр, СтруктураЮрЛицаСторонняяОрганизация);
	
	РезультатФункции = Не (СтруктураЮрЛицаМедосмотр.Заполнена 
				 	   И ЮрЛицаСовпадают 
					   Или ЗначениеЗаполнено(СторонняяОрганизацияИдентификатор));
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗагрузитьТехосмотр(ДляДокумента, ТехосмотрСОнлайна, ТолькоОтветственный = Ложь)
	ОтветственныеЗаТехосмотр = Новый Массив;
	ДляДокумента.Вставить("ОтветственныеЗаТехосмотр", ОтветственныеЗаТехосмотр);
	ДляДокумента.Вставить("ТО_НеРазрешенВыпускПосле", Ложь);
	
	Если Не ЗначениеЗаполнено(ТехосмотрСОнлайна) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураМеханика = Новый Структура;
	МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьОтветственного(СтруктураМеханика, ТехосмотрСОнлайна["Ответственный"]);
	Если Не ПустаяСтрока(СтруктураМеханика.Имя) Тогда
		СтруктураМеханика.Вставить("Роль", ЗначениеМетаданных("ESD_РолиОтветственных.Техосмотр"));
		ОтветственныеЗаТехосмотр.Добавить(СтруктураМеханика);
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

	Если Не ТолькоОтветственный Тогда
		
		ДатаВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ТехосмотрСОнлайна, "Результат.ДатаВремя");
		ДатаВремя = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(ДатаВремя);
		Отметка   = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ТехосмотрСОнлайна, "Результат.Отметка");
		
		ДляДокумента.Вставить("ТО_ДатаВремя",   ДатаВремя);
		ДляДокумента.Вставить("ТО_Комментарий", "");
		
		ДатаВыпускаВРейс = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ТехосмотрСОнлайна, "ВыпускНаЛинию.ДатаВремя");
		ДатаВыпускаВРейс = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(ДатаВыпускаВРейс);
		
		ДляДокумента.Вставить("ТО_НеРазрешенВыпускПосле", Отметка = "2");
		ДляДокумента.Вставить("ТО_ДатаВремяВыпускаВРейс", ДатаВыпускаВРейс);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьСтороныВыпуск(ДляДокумента, ДопПараметры)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

	Медосмотр = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДопПараметры.Стороны, "Медосмотр");
	ЗагрузитьМедосмотр(ДляДокумента, Медосмотр, Истина, ДопПараметры);
	
	ПостМедосмотр = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДопПараметры.Стороны, "ПостМедосмотр");
	ЗагрузитьМедосмотр(ДляДокумента, ПостМедосмотр, Ложь, ДопПараметры);
	
	Техосмотр = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДопПараметры.Стороны, "Техосмотр");
	ЗагрузитьТехосмотр(ДляДокумента, Техосмотр, Истина);
	
КонецПроцедуры

Процедура ЗагрузитьСтороныВыпускающий(ДляДокумента, Стороны)
	ОтветственныеЗаПрием = Новый Массив;
	ДляДокумента.Вставить("ОтветственныеЗаПрием", ОтветственныеЗаПрием);
	
	Если Не ЗначениеЗаполнено(Стороны) Тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(Стороны, "Приемка.Ответственный");
	
	СтруктураПринимающего = Новый Структура;
	МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьОтветственного(СтруктураПринимающего, Ответственный);
	СтруктураПринимающего.Вставить("Роль", ЗначениеМетаданных("ESD_РолиОтветственных.ОдометрЗаезд"));
	ОтветственныеЗаПрием.Добавить(СтруктураПринимающего);
КонецПроцедуры

Процедура ЗагрузитьЗаменуВодителя(ДляДокумента, ДопПараметры)
	Если Не ЗначениеЗаполнено(ДопПараметры.ЗаменаВодителя) Тогда
		Возврат;
	КонецЕсли;
		
	ПЛПредыдущий = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		ДопПараметры.ЗаменаВодителя, "ПЛПредыдущий.Идентификатор");
		
	ПЛСледующий  = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		ДопПараметры.ЗаменаВодителя, "ПЛСледующий.Идентификатор");
	
	ДляДокумента.Вставить("ПЛПредыдущий", ПЛПредыдущий);
	ДляДокумента.Вставить("ПЛСледующий",  ПЛСледующий);
КонецПроцедуры

Процедура ДобавитьТитулыПоАктивномуЭтапу(МассивТитуловДляЗагрузки, Этап, ТипыТитулов)
	
	// В регистре состояния нет данных о текущем этапе, при этом документооборот не завершен.
	Если Не ЗначениеЗаполнено(Этап) Тогда
		МассивТитуловДляЗагрузки.Добавить(ТипыТитулов["Выпуск"]);
	ИначеЕсли Этап = ТипыТитулов["ПредрейсовыйМедосмотр"] Или Этап = ТипыТитулов["ПредрейсовыйТехосмотр"] Тогда
		МассивТитуловДляЗагрузки.Добавить(ТипыТитулов["ПредрейсовыйМедосмотр"]);
		МассивТитуловДляЗагрузки.Добавить(ТипыТитулов["ПредрейсовыйТехосмотр"]);
	Иначе
		МассивТитуловДляЗагрузки.Добавить(Этап);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // Загрузка

#Область ХранилищеОбщихНастроек

Функция КлючОбщихНастроек()
	Возврат "ESD_ПутевойЛист";
КонецФункции

#КонецОбласти

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_etrn_base_Document_ПутевойЛист_ВзаимодействиеСОнлайном
#КонецОбласти // include_etrn_base_Document_ПутевойЛист_ВзаимодействиеСОнлайном

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиентСервер
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиентСервер

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_CommonModule_Метаданные
#КонецОбласти // include_etrn_base_CommonModule_Метаданные

