
// Сохраняем статус документ в дополнительные сведения через ядро
//
// Параметры:
// 	Документ - Ссылка - ссылка на документ основание для ВО
//           - Структура - данные документа основания в ESD
//	ДанныеДляЗаписи - Соответствие - ответ онлайна на выгрузку вложения
//
Процедура ЗаписатьДополнительныеСведенияОснования(Документ, ДанныеДляЗаписи) Экспорт
	ДокументОснование = Документ;
		
	// нет типового документа к которому запишем статус
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
		
	Идентификатор = ДанныеДляЗаписи["Идентификатор"];
    Если Не ЗначениеЗаполнено(Идентификатор) Тогда
        Возврат;
    КонецЕсли;
    
    Модуль_ESDКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	КодСостояния = Модуль_ESDКлиентСервер.ЗначениеИзКоллекции(ДанныеДляЗаписи, "Состояние.Код");
    Регламент    = Модуль_ESDКлиентСервер.ЗначениеИзКоллекции(ДанныеДляЗаписи, "Регламент.Название");
    
    // Обращение в ядро...
	Модуль_ESDЯдро = ОбъектОбработки();
	Модуль_ESDЯдро.СтатусыДокументовОбновитьПоUID(
        Идентификатор, "", КодСостояния, ДокументОснование, , , Идентификатор, Регламент);    
КонецПроцедуры

