
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОграничитьТипыДокументовОснованийНаСервере();
		
	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииПослеЗаписиНаСервере();
	Иначе
		Saby_ТНОбщегоНазначенияСервер.УбратьПризнакНеПросмотрен(Объект.Ссылка);
	КонецЕсли;
	
	УстановкаСпискаДоступныхТиповКИ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОповеститьОбИзменении(Объект.Ссылка);
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ПредставительЗаказчика_Основание = ЭтаФорма.Оформитель_Основание;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриЧтенииСозданииПослеЗаписиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииПослеЗаписиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Saby_ТНОбщегоНазначенияКлиент.ОбработатьОповещенияДляФормы(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	Если Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.Saby_ТипДокументаЗнП.Заказ") Тогда
		Объект.Договор = "";
	КонецЕсли;
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРеквизитаФормы = Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыРеквизитаФормы(Элемент.Имя, Элемент.Имя);
	ПараметрыРеквизитаФормы.ТолькоПросмотр = Элементы.ГруппаЗаказчик.ТолькоПросмотр;
	Saby_ТНОбщегоНазначенияКлиент.ЮрЛицоНажатие(ЭтаФорма, "Отправитель", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправитель_ТелефонПриИзменении(Элемент)
	
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "Отправитель");
	
	Saby_ТНОбщегоНазначенияКлиент.ТелефонПриИзменении(ЭтаФорма, ЭтаФорма.Отправитель_Телефон, РолиЮрЛиц, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправитель_ТелефонНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПараметрыВыбораТелефона = Новый Структура;
	ПараметрыВыбораТелефона.Вставить("Роль",     Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "Отправитель"));
	ПараметрыВыбораТелефона.Вставить("Значение", ЭтаФорма.Отправитель_Телефон);
	
	Saby_ТНОбщегоНазначенияКлиент.ТелефонНачалоВыбора(ЭтаФорма, ПараметрыВыбораТелефона, СтандартнаяОбработка, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставительЗаказчикаПриИзменении(Элемент)
	
	ИмяРолиОформитель = "Оформитель";
	
	// зачищаем данные если не представитель
	Если Не Объект.ПредставительЗаказчика Тогда
		
		ЭтаФорма.Оформитель_Основание = "";
		Saby_ТНОбщегоНазначенияКлиентСервер.УдалитьСтрокиПоРоли(Объект.ДанныеЮрЛиц, ИмяРолиОформитель);
		
		ЭтаФорма.ОформительСтрокой = Saby_ТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
			Объект.ДанныеЮрЛиц, ИмяРолиОформитель);

	КонецЕсли;	
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОформительСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРеквизитаФормы = Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыРеквизитаФормы(Элемент.Имя, Элемент.Имя);
	ПараметрыРеквизитаФормы.ДополнительныеПоля = "Основание";
	ПараметрыРеквизитаФормы.ТолькоПросмотр = Элементы.ГруппаЗаказчик.ТолькоПросмотр;
	Saby_ТНОбщегоНазначенияКлиент.ЮрЛицоНажатие(ЭтаФорма, "Оформитель", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРеквизитаФормы = Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыРеквизитаФормы(Элемент.Имя, Элемент.Имя);
	ПараметрыРеквизитаФормы.ТолькоПросмотр = Элементы.ГруппаПеревозчик.ТолькоПросмотр;
	Saby_ТНОбщегоНазначенияКлиент.ЮрЛицоНажатие(ЭтаФорма, "Перевозчик", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Перевозчик_ТелефонПриИзменении(Элемент)
	
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "Перевозчик");
	
	Saby_ТНОбщегоНазначенияКлиент.ТелефонПриИзменении(ЭтаФорма, ЭтаФорма.Перевозчик_Телефон, РолиЮрЛиц, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Перевозчик_ТелефонНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПараметрыВыбораТелефона = Новый Структура;
	ПараметрыВыбораТелефона.Вставить("Роль",     Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "Перевозчик"));
	ПараметрыВыбораТелефона.Вставить("Значение", ЭтаФорма.Перевозчик_Телефон);
	
	Saby_ТНОбщегоНазначенияКлиент.ТелефонНачалоВыбора(ЭтаФорма, ПараметрыВыбораТелефона, СтандартнаяОбработка, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаполнитьПодачаТСНажатие(Элемент)	
	ИзменитьАдресПодачи(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ПодачаДатаПриИзменении(Элемент)
	
	ПроверкаДатАдресовПунктовВыгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодачаВремяПриИзменении(Элемент)
	
	ПроверкаДатАдресовПунктовВыгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаполнитьКонечнаяТочкаНажатие(Элемент)	
	
	ИзменитьАдресКонечнойТочки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодачаАдресНажатие(Элемент, СтандартнаяОбработка)	
	ИзменитьАдресПодачи(СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура КонечнаяТочкаАдресНажатие(Элемент, СтандартнаяОбработка)	
	ИзменитьАдресКонечнойТочки(СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчикаСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРеквизитаФормы = Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыРеквизитаФормы(Элемент.Имя, Элемент.Имя);
	ПараметрыРеквизитаФормы.ДополнительныеПоля = "Основание,Полномочия";
	ПараметрыРеквизитаФормы.ТолькоПросмотр     = Элементы.ГруппаУполномоченныеЛицаПеревозчика.ТолькоПросмотр;
	Saby_ТНОбщегоНазначенияКлиент.ЮрЛицоНажатие(ЭтаФорма, "УполномоченноеЛицоПеревозчика", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчика_ТелефонПриИзменении(Элемент)
	
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "УполномоченноеЛицоПеревозчика");
	
	Saby_ТНОбщегоНазначенияКлиент.ТелефонПриИзменении(
		ЭтаФорма, ЭтаФорма.УполномоченноеЛицоПеревозчика_Телефон, РолиЮрЛиц, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчика_ТелефонНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
		СтандартнаяОбработка)
		
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "УполномоченноеЛицоПеревозчика");
		
	ПараметрыВыбораТелефона = Новый Структура;
	ПараметрыВыбораТелефона.Вставить("Роль",     РолиЮрЛиц);
	ПараметрыВыбораТелефона.Вставить("Значение", ЭтаФорма.УполномоченноеЛицоПеревозчика_Телефон);
	
	Saby_ТНОбщегоНазначенияКлиент.ТелефонНачалоВыбора(ЭтаФорма, ПараметрыВыбораТелефона, СтандартнаяОбработка, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	Saby_ТНОбщегоНазначенияКлиент.ТранспортноеСредствоНажатие(
		ЭтаФорма,
		СтандартнаяОбработка,
		Неопределено,
		Элементы.СтраницаВодителиИТС.ТолькоПросмотр);
		
КонецПроцедуры

&НаКлиенте
Процедура ПрицепыСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	Saby_ТНОбщегоНазначенияКлиент.ПрицепыНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВодителиСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ЭтаФорма.ТекущийЭлемент = Элементы.Водители;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйЗаПеревозкуСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтветственного = Saby_ТНОбщегоНазначенияСервер.СтруктураОтветственного(Объект.ОтветственныеЛица, "Ответственный");
	СтруктураОтветственного.Вставить("ТолькоПросмотр", Элементы.СтраницаВодителиИТС.ТолькоПросмотр);
	СтруктураОтветственного.Вставить(
		"ИмяМетаданных",
		Saby_ТНОбщегоНазначенияКлиентСервер.ИмяМетаданныхПоФорме(ЭтаФорма));
	
	Saby_ТНОбщегоНазначенияКлиент.НачатьРедактированиеОтветственногоЛица(
		ЭтаФорма, СтруктураОтветственного, "Ответственный");
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаСНДСПриИзменении(Элемент)
	
	ОбновитьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	ОбновитьСумму();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтправительКонтактныеДанные

&НаКлиенте
Процедура ОтправительКонтактныеДанныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ЕстьДанныеЮрЛица("Отправитель") Тогда 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан Заказчик!";
		Сообщение.Поле  = "ОтправительСтрокой";
		Сообщение.Сообщить();		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактныеДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Если Копирование Тогда
			Элементы.ОтправительКонтактныеДанные.ТекущиеДанные.Основной = Ложь;
		КонецЕсли;
		ОбработатьНовуюСтрокуКонтактнойИнформации(Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактныеДанныеПослеУдаления(Элемент)
	
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "Отправитель");
	ДопПараметры = Saby_ТНОбщегоНазначенияКлиентСервер.ДопПараметрыОбновленияКИ(РолиЮрЛиц);
	Saby_ТНОбщегоНазначенияКлиентСервер.ОбновитьОсновнойНомерТелефона(ЭтаФорма, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактныеДанныеЗначениеПриИзменении(Элемент)
	
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "Отправитель");
	
	Saby_ТНОбщегоНазначенияКлиент.ЗначениеКонтактныхДанныхПриИзменении(
		ЭтаФорма, Элементы.ОтправительКонтактныеДанные.ТекущиеДанные, РолиЮрЛиц);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактныеДанныеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "Отправитель");
	
	Saby_ТНОбщегоНазначенияКлиент.ЗначениеКонтактныхДанныхНачалоВыбора(
		ЭтаФорма, Элементы.ОтправительКонтактныеДанные.ТекущиеДанные, РолиЮрЛиц, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыОтправительКонтактныеДанные

#Область ОбработчикиСобытийЭлементовТаблицыФормыПеревозчикКонтактныеДанные

&НаКлиенте
Процедура ПеревозчикКонтактныеДанныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ЕстьДанныеЮрЛица("Перевозчик") Тогда 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан Перевозчик!";
		Сообщение.Поле  = "ПеревозчикСтрокой";
		Сообщение.Сообщить();		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикКонтактныеДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Если Копирование Тогда
			Элементы.ПеревозчикКонтактныеДанные.ТекущиеДанные.Основной = Ложь;
		КонецЕсли;
		ОбработатьНовуюСтрокуКонтактнойИнформации(Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикКонтактныеДанныеПослеУдаления(Элемент)
	
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "Перевозчик");
	ДопПараметры = Saby_ТНОбщегоНазначенияКлиентСервер.ДопПараметрыОбновленияКИ(РолиЮрЛиц);
	Saby_ТНОбщегоНазначенияКлиентСервер.ОбновитьОсновнойНомерТелефона(ЭтаФорма, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикКонтактныеДанныеЗначениеПриИзменении(Элемент)
	
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "Перевозчик");
	
	Saby_ТНОбщегоНазначенияКлиент.ЗначениеКонтактныхДанныхПриИзменении(
		ЭтаФорма, Элементы.ПеревозчикКонтактныеДанные.ТекущиеДанные, РолиЮрЛиц);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикКонтактныеДанныеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "Перевозчик");
	
	Saby_ТНОбщегоНазначенияКлиент.ЗначениеКонтактныхДанныхНачалоВыбора(
		ЭтаФорма, Элементы.ПеревозчикКонтактныеДанные.ТекущиеДанные, РолиЮрЛиц, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыПеревозчикКонтактныеДанные

#Область ОбработчикиСобытийЭлементовТаблицыФормыАдресаПунктовВыгрузки

&НаКлиенте
Процедура АдресаПунктовВыгрузкиПриИзменении(Элемент)
	
	ПроверкаДатАдресовПунктовВыгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.АдресаПунктовВыгрузки.ТекущиеДанные;
	
	Если ТекущаяСтрока.ЭтоПогрузка И Поле.Имя = "АдресаПунктовВыгрузкиОрганизацияСтрока" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПроцедураПослеИзмененияЮрЛица = Новый ОписаниеОповещения("ПослеИзмененияЮрЛица", ЭтаФорма);
		
		СтандартныеПараметрыСобытия = Новый Структура;
		СтандартныеПараметрыСобытия.Вставить("Элемент",         Элемент);
		СтандартныеПараметрыСобытия.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		СтандартныеПараметрыСобытия.Вставить("Поле",            Поле);
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Роль",                          "Отгрузчик");
		ДополнительныеПараметры.Вставить("ТолькоПросмотр",                Элементы.СтраницаПунктыМаршрута.ТолькоПросмотр);
		ДополнительныеПараметры.Вставить("ПроцедураПослеИзмененияЮрЛица", ПроцедураПослеИзмененияЮрЛица);
		Saby_ТНОбщегоНазначенияКлиент.ЮрЛицоВТаблицеВыбор(ЭтаФорма, СтандартныеПараметрыСобытия, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияЮрЛица(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.АдресаПунктовВыгрузки.ТекущиеДанные.Значение  = Результат.Адрес;
	Элементы.АдресаПунктовВыгрузки.ТекущиеДанные.Структура = Результат.АдресСтруктура;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		СкопироватьДанныеЮрЛиц("АдресаПунктовВыгрузки", Элементы.АдресаПунктовВыгрузки.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	ТекущиеДанные = Элементы.АдресаПунктовВыгрузки.ТекущиеДанные;
	
	ПараметрыВыбораАдреса = Новый Структура;
	ПараметрыВыбораАдреса.Вставить("Роль",     "АдресаПунктовВыгрузки");
	ПараметрыВыбораАдреса.Вставить("Значение", ТекущиеДанные.Структура);
	ПараметрыВыбораАдреса.Вставить("Текст",    ТекущиеДанные.Значение);
		
	Saby_ТНОбщегоНазначенияКлиент.АдресНачалоВыбора(ЭтаФорма, ПараметрыВыбораАдреса, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиДатаВремяПриИзменении(Элемент)
	
	ОбновитьДатуДопустимогоВремени(Элементы.АдресаПунктовВыгрузки.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиДопустимоеВремяПриИзменении(Элемент)
	
	ОбновитьДатуДопустимогоВремени(Элементы.АдресаПунктовВыгрузки.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиЭтоПогрузкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.АдресаПунктовВыгрузки.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
		И Не ТекущиеДанные.ЭтоПогрузка Тогда
		
		// сбросим данные организации
		ТекущиеДанные.ОрганизацияСтрока      = "";
		ТекущиеДанные.ОрганизацияИНН         = "";
		ТекущиеДанные.КлючСтроки_ДанныеЮрЛиц = 0;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыАдресаПунктовВыгрузки

#Область ОбработчикиСобытийЭлементовТаблицыФормыАдресаПромежуточныхПунктов

&НаКлиенте
Процедура АдресаПромежуточныхПунктовЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПараметрыВыбораАдреса = Новый Структура;
	ПараметрыВыбораАдреса.Вставить("Роль",           "АдресаПромежуточныхПунктов");
	ПараметрыВыбораАдреса.Вставить("Значение",       Элементы.АдресаПромежуточныхПунктов.ТекущиеДанные.Структура);
	ПараметрыВыбораАдреса.Вставить("ТолькоПросмотр", Ложь);
	
	Saby_ТНОбщегоНазначенияКлиент.АдресНачалоВыбора(ЭтаФорма, ПараметрыВыбораАдреса, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыАдресаПромежуточныхПунктов

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрузы

&НаКлиенте
Процедура ГрузыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ГрузыЗаказчикСтрока" Тогда
		СтандартнаяОбработка = Ложь;
		СтандартныеПараметрыСобытия = Новый Структура;
		СтандартныеПараметрыСобытия.Вставить("Элемент",         Элемент);
		СтандартныеПараметрыСобытия.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		СтандартныеПараметрыСобытия.Вставить("Поле",            Поле);
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Роль",                          "Заказчик");
		ДополнительныеПараметры.Вставить("ТолькоПросмотр",                Элементы.СтраницаГруз.ТолькоПросмотр);
		ДополнительныеПараметры.Вставить("ПроцедураПослеИзмененияЮрЛица", Неопределено);
		Saby_ТНОбщегоНазначенияКлиент.ЮрЛицоВТаблицеВыбор(ЭтаФорма, СтандартныеПараметрыСобытия, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузыПриАктивизацииСтроки(Элемент)
	
	СтруктураСвязанныхТаблиц = СвязанныеСГрузомТаблицы();
	Saby_ТНОбщегоНазначенияКлиентСервер.УстановитьОтборПоСвязаннымТаблицам(ЭтаФорма, СтруктураСвязанныхТаблиц);
		
КонецПроцедуры

&НаКлиенте
Процедура ГрузыПередУдалением(Элемент, Отказ)
	
	СтруктураСвязанныхТаблиц = СвязанныеСГрузомТаблицы();
	Saby_ТНОбщегоНазначенияКлиентСервер.УдалитьСтрокиСвязанныхТаблиц(ЭтаФорма, СтруктураСвязанныхТаблиц);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		СтрокаГруза = Элементы.Грузы.ТекущиеДанные;		
		СтрокаГруза.КлючСтроки = Saby_ТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(ЭтаФорма, "Грузы");
		Если Не Копирование Тогда 
			СтрокаГруза.Тип = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.Saby_ТипГруза.Груз");
		Иначе
			СкопироватьДанныеЮрЛиц("Грузы", Элементы.Грузы.ТекущаяСтрока);
		КонецЕсли;
		
		СтруктураСвязанныхТаблиц = СвязанныеСГрузомТаблицы();
		Saby_ТНОбщегоНазначенияКлиентСервер.УстановитьОтборПоСвязаннымТаблицам(ЭтаФорма, СтруктураСвязанныхТаблиц);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыГрузы

#Область ОбработчикиСобытийЭлементовТаблицыФормыМаркировки

&НаКлиенте
Процедура МаркировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Saby_ТНОбщегоНазначенияКлиент.ПередНачаломДобавленияСтрокиСвязаннойТаблицы(ЭтаФорма, "Грузы", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркировкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		СтрокаТаблицы = Элементы.Груз_АдресаПунктов.ТекущиеДанные;
		СтрокаТаблицы.КлючСтроки_Грузы = Saby_ТНОбщегоНазначенияКлиентСервер.НовыйКлючСвязаннойСтроки(ЭтаФорма, "Грузы");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыМаркировки

#Область ОбработчикиСобытийЭлементовТаблицыФормыОпасныеГрузы

&НаКлиенте
Процедура ОпасныеГрузыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Saby_ТНОбщегоНазначенияКлиент.ПередНачаломДобавленияСтрокиСвязаннойТаблицы(ЭтаФорма, "Грузы", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		СтрокаТаблицы = Элементы.ОпасныеГрузы.ТекущиеДанные;
		СтрокаТаблицы.КлючСтроки_Грузы = Saby_ТНОбщегоНазначенияКлиентСервер.НовыйКлючСвязаннойСтроки(ЭтаФорма, "Грузы");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыОпасныеГрузы

#Область ОбработчикиСобытийЭлементовТаблицыФормыСведенияГосСистем

&НаКлиенте
Процедура СведенияГосСистемПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Saby_ТНОбщегоНазначенияКлиент.ПередНачаломДобавленияСтрокиСвязаннойТаблицы(ЭтаФорма, "Грузы", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		СтрокаТаблицы = Элементы.СведенияГосСистем.ТекущиеДанные;
		СтрокаТаблицы.КлючСтроки_Грузы = Saby_ТНОбщегоНазначенияКлиентСервер.НовыйКлючСвязаннойСтроки(ЭтаФорма, "Грузы");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыСведенияГосСистем

#Область ОбработчикиСобытийЭлементовТаблицыФормыКонтейнеры

&НаКлиенте
Процедура КонтейнерыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Saby_ТНОбщегоНазначенияКлиент.ПередНачаломДобавленияСтрокиСвязаннойТаблицы(ЭтаФорма, "Грузы", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		СтрокаТаблицы = Элементы.Контейнеры.ТекущиеДанные;
		СтрокаТаблицы.КлючСтроки_Грузы = Saby_ТНОбщегоНазначенияКлиентСервер.НовыйКлючСвязаннойСтроки(ЭтаФорма, "Грузы");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыКонтейнеры

#Область ОбработчикиСобытийЭлементовТаблицыФормыУполномоченныеЛицаЗаказчика

&НаКлиенте
Процедура УполномоченныеЛицаЗаказчикаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРеквизитаФормы = Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыРеквизитаФормы(
		"НаименованиеОрганизации",
		"УполномоченныеЛицаЗаказчикаНаименованиеОрганизации",
		ВыбраннаяСтрока);
		
	ПараметрыРеквизитаФормы.ИмяИсходнойТаблицы          = "ДанныеЮрЛиц";
	ПараметрыРеквизитаФормы.ТолькоПросмотр              = Элементы.ГруппаУполномоченныеЛицаЗаказчика.ТолькоПросмотр;
	ПараметрыРеквизитаФормы.ИдентификаторИсходнойСтроки = ВыбраннаяСтрока;
	
	Saby_ТНОбщегоНазначенияКлиент.ЮрЛицоНажатие(ЭтаФорма, "УполномоченноеЛицо", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченныеЛицаЗаказчикаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Для Каждого СтруктураОтбора Из Элемент.ОтборСтрок Цикл
			Элемент.ТекущиеДанные[СтруктураОтбора.Ключ] = СтруктураОтбора.Значение;
		КонецЦикла;
		КлючИсходнойСтроки = Элемент.ТекущиеДанные.КлючСтроки;
		Элемент.ТекущиеДанные.КлючСтроки = Saby_ТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(
			ЭтаФорма, "ДанныеЮрЛиц");
		Если Копирование Тогда
			СкопироватьКонтактныеДанные(Элемент.ТекущаяСтрока, КлючИсходнойСтроки);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыРеквизитаФормы = Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыРеквизитаФормы(
		"НаименованиеОрганизации",
		"УполномоченныеЛицаЗаказчикаНаименованиеОрганизации",
		Элементы.УполномоченныеЛицаЗаказчика.ТекущаяСтрока);
			
	ПараметрыРеквизитаФормы.ИмяИсходнойТаблицы          = "ДанныеЮрЛиц";
	ПараметрыРеквизитаФормы.ИдентификаторИсходнойСтроки = Элементы.УполномоченныеЛицаЗаказчика.ТекущаяСтрока;
			
	Saby_ТНОбщегоНазначенияКлиент.ЮрЛицоНажатие(ЭтаФорма, "УполномоченноеЛицо", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыУполномоченныеЛицаЗаказчика

#Область ОбработчикиСобытийЭлементовТаблицыФормыУполномоченноеЛицоПеревозчикаКонтактныеДанные

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчикаКонтактныеДанныеПередНачаломДобавления(Элемент, Отказ, Копирование,
		Родитель, Группа, Параметр)
	
	Если Не ЕстьДанныеЮрЛица("УполномоченноеЛицоПеревозчика") Тогда 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указано уполномоченное лицо перевозчика!";
		Сообщение.Поле  = "УполномоченноеЛицоПеревозчикаСтрокой";
		Сообщение.Сообщить();		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчикаКонтактныеДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Если Копирование Тогда
			Элементы.УполномоченноеЛицоПеревозчикаКонтактныеДанные.ТекущиеДанные.Основной = Ложь;
		КонецЕсли;
		ОбработатьНовуюСтрокуКонтактнойИнформации(Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчикаКонтактныеДанныеПослеУдаления(Элемент)
	
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "УполномоченноеЛицоПеревозчика");
	ДопПараметры = Saby_ТНОбщегоНазначенияКлиентСервер.ДопПараметрыОбновленияКИ(РолиЮрЛиц);
	Saby_ТНОбщегоНазначенияКлиентСервер.ОбновитьОсновнойНомерТелефона(ЭтаФорма, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчикаКонтактныеДанныеЗначениеПриИзменении(Элемент)
	
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "УполномоченноеЛицоПеревозчика");
	
	Saby_ТНОбщегоНазначенияКлиент.ЗначениеКонтактныхДанныхПриИзменении(
		ЭтаФорма, Элементы.УполномоченноеЛицоПеревозчикаКонтактныеДанные.ТекущиеДанные, РолиЮрЛиц);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчикаКонтактныеДанныеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
		СтандартнаяОбработка)
	
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "УполномоченноеЛицоПеревозчика");
	
	Saby_ТНОбщегоНазначенияКлиент.ЗначениеКонтактныхДанныхНачалоВыбора(
		ЭтаФорма, Элементы.УполномоченноеЛицоПеревозчикаКонтактныеДанные.ТекущиеДанные, РолиЮрЛиц, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыУполномоченноеЛицоПеревозчикаКонтактныеДанные

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрицепы

&НаКлиенте
Процедура ПрицепыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Saby_ТНОбщегоНазначенияКлиент.ТаблицаПрицеповВыбор(
		ЭтаФорма,
		ВыбраннаяСтрока,
		СтандартнаяОбработка,
		Неопределено,
		Элементы.СтраницаВодителиИТС.ТолькоПросмотр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрицепыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Saby_ТНОбщегоНазначенияКлиент.ТаблицаПрицеповПриНачалеРедактирования(
		ЭтаФорма,
		Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрицепыПослеУдаления(Элемент)
	
	Saby_ТНОбщегоНазначенияКлиентСервер.ОбновитьТранспортныеСредстваНаФорме(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыПрицепы

#Область ОбработчикиСобытийЭлементовТаблицыФормыВодители

&НаКлиенте
Процедура ВодителиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтруктураОтветственного = Saby_ТНОбщегоНазначенияСервер.СтруктураОтветственного(
		Объект.ОтветственныеЛица, "", ВыбраннаяСтрока);
		
	СтруктураОтветственного.Вставить("ТолькоПросмотр", Элементы.СтраницаВодителиИТС.ТолькоПросмотр);
	
	Saby_ТНОбщегоНазначенияКлиент.НачатьРедактированиеОтветственногоЛица(ЭтаФорма, СтруктураОтветственного, "Водитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ВодителиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Для Каждого СтруктураОтбора Из Элемент.ОтборСтрок Цикл
			Элемент.ТекущиеДанные[СтруктураОтбора.Ключ] = СтруктураОтбора.Значение;
		КонецЦикла;
		
		СтруктураОтветственного = Saby_ТНОбщегоНазначенияСервер.СтруктураОтветственного(
			Объект.ОтветственныеЛица, "", Элемент.ТекущаяСтрока);
		
		Saby_ТНОбщегоНазначенияКлиент.НачатьРедактированиеОтветственногоЛица(ЭтаФорма, СтруктураОтветственного, "Водитель");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодителиПослеУдаления(Элемент)
	
	Saby_ТНОбщегоНазначенияКлиентСервер.ОбновитьВодителейНаФорме(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыВодители

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОшибки

&НаКлиенте
Процедура ТаблицаОшибокПриАктивизацииСтроки(Элемент)

	СоответствиеТаблицФормыИОбъекта = СоответствиеТаблицФормыИОбъекта();
	Saby_ТНОбщегоНазначенияКлиент.РасшифровкаЗаписиТаблицыОшибок(ЭтаФорма, СоответствиеТаблицФормыИОбъекта);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СоответствиеТаблицФормыИОбъекта = СоответствиеТаблицФормыИОбъекта();
	Saby_ТНОбщегоНазначенияКлиент.РасшифровкаЗаписиТаблицыОшибок(ЭтаФорма, СоответствиеТаблицФормыИОбъекта);

КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОшибки

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВСбис(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяКоманды", "ВыгрузитьВСбис");
	
	ПроцедураОбменДаннымиЗнП = Новый ОписаниеОповещения("ОбменДаннымиЗнП", ЭтаФорма, ДополнительныеПараметры);
	
	Saby_ТНОбщегоНазначенияКлиент.ПроверитьМодифицированностьИПродолжитьВыполнение(ПроцедураОбменДаннымиЗнП);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДокумент(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяКоманды", "ПрочитатьДокумент");
	
	ПроцедураОбменДаннымиЗнП = Новый ОписаниеОповещения("ОбменДаннымиЗнП", ЭтаФорма, ДополнительныеПараметры);
	
	Saby_ТНОбщегоНазначенияКлиент.ПроверитьМодифицированностьИПродолжитьВыполнение(ПроцедураОбменДаннымиЗнП);
	
КонецПроцедуры

#Область ДокументОснование

&НаКлиенте
Процедура ДекорацияДокументОснование(Элемент)
	
	Saby_ТНОбщегоНазначенияКлиент.ДокументОснованиеНажатие(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДокументОснование(Команда)
	
	Saby_ТНОбщегоНазначенияКлиент.ОчиститьДокументОснованиеНаФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДокументовОснований(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка", Объект.Ссылка);
	
	ОткрытьФорму("ОбщаяФорма.Saby_ВыборТиповЭПД", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти // ДокументОснование

#Область КомандыЛенты

&НаКлиенте
Процедура ЛентаВлево(Команда)
	
	СдвинутьЛенту(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛентаВправо(Команда)
	
	СдвинутьЛенту(Истина);
	
КонецПроцедуры

#КонецОбласти // КомандыЛенты

&НаКлиенте
Процедура ПоказатьСкрытьОшибки(Команда)
	
	Элементы.ФормаПоказатьСкрытьОшибки.Пометка = Не Элементы.ФормаПоказатьСкрытьОшибки.Пометка;
	
	ОбновитьВнешнийВидЭлементовОшибок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоОшибкам(Команда)
	
	ПроцедураОбновитьДанныеПоОшибкамНаКлиенте = Новый ОписаниеОповещения(
		"ОбновитьДанныеПоОшибкамНаКлиенте",
		ЭтаФорма);
	
	Saby_ТНОбщегоНазначенияКлиент.ПроверитьМодифицированностьИПродолжитьВыполнение(
		ПроцедураОбновитьДанныеПоОшибкамНаКлиенте, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
	ПроцедураОткрытьПечатнуюФорму = Новый ОписаниеОповещения(
		"ОткрытьПечатнуюФорму",
		ЭтаФорма);
	
	Saby_ТНОбщегоНазначенияКлиент.ПроверитьМодифицированностьИПродолжитьВыполнение(
		ПроцедураОткрытьПечатнуюФорму);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииПослеЗаписиНаСервере()
	
	ЗаполнитьРасчетныеРеквизиты();
	
	Saby_ТНОбщегоНазначенияСервер.ОбновитьЛенту(ЭтаФорма, Истина);
	
	Saby_ТНОбщегоНазначенияСервер.ОбновитьВнешнийВидЭлементовОшибок(ЭтаФорма);
		
	ОбновитьВидимостьПоЭтапуИУчастнику();
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
	СтруктураСвязанныхТаблиц = СвязанныеСГрузомТаблицы();
	Saby_ТНОбщегоНазначенияКлиентСервер.УстановитьОтборПоСвязаннымТаблицам(ЭтаФорма, СтруктураСвязанныхТаблиц);
	
	УстановитьОтборУполномоченныхЛиц();
	
	Saby_ТНОбщегоНазначенияСервер.УстановитьОтборТаблицыОтветственных(Элементы.Водители, "Водитель");
	
	Saby_ТНОбщегоНазначенияКлиентСервер.НастроитьДополнительныеКонтакты(
		ЭтаФорма, "Отправитель,Перевозчик,УполномоченноеЛицоПеревозчика");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасчетныеРеквизиты()
	
	// Активный этап и индикация состояния
	Saby_ТНОбщегоНазначенияСервер.ОтобразитьНаФормеСбисЭтапИСостояние(ЭтаФорма);
	
	// Документ основание
	Если ЗначениеЗаполнено(Объект.ДокументОснование_Идентификатор) Тогда
		ДокументОснование = Документы[Объект.ДокументОснование_ОбъектМетаданных].ПолучитьСсылку(
			Новый УникальныйИдентификатор(Объект.ДокументОснование_Идентификатор));
		Элементы.ДекорацияДокументОснование.Заголовок = СокрЛП(ДокументОснование);
	КонецЕсли;
	
	ЭтаФорма.ОтправительСтрокой = Saby_ТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, "Отправитель");
		
	ИмяРолиОформитель = "Оформитель";
	ЭтаФорма.ОформительСтрокой = Saby_ТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, ИмяРолиОформитель);
	СтрокаЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(Объект.ДанныеЮрЛиц, ИмяРолиОформитель);
	Saby_ТНОбщегоНазначенияКлиентСервер.ЗаполнитьДополнительныеПоляЮрЛица(
		ЭтаФорма, СтрокаЮрЛиц, "Основание", ИмяРолиОформитель);
		
	ЭтаФорма.ПеревозчикСтрокой = Saby_ТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, "Перевозчик");
	
	ИмяРолиУполномоченноеЛицоПеревозчика = "УполномоченноеЛицоПеревозчика";
	ЭтаФорма.УполномоченноеЛицоПеревозчикаСтрокой = Saby_ТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, ИмяРолиУполномоченноеЛицоПеревозчика);
	СтрокаЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, ИмяРолиУполномоченноеЛицоПеревозчика);
	Saby_ТНОбщегоНазначенияКлиентСервер.ЗаполнитьДополнительныеПоляЮрЛица(
		ЭтаФорма, СтрокаЮрЛиц, "Полномочия,Основание", ИмяРолиУполномоченноеЛицоПеревозчика);
	
	// Телефоны
	РолиЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(
		ЭтаФорма, "Отправитель,Перевозчик,УполномоченноеЛицо,УполномоченноеЛицоПеревозчика");
	ДопПараметры = Saby_ТНОбщегоНазначенияКлиентСервер.ДопПараметрыОбновленияКИ(РолиЮрЛиц);
	Saby_ТНОбщегоНазначенияКлиентСервер.ОбновитьОсновнойНомерТелефона(ЭтаФорма, ДопПараметры);
	
	// ТС
	Saby_ТНОбщегоНазначенияКлиентСервер.ОбновитьТранспортныеСредстваНаФорме(ЭтаФорма);
	
	// Водители
	Saby_ТНОбщегоНазначенияКлиентСервер.ОбновитьВодителейНаФорме(ЭтаФорма);
	
	СтруктураОтветственного = Saby_ТНОбщегоНазначенияСервер.СтруктураОтветственного(Объект.ОтветственныеЛица, "Ответственный");
	Saby_ТНОбщегоНазначенияСервер.ОбновитьОтветственногоНаФорме(
		ЭтаФорма, "ОтветственныйЗаПеревозкуСтрокой", СтруктураОтветственного);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьИДоступностьЭлементов()
	
	Элементы.ГруппаПредставительЗаказчика.Видимость = Объект.ПредставительЗаказчика;
		
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ТипДокумента");
	МассивЭлементов.Добавить("ДекорацияЗаполнитьПодачаТС");
	МассивЭлементов.Добавить("ПодачаАдрес");
	МассивЭлементов.Добавить("ДекорацияЗаполнитьКонечнаяТочка");
	МассивЭлементов.Добавить("КонечнаяТочкаАдрес");
	
	Saby_ТНОбщегоНазначенияКлиентСервер.ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Доступность", НЕ Элементы.Группа_ДанныеОформителя.ТолькоПросмотр, МассивЭлементов);
		
	// если еще доступно то проверяем на "типдокумента"	
	Элементы.Договор.ТолькоПросмотр = (Объект.ТипДокумента = Перечисления.Saby_ТипДокументаЗнП.Заказ);
	
	Элементы.ДекорацияЗаполнитьПодачаТС.Видимость      = Не ЗначениеЗаполнено(Объект.ПодачаАдрес);
	Элементы.ДекорацияЗаполнитьКонечнаяТочка.Видимость = Не ЗначениеЗаполнено(Объект.КонечнаяТочкаАдрес);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьПоЭтапуИУчастнику()
	
	Признаки = ПризнакиДокумента();
	
	Элементы.ГруппаДокументОснование.Видимость = Признаки.Исходящий
		И (Признаки.Этапы.ОформлениеДоступно Или ЗначениеЗаполнено(Объект.ДокументОснование_Идентификатор));
		
	ДоЗавершенПоложительно = 6;	
		
	Элементы.ФормаСоздать_Saby_ТранспортнаяНакладная.Доступность = 
		Признаки.Этапы.ДОЗавершен
		И ЭтаФорма.ИндексКартинки = ДоЗавершенПоложительно; // ДО завершен Положительно	
				
	УстановитьТолькоПросмотр = Новый Массив;	
	УстановитьТолькоПросмотр.Добавить("Группа_ДанныеОформителя");
	УстановитьТолькоПросмотр.Добавить("ГруппаОсновноеВерх");
	УстановитьТолькоПросмотр.Добавить("ГруппаЗаказчик");
	УстановитьТолькоПросмотр.Добавить("ГруппаПеревозчик");
	УстановитьТолькоПросмотр.Добавить("Договор");
	УстановитьТолькоПросмотр.Добавить("СтраницаПунктыМаршрута");
	УстановитьТолькоПросмотр.Добавить("СтраницаГруз");
	УстановитьТолькоПросмотр.Добавить("ГруппаПараметрыТС");
	УстановитьТолькоПросмотр.Добавить("ГруппаСпециальныеУсловия");
	УстановитьТолькоПросмотр.Добавить("ГруппаУполномоченныеЛицаЗаказчика");
	
	Saby_ТНОбщегоНазначенияКлиентСервер.ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "ТолькоПросмотр", Не Признаки.Этапы.ОформлениеДоступно, УстановитьТолькоПросмотр);
		
	ВидимостьИПросмотр = Новый Массив;
	ВидимостьИПросмотр.Добавить("ГруппаОплата");
	ВидимостьИПросмотр.Добавить("ГруппаУполномоченныеЛицаПеревозчика");
	ВидимостьИПросмотр.Добавить("СтраницаВодителиИТС");
	НомерТитулаУтверждение = 2;
	
	Saby_ТНОбщегоНазначенияКлиентСервер.ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", Признаки.Этапы.Номер >= НомерТитулаУтверждение, ВидимостьИПросмотр);
		
	Saby_ТНОбщегоНазначенияКлиентСервер.ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "ТолькоПросмотр", Не Признаки.Этапы.УтверждениеДоступно, ВидимостьИПросмотр);
	
КонецПроцедуры

&НаСервере
Функция ПризнакиДокумента()
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Этапы",     Новый Структура);
	РезультатФункции.Вставить("Исходящий", Объект.Направление = Перечисления.Saby_Направление.Исходящий);
		
	ДОЗавершен = Saby_ТНОбщегоНазначенияКлиентСервер.ДокументооборотЗавершен(ЭтаФорма);
	
	ОформлениеДоступно = Saby_ТНОбщегоНазначенияСервер.ТипТитулаДоступенУчастнику(
		ЭтаФорма,
		Объект.ТекущиеЭтапы,
		Перечисления.Saby_ТипТитулаЗнП.Оформление,
		ДОЗавершен);
	РезультатФункции.Этапы.Вставить("ОформлениеДоступно", ОформлениеДоступно);
		
	УтверждениеДоступно = Saby_ТНОбщегоНазначенияСервер.ТипТитулаДоступенУчастнику(
		ЭтаФорма,
	    Объект.ТекущиеЭтапы,
		Перечисления.Saby_ТипТитулаЗнП.Утверждение,
		ДОЗавершен);
	РезультатФункции.Этапы.Вставить("УтверждениеДоступно", УтверждениеДоступно);
	
	РезультатФункции.Этапы.Вставить("ДОЗавершен", ДОЗавершен);
	
	Если РезультатФункции.Этапы.ОформлениеДоступно Тогда
		ПорядковыйНомер = 1;
	ИначеЕсли РезультатФункции.Этапы.УтверждениеДоступно Тогда
		ПорядковыйНомер = 2;
	ИначеЕсли ДОЗавершен Тогда
		ПорядковыйНомер = 3;
	Иначе
		ПорядковыйНомер = 4;
	КонецЕсли;
	
	РезультатФункции.Этапы.Вставить("Номер", ПорядковыйНомер);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОбменДаннымиЗнП(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ИмяКоманды = Результат;
	Если ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.Свойство("ИмяКоманды") Тогда
		ИмяКоманды = ДополнительныеПараметры.ИмяКоманды;
	КонецЕсли;
	
	Если ИмяКоманды = "ВыгрузитьВСбис" Тогда
		ДанныеДляОбработки = Новый Массив;
		ПараметрыВыгрузки = Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыВыгрузки(Объект.Ссылка);
		ДанныеДляОбработки.Добавить(ПараметрыВыгрузки);
	Иначе
		ДанныеДляОбработки = Новый Массив;
		ПараметрыЗагрузки = Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыЗагрузки(Объект.Ссылка);
		Если ИмяКоманды = "ОбновитьАктивныйЭтап" Тогда
			ПараметрыЗагрузки.ТекущийТитул = АктивныйЭтапСтрокой;
			ПараметрыЗагрузки.ТолькоАктивныйЭтап = Истина;
		КонецЕсли;
		ПараметрыЗагрузки.ИзДокумента = Истина;
		ПараметрыЗагрузки.ИмяМетаданных = "Saby_ЗаказНаПеревозку";
		ДанныеДляОбработки.Добавить(ПараметрыЗагрузки);
	КонецЕсли;
	
	ДополнительныеПараметрыОбмена = Новый Структура;
	ДополнительныеПараметрыОбмена.Вставить("ДвоичныеДанныеОбработки", Неопределено);
	
	Saby_ТНОбщегоНазначенияКлиент.ВыполнитьКомандуСбис(
		ЭтаФорма,
		ИмяКоманды,
		ДанныеДляОбработки,
		ДополнительныеПараметрыОбмена);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНовуюСтрокуКонтактнойИнформации(ИмяТЧ)
	
	Роль = ПредопределенноеЗначение("Перечисление.Saby_РолиКонтрагентов.ПустаяСсылка");
	
    Отбор = Новый Структура;
	Отбор.Вставить("Роль", Роль);
	
	НайденныеСтроки = Объект.КонтактныеДанные.НайтиСтроки(Отбор);
	Для Каждого Строка Из НайденныеСтроки Цикл 
		Строка.Роль                   = Элементы[ИмяТЧ].ОтборСтрок.Роль;
		Строка.КлючСтроки_ДанныеЮрЛиц = Элементы[ИмяТЧ].ОтборСтрок.КлючСтроки_ДанныеЮрЛиц;
	КонецЦикла;
				
КонецПроцедуры

&НаКлиенте
Функция ЕстьДанныеЮрЛица(Роль)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Роль", ПредопределенноеЗначение("Перечисление.Saby_РолиКонтрагентов." + Роль));
	
	Возврат Объект.ДанныеЮрЛиц.НайтиСтроки(Отбор).Количество() > 0;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьИДоступностьЭлементовНаКлиенте() Экспорт
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СвязанныеСГрузомТаблицы()
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Грузы", Новый Массив);
	
	РезультатФункции.Грузы.Добавить("Груз_АдресаПунктов");
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура УстановитьОтборУполномоченныхЛиц()
	
	Отбор = Новый Структура;
	Отбор.Вставить("Роль", Перечисления.Saby_РолиКонтрагентов.УполномоченноеЛицо);
	
	ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
	Элементы.УполномоченныеЛицаЗаказчика.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияОтветственногоЛицаНаФорме(СтруктураОтветственногоЛица) Экспорт
	
	Роль = СокрЛП(СтруктураОтветственногоЛица.Роль);
	
	Если Роль = "Ответственный" Тогда
		ЭтаФорма.ОтветственныйЗаПеревозкуСтрокой = Saby_ТНОбщегоНазначенияКлиентСервер.ПредставлениеФИО(
			СтруктураОтветственногоЛица);
		Если Не ЗначениеЗаполнено(ЭтаФорма.ОтветственныйЗаПеревозкуСтрокой) Тогда
			ЭтаФорма.ОтветственныйЗаПеревозкуСтрокой = "Заполнить";
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДатуДопустимогоВремени(ИдентификаторСтроки)
	
	СтрокаПункта = Объект.АдресаПунктовВыгрузки.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтрокаПункта.ДопустимоеВремя = Дата(
		Год(СтрокаПункта.ДатаВремя),
		Месяц(СтрокаПункта.ДатаВремя),
		День(СтрокаПункта.ДатаВремя),
		Час(СтрокаПункта.ДопустимоеВремя),
		Минута(СтрокаПункта.ДопустимоеВремя),
		Секунда(СтрокаПункта.ДопустимоеВремя));
	
КонецПроцедуры

&НаСервере
Функция ЗаполнениеНаОснованииINI() Экспорт
	
	Результат = Saby_ТНОбщегоНазначенияСервер.ЗаполнитьНаОснованииINI(Объект, ДокументОснование);	
	Если ЗначениеЗаполнено(Результат) Тогда		
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ОбработкаОповещений

&НаКлиенте
Процедура ОбработатьОповещениеОбновитьДокумент(Параметр) Экспорт
	
	ЭтаФорма.ТаблицаОшибок.Очистить();
	ЭтаФорма.КоличествоОшибок = 0;
	
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещениеВыполнитьПереходНаФорме() Экспорт
	
	ОбменДаннымиЗнП("ОбновитьАктивныйЭтап");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещениеЗавершениеВыполнитьДействиеНаФорме(Параметр) Экспорт
	
	Если Параметр.status = "error" Тогда
		
		Saby_ТНОбщегоНазначенияКлиент.ОбработатьОшибкиИзФормыВыполнитьДействие(ЭтаФорма, Объект.Ссылка, Параметр);
		
		ЭтаФорма.Прочитать();
		
	Иначе
		
		ОбменДаннымиЗнП("ОбновитьАктивныйЭтап");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПечатнуюФорму(Результат, ДополнительныеПараметры) Экспорт
	
	Saby_ТНОбщегоНазначенияКлиент.СоздатьИОткрытьПечатнуюФорму(Объект.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти // ОбработкаОповещений

#Область Ошибки

&НаСервере
Процедура ОбновитьДанныеПоОшибкамНаСервере(Знач Ошибки = Неопределено) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Ссылка", Объект.Ссылка);
	
	Saby_ТНОбщегоНазначенияСервер.ОбновитьОшибки(
		ЭтаФорма,
		ДополнительныеПараметры,
		Ошибки);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВнешнийВидЭлементовОшибок()
	
	Saby_ТНОбщегоНазначенияСервер.ОбновитьВнешнийВидЭлементовОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДекорациюНаСервере(Знач ПараметрыВыделенияДекорации) Экспорт
	
	Saby_ТНОбщегоНазначенияСервер.ОбновитьДекорацию(ЭтаФорма, ПараметрыВыделенияДекорации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоОшибкамНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьДанныеПоОшибкамНаСервере();
	
КонецПроцедуры

&НаКлиенте
Функция СоответствиеТаблицФормыИОбъекта()
	
	СоответствиеТаблицФормыИОбъекта = Новый Соответствие;
	СоответствиеТаблицФормыИОбъекта.Вставить("Водители",                    "ОтветственныеЛица");
	СоответствиеТаблицФормыИОбъекта.Вставить("УполномоченныеЛицаЗаказчика", "ДанныеЮрЛиц");
	СоответствиеТаблицФормыИОбъекта.Вставить("Прицепы",                     "ТранспортныеСредства");
	
	Возврат СоответствиеТаблицФормыИОбъекта;
	
КонецФункции

#КонецОбласти // Ошибки

&НаКлиенте
Процедура ОбновитьСумму()
	
	НДС = Объект.СтавкаНДС;
	НДС = СтрЗаменить(НДС, "%", "");
	НДС = СтрЗаменить(НДС, "без НДС", "0");
	Если ЗначениеЗаполнено(НДС) Тогда
		НДС = Число(НДС);
	Иначе
		НДС = 0;
	КонецЕсли;
	
	СтоПроцентов = 100;
	Объект.СуммаБезНДС = Объект.СуммаСНДС / (1 + НДС / СтоПроцентов);
	
КонецПроцедуры

&НаСервере
Процедура ОграничитьТипыДокументовОснованийНаСервере() Экспорт
	
	Saby_ТНОбщегоНазначенияСервер.ОграничитьТипыДокументовОснований(ЭтаФорма);
	
КонецПроцедуры

#Область Лента

&НаСервере
Процедура СдвинутьЛенту(Знач Вправо)
	
	Saby_ТНОбщегоНазначенияСервер.СдвинутьЛенту(ЭтаФорма, Вправо);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТитулОбработкаНавигационнойСсылки(Элемент,
		НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Saby_ТНОбщегоНазначенияКлиент.ОбработкаНавигационнойСсылкиЛенты(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьРеквизитИзТитула(СтрокаЛенты) Экспорт
		
	Если СтрокаЛенты.НаименованиеТитула = "Оформление" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ТипДокумента;
	ИначеЕсли СтрокаЛенты.НаименованиеТитула = "Утверждение" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ТранспортноеСредствоСтрокой;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТитулОтрицательноЗавершен(СтрокаЛенты) Экспорт
	
	ДОЗавершенОтрицательно = 5;
	
	Возврат СтрокаЛенты.ТипТитула = Перечисления.Saby_ТипТитулаЗнП.Утверждение
		И ЭтаФорма.ИндексКартинки = ДОЗавершенОтрицательно;
	
КонецФункции

#КонецОбласти // Лента

&НаСервере
Процедура УстановкаСпискаДоступныхТиповКИ()
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ОтправительКонтактныеДанныеТип");
	МассивЭлементов.Добавить("ПеревозчикКонтактныеДанныеТип");
	МассивЭлементов.Добавить("УполномоченноеЛицоПеревозчикаКонтактныеДанныеТип");
		
	Saby_ТНОбщегоНазначенияСервер.УстановкаСпискаДоступныхТиповКИ(ЭтаФорма, МассивЭлементов);
	   
КонецПроцедуры

#Область ИзменениеАдресов

&НаКлиенте
Процедура ИзменитьАдресПодачи(СтандартнаяОбработка) 
	
	ПараметрыВыбораАдреса = Новый Структура;
	ПараметрыВыбораАдреса.Вставить("Роль",           "ПодачаТС");
	ПараметрыВыбораАдреса.Вставить("Значение",       Объект.ПодачаАдресСтруктура);
	ПараметрыВыбораАдреса.Вставить("Текст",          Объект.ПодачаАдрес);
	ПараметрыВыбораАдреса.Вставить("ТолькоПросмотр", Элементы.СтраницаПунктыМаршрута.ТолькоПросмотр);
	
	Saby_ТНОбщегоНазначенияКлиент.АдресНачалоВыбора(ЭтаФорма, ПараметрыВыбораАдреса, СтандартнаяОбработка);
	
КонецПроцедуры

 &НаКлиенте
Процедура ИзменитьАдресКонечнойТочки(СтандартнаяОбработка) 
	
	ПараметрыВыбораАдреса = Новый Структура;
	ПараметрыВыбораАдреса.Вставить("Роль",           "КонечнаяТочка");
	ПараметрыВыбораАдреса.Вставить("Значение",       Объект.КонечнаяТочкаАдресСтруктура);
	ПараметрыВыбораАдреса.Вставить("Текст",          Объект.КонечнаяТочкаАдрес);
	ПараметрыВыбораАдреса.Вставить("ТолькоПросмотр", Элементы.СтраницаПунктыМаршрута.ТолькоПросмотр);
	
	Saby_ТНОбщегоНазначенияКлиент.АдресНачалоВыбора(ЭтаФорма, ПараметрыВыбораАдреса, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ИзменениеАдресов

&НаКлиенте
Процедура СкопироватьДанныеЮрЛиц(ИмяТаблицы, ИдентификаторСтроки)
	
	СтрокаТаблицы = Объект[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.КлючСтроки_ДанныеЮрЛиц) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПоКлючу = Новый Структура("КлючСтроки", СтрокаТаблицы.КлючСтроки_ДанныеЮрЛиц);
	НайденныеСтроки = Объект.ДанныеЮрЛиц.НайтиСтроки(ОтборПоКлючу);
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаТаблицы.КлючСтроки_ДанныеЮрЛиц = 0;
		Возврат;
	КонецЕсли;
	
	КлючИсходнойСтроки = СтрокаТаблицы.КлючСтроки_ДанныеЮрЛиц;
	СтрокаТаблицы.КлючСтроки_ДанныеЮрЛиц = Saby_ТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(
		ЭтаФорма, "ДанныеЮрЛиц");
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		СтрокаЮрЛиц = Объект.ДанныеЮрЛиц.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЮрЛиц, НайденнаяСтрока);
		СтрокаЮрЛиц.КлючСтроки = СтрокаТаблицы.КлючСтроки_ДанныеЮрЛиц;
	КонецЦикла;
	
	СкопироватьКонтактныеДанные(СтрокаЮрЛиц.ПолучитьИдентификатор(), КлючИсходнойСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьКонтактныеДанные(ИдентификаторСтроки, КлючИсходнойСтроки)
	
	СтрокаЮрЛиц = Объект.ДанныеЮрЛиц.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ОтборПоКлючу = Новый Структура;
	ОтборПоКлючу.Вставить("КлючСтроки_ДанныеЮрЛиц", КлючИсходнойСтроки);
	
	НайденныеСтроки = Объект.КонтактныеДанные.НайтиСтроки(ОтборПоКлючу);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		СтрокаКонтактныхДанных = Объект.КонтактныеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКонтактныхДанных, НайденнаяСтрока);
		СтрокаКонтактныхДанных.КлючСтроки_ДанныеЮрЛиц = СтрокаЮрЛиц.КлючСтроки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаДатАдресовПунктовВыгрузки()
	
	ДатаПогрузки = Дата(1, 1, 1);
	
	ДатаПодачиТС = ?(ЗначениеЗаполнено(Объект.ПодачаДатаВремя), Объект.ПодачаДатаВремя, Дата(1, 1, 1));
	
	ОчиститьСообщения();
	СтрокиПогрузки = Объект.АдресаПунктовВыгрузки.НайтиСтроки(Новый Структура("ЭтоПогрузка", Истина));
	Для Каждого СтрокаПогрузки Из СтрокиПогрузки Цикл
		ДатаПогрузки = Макс(ДатаПогрузки, СтрокаПогрузки.ДатаВремя);
		Если СтрокаПогрузки.ДатаВремя < ДатаПодачиТС Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата погрузки должна быть позднее даты подачи транспортного средства";
			Сообщение.Поле = СтрШаблон(
				"Объект.АдресаПунктовВыгрузки[%1].ДатаВремя",
				Формат(СтрокаПогрузки.ПолучитьИдентификатор(), "ЧДЦ=0; ЧН=0; ЧГ="));
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
	СтрокиВыгрузки = Объект.АдресаПунктовВыгрузки.НайтиСтроки(Новый Структура("ЭтоПогрузка", Ложь));
	Для Каждого СтрокаВыгрузки Из СтрокиВыгрузки Цикл
		Если ДатаПогрузки <> Дата(1, 1, 1) И СтрокаВыгрузки.ДатаВремя <= ДатаПогрузки Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата выгрузки должна быть позднее даты погрузки";
			Сообщение.Поле = СтрШаблон(
				"Объект.АдресаПунктовВыгрузки[%1].ДатаВремя",
				Формат(СтрокаВыгрузки.ПолучитьИдентификатор(), "ЧДЦ=0; ЧН=0; ЧГ="));
			Сообщение.Сообщить();
		КонецЕсли;
		Если СтрокаВыгрузки.ДатаВремя < ДатаПодачиТС Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата выгрузки должна быть позднее даты подачи транспортного средства";
			Сообщение.Поле = СтрШаблон(
				"Объект.АдресаПунктовВыгрузки[%1].ДатаВремя",
				Формат(СтрокаВыгрузки.ПолучитьИдентификатор(), "ЧДЦ=0; ЧН=0; ЧГ="));
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
