
&НаКлиенте
Функция ПроверитьНаличиеПараметровПодключенияНаСервере() Экспорт
	Возврат ESD_КомандыОбменаДляФормыКлиент.ПроверитьНаличиеПараметровПодключенияНаСервере();
КонецФункции

&НаКлиенте
Процедура ПолучитьАктуальностьВерсии()
	ОбновитьАктуальныйСтатусВерсии();
КонецПроцедуры

&НаКлиенте
Процедура ПослеСменыАккаунта(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	ПослеИзмененияАвторизацииНаСервере();
	ПолучитьАктуальностьВерсии();
КонецПроцедуры

#Область include_etrn_base_CommonForm_НастройкиЭПД_Функционал_СменаАккаунта_Переопределяемые
#КонецОбласти

