
&НаКлиенте
Процедура ОткрытьВыборИзСписка(СписокВыбора, ОписаниеОповещения, ЭлементФормы = Неопределено, ЗаголовокОкнаВыбора = "Выберите значение", ТекЭлемСписка = 0)
	// Проблема только при скрытии областей управляемой формы с двухфакторной авторизацией
	//Подглядел у 1с
	
	// обход ошибок платформы: в тонком клиенте не работает ПоказатьВыборИзСписка (ПоказатьВыборИзМеню не работает в веб-клиенте 
	// и в событии ПриИзмененииСодержимогоОбласти табличного документа - где мы его и хотим использовать прежде всего)
	#Если ВебКлиент Тогда
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, ЭлементФормы, ТекЭлемСписка);	
	#Иначе
		СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, ЗаголовокОкнаВыбора, ТекЭлемСписка);		
	#КонецЕсли
КонецПроцедуры

