
Процедура СохранитьСоставителя(Знач Результат, ДокументОснование) Экспорт
	ДокОбъект = ДокументОснование.ПолучитьОбъект(); 
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	СтрокаЮрЛиц = МодульТНОбщегоНазначенияКлиентСервер.СтрокаЮрЛиц(Результат.ЭлементФормы, ДокОбъект, Результат.Роль);
	ЗаполнитьЗначенияСвойств(СтрокаЮрЛиц, Результат);
	МодульТНОбщегоНазначенияКлиентСервер.ДобавитьДанныеЮрЛицОбъекта(ДокОбъект, Результат, Результат.ЭлементФормы, СтрокаЮрЛиц); 
	
	МодульТНОбщегоНазначенияКлиентСервер.ОбновитьКонтактныеДанныеОбъекта(ДокОбъект, Результат, СтрокаЮрЛиц);
	ДокОбъект.Записать();
КонецПроцедуры

