
Процедура ФЛК_Инициализация(Форма, Знач ГруппаВладелец = Неопределено) Экспорт
	ФЛК_ДобавитьКоманду(Форма);
	
	Если ГруппаВладелец = Неопределено Тогда
		ГруппаВладелец = Форма.КоманднаяПанель;
	КонецЕсли;
	ФЛК_ДобавитьЭлемент(Форма, ГруппаВладелец);
КонецПроцедуры

Функция ФЛК_ДобавитьЭлемент(Форма, ГруппаВладелец) Экспорт
	ЭлементФормы_ = Форма.Элементы.Найти("ФЛК_Выполнить");
	Если ЭлементФормы_ = Неопределено Тогда
		ЭлементФормы_ = Форма.Элементы.Добавить("ФЛК_Выполнить", Тип("КнопкаФормы"), ГруппаВладелец);
		ЭлементФормы_.Заголовок = "Проверить заполнение";
		ЭлементФормы_.ИмяКоманды = "ФЛК_Выполнить";
		Попытка
			// Доступен с 8.3.15, в ранних версиях будет ошибка
			ЭлементФормы_["ПоложениеВКоманднойПанели"] = Вычислить("ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю");
		// BSLLS:MissingCodeTryCatchEx-off
		Исключение
		КонецПопытки;
		// BSLLS:MissingCodeTryCatchEx-on
		
		Если Форма.Элементы.Найти("ФормаПоказатьСкрытьОшибки") <> Неопределено Тогда
			Форма.Элементы.Переместить(ЭлементФормы_, ГруппаВладелец, Форма.Элементы.ФормаПоказатьСкрытьОшибки);
		КонецЕсли;	
	КонецЕсли;
	
	// Перенесем признак "ТолькоПросмотр" с формы на добавляемый элемент команды
	ЭлементФормы_.Доступность = Не Форма.ТолькоПросмотр И Форма.Доступность;
	
	Возврат ЭлементФормы_;	
КонецФункции

Функция ФЛК_ДобавитьКоманду(Форма) Экспорт
	КомандаФормы_ = Форма.Команды.Найти("ФЛК_Выполнить");
	Если КомандаФормы_ <> Неопределено Тогда
		Возврат КомандаФормы_;
	КонецЕсли;
	
	КомандаФормы_ = Форма.Команды.Добавить("ФЛК_Выполнить");
	КомандаФормы_.Заголовок = "Выполнить ФЛК";
	КомандаФормы_.Действие = "Подключаемый_ФЛК_Выполнить";
	
	Возврат КомандаФормы_;
КонецФункции

