
Процедура ФЛК_Выполнить(Форма, СсылкаНаДокумент) Экспорт
	Если Не ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Ссылка", СсылкаНаДокумент);
	ESD_ТНОбщегоНазначенияСервер.ОбновитьОшибки(Форма, ДополнительныеПараметры);
КонецПроцедуры

Процедура ФЛК_ПередВыгрузкой_ВыполнитьСписок(СписокСсылок) Экспорт 
	Если Не ЗначениеЗаполнено(СписокСсылок) Тогда
		ESD_ТНОбщегоНазначенияСервер.СообщитьПользователюСервер("Не выбрано документов для проверки.");
		Возврат;
	КонецЕсли; 

	Для Каждого Ссылка_ Из СписокСсылок Цикл
		ФЛК_ПередВыгрузкой_Выполнить(Ссылка_);	
	КонецЦикла;	
КонецПроцедуры   

Процедура ФЛК_ПередВыгрузкой_Выполнить(Ссылка)  Экспорт 
	ПараметрыВыгрузки_ = ESD_ТНОбщегоНазначенияКлиентСервер.ПараметрыВыгрузки(Ссылка);
	ESD_ТНОбщегоНазначенияСервер.ЗаполнитьПараметрыВыгрузки(ПараметрыВыгрузки_);  
	
	Если ПараметрыВыгрузки_.Свойство("Состояние")
		И ESD_ТНОбщегоНазначенияКлиентСервер.ДокументооборотЗавершен(ПараметрыВыгрузки_.Состояние.ИндексКартинки) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыгрузки_.ВыполнитьФЛК = Истина;    
	Результат_ = ESD_ТНОбщегоНазначенияКлиентСервер.РезультатВзаимодействияСоСБИС(0);
	ESD_ТНВыгрузкаСервер.СформироватьСтруктуруДокументаСПроверкойФЛК(ПараметрыВыгрузки_, Результат_);
КонецПроцедуры

