
&НаКлиенте
// Авторизация в сервисе
// Параметры:
//  Команда - Строка - имя команды
//	ЭтаФорма - ФормаКлиентскогоПриложения - источник авторизации
//
// Возвращаемое значение:
//  Структура - данные авторизации, в противном случае Неопределено
Функция АвторизацияSaby(Команда, ЭтаФорма) Экспорт
	
	context_params = ВыполнитьНаСервере("Saby_Core.ПроверитьНаличиеПараметровПодключения", Неопределено);
	
	Если context_params = Неопределено Тогда
		
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Вы не авторизованы! Выполните авторизацию и повторите команду";
		Сообщение.Сообщить();
		
		ПараметрыОткрытияФормыОбработки = МодульКодаКлиент("Saby_ТНОбщегоНазначенияКлиент").ПараметрыОткрытияФормыОбработки(
			"Обработка.SABY.Форма.Вход");
		ПараметрыОткрытияФормыОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		МодульКодаКлиент("Saby_ТНОбщегоНазначенияКлиент").ОткрытьФормуОбработки(ПараметрыОткрытияФормыОбработки);
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат context_params;
	
КонецФункции

