
&НаКлиенте
// Авторизация в сервисе
// Параметры:
//  Команда - Строка - имя команды
//	ЭтаФорма - ФормаКлиентскогоПриложения - источник авторизации
//
// Возвращаемое значение:
//  Структура - данные авторизации, в противном случае Неопределено
Функция АвторизацияSaby(Команда = Неопределено, ЭтаФорма = Неопределено) Экспорт
	
	context_params = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД", Неопределено);
	
	Если context_params = Неопределено Тогда
		
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Вы не авторизованы! Выполните авторизацию и повторите команду";
		Сообщение.Сообщить();
		
		ПараметрыОткрытияФормыОбработки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПараметрыОткрытияФормыОбработки(
			ФормыЯдраКлиент() + "Вход");
			
		ПараметрыОткрытияФормыОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОткрытьФормуОбработки(ПараметрыОткрытияФормыОбработки);
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат context_params;
	
КонецФункции

