
&НаКлиенте
// Авторизация в сервисе
// Параметры:
//  Команда - Строка - имя команды
//	ЭтаФорма - ФормаКлиентскогоПриложения - источник авторизации
//	Оповещение - ОписаниеОповещения - процедура оповещения
//
// Возвращаемое значение:
//  Структура - данные авторизации, в противном случае Неопределено
Функция АвторизацияSaby(Команда = Неопределено, ЭтаФорма = Неопределено, Оповещение = Неопределено) Экспорт
	
	context_params = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД");
	
	ЭтоФормаНастроекЭПД = ЭтаФорма <> Неопределено 
		И МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЭтоФормаПриложения(ЭтаФорма)
		И Найти(ЭтаФорма.ИмяФормы, "НастройкиЭПД") > 0;
	
	Если context_params = Неопределено И Не ЭтоФормаНастроекЭПД Тогда
		
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Вы не авторизованы! Выполните авторизацию и повторите команду";
		Сообщение.Сообщить();
		
		ПараметрыОткрытияФормыОбработки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПараметрыОткрытияФормыОбработки(
			ФормыЯдраКлиент() + "Вход");
			
		Если ЭтаФорма <> Неопределено Тогда	
			ПараметрыОткрытияФормыОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			ПараметрыОткрытияФормыОбработки.Владелец = ЭтаФорма;
		Иначе
			ПараметрыОткрытияФормыОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		КонецЕсли;
		
		ПараметрыОткрытияФормыОбработки.ОписаниеОповещенияОЗакрытии = Оповещение;
		
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОткрытьФормуОбработки(ПараметрыОткрытияФормыОбработки);
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат context_params;
	
КонецФункции

