
&НаКлиенте
// Фоновое выполнене команды
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - источник вызова выполнения
//  СтруктураПараметров - Структура - параметры для выполнения команды
//	УникальныйИдентификатор - УникальныйИдентификатор - уникальный идентификатор длительной операции
//
Процедура ВыполнитьКомандуВФоне(Форма, СтруктураПараметров, Знач УникальныйИдентификатор = Неопределено) Экспорт
	Если УникальныйИдентификатор = Неопределено Тогда
		УникальныйИдентификатор = Форма.УникальныйИдентификатор;
	КонецЕсли;

	ДлительнаяОперация = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ДлительнаяОперация",
		СтруктураПараметров, 
		УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма); 
	Если СтруктураПараметров.Свойство("ПараметрыОжидания") Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыОжидания, СтруктураПараметров.ПараметрыОжидания);
	КонецЕсли;	
	
	СтруктураПараметров.Вставить("Форма", Форма);
	
	Оповещение = Новый ОписаниеОповещения(
		"ОбработатьРезультат", МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент"), СтруктураПараметров);
		
	Попытка
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	Исключение
		// не обрабатываем ошибки из типового модуля
		Возврат;		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
// Вывести ошибку или оповестить источник о успешном выполнении команды
// Параметры:
//	Результат - Структура - данные по результатам выполнения команды 
//  ДополнительныеПараметры - Структура - параметры для обработки результата
//
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ИмяКоманды = ДополнительныеПараметры.ИмяКоманды;
	Источник   = ДополнительныеПараметры.Источник;
	
	РезультатОбработки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если ЭтоЗагрузкаЧтениеИлиОбновление(ИмяКоманды) Тогда
		
		ОбработатьРезультатКоманды(РезультатОбработки, ИмяКоманды, ДополнительныеПараметры);  
		
		// Обновить форму списка после каких то изменений
		Оповестить("Saby_СписокДокументовОбновить", , Источник);   
		
	ИначеЕсли ЭтоДополнительнаяКоманда(ИмяКоманды) Тогда
	
		Оповестить("Saby_" + ИмяКоманды, РезультатОбработки, Источник);
		
	Иначе		
		Возврат;		
	КонецЕсли;
			
КонецПроцедуры

