
// Универсальное выполнение команд
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - источник вызова выполнения
//	ИмяКоманды - Строка - имя команды, которую требуется выполнить
//	МассивДокументов - Массив - документы для выполнения команды
//  ПараметрыКоманды - Структура - дополнительные параметры команды
//	УникальныйИдентификатор - УникальныйИдентификатор - уникальный идентификатор выполнения команды
//
&НаКлиенте
Процедура ВыполнитьКомандуСбис(Форма, ИмяКоманды, МассивДокументов, 
	Знач ПараметрыКоманды = Неопределено, 
	Знач УникальныйИдентификатор = Неопределено
) Экспорт
	ПараметрыВыполнения = Новый Структура("ИмяКоманды", ИмяКоманды);		
	
	ТранспортВО = Неопределено;
	Если ПараметрыКоманды <> Неопределено И ПараметрыКоманды.ДвоичныеДанныеОбработки <> Неопределено Тогда
		ТранспортВО = ТранспортВО(Форма);
		ПараметрыВыполнения.Вставить("ПрефиксМодуляВнешнейОбработки", Форма.ПутьКМодулюОбъекта());
	КонецЕсли;
	
	context_params = АвторизацияSaby(ИмяКоманды, Форма);
	
	Если ЭтоЗагрузкаЧтениеИлиОбновление(ИмяКоманды) Тогда	
		Если context_params <> Неопределено Тогда	
			ПередВыполнениемКоманды(МассивДокументов, ТранспортВО, context_params, ПараметрыКоманды);
			
			ПараметрыВыполнения.Вставить("МассивДокументов", МассивДокументов);
			ПараметрыВыполнения.Вставить("context_params",   context_params);			
			ПараметрыВыполнения.Вставить("ДопПараметры",     ПараметрыКоманды);
			ПараметрыВыполнения.Вставить("Источник",         Форма.УникальныйИдентификатор);
			ВыполнитьКомандуВФоне(Форма, ПараметрыВыполнения);	
		КонецЕсли;
	ИначеЕсли ИмяКоманды = "ОткрытьВСбис" Тогда  			
		Массив = Новый Массив;
		Массив.Добавить(МассивДокументов[0]);
		
		ПараметрыВыполнения = Новый Структура;		
		ПараметрыВыполнения.Вставить("Форма", Форма);
		
		МодульКодаКлиент("ESD_КомандыОбменаДляФормыКлиент").ПриНажатииОткрытьВСБИСПолучитьUID(ИмяКоманды, ПараметрыВыполнения);
		
	ИначеЕсли ЭтоДополнительнаяКоманда(ИмяКоманды) Тогда	
		ПараметрыКоманды.Вставить("context_params", context_params);
		ПараметрыВыполнения.Вставить("ДопПараметры", ПараметрыКоманды);
		
		ПередВыполнениемДополнительныхКоманд(ТранспортВО, ПараметрыВыполнения, context_params);
		
		ПараметрыОжидания = Новый Структура;
		ПараметрыОжидания.Вставить("ВыводитьОкноОжидания", Ложь);
		
		ПараметрыВыполнения.Вставить("ПараметрыОжидания", ПараметрыОжидания);
		ПараметрыВыполнения.Вставить("Источник",          Форма.УникальныйИдентификатор);
		
		ВыполнитьКомандуВФоне(Форма, ПараметрыВыполнения, УникальныйИдентификатор);	
	Иначе	
		ВызватьИсключение("Для команды " + ИмяКоманды + " не предусмотрен обработчик! Обратитесь к администратору");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьКомандуСбис_ПараметрыКоманды() Экспорт
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ДвоичныеДанныеОбработки");
	РезультатФункции.Вставить("НаКлиенте", Ложь);
	РезультатФункции.Вставить("ОтветНаКлиенте");
	
	Возврат РезультатФункции;
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ТранспортВО
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ТранспортВО

&НаКлиенте
Процедура ПередВыполнениемКоманды(МассивПараметров, ТранспортВО, context_params, ДополнительныеПараметры)
	
	Если Не ЗначениеЗаполнено(МассивПараметров) Или ТранспортВО = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьОпасныеГрузы = Ложь;
	ЗагрузитьВидыУпаковки = Ложь;
	
	ОбщиеПараметрыЗагрузки = Новый Структура;
	ОбщиеПараметрыЗагрузки.Вставить("context_params",  context_params);
	ОбщиеПараметрыЗагрузки.Вставить("ОбъектОбработки", ТранспортВО.ТранспортИнтеграции);
	ОбщиеПараметрыЗагрузки.Вставить("ТранспортБлокли", ТранспортВО.ТранспортБлокли);
	
	Для Каждого ПараметрыЗагрузки Из МассивПараметров Цикл
		
		Если ПараметрыЗагрузки.Свойство("ТолькоАктивныйЭтап")
			И ПараметрыЗагрузки.ТолькоАктивныйЭтап И Не ПараметрыЗагрузки.ЭтоЗагрузкаЧерновика 
		Тогда
			МодульКодаКлиент("ESD_ТНЗагрузкаСервер")
				.ЗаписатьСтатистикуНапрямую(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки);
		КонецЕсли;
		
		Результат = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РезультатВзаимодействияСоСБИС(1);
		
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").SabyЗагрузитьДанныеДокумента(
			ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, Результат);
			
		ЗагрузитьОпасныеГрузы = ЗагрузитьОпасныеГрузы Или НужноЗагружатьОпасныеГрузы(ПараметрыЗагрузки);
		ЗагрузитьВидыУпаковки = ЗагрузитьВидыУпаковки Или НужноЗагружатьВидыУпаковки(ПараметрыЗагрузки);
		
	КонецЦикла;
	
	Если ЗагрузитьОпасныеГрузы Тогда
		ДополнительныеПараметры.Вставить("ОпасныеГрузыСОнлайна", 
			МодульКодаКлиент("ESD_ТНЗагрузкаСервер").СправочникСОнлайна("Справочник опасных грузов", ОбщиеПараметрыЗагрузки));
	КонецЕсли;
	Если ЗагрузитьВидыУпаковки Тогда
		ДополнительныеПараметры.Вставить("ВидыУпаковкиСОнлайна", 
			МодульКодаКлиент("ESD_ТНЗагрузкаСервер").СправочникСОнлайна("Вид упаковки Меркурия", ОбщиеПараметрыЗагрузки));
	КонецЕсли;
	
	ОбщиеПараметрыЗагрузки.ОбъектОбработки = Неопределено;
	ОбщиеПараметрыЗагрузки.ТранспортБлокли = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Функция НужноЗагружатьОпасныеГрузы(ПараметрыЗагрузки)
	
	РезультатФункции = Ложь;
	
	ПервыйТитул = ПодстановкаПервогоТитула(ПараметрыЗагрузки);
	
	ПозицииГруза = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(ПервыйТитул, "Груз.Позиция");
	
	Если ЗначениеЗаполнено(ПозицииГруза) Тогда
		Для Каждого ПозицияГруза Из ПозицииГруза Цикл
			ОпасныйГруз = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(ПозицияГруза, "ОпасныйГруз");
			РезультатФункции = РезультатФункции Или ЗначениеЗаполнено(ОпасныйГруз);
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция НужноЗагружатьВидыУпаковки(ПараметрыЗагрузки)
	
	РезультатФункции = Ложь;
	
	ПервыйТитул = ПодстановкаПервогоТитула(ПараметрыЗагрузки);
	
	ПозицииГруза = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(ПервыйТитул, "Груз.Позиция");
	
	Если ЗначениеЗаполнено(ПозицииГруза) Тогда
		Для Каждого ПозицияГруза Из ПозицииГруза Цикл
			ТараКод = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(ПозицияГруза, "ТараКод");
			РезультатФункции = РезультатФункции Или ЗначениеЗаполнено(ТараКод);
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ПодстановкаПервогоТитула(ПараметрыЗагрузки)
	
	ПервыйТитул = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		ПараметрыЗагрузки.ДанныеДокумента, "Подстановки.ЭТрН_1110339");
	Если ЗначениеЗаполнено(ПервыйТитул) Тогда
		ПервыйТитул = ПервыйТитул[0];
	Иначе
		ПервыйТитул = Новый Соответствие;
	КонецЕсли;
	
	Возврат ПервыйТитул;
	
КонецФункции

&НаКлиенте
Процедура ПередВыполнениемДополнительныхКоманд(ТранспортВО, ПараметрыВыполнения, context_params)
	
	Если Не ПараметрыВыполнения.ДопПараметры.НаКлиенте Тогда
		Возврат;
	КонецЕсли;
	
	ОбщиеПараметрыЗагрузки = Новый Структура;
	ОбщиеПараметрыЗагрузки.Вставить("context_params",  context_params);
	ОбщиеПараметрыЗагрузки.Вставить("ОбъектОбработки", ТранспортВО.ТранспортИнтеграции);
	ОбщиеПараметрыЗагрузки.Вставить("ТранспортБлокли", ТранспортВО.ТранспортБлокли);
	
	МодульТНОбщегоНазначенияКлиент = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент"); 
	
	Если ПараметрыВыполнения.ИмяКоманды = "РаспознаваниеВУ" Тогда
		ПараметрыВыполнения.ДопПараметры.ОтветНаКлиенте = МодульТНОбщегоНазначенияКлиент
			.РаспознаваниеВУ(ПараметрыВыполнения.ДопПараметры, ОбщиеПараметрыЗагрузки);
	ИначеЕсли ПараметрыВыполнения.ИмяКоманды = "ЗагрузитьДанныеТСПоРегНомеру" Тогда
		ПараметрыВыполнения.ДопПараметры.ОтветНаКлиенте = МодульТНОбщегоНазначенияКлиент
			.ЗагрузитьДанныеТСПоРегНомеру(ПараметрыВыполнения.ДопПараметры, ОбщиеПараметрыЗагрузки);
	ИначеЕсли ПараметрыВыполнения.ИмяКоманды = "ЗагрузитьДанныеТСПоВИН" Тогда
		ПараметрыВыполнения.ДопПараметры.ОтветНаКлиенте = МодульТНОбщегоНазначенияКлиент
			.ЗагрузитьДанныеТСПоВИН(ПараметрыВыполнения.ДопПараметры, ОбщиеПараметрыЗагрузки);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ВыполнениеВФоне
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ВыполнениеВФоне

&НаКлиенте
Функция ЭтоЗагрузкаЧтениеИлиОбновление(ИмяКоманды)
	
	Возврат ЭтоВыгрузка(ИмяКоманды)
		Или ИмяКоманды = "ПрочитатьДокумент"
		Или ИмяКоманды = "ОбновитьАктивныйЭтап"  
		Или ИмяКоманды = "ОбновитьДокументИзСбис";
	
КонецФункции

&НаКлиенте
Функция ЭтоВыгрузка(ИмяКоманды, ВключаяДинамический = Истина)
	
	РезультатФункции = ИмяКоманды = "ВыгрузитьВСбис"
		Или ИмяКоманды = "ВыгрузитьВСбисИзСписка";
	Если ВключаяДинамический Тогда
		РезультатФункции = РезультатФункции Или ИмяКоманды = "ЗагрузитьВСбисДинамическийТитул";
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ЭтоДополнительнаяКоманда(ИмяКоманды)
	
	Возврат ИмяКоманды = "АктуальныйСтатусВерсии"
		Или ИмяКоманды = "РаспознаваниеВУ"
		Или ИмяКоманды = "ЗагрузитьДанныеТСПоРегНомеру"
		Или ИмяКоманды = "ЗагрузитьДанныеТСПоВИН"
		Или ИмяКоманды = "МассовоеСоздание";
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатКоманды(РезультатОбработки, ИмяКоманды, ДополнительныеПараметры)
	Если Не ЗначениеЗаполнено(РезультатОбработки) Тогда
		Возврат;
	КонецЕсли;

	ПродолжитьВыполнениеНаКлиенте(РезультатОбработки, ИмяКоманды, ДополнительныеПараметры);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОповеститьПользователяОРезультатах(
		Неопределено, ИмяКоманды, РезультатОбработки);
	
	ОповеститьПослеОбработкиРезультатаКоманды(ИмяКоманды, РезультатОбработки, ДополнительныеПараметры.Источник);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыполнениеНаКлиенте(РезультатОбработки, ИмяКоманды, ДополнительныеПараметры)
    
    Если Не РезультатОбработки.Выполнение.НаКлиенте Тогда
        Возврат;
    КонецЕсли;
	
    Если ЭтоВыгрузка(ИмяКоманды) Тогда
		Для Каждого СтруктураПараметров Из РезультатОбработки.Выполнение.Параметры Цикл
			
			ТранспортВО = ТранспортВО(ДополнительныеПараметры.Форма);
			СтруктураПараметров.ОбщиеПараметрыВыгрузки.ОбъектОбработки = ТранспортВО.ТранспортИнтеграции;
			СтруктураПараметров.ОбщиеПараметрыВыгрузки.ТранспортБлокли = ТранспортВО.ТранспортБлокли;
			
			Если СтруктураПараметров.ПараметрыВыгрузки.ЭтоВыгрузкаЧерновика Тогда
				НашаОрганизация = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").НашаОрганизацияСОнлайна(
					СтруктураПараметров.ПараметрыВыгрузки, СтруктураПараметров.ОбщиеПараметрыВыгрузки);
				Вложения = СтруктураПараметров.ПараметрыВыгрузки.СтруктураДокумента.Вложение;
				Вложения[Вложения.ВГраница()].Вставить("НашаОрганизация", НашаОрганизация);
			КонецЕсли;
			
			МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ВыполнитьВыгрузкуСОбщимРезультатом(
				СтруктураПараметров.ПараметрыВыгрузки, СтруктураПараметров.ОбщиеПараметрыВыгрузки, РезультатОбработки);
				
		КонецЦикла;
	КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьПослеОбработкиРезультатаКоманды(ИмяКоманды, РезультатОбработки, Источник)
	
	Если РезультатОбработки.Ошибки.Количество() Тогда
		ОповеститьОбОшибкахДоПодписания(ИмяКоманды, РезультатОбработки);
	КонецЕсли;
	
	ОповеститьПослеОбработкиРезультатаКомандыЧтения(ИмяКоманды, РезультатОбработки, Источник);
			
	Если РезультатОбработки.Успешные.Количество() = 0 Или Не ЭтоВыгрузка(ИмяКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПерехода = Новый Структура;
	ПараметрыПерехода.Вставить("Документы",            РезультатОбработки.Успешные);
	ПараметрыПерехода.Вставить("ЭтапДляПерехода",      РезультатОбработки.Выполнение.ЭтапДляПерехода);
	ПараметрыПерехода.Вставить("ЭтоВыгрузкаЧерновика", РезультатОбработки.Выполнение.ЭтоВыгрузкаЧерновика);
	
	Если РезультатОбработки.Выполнение.ИзРасширения Тогда
		Если РезультатОбработки.Выполнение.ЭтоВыгрузкаЧерновика Тогда
			Оповестить("ESD_ОбновитьАктивныйЭтап", ПараметрыПерехода, Источник);
		Иначе
			Оповестить("ESD_ВыполнитьПереходыПоДокументам", ПараметрыПерехода, Источник);
		КонецЕсли;
	Иначе
		// BSLLS:GetFormMethod-off
		Форма = ПолучитьФорму("Документ." + РезультатОбработки.Успешные[0].ИмяМетаданных + ".ФормаСписка");
		// BSLLS:GetFormMethod-on
		Если Форма.Открыта() Тогда
			Форма.ТолькоПросмотр = Истина;
		КонецЕсли;
		
		Если РезультатОбработки.Выполнение.ЭтоВыгрузкаЧерновика Тогда
			ПараметрыПерехода = Новый Структура;
			ПараметрыПерехода.Вставить("ЭтоВыгрузкаЧерновика", Истина);
			Форма.ОбработатьОповещениеВыполнитьПереходНаФорме(ПараметрыПерехода);
		Иначе
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Форма",        Форма);
			ДополнительныеПараметры.Вставить("ИзРасширения", РезультатОбработки.Выполнение.ИзРасширения);
			
			ПроцедураПослеВыполненияПереходаПоДокументам =  Новый ОписаниеОповещения(
				"ПослеВыполненияПереходаПоДокументам", МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент"), ДополнительныеПараметры);
			
			ВыполнитьПереходыПоДокументам(Форма, ПараметрыПерехода, ПроцедураПослеВыполненияПереходаПоДокументам);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьПослеОбработкиРезультатаКомандыЧтения(ИмяКоманды, РезультатОбработки, Источник)
	
	ЭтоЗагрузкаДокументов = (ИмяКоманды = "ОбновитьДокументИзСбис");
	
	ЭтоСобытиеЧтения = ИмяКоманды = "ПрочитатьДокумент" Или ИмяКоманды = "ОбновитьАктивныйЭтап" Или ЭтоЗагрузкаДокументов;
	
	Если Не ЭтоСобытиеЧтения Тогда
		Возврат;
	КонецЕсли;
	
	МассивСсылок = РезультатОбработки.Успешные;
	Для Каждого Элемент Из МассивСсылок Цикл
		Если Не ЗначениеЗаполнено(Элемент.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоЗагрузкаДокументов Тогда
			// обновим документ в форме списка
			ОповеститьОбИзменении(Элемент.Ссылка);
		Иначе
			Оповестить("Saby_ОбновитьДокумент", Элемент, Источник);
		КонецЕсли;
	КонецЦикла;
	
	Если Не РезультатОбработки.Выполнение.ИзРасширения Тогда
		Оповестить("ESD_ОбновитьСвязанныеДанные");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбОшибкахДоПодписания(ИмяКоманды, РезультатОбработки)
	
	Если РезультатОбработки.Выполнение.ИзРасширения Тогда
		Если Не ЭтоВыгрузкаДинамическогоТитула(ИмяКоманды) И ИмяКоманды <> "ВыгрузитьВСбисИзСписка" Тогда
			МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОткрытьПервыйДокументИзСоответствия(РезультатОбработки.Ошибки);
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("СписокДокументов",     РезультатОбработки.Ошибки);
		ПараметрыФормы.Вставить("ЭтоДинамическийТитул", ЭтоВыгрузкаДинамическогоТитула(ИмяКоманды));
		
		Оповестить("Saby_СписокДокументов", ПараметрыФормы);
	Иначе	
		ТекстОшибки = "";
		Для Каждого ТекстОшибки Из РезультатОбработки.ОшибкиОбщие Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
		КонецЦикла;
		
		Если ЗначениеЗаполнено(РезультатОбработки.ОшибкаСопоставления) Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("РезультатЗаполненияНаОсновании", РезультатОбработки.ОшибкаСопоставления);
			ПроцедураНажатиеНаОшибкуЗаполненияНаОсновании = Новый ОписаниеОповещения(
				"НажатиеНаОшибкуЗаполненияНаОсновании",
				МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент"),
				ДополнительныеПараметры);
				
			ПоказатьИнформативноеОповещениеПользователя("Ошибка заполнения",
				ПроцедураНажатиеНаОшибкуЗаполненияНаОсновании,
				ТекстОшибки,
				КартинкаИнтерфейса(Неопределено, "ESD_Ошибка32"));
		КонецЕсли;
		
		Оповестить("ESD_ОбновитьСвязанныеДанные");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоВыгрузкаДинамическогоТитула(ИмяКоманды)
	
	Возврат ИмяКоманды = "ЗагрузитьВСбисДинамическийТитул";
	
КонецФункции

