
&НаКлиенте
// Универсальное выполнение команд
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - источник вызова выполнения
//	ИмяКоманды - Строка - имя команды, которую требуется выполнить
//	МассивДокументов - Массив - документы для выполнения команды
//  ДополнительныеПараметры - Структура - дополнительные параметры команды
//
Процедура ВыполнитьКомандуСбис(Форма, ИмяКоманды, МассивДокументов, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДопПараметры = Новый Структура;		
	ДопПараметры.Вставить("ИмяКоманды", ИмяКоманды);
		
	Если ЭтоЗагрузкаЧтениеИлиОбновление(ИмяКоманды) Тогда
		
		Если МассивДокументов.Количество() > 1 Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данная команда предназначена для выполнения по 1 документу. 
				|Будет использован первый выбранный документ из списка";
			Сообщение.Сообщить();			
		КонецЕсли;
				
		// Авторизация
		context_params = АвторизацияSaby(ИмяКоманды, Форма); 
		Если context_params <> Неопределено Тогда
			
			Если ЗначениеЗаполнено(МассивДокументов) Тогда 
				СсылкаНаДокумент = МассивДокументов[0];
				МассивДокументов = Новый Массив;
				МассивДокументов.Добавить(СсылкаНаДокумент);
			КонецЕсли;
			
			ДопПараметры.Вставить("МассивДокументов", МассивДокументов);
			ДопПараметры.Вставить("context_params",   context_params);			
			ДопПараметры.Вставить("ДопПараметры",     ДополнительныеПараметры);
			ДопПараметры.Вставить("Источник",         Форма.УникальныйИдентификатор);
			ВыполнитьКомандуВФоне(Форма, ДопПараметры);
			
		КонецЕсли;
		
	ИначеЕсли ИмяКоманды = "ОткрытьВСбис" Тогда  		
		
		Массив = Новый Массив;
		Массив.Добавить(МассивДокументов[0]);
		// Источник = Массив;
		
		ПараметрыФормы = Новый Структура;		
		ПараметрыФормы.Вставить("Форма", Форма);
		
		МодульКодаКлиент("Saby_КомандыОбменаДляФормыКлиент").ПриНажатииОткрытьВСБИСПолучитьUID(ИмяКоманды, ПараметрыФормы);
		
	ИначеЕсли ЭтоДополнительнаяКоманда(ИмяКоманды) Тогда 
		
		ДопПараметры.Вставить("ДопПараметры", ДополнительныеПараметры);
		
		ПараметрыОжидания = Новый Структура;
		ПараметрыОжидания.Вставить("ВыводитьОкноОжидания", Ложь);
		
		ДопПараметры.Вставить("ПараметрыОжидания",  ПараметрыОжидания);
		ДопПараметры.Вставить("Источник",           Форма.УникальныйИдентификатор);
		
		ВыполнитьКомандуВФоне(Форма, ДопПараметры);
		
	Иначе
		
		ВызватьИсключение("Для команды " + ИмяКоманды + " не предусмотрен обработчик! Обратитесь к администратору");
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Фоновое выполнене команды
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - источник вызова выполнения
//  СтруктураПараметров - Структура - параметры для выполнения команды
//
Процедура ВыполнитьКомандуВФоне(Форма, СтруктураПараметров) Экспорт
	
	ДлительнаяОперация = ВыполнитьНаСервере("Saby_ТНОбщегоНазначенияСервер.ДлительнаяОперация",
		СтруктураПараметров, 
		Форма.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма); 
	Если СтруктураПараметров.Свойство("ПараметрыОжидания") Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыОжидания, СтруктураПараметров.ПараметрыОжидания);
	КонецЕсли;	
	
	Оповещение = Новый ОписаниеОповещения(
		"ОбработатьРезультат", МодульКодаКлиент("Saby_ТНОбщегоНазначенияКлиент"), СтруктураПараметров);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
// Вывести ошибку или оповестить источник о успешном выполнении команды
// Параметры:
//	Результат - Структура - данные по результатам выполнения команды 
//  ДополнительныеПараметры - Структура - параметры для обработки результата
//
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ИмяКоманды = ДополнительныеПараметры.ИмяКоманды;
	Источник   = ДополнительныеПараметры.Источник;
	
	Если ЭтоЗагрузкаЧтениеИлиОбновление(ИмяКоманды) Тогда
		
		ОбработатьРезультатКоманды(Результат, ИмяКоманды, Источник); 
		
		// Обновить форму списка после каких то изменений
		Оповестить("Saby_СписокДокументовОбновить", , Источник);   
		
	ИначеЕсли ЭтоДополнительнаяКоманда(ИмяКоманды) Тогда	
		
		РезультатОбработки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);		
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Оповестить("Saby_" + ИмяКоманды, РезультатОбработки, Источник);
		
	Иначе		
		Возврат;		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Функция ЭтоЗагрузкаЧтениеИлиОбновление(ИмяКоманды)
	
	Возврат ИмяКоманды = "ВыгрузитьВСбис"
		Или ИмяКоманды = "ЗагрузитьВСбисДинамическийТитул"
		Или ИмяКоманды = "ПрочитатьДокумент"
		Или ИмяКоманды = "ОбновитьАктивныйЭтап"  
		Или ИмяКоманды = "ОбновитьДокументИзСбис";
	
КонецФункции

&НаКлиенте
Функция ЭтоДополнительнаяКоманда(ИмяКоманды)
	
	Возврат ИмяКоманды = "АктуальныйСтатусВерсии"
		Или ИмяКоманды = "РаспознаваниеВУ"
		Или ИмяКоманды = "ЗагрузитьДанныеТСПоРегНомеру"
		Или ИмяКоманды = "ЗагрузитьДанныеТСПоВИН";
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатКоманды(Результат, ИмяКоманды, Источник)
	
	РезультатОбработки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	ОповеститьПослеОбработкиРезультатаКоманды(ИмяКоманды, РезультатОбработки, Источник);
	
	ОповеститьПользователяОРезультатах(Неопределено, ИмяКоманды, РезультатОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьПослеОбработкиРезультатаКоманды(ИмяКоманды, РезультатОбработки, Источник)
	
	Если РезультатОбработки.Ошибки.Количество() Тогда
		
		Если Не ЭтоВыгрузкаДинамическогоТитула(ИмяКоманды) Тогда
			МодульКодаКлиент("Saby_ТНОбщегоНазначенияКлиент").ОткрытьПервыйДокументИзСоответствия(РезультатОбработки.Ошибки);
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("СписокДокументов",     РезультатОбработки.Ошибки);
		ПараметрыФормы.Вставить("ЭтоДинамическийТитул", ЭтоВыгрузкаДинамическогоТитула(ИмяКоманды));
		
		Оповестить("Saby_СписокДокументов", ПараметрыФормы);
		
	КонецЕсли;
	
	Если Не РезультатОбработки.Итог.Успех Тогда
		Возврат;
	КонецЕсли;
	
	МассивСсылок = РезультатОбработки.Успешные;
	Для Каждого Элемент Из МассивСсылок Цикл
		
		// одиночная команда
		Если ИмяКоманды = "ПрочитатьДокумент"
			Или ИмяКоманды = "ОбновитьАктивныйЭтап"
			Или ИмяКоманды = "ЗагрузитьВСбисДинамическийТитул" Тогда
			
			Оповестить("Saby_ОбновитьДокумент", Элемент, Источник);
			
		ИначеЕсли ИмяКоманды = "ВыгрузитьВСбис" Тогда
			
			Оповестить("Saby_ВыполнитьПереход", Элемент, Источник);
			
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоВыгрузкаДинамическогоТитула(ИмяКоманды)
	
	Возврат ИмяКоманды = "ЗагрузитьВСбисДинамическийТитул";
	
КонецФункции

