
&НаКлиенте
// Обработка для стандартного события формы документов ОбработкаОповещения
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма источник вызова
//  ИмяСобытия - Строка - имя события оповещения 
//  Параметр - Структура - параметры оповещения 
//  Источник - Произвольный - источник оповещения 
//
Процедура ОбработатьОповещенияДляФормы(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если Не ОповещениеДляЭтойФормы(Форма, ИмяСобытия, Параметр, Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьОповещенияДО(Форма, ИмяСобытия, Параметр, Источник);
	
	ОбработатьДополнительныеОповещения(Форма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
// Проверка, что оповещение пришло для нужного источника
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма источник вызова
//  ИмяСобытия - Строка - имя события оповещения 
//  Параметр - Структура - параметры оповещения 
//  Источник - Произвольный - источник оповещения 
//
// Возвращаемое значение:
//  Булево - если Истина то оповещение предназначено для данной формы
//
Функция ОповещениеДляЭтойФормы(Форма, ИмяСобытия, Параметр, Источник)
	ЭтоНужнаяФорма = Форма.Открыта() И (Источник = Форма Или Источник = Форма.УникальныйИдентификатор);
	ЭтоФормаСписка = ЭтоФормаСписка(Форма);
	
	Если ОповещениеДляЭтойФормыПереопределяемый(Форма, ИмяСобытия, Параметр, Источник, 
		Новый Структура("ЭтоНужнаяФорма, ЭтоФормаСписка", ЭтоНужнаяФорма, ЭтоФормаСписка)) 
	Тогда
		РезультатФункции = Истина;
	ИначеЕсли ИмяСобытия = "Saby_СписокДокументовОбновить" Тогда	
		РезультатФункции = ЭтоФормаСписка И ЭтоНужнаяФорма;	
	ИначеЕсли ИмяСобытия = "Saby_АктуальныйСтатусВерсии" Тогда	
		РезультатФункции = ЭтоНужнаяФорма;	
	ИначеЕсли ИмяСобытия = "Saby_СписокДокументов" Тогда	
		РезультатФункции = Не ЭтоФормаСписка;	
	ИначеЕсли ИмяСобытия = "Saby_Ошибки" Или ИмяСобытия = "ОбновитьЛенту" Тогда	
		РезультатФункции = Не ЭтоФормаСписка И ЭтоНужнаяФорма;	
	Иначе
		РезультатФункции = ПроверкаСобытияФормы(ИмяСобытия, ЭтоНужнаяФорма, ЭтоФормаСписка);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ОбработкаОповещенийПереопределяемый
#КонецОбласти

&НаКлиенте
Процедура ОбработатьОповещенияДО(Форма, ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Saby_ОбновитьДокумент" Тогда	
		Форма.ОбработатьОповещениеОбновитьДокумент(Параметр);	
	ИначеЕсли ИмяСобытия = "Saby_ВыполнитьПереход" Тогда	
		ОбработатьОповещениеВыполнитьПереход(Форма, Параметр);	
	ИначеЕсли ИмяСобытия = "ESD_ВыполнитьПереходыПоДокументам" Тогда	
		ВыполнитьПереходыПоДокументам(Форма, Параметр);	
	ИначеЕсли ИмяСобытия = "ESD_ОбновитьАктивныйЭтап" Тогда	
		Форма.ОбработатьОповещениеВыполнитьПереходНаФорме(Параметр);	
	ИначеЕсли ИмяСобытия = "Saby_ЗавершениеВыполнитьДействие" Тогда	
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма",        Форма);
		ДополнительныеПараметры.Вставить("ИзРасширения", Истина);
		
		ПослеВыполненияПереходаПоДокументам(Параметр, ДополнительныеПараметры);	
	ИначеЕсли ИмяСобытия = "Saby_СписокДокументов" Тогда	
		Если Параметр.ЭтоДинамическийТитул Тогда
			Возврат;
		КонецЕсли;
		
		МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
		
		ФормаОбъект = МодульТНОбщегоНазначенияКлиентСервер.ФормаОбъект(Форма);
		Если МодульТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(ФормаОбъект, "Ссылка") Тогда
			КлючСоответствия = МодульТНОбщегоНазначенияКлиентСервер.КлючСсылка(ФормаОбъект.Ссылка);
			ОшибкиДокумента = ПолучитьОшибки(Параметр.СписокДокументов, КлючСоответствия);
			Форма.ОбновитьДанныеПоОшибкамНаСервере(ОшибкиДокумента);
		КонецЕсли;	
	ИначеЕсли ИмяСобытия = "Saby_СписокДокументовОбновить" Тогда	
		Форма.Элементы.Список.Обновить();	
	ИначеЕсли ЭтоОповещениеИзмененияАвторизации(ИмяСобытия, Параметр) Тогда	
		Форма.ОбработатьОповещениеВыход();	
	Иначе	
		Возврат;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОшибки(СоответствиеДокументов, КлючСоответствия)
	
	Если ТипЗнч(КлючСоответствия) <> Тип("Структура") Тогда
		РезультатФункции = СоответствиеДокументов.Получить(КлючСоответствия);
		Если РезультатФункции = Неопределено Тогда
			Для Каждого КлючЗначение Из СоответствиеДокументов Цикл
				РезультатФункции = КлючЗначение.Значение;
				Прервать;
			КонецЦикла;
		КонецЕсли;
		Возврат РезультатФункции;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из СоответствиеДокументов Цикл
		Если КлючЗначение.Ключ.Идентификатор = КлючСоответствия.Идентификатор Тогда
			Возврат КлючЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьДополнительныеОповещения(Форма, ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Saby_ИзмененыТипыДокументовОснований" 
		И Найти(Форма.ИмяФормы, "ОбщаяФорма.") = 0 Тогда
		
		Форма.ОграничитьТипыДокументовОснованийНаСервере();
		
	ИначеЕсли ИмяСобытия = "ВыбранДокументОснованиеINI" Тогда
		
		Результат = Форма.ЗаполнениеНаОснованииINI();
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОповеститьПользователяОРезультатах(
			Форма, "ВыбранДокументОснованиеINI", Результат);
		
	ИначеЕсли ИмяСобытия = "Saby_АктуальныйСтатусВерсии" Тогда
		
		ОтобразитьНаличиеОбновлений(Форма, Параметр);
		
	ИначеЕсли ИмяСобытия = "Saby_РаспознаваниеВУ" Тогда
		
		Форма.ОбработатьРезультатРаспознаванияВУНаСервере(Параметр);
		
	ИначеЕсли ИмяСобытия = "Saby_ЗагрузитьДанныеТСПоРегНомеру" Тогда
		
		Форма.ОбработатьРезультатЗагрузкиДанныхТСПоРегНомеру(Параметр);
		
	ИначеЕсли ИмяСобытия = "Saby_МассовоеСоздание" Тогда
		
		Форма.ОбработатьРезультатСозданияДокументов(Параметр);
		
	ИначеЕсли ИмяСобытия = "Saby_ЗагрузитьДанныеТСПоВИН" Тогда
		
		Форма.ОбработатьРезультатЗагрузкиДанныхТСПоВИН(Параметр);
		
	ИначеЕсли ИмяСобытия = "ОбновитьЛенту" Тогда
		
		Форма.ОбновитьЛентуНаСервере();
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаСобытияФормы(ИмяСобытия, ЭтоНужнаяФорма, ЭтоФормаСписка)
	
	Возврат (ИмяСобытия = "Saby_ВыполнитьПереход" И ЭтоНужнаяФорма)
		Или (ИмяСобытия = "Saby_ЗавершениеВыполнитьДействие" И ЭтоНужнаяФорма)
		Или (ИмяСобытия = "Saby_РаспознаваниеВУ" И ЭтоНужнаяФорма)
		Или (ИмяСобытия = "Saby_ЗагрузитьДанныеТСПоРегНомеру" И ЭтоНужнаяФорма)
		Или (ИмяСобытия = "Saby_ЗагрузитьДанныеТСПоВИН" И ЭтоНужнаяФорма)
		Или СобытияФормыОбъекта(ИмяСобытия, ЭтоНужнаяФорма, ЭтоФормаСписка)
		Или СобытияМассовыхОпераций(ИмяСобытия, ЭтоНужнаяФорма, ЭтоФормаСписка);
	
КонецФункции

&НаКлиенте
Функция СобытияФормыОбъекта(ИмяСобытия, ЭтоНужнаяФорма, ЭтоФормаСписка)
	
	НужнаяФормаОбъекта = ЭтоНужнаяФорма И Не ЭтоФормаСписка;
	
	Возврат (ИмяСобытия = "Saby_ОбновитьДокумент" И НужнаяФормаОбъекта)
		Или (ИмяСобытия = "Saby_ИзмененыТипыДокументовОснований" И НужнаяФормаОбъекта)
		Или (ИмяСобытия = "Saby_ПрочитанДинамическийТитул" И НужнаяФормаОбъекта)
		Или (ИмяСобытия = "ВыбранДокументОснованиеINI" И НужнаяФормаОбъекта)
		Или (ИмяСобытия = "ESD_ОбновитьАктивныйЭтап" И НужнаяФормаОбъекта);
	
КонецФункции

&НаКлиенте
Функция СобытияМассовыхОпераций(ИмяСобытия, ЭтоНужнаяФорма, ЭтоФормаСписка)
	
	Возврат (ИмяСобытия = "ESD_ВыполнитьПереходыПоДокументам" И ЭтоНужнаяФорма)
		Или (ИмяСобытия = "Saby_МассовоеСоздание" И ЭтоНужнаяФорма И ЭтоФормаСписка);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьОповещениеВыполнитьПереход(Форма, Параметр, ПроцедураПослеЗакрытия = Неопределено) Экспорт
	Если ЗначениеЗаполнено(Параметр.Этап) Тогда
		Если МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(Форма, "Объект")
			И ТипЗнч(Форма.Объект) = Тип("Структура")
			И Форма.Объект.Свойство("Ссылка") Тогда
			Ссылка = Форма.Объект.Ссылка;
		ИначеЕсли Параметр.Свойство("Ссылка") Тогда
			Ссылка = Параметр.Ссылка;
		Иначе
			Ссылка = Параметр.Ключ;
		КонецЕсли;
		СменаЭтапа(Ссылка, Форма, Параметр.Этап, ПроцедураПослеЗакрытия);
	Иначе
		Форма.ОбработатьОповещениеВыполнитьПереходНаФорме();
		
		КартинкаСообщения = КартинкаИнтерфейса(Форма, "ESD_Ошибка32");
		ПоказатьВажноеОповещениеПользователя("Ошибка",,
			"Нет доступных действий",
			КартинкаСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещениеЗавершениеВыполнитьДействие(Форма, Параметр) Экспорт
	Если Не ЭтоФормаСписка(Форма) Тогда
		Форма.ОбработатьОповещениеЗавершениеВыполнитьДействиеНаФорме(Параметр);
		Возврат;
	КонецЕсли;
	
	Если Форма.Элементы.Список.ВыделенныеСтроки.Количество() Тогда	
		ТекущаяСсылка = Форма.Элементы.Список.ВыделенныеСтроки[0];
		ОповеститьОбИзменении(ТекущаяСсылка);		
	Иначе
		ТекущаяСсылка = Неопределено;
	КонецЕсли;
	
	Если Параметр.status = "error" Тогда	
		ОбработатьОшибкиИзФормыВыполнитьДействие(Форма, ТекущаяСсылка, Параметр);
		Форма.Элементы.Список.Обновить();	
	Иначе	
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(Форма, "ОбновитьАктивныйЭтап");	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ЭтоФормаСписка(Форма)
	
	Возврат Форма.Элементы.Найти("Список") <> Неопределено;
	
КонецФункции

&НаКлиенте
// Переход документа на следующий этап
//
// Параметры:
//  Ссылка - ДокументСсылка.Saby_ТранспортнаяНакладная - ссылка на документ
//  Форма - ФормаКлиентскогоПриложения - источник перехода
//  Этапы - Структура - параметры для последующего перехода
//  ПроцедураПослеЗакрытия - ОписаниеОповещения - процедура, вызываемая после закрытия формы выполнить действие.
Процедура СменаЭтапа(Ссылка, Форма, Этапы, ПроцедураПослеЗакрытия = Неопределено) Экспорт
	
	СписокДокументовСБИС = Новый Массив();
	СписокДокументов1С   = Новый Массив();
	
	СписокДокументов1С.Добавить(Ссылка);
	
	Идентификатор = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ИдентификаторВСбис", Ссылка);
	
	Если ТипЗнч(Ссылка) <> Тип("Структура") Тогда
		Документ1С = Ссылка;
	Иначе
		Документ1С = Неопределено;
	КонецЕсли;	
	
	ДокументСБИС = Новый Соответствие;
	ДокументСБИС.Вставить("Идентификатор", Идентификатор);
	ДокументСБИС.Вставить("Документ1С",    Документ1С);
	ДокументСБИС.Вставить("ДокументСБИС",  Неопределено);
	ДокументСБИС.Вставить("Этап",          Этапы);
	Если Документ1С = Неопределено Тогда
		ДокументСБИС.Вставить("ПервичныйКлюч", Идентификатор);
	КонецЕсли;
	
	СписокДокументовСБИС.Добавить(ДокументСБИС);
	
	ПараметрыВФорму = Новый Структура;
	ПараметрыВФорму.Вставить("СписокДокументовСБИС",          СписокДокументовСБИС);
	ПараметрыВФорму.Вставить("СписокДокументов1С",            СписокДокументов1С);
	ПараметрыВФорму.Вставить("МожноПереотправитьВСБИС",       Ложь);
	ПараметрыВФорму.Вставить("МожноОбновитьВСБИС",            Истина);
	ПараметрыВФорму.Вставить("ПрисоединенныеФайлыРасширения", Истина);
	
	ПараметрыОткрытияФормыОбработки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПараметрыОткрытияФормыОбработки(
		ФормыЯдраКлиент() + "ВыполнитьДействие", ПараметрыВФорму, Форма);
		
	ПараметрыОткрытияФормыОбработки.Уникальность = Новый УникальныйИдентификатор();
	ПараметрыОткрытияФормыОбработки.ОписаниеОповещенияОЗакрытии = ПроцедураПослеЗакрытия;
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОткрытьФормуОбработки(ПараметрыОткрытияФормыОбработки);
	
КонецПроцедуры

&НаКлиенте
// Проверка наличия обновлений расширения и генерация элементов предупреждения и ссылки на скачивание
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для обновления элементов
//  СтатусВерсии - Структура - данные о текущей версии
//
Процедура ОтобразитьНаличиеОбновлений(Форма, СтатусВерсии) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Не Элементы.ГруппаОбновление.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаОбновление.Видимость = Ложь;
	
	Если СтатусВерсии = Неопределено Или Не ЗначениеЗаполнено(СтатусВерсии.НомерАктуальнойВерсии) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЭлементов = ОбработкаШаблонаСтатусаВерсии(СтатусВерсии);
	Если Не ЗначениеЗаполнено(ДанныеЭлементов) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаОбновление.Видимость = Истина;
	
	// Картинка
	Картинка = Элементы.КартинкаОбновление;
	Картинка.Картинка       = КартинкаИнтерфейса(Форма, "ESD_СостояниеОшибка");
	Картинка.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
	
	// Надпись
	Надпись = Элементы.СтатусОбновление;
	Надпись.Заголовок = ДанныеЭлементов.Заголовок;
	Если ДанныеЭлементов.ЦветТекста <> Неопределено Тогда
		Надпись.ЦветТекста = ДанныеЭлементов.ЦветТекста;
	КонецЕсли;
	
	// Ссылка на скачивание
	Если ДанныеЭлементов.Гиперссылка Тогда
		Гиперссылка = Элементы.СсылкаОбновление;
		Гиперссылка.Видимость   = Истина;
		Гиперссылка.Доступность = Истина;
		Гиперссылка.Заголовок   = "Скачать";
		
		Если ЭтоУниверсальноеРасширение() Тогда
			// изменим путь к скачиванию
			СсылкаНаСкачивание = МодульКода("ESD_ТНОбщегоНазначенияСервер").СсылкаНаСкачиваниеУниверсальногоРасширения(
				ДанныеЭлементов.Ссылка);
		Иначе
			СсылкаНаСкачивание = ДанныеЭлементов.Ссылка;
		КонецЕсли;
					
		Гиперссылка.Подсказка = СсылкаНаСкачивание;
	Иначе
		Элементы.СсылкаОбновление.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Вывод ошибок в форме по результатам команды "ВыполнитьДействие"
// из формы обработки SABY ВыполнитьДействие
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - источник перехода
//  Ссылка - ДокументСсылка.Saby_ТранспортнаяНакладная - ссылка на источник выполнения
//  Параметр - Структура - данные по ошибке
//           - Строка - описание ошибки
//
Процедура ОбработатьОшибкиИзФормыВыполнитьДействие(Форма, Ссылка, Параметр) Экспорт
	
	МассивОшибок = Новый Массив;
	
	ЭтоСтруктура = ТипЗнч(Параметр.data) = Тип("Структура");
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Если ТипЗнч(Параметр.data) = Тип("Структура") Или ТипЗнч(Параметр.data) = Тип("Соответствие") Тогда
		Сообщение       = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Параметр.data, "message");
		Детали          = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Параметр.data, "detail");
		МассивСообщений = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Параметр.data, "Результат");
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Сообщение = Неопределено И ТипЗнч(МассивСообщений) = Тип("Массив") Тогда
		
		Для Каждого Строка Из МассивСообщений Цикл
			
			ИндексОшибки = 0;
			
			СтруктураОшибки = ДанныеОшибки(Строка, ЭтоСтруктура, ИндексОшибки);
			МассивОшибок.Добавить(СтруктураОшибки);
			
			ИндексОшибки = ИндексОшибки + 1;
			
		КонецЦикла;
		
	Иначе
		
		ТекстОшибки = Сообщение + " - (" + Детали + ")";
		
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("ИндексСтроки",        0);
		СтруктураОшибки.Вставить("ТекстДляОднойОшибки", ТекстОшибки);
		СтруктураОшибки.Вставить("ПолеОшибки",          "");
		СтруктураОшибки.Вставить("ГруппаОшибок",        Неопределено);
		МассивОшибок.Добавить(СтруктураОшибки);
		
	КонецЕсли;
	
	// если нет ошибок по нашему документу ошибки не показываем
	Если Не МассивОшибок.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОшибок = Новый Структура;
	СтруктураОшибок.Вставить("СписокОшибок", МассивОшибок);
	СтруктураОшибок.Вставить("ГруппыОшибок", Новый Соответствие);
	
	ИмяМетаданных            = МодульТНОбщегоНазначенияКлиентСервер.ИмяМетаданныхПоФорме(Форма);
	ПараметрыДокументаДляАПИ = МодульТНОбщегоНазначенияКлиентСервер.ПараметрыДокументаДляАПИ(ИмяМетаданных);
	
	СтруктураОшибок.Вставить("ИмяМетаданных", ИмяМетаданных);
	СтруктураОшибок.Вставить("Тип",           ПараметрыДокументаДляАПИ.Тип);
	
	СписокДокументов = Новый Соответствие;
	СписокДокументов.Вставить(Ссылка, СтруктураОшибок);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОткрытьПервыйДокументИзСоответствия(СписокДокументов);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СписокДокументов",     СписокДокументов);
	ПараметрыФормы.Вставить("ЭтоДинамическийТитул", Ложь);
	
	Оповестить("Saby_СписокДокументов", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеОшибки(Строка, ЭтоСтруктура, ИндексОшибки)
	
	СтруктураОшибки = Новый Структура;
	СтруктураОшибки.Вставить("ИндексСтроки",        ИндексОшибки);
	СтруктураОшибки.Вставить("ТекстДляОднойОшибки", "");
	СтруктураОшибки.Вставить("ПолеОшибки",          "");
	СтруктураОшибки.Вставить("ГруппаОшибок",        Неопределено);
	
	Если ЭтоСтруктура Тогда
		СтруктураОшибки.ТекстДляОднойОшибки = Строка.message;
		Возврат СтруктураОшибки;
	КонецЕсли;
	
	ДокументСБИС = Строка["ДокументСБИС"];
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Если ТипЗнч(ДокументСБИС) = Тип("Структура") Или ТипЗнч(ДокументСБИС) = Тип("Соответствие") Тогда
		СтруктураОшибки.ТекстДляОднойОшибки = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДокументСБИС, "detail.error.details", Неопределено);
		Если СтруктураОшибки.ТекстДляОднойОшибки = Неопределено Тогда
			СтруктураОшибки.ТекстДляОднойОшибки = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
				ДокументСБИС, "message", "");
		КонецЕсли;
	Иначе
		СтруктураОшибки.ТекстДляОднойОшибки = "Ошибка выполнения действия";
	КонецЕсли;
	
	Возврат СтруктураОшибки;
	
КонецФункции

&НаКлиенте
Функция ОбработкаШаблонаСтатусаВерсии(СтатусВерсии)
	Перем РезультатФункции;
	
	ВерсияАктуальна = СтатусВерсии.Шаблон = Неопределено 
		Или (ТипЗнч(СтатусВерсии.Шаблон) = Тип("Число") И СтатусВерсии.Шаблон <= 0);
	Если ВерсияАктуальна Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ДоступнаНоваяВерсия = 1;
	ВерсияУстарела      = 2;
	ВерсияНеСовместима  = 3;
	ВерсияСОшибками     = 4;
	
	Если СтатусВерсии.Шаблон = ДоступнаНоваяВерсия Тогда
		Ссылка_ = СсылкаНаСкачиваниеПродукта(СтатусВерсии);
		РезультатФункции = СтатусВерсии_СтруктураОписания(
			"Доступна новая версия"
			, , Истина, Ссылка_);
	ИначеЕсли СтатусВерсии.Шаблон = ВерсияУстарела Тогда
		Ссылка_ = СсылкаНаСкачиваниеПродукта(СтатусВерсии);
		РезультатФункции = СтатусВерсии_СтруктураОписания(
			"Версия устарела"
			, , Истина, Ссылка_);
	ИначеЕсли СтатусВерсии.Шаблон = ВерсияНеСовместима Тогда
		Ссылка_ = СсылкаНаСкачиваниеПродукта(СтатусВерсии);
		РезультатФункции = СтатусВерсии_СтруктураОписания(
			"ВЕРСИЯ НЕ СОВМЕСТИМА"
			, , Истина, Ссылка_);
	ИначеЕсли СтатусВерсии.Шаблон = ВерсияСОшибками Тогда
		Ссылка_ = СсылкаНаСкачиваниеПродукта(СтатусВерсии);
		РезультатФункции = СтатусВерсии_СтруктураОписания(
			"ВЕРСИЯ СОДЕРЖИТ КРИТИЧЕСКИЕ ОШИБКИ"
			, WebЦвета.Красный, Истина, Ссылка_);
	Иначе
		РезультатФункции = СтатусВерсии_СтруктураОписания(
			"Ошибка при получении информации о версии"
			, WebЦвета.Красный);
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

Функция СтатусВерсии_СтруктураОписания(Заголовок = "", ЦветТекста = Неопределено, ГиперСсылка = Ложь, Ссылка = "")
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Заголовок",   Заголовок);
	РезультатФункции.Вставить("ЦветТекста",  ЦветТекста);
	РезультатФункции.Вставить("Гиперссылка", ГиперСсылка);
	РезультатФункции.Вставить("Ссылка",      Ссылка);
	
	Возврат РезультатФункции;	
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_СсылкаНаСкачиваниеПродукта
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_СсылкаНаСкачиваниеПродукта

#Область ВыполнениеПереходаПоМножествуДокументов

&НаКлиенте
Процедура ВыполнитьПереходыПоДокументам(Форма, Параметры, ПроцедураПослеЗакрытия = Неопределено) Экспорт
		
	СгруппированныеПоТитулуДокументы = СгруппированныеПоТитулуДокументы(Параметры.Документы);
	ЭтапДляПерехода                  = Параметры.ЭтапДляПерехода;
	
	Если СгруппированныеПоТитулуДокументы.Данные.Количество() = 1 Тогда
		ВыполнитьПереходПоТитулу(Форма, СгруппированныеПоТитулуДокументы.Данные[0], ЭтапДляПерехода, ПроцедураПослеЗакрытия);
	ИначеЕсли СгруппированныеПоТитулуДокументы.Данные.Количество() > 1 Тогда		
		Форма.СгруппированныеПоТитулуДокументы = СгруппированныеПоТитулуДокументы;
		ВыполнитьПереходПоТитулу(Форма, Неопределено, ЭтапДляПерехода, ПроцедураПослеЗакрытия);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СгруппированныеПоТитулуДокументы(МассивДанныхДокументов)
	
	// Упаковано в структуру, чтобы можно было использовать в реквизите формы
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Данные", Новый Массив);
	
	ИндексыПоТитулу = Новый Соответствие;
	
	Для Каждого ДанныеДокумента Из МассивДанныхДокументов Цикл
		ИндексПоТитулу = ИндексыПоТитулу[ДанныеДокумента.ТипТитула];
		Если ИндексПоТитулу = Неопределено Тогда
			РезультатФункции.Данные.Добавить(Новый Массив);
			ИндексПоТитулу = РезультатФункции.Данные.ВГраница();
			ИндексыПоТитулу.Вставить(ДанныеДокумента.ТипТитула, ИндексПоТитулу);
		КонецЕсли;
		МассивДокументовТитула = РезультатФункции.Данные[ИндексПоТитулу];
		
		Документ1С = ДанныеДокумента.Ссылка;
		Если ТипЗнч(Документ1С) = Тип("Структура") Тогда
			Документ1С = Неопределено;
		КонецЕсли;
		
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("Идентификатор", ДанныеДокумента.Идентификатор);
		СтруктураДокумента.Вставить("Документ1С",    Документ1С);
		СтруктураДокумента.Вставить("ДокументСБИС",  Неопределено);
		СтруктураДокумента.Вставить("Этап",          ДанныеДокумента.Этап);
		Если Документ1С = Неопределено Тогда
			СтруктураДокумента.Вставить("ПервичныйКлюч", ДанныеДокумента.Идентификатор);
		КонецЕсли;
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Ссылка", ДанныеДокумента.Ссылка);
		СтруктураДанных.Вставить("СтруктураДокумента", СтруктураДокумента);
		
		МассивДокументовТитула.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПереходПоТитулу(Форма, МассивДанныхДокументов = Неопределено,
		ЭтапДляПерехода = Неопределено, ПроцедураПослеЗакрытия = Неопределено)
	
	Если ТипЗнч(МассивДанныхДокументов) = Тип("Массив") Тогда
		МассивДанныхДляПерехода = МассивДанныхДокументов;
	ИначеЕсли ЗначениеЗаполнено(Форма.СгруппированныеПоТитулуДокументы) Тогда
		МассивДанныхДляПерехода = Форма.СгруппированныеПоТитулуДокументы.Данные[0];
		Форма.СгруппированныеПоТитулуДокументы.Данные.Удалить(0);
		Если Форма.СгруппированныеПоТитулуДокументы.Данные.Количество() = 0 Тогда
			Форма.СгруппированныеПоТитулуДокументы = Неопределено;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	СписокДокументовСБИС = Новый Массив;
	СписокДокументов1С   = Новый Массив;
	
	Для Каждого ДанныеДокумента Из МассивДанныхДляПерехода Цикл
		СписокДокументовСБИС.Добавить(ДанныеДокумента.СтруктураДокумента);
		СписокДокументов1С.Добавить(ДанныеДокумента.Ссылка);
	КонецЦикла;
	
	ПараметрыВФорму = Новый Структура;
	ПараметрыВФорму.Вставить("СписокДокументовСБИС",          СписокДокументовСБИС);
	ПараметрыВФорму.Вставить("СписокДокументов1С",            СписокДокументов1С);
	ПараметрыВФорму.Вставить("МожноПереотправитьВСБИС",       Ложь);
	ПараметрыВФорму.Вставить("МожноОбновитьВСБИС",            Истина);
	ПараметрыВФорму.Вставить("ПрисоединенныеФайлыРасширения", Истина);
	ПараметрыВФорму.Вставить("Этап",                          ЭтапДляПерехода);
	
	ПараметрыОткрытияФормыОбработки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПараметрыОткрытияФормыОбработки(
		ФормыЯдраКлиент() + "ВыполнитьДействие", ПараметрыВФорму, Форма);
		
	ПараметрыОткрытияФормыОбработки.Уникальность = Новый УникальныйИдентификатор();
	ПараметрыОткрытияФормыОбработки.ОписаниеОповещенияОЗакрытии = ПроцедураПослеЗакрытия;
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОткрытьФормуОбработки(ПараметрыОткрытияФормыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияПереходаПоДокументам(РезультатВыполненияПерехода, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.ТолькоПросмотр = Ложь;
	
	Если ЭтоФормаСписка(ДополнительныеПараметры.Форма) Тогда
		ПослеВыполненияПереходаВФормеСписка(РезультатВыполненияПерехода, ДополнительныеПараметры);
	Иначе
		ПослеВыполненияПереходаВФорме(РезультатВыполненияПерехода, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияПереходаВФорме(РезультатВыполненияПерехода, ДополнительныеПараметры)
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если РезультатВыполненияПерехода.status = "error" Тогда
		ОбработатьОшибкиФормыВыполнитьДействие(РезультатВыполненияПерехода, ДополнительныеПараметры);
		Если Форма.ИмяФормы = "ФормаДинамическихТитулов" Или Форма.ИмяФормы = "Saby_ТранспортнаяНакладнаяДТ" Тогда
			Форма.ТаблицаОшибок.Добавить();
		КонецЕсли;
		Форма.Прочитать();
	Иначе
		Форма.ОбработатьОповещениеЗавершениеВыполнитьДействиеНаФорме(РезультатВыполненияПерехода);
		Если Не Форма.ЭтоВО Тогда
			ФормаОбъект = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ФормаОбъект(Форма);
			ОповеститьОбИзменении(ФормаОбъект.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияПереходаВФормеСписка(РезультатВыполненияПерехода, ДополнительныеПараметры)
	
	Форма = ДополнительныеПараметры.Форма;
	
	МассивСообщений = ОбработатьОшибкиФормыВыполнитьДействие(РезультатВыполненияПерехода, ДополнительныеПараметры);
	Форма.Элементы.Список.Обновить();
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрукутраСообщения Из МассивСообщений Цикл
		ОшибокНет = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(СтрукутраСообщения, "ОшибокНет", Ложь);
		Если ОшибокНет Тогда
			МассивДокументов.Добавить(СтрукутраСообщения["СсылкаНаДокумент"]);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДокументов.Количество() > 0 Тогда
		ДополнительныеПараметрыОбмена = Новый Структура("МассивДокументов", МассивДокументов);
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбменДаннымиСБИСИзФормыСписка(
			Форма, "ОбновитьАктивныйЭтап", ДополнительныеПараметрыОбмена);
	КонецЕсли;
	
	ПроцедураПослеВыполненияПереходаПоДокументам =  Новый ОписаниеОповещения(
		"ПослеВыполненияПереходаПоДокументам", МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент"), ДополнительныеПараметры);
	
	ВыполнитьПереходПоТитулу(Форма, , , ПроцедураПослеВыполненияПереходаПоДокументам);
	
КонецПроцедуры

&НаКлиенте
Функция ОбработатьОшибкиФормыВыполнитьДействие(РезультатВыполненияПерехода, ДополнительныеПараметры)
	
	Форма = ДополнительныеПараметры.Форма;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	МассивСообщений = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		РезультатВыполненияПерехода, "Result.Результат", Новый Массив);
	ОблегчитьМассивСообщений(МассивСообщений);
	
	МассивСообщений = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкиВыполненияВРегистрСостояний",
		МассивСообщений);
	
	Если Не ЭтоФормаСписка(Форма) Тогда
		
		Сообщение = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(РезультатВыполненияПерехода, "Result.message");
		Детали    = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(РезультатВыполненияПерехода, "Result.detail");
			
		Для Каждого СтруктураСообщения Из МассивСообщений Цикл
			Сообщение = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(СтруктураСообщения, "Сообщение");
			Детали    = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(СтруктураСообщения, "Детали");
		КонецЦикла;
		
		МассивОшибок = Новый Массив;
		
		ТекстОшибки = Сообщение + " - (" + Детали + ")";
		
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("ИндексСтроки",        0);
		СтруктураОшибки.Вставить("ТекстДляОднойОшибки", ТекстОшибки);
		СтруктураОшибки.Вставить("ПолеОшибки",          "");
		СтруктураОшибки.Вставить("ГруппаОшибок",        Неопределено);
		МассивОшибок.Добавить(СтруктураОшибки);
		
		СтруктураОшибок = Новый Структура;
		СтруктураОшибок.Вставить("СписокОшибок", МассивОшибок);
		СтруктураОшибок.Вставить("ГруппыОшибок", Новый Соответствие);
		
		ИмяМетаданных            = МодульТНОбщегоНазначенияКлиентСервер.ИмяМетаданныхПоФорме(Форма);
		ПараметрыДокументаДляАПИ = МодульТНОбщегоНазначенияКлиентСервер.ПараметрыДокументаДляАПИ(ИмяМетаданных);
		
		СтруктураОшибок.Вставить("ИмяМетаданных", ИмяМетаданных);
		СтруктураОшибок.Вставить("Тип",           ПараметрыДокументаДляАПИ.Тип);
		
		Форма.ОбновитьДанныеПоОшибкамНаСервере(СтруктураОшибок);
		
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.ИзРасширения Тогда
		Для Каждого СтруктураСообщения Из МассивСообщений Цикл
			Если МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(СтруктураСообщения, "ОшибокНет", Истина) Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстСообщения   = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(СтруктураСообщения, "Сообщение", "");
			Детали           = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(СтруктураСообщения, "Детали", "");
			ТекстОшибки      = ТекстСообщения + " - (" + Детали + ")";
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
		КонецЦикла;
		Оповестить("ESD_ОбновитьСвязанныеДанные");
	КонецЕсли;
	
	Возврат МассивСообщений;
	
КонецФункции

&НаКлиенте
Процедура ОблегчитьМассивСообщений(МассивСообщений)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Для Каждого СтруктураСообщения Из МассивСообщений Цикл
		Сообщение     = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(СтруктураСообщения, "ДокументСБИС.message", "");
		Детали        = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(СтруктураСообщения, "ДокументСБИС.detail", "");
		Идентификатор = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(СтруктураСообщения, "ДокументСБИС.Идентификатор", "");
		Если ПустаяСтрока(Идентификатор) Тогда
			Идентификатор = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(СтруктураСообщения, "Идентификатор", "");	
		КонецЕсли;
		СтруктураСообщения.Вставить("Сообщение",     Сообщение);
		СтруктураСообщения.Вставить("Детали",        Детали);
		СтруктураСообщения.Вставить("Идентификатор", Идентификатор);
		СтруктураСообщения.Удалить("ДокументСБИС");
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ВыполнениеПереходаПоМножествуДокументов

