
&НаКлиенте
// Преобразует строку табличной части формы в структуру.
// Свойства структуры и их значения совпадают с колонками переданной строки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - источник данных строки
//  ИмяТаблицы - Строка - таблица, где находится строка преобразования
//  СтрокаТаблицы - СтрокаТаблицыЗначений - строка для преобразования
//  МассивКолонокИсключений - Массив - колонки для исключения
//
// Возвращаемое значение:
//  Структура - преобразованная строка таблицы значений.
//
Функция СтрокаТаблицыФормыВСтруктуру(Форма, ИмяТаблицы, СтрокаТаблицы, МассивКолонокИсключений = Неопределено) Экспорт
	
	КолонкиТаблицы = Форма.Элементы[ИмяТаблицы].ПодчиненныеЭлементы; 
	
	Структура = Новый Структура;
	Для Каждого Колонка Из КолонкиТаблицы Цикл
		
		ИмяКолонки = Колонка.Имя;
		Если МодульКодаКлиент("Saby_ТНОбщегоНазначенияКлиентСервер").СтрНачинаетсяСЭПД(ИмяКолонки, ИмяТаблицы) Тогда
			ИмяКолонки = СтрЗаменить(ИмяКолонки, ИмяТаблицы, "");
		КонецЕсли;
		
		НельзяДобавитьВСтруктуру = МассивКолонокИсключений <> Неопределено
			И МассивКолонокИсключений.Найти(ИмяКолонки) <> Неопределено
			Или КолонкиТаблицы.Найти(Колонка.Имя) = Неопределено;
			
		Если НельзяДобавитьВСтруктуру Тогда
			Продолжить;
		КонецЕсли;
		
		Структура.Вставить(ИмяКолонки, СтрокаТаблицы[ИмяКолонки]);
		
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

