
&НаКлиенте
Функция ОповещениеДляЭтойФормыПереопределяемый(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры)
    РезультатФункции = Ложь;

    Если ЭтоОповещениеИзмененияАвторизации(ИмяСобытия, Параметр) Тогда	
        РезультатФункции = Форма.Открыта();
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

&НаКлиенте
Функция ЭтоОповещениеИзмененияАвторизации(ИмяСобытия, Параметр)
    Возврат ИмяСобытия = "Saby_ОбработкаВыхода" 
        Или ИмяСобытия = МодульКодаКлиент("ESD_Core").ЛокализацияНазваниеПродукта() + "_ЗакрытиеФормыАвторизации" 
            И Параметр.АвторизацияУспешна;	
КонецФункции
	
