
&НаКлиенте
Процедура ПоказатьВажноеОповещениеПользователя(Знач Текст, 
    Знач ДействиеПриНажатии = Неопределено, 
    Знач Пояснение = "", 
    Знач Картинка = Неопределено
) Экспорт
    ПоказатьОповещениеПользователя(
		Текст,
        ДействиеПриНажатии,
		Пояснение,
		Картинка,
		СтатусОповещенияПользователя.Важное
    );
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИнформативноеОповещениеПользователя(Знач Текст, 
    Знач ДействиеПриНажатии = Неопределено, 
    Знач Пояснение = "", 
    Знач Картинка = Неопределено
) Экспорт
    ПоказатьОповещениеПользователя(
		Текст,
        ДействиеПриНажатии,
		Пояснение,
		Картинка,
		СтатусОповещенияПользователя.Информация
    );
КонецПроцедуры

