
#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ИмяФормыОбработки
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ИмяФормыОбработки

&НаКлиенте
Функция ПараметрыОткрытияФормыОбработки(ИмяФормыДляОткрытия, Параметры = Неопределено, Владелец = Неопределено)
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ИмяФормы",                    ИмяФормыОбработки(ИмяФормыДляОткрытия));
	РезультатФункции.Вставить("Параметры",                   Параметры);
	РезультатФункции.Вставить("Владелец",                    Владелец);
	РезультатФункции.Вставить("Уникальность",                Неопределено);
	РезультатФункции.Вставить("Окно",                        Неопределено);
	РезультатФункции.Вставить("НавигационнаяСсылка",         Неопределено);
	РезультатФункции.Вставить("ОписаниеОповещенияОЗакрытии", Неопределено);
	РезультатФункции.Вставить("РежимОткрытияОкна",           Неопределено);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуОбработки(ПараметрыОткрытияФормыОбработки)
		
	ОткрытьФорму(
		ПараметрыОткрытияФормыОбработки.ИмяФормы,
		ПараметрыОткрытияФормыОбработки.Параметры,
		ПараметрыОткрытияФормыОбработки.Владелец,
		ПараметрыОткрытияФормыОбработки.Уникальность,
		ПараметрыОткрытияФормыОбработки.Окно,
		ПараметрыОткрытияФормыОбработки.НавигационнаяСсылка,
		ПараметрыОткрытияФормыОбработки.ОписаниеОповещенияОЗакрытии,
		ПараметрыОткрытияФормыОбработки.РежимОткрытияОкна);
	
КонецПроцедуры

