
&НаКлиенте
Процедура ДобавитьДанныеЮрЛиц(Форма, СтруктураДанныхЮрЛиц, ПараметрыРеквизитаФормы)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ФормаОбъект = МодульТНОбщегоНазначенияКлиентСервер.ФормаОбъект(Форма);
	СтрокаЮрЛиц = МодульТНОбщегоНазначенияКлиентСервер.СтрокаЮрЛиц(ПараметрыРеквизитаФормы, ФормаОбъект, СтруктураДанныхЮрЛиц.Роль);
	ЗаполнитьЗначенияСвойств(СтрокаЮрЛиц, СтруктураДанныхЮрЛиц);
    МодульТНОбщегоНазначенияКлиентСервер.ДобавитьДанныеЮрЛицОбъекта(
		ФормаОбъект, СтруктураДанныхЮрЛиц, ПараметрыРеквизитаФормы, СтрокаЮрЛиц);
	
	Если Не ПараметрыРеквизитаФормы.ЭтоСтрокаТаблицы Тогда
		Если ПараметрыРеквизитаФормы.ИмяРеквизита <> Неопределено Тогда
			Форма[ПараметрыРеквизитаФормы.ИмяРеквизита] = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
				СтрокаЮрЛиц.НаименованиеОрганизации);
		КонецЕсли;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер.ЗаполнитьДополнительныеПоляЮрЛица(
		Форма, СтрокаЮрЛиц, ПараметрыРеквизитаФормы.ДополнительныеПоля, СтруктураДанныхЮрЛиц.РольСтрокой);
	
	ОбновитьКонтактныеДанные(Форма, СтруктураДанныхЮрЛиц, СтрокаЮрЛиц, ПараметрыРеквизитаФормы);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьКонтактныеДанные(Форма, СтруктураДанныхЮрЛиц, СтрокаЮрЛиц, ПараметрыРеквизитаФормы)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ФормаОбъект = МодульТНОбщегоНазначенияКлиентСервер.ФормаОбъект(Форма);
	
	МодульТНОбщегоНазначенияКлиентСервер.ОбновитьКонтактныеДанныеОбъекта(ФормаОбъект, СтруктураДанныхЮрЛиц, СтрокаЮрЛиц);
	
	РолиДляОбновления = Новый Массив;
	СтруктураРоли = МодульТНОбщегоНазначенияКлиентСервер.СтруктураДанныхРолей();
	ЗаполнитьЗначенияСвойств(СтруктураРоли, СтрокаЮрЛиц);
	СтруктураРоли.РольСтрокой             = СтруктураДанныхЮрЛиц.РольСтрокой;
	СтруктураРоли.ПараметрыРеквизитаФормы = ПараметрыРеквизитаФормы;
	РолиДляОбновления.Добавить(СтруктураРоли);
	
	ДопПараметры = МодульТНОбщегоНазначенияКлиентСервер.ДопПараметрыОбновленияКИ(РолиДляОбновления);
	МодульТНОбщегоНазначенияКлиентСервер.ОбновитьОсновнойНомерТелефона(Форма, ДопПараметры);
	
	МодульТНОбщегоНазначенияКлиентСервер.НастроитьДополнительныеКонтакты(Форма, СтруктураДанныхЮрЛиц.РольСтрокой);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВводаДанныхЮрЛица(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяМетаданных = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ИмяМетаданныхПоФорме(ДополнительныеПараметры.Форма);
	
	ДополнительныеПараметры.Вставить("РезультатВводаДанныхЮрЛица", Результат);
	
	ТребуетсяЗачисткаОтветственных = ИмяМетаданных = ПутевойЛистКлиент()
		И ДополнительныеПараметры.Форма.ИспользоватьТабельныйНомер
		И Результат.РольСтрокой = "Оформитель"
		И ДополнительныеПараметры.Форма.Объект.ОтветственныеЛица.Количество() > 0;
	
	Если ТребуетсяЗачисткаОтветственных Тогда
		ПроцедураОбновитьДанныеЮрЛица = Новый ОписаниеОповещения(
			"ОбновитьДанныеЮрЛица", МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент"), ДополнительныеПараметры);
		
		ТекстВопроса = "После изменения организации данные ответственных лиц станут неактуальными, поэтому их необходимо выбрать заново.
		|Будут очищены водители, медик, техник и ответственные за выпуск в рейс и прием из рейса.
		|
		|Заменить организацию и очистить ответственных лиц?";
		ПоказатьВопрос(
			ПроцедураОбновитьДанныеЮрЛица,
			ТекстВопроса,
			РежимДиалогаВопрос.ОКОтмена, ,
			КодВозвратаДиалога.Отмена,
			"Заменить организацию с очисткой ответственных лиц?");
	Иначе
		ОбновитьДанныеЮрЛица(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеЮрЛица(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВводаЮрЛица = ДополнительныеПараметры.РезультатВводаДанныхЮрЛица;
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ДополнительныеПараметры.Форма.Объект.ОтветственныеЛица.Очистить();
		ДополнительныеПараметры.Форма.ОбновитьВсеОтветственныеЛица();
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ОбновитьВодителейНаФорме(ДополнительныеПараметры.Форма);
	КонецЕсли;
	
	ДобавитьДанныеЮрЛиц(ДополнительныеПараметры.Форма, РезультатВводаЮрЛица, РезультатВводаЮрЛица.ЭлементФормы);
	
	ДополнительныеПараметры.Форма.Модифицированность = Истина;
	
	Если ДополнительныеПараметры.ПроцедураПослеИзмененияЮрЛица <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПроцедураПослеИзмененияЮрЛица, РезультатВводаЮрЛица);
	КонецЕсли;
	
КонецПроцедуры

