
&НаКлиенте
Процедура ПодготовитьПараметрыПечати(ПараметрыПечати)
	Форма = ПараметрыПечати.Форма;
	Если Не ПараметрыПечати.ЭтоФормаСписка Тогда
		Форма.ЗаполнитьСтруктуруДокумента();
	КонецЕсли;
	
	СсылкаНаДокумент = ОснованиеПечатнойФормы(Форма, ПараметрыПечати);
	Если Не ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Возврат;
	КонецЕсли;
	ПараметрыПечати.Вставить("СсылкаНаДокумент", СсылкаНаДокумент);
	ПослеПодготовкиПараметровПечати(ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Функция ОснованиеПечатнойФормы(Форма, ДополнительныеПараметры)
	Если ДополнительныеПараметры.ЭтоФормаСписка Тогда
		СсылкаНаДокумент = Форма.Элементы.Список.ТекущаяСтрока;
	Иначе
		ФормаОбъект = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ФормаОбъект(Форма);
		СсылкаНаДокумент = ФормаОбъект.Ссылка;
	КонецЕсли;
	
	Возврат СсылкаНаДокумент;	
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ДополнительныйФункционал_ДополнительныеКомандыSaby_Печать_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ДополнительныйФункционал_ДополнительныеКомандыSaby_Печать_СлужебныеПроцедурыИФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ДополнительныйФункционал_ДополнительныеКомандыSaby_АрхивВложений_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_ДополнительныйФункционал_ДополнительныеКомандыSaby_АрхивВложений_СлужебныеПроцедурыИФункции

