
&НаКлиенте
Функция ТранспортВО(Форма, context_params) Экспорт
	
	РезультатФункции = Новый Структура;
	
	ГлавнаяФорма = ГлавнаяФорма(Форма);
	
	РезультатФункции.Вставить("ТранспортИнтеграции", ГлавнаяФорма.ТранспортИнтеграции);
	РезультатФункции.Вставить("ТранспортБлокли",     ГлавнаяФорма.BlocklyExecutor);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ГлавнаяФорма(Форма)
	
	РезультатФункции = Форма.ВладелецФормы;
	Пока Найти(РезультатФункции.ИмяФормы, "ФормаГлавноеОкно") = 0 Цикл
		РезультатФункции = РезультатФункции.ВладелецФормы;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

