#Область ПрограммныйИнтерфейс

// Получение невыполненных действий автоматических сценариев
//
// Параметры:
//	АвтоматическийСценарий - СправочникСсылка.АвтоматическиеСценарии - элемент справочника "Автоматические сценарии"
//	ID - Строка - идентификатор запущенного автоматического сценария
//
// Возвращаемое значение:
//	ТаблицаЗначений - найденные активные действия в журнале со статусом "Создано"
//
Функция АктивныеДействия(АвтоматическийСценарий, ID) Экспорт
	Запрос = Новый Запрос;
	// BSLLS:QueryParseError-off
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ЖурналВыполненияАвтоматическихСценариев.АвтоматическийСценарий КАК АвтоматическийСценарий,
		|	ЖурналВыполненияАвтоматическихСценариев.ID КАК ID,
		|	ЖурналВыполненияАвтоматическихСценариев.Действие КАК Действие
		|ИЗ
		|	РегистрСведений." + ИмяОбъекта() + ".СрезПоследних(,
		|		АвтоматическийСценарий = &АвтоматическийСценарий
		|		И ID = &ID
		|	) КАК ЖурналВыполненияАвтоматическихСценариев
		|ГДЕ
		| 	ЖурналВыполненияАвтоматическихСценариев.Статус = &СтатусДействия
		|УПОРЯДОЧИТЬ ПО
		|	ЖурналВыполненияАвтоматическихСценариев.АвтоматическийСценарий.Приоритет ВОЗР	
		|";
	// BSLLS:QueryParseError-on
	Запрос.УстановитьПараметр("ID", ID);
	Запрос.УстановитьПараметр("АвтоматическийСценарий", АвтоматическийСценарий);
	Запрос.УстановитьПараметр("СтатусДействия", МодульКода("Перечисления.АвтоматическиеСценарииСтатусыВыполнения").Создано);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Добавление нового статуса в журнал выполнения автоматических сценариев
//
// Параметры:
//	АвтоматическийСценарий - СправочникСсылка.АвтоматическиеСценарии - автоматический сценарий
//	ID - Строка - идентификатор запущенного автоматического сценария
//	Действие - СправочникСсылка.АвтоматическиеСценарииДействия - действие автоматического сценария
//	Период - Дата - дата установки нового статуса
//	Статус - ПеречислениеСсылка.АвтоматическиеСценарииСтатус - статус выполнения действия автоматического сценария
//	Комментарий - Строка - комментарий выполнения действия автоматического сценария
//	Результат - ТаблицаЗначений - таблица значений результата выполнения действия
//
Процедура ДобавитьНовыйСтатус(АвтоматическийСценарий, ID, Действие
	, Знач Период = Неопределено
	, Знач Статус = Неопределено
	, Знач Комментарий = ""
	, Знач Результат = Неопределено
) Экспорт
	Если Статус = Неопределено Тогда
		Статус = МодульКода("Перечисления.АвтоматическиеСценарииСтатусыВыполнения").Создано;	
	КонецЕсли; 
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений[ИмяОбъекта()].СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период                 = Период;
	МенеджерЗаписи.АвтоматическийСценарий = АвтоматическийСценарий;
	МенеджерЗаписи.Действие               = Действие;
	МенеджерЗаписи.ID                     = ID;
	МенеджерЗаписи.Статус                 = Статус;
	МенеджерЗаписи.Комментарий            = Комментарий;
	МенеджерЗаписи.Результат              = Новый ХранилищеЗначения(Результат);
	
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураДанных()
	Результат = Новый Структура;
	Результат.Вставить("АвтоматическийСценарий");
	Результат.Вставить("Действие", "");
	Результат.Вставить("ID", "");
	Результат.Вставить("Статус");
	Результат.Вставить("Комментарий", "");
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область include_etrn_base_Modules_АвтоматическиеСценарии_InformationRegister_АвтоматическиеСценарииЖурнал_ИмяОбъекта
#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти