
Функция События_ДополнительныеПараметры(Знач АльтернативныеНазвания = Неопределено) Экспорт
	РезультатФункции = Новый Структура;
	
	Если АльтернативныеНазвания = Неопределено Тогда
		АльтернативныеНазвания = Новый Соответствие;
	КонецЕсли;
	РезультатФункции.Вставить("АльтернативныеНазвания", АльтернативныеНазвания);
	
	Возврат РезультатФункции;
КонецФункции

Функция События_СлужебныеПараметры(context_params = Неопределено, ВывестиТекущийЭтап = Истина, ОтображатьСлужебные = Ложь) Экспорт
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("context_params", context_params);
	РезультатФункции.Вставить("ВывестиТекущийЭтап", ВывестиТекущийЭтап);
	РезультатФункции.Вставить("ОтображатьСлужебные", ОтображатьСлужебные);
	
	Возврат РезультатФункции;
КонецФункции

Функция События_ИмяСтраницы() Экспорт
	Возврат "ESD_События_Страница";
КонецФункции

Функция События_ИмяРеквизита() Экспорт
	Возврат "ESD_События_ТабличныйДокумент";
КонецФункции

Функция События_ЭтоСлужебное(Наименование) Экспорт
	Возврат (События_СлужебныеНазвания()[НРег(Наименование)] = Истина);
КонецФункции

