
// Преобразует объект 1С в JSON
//
// Параметры:
//  Объект - Структура, Соответствие, Массив - структура данных 1С.
//	ПараметрыЗаписиJSON - ПараметрыЗаписиJSON - параметры записи JSON.
//
// Возвращаемое значение:
//  Строка - сформированный JSON
//
Функция ЗакодироватьJSON(Объект, Знач ПараметрыЗаписиJSON = Неопределено) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	
	Если ПараметрыЗаписиJSON = Неопределено Тогда
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
	КонецЕсли;
	
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, Объект);
	
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

// Преобразует строку JSON в объект 1С
//
// Параметры:
//  СтрокаJSON - Строка - строка формата JSON.
//	ВСоответствие - Булево - указатель преобразования в "соответствие" 1С.
//
// Возвращаемое значение:
//  Структура, Соответствие, Массив - сформированный объект 1С
//
Функция ДекодироватьJSON(СтрокаJSON, ВСоответствие = Ложь) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	РезультатФункции = ПрочитатьJSON(ЧтениеJSON, ВСоответствие);
	ЧтениеJSON.Закрыть();
	
	Возврат РезультатФункции;	
КонецФункции

