
// Декодирование строки по правилам URL
//
// Параметры:
//  Строка - строка - строка кодирования.
//
// Возвращаемое значение:
//  Строка - строка URL
//
Функция КодироватьСтрокуВURL(Строка) Экспорт
	ЗакодированныеДанные = Base64Строка(СтрокаВДвоичныеДанные(Строка));
	ЗакодированныеДанные = КодироватьСтроку(ЗакодированныеДанные, СпособКодированияСтроки.КодировкаURL);
	
	Возврат ЗакодированныеДанные;
КонецФункции

// Декодирование строки по правилам URL
//
// Параметры:
//  URL - строка - строка URL.
//
// Возвращаемое значение:
//  Строка - декодированная строка
//
Функция ДекодироватьURLВСтроку(URL) Экспорт
	ДекодированныеДанные = РаскодироватьСтроку(URL, СпособКодированияСтроки.КодировкаURL);
	ДекодированныеДанные = ДвоичныеДанныеВСтроку(Base64Значение(ДекодированныеДанные));
	
	Возврат ДекодированныеДанные;
КонецФункции

