
// Преобразование строки в двоичные данные
// 
// Параметры:
//  Строка - Строка - текстовая строка
//
// Возвращаемое значение:
//  ДвоичныеДанные - закодированная строка в двоичных данных
//
Функция СтрокаВДвоичныеДанные(Строка) Экспорт
    Возврат ПолучитьДвоичныеДанныеИзСтроки(Строка);
КонецФункции

// Преобразование двоичных данных в строку
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - исходные двоичные данные, содержащие строку
//
// Возвращаемое значение:
//  Строка - полученная из двоичных данных строка
//
Функция ДвоичныеДанныеВСтроку(ДвоичныеДанные) Экспорт
    Возврат ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);
КонецФункции

