
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОграничитьТипыДокументовОснованийНаСервере();
		
	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииПослеЗаписиНаСервере();
	Иначе
		МодульКода("ESD_ТНОбщегоНазначенияСервер").УбратьПризнакНеПросмотрен(Объект.Ссылка);
	КонецЕсли;
	
	УстановкаСпискаДоступныхТиповКИ();

	НастроитьФормуДляСтарыхПлатформ();
	
	Если Не ЭтоУниверсальноеРасширение() И Не ЭтаФорма.ЭтоВО И Не ЗначениеЗаполнено(Объект.НомерСбис) Тогда
		Объект.НомерСбис = Объект.Номер;
	КонецЕсли;
	
	Если Параметры.ОбновитьОшибки Тогда
		ОбновитьДанныеПоОшибкамНаСервере();
	КонецЕсли;
	
	ПриСозданииНаСервереПереопределяемый();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьОтображениеДанных();
	
	ОповеститьОбИзменении(Объект.Ссылка);
	Подключаемый_ПриОткрытии();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ПредставительЗаказчика_Основание = ЭтаФорма.Оформитель_Основание;
	Подключаемый_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры   

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриЧтенииСозданииПослеЗаписиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)	
	ПриЧтенииСозданииПослеЗаписиНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбработатьОповещенияДляФормы(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Подключаемый_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Подключаемый_СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	Если Объект.ТипДокумента = ЗначениеМетаданныхКлиент("ESD_ТипДокументаЗнП.Заказ") Тогда
		Объект.Договор = "";
	КонецЕсли;
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		Элемент.Имя, Элемент.Имя);
	ПараметрыРеквизитаФормы.ТолькоПросмотр = Элементы.ГруппаЗаказчик.ТолькоПросмотр;
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "Отправитель", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправитель_ТелефонПриИзменении(Элемент)
	
	РолиЮрЛиц = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РолиЮрЛиц(ЭтаФорма, "Отправитель");
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТелефонПриИзменении(
		ЭтаФорма, ЭтаФорма.Отправитель_Телефон, РолиЮрЛиц, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправитель_ТелефонНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Роль = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РолиЮрЛиц(ЭтаФорма, "Отправитель");
	
	ПараметрыВыбораТелефона = Новый Структура;
	ПараметрыВыбораТелефона.Вставить("Роль",     Роль);
	ПараметрыВыбораТелефона.Вставить("Значение", ЭтаФорма.Отправитель_Телефон);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТелефонНачалоВыбора(
		ЭтаФорма, ПараметрыВыбораТелефона, СтандартнаяОбработка, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставительЗаказчикаПриИзменении(Элемент)
	
	ИмяРолиОформитель = "Оформитель";
	
	// зачищаем данные если не представитель
	Если Не Объект.ПредставительЗаказчика Тогда
		
		ЭтаФорма.Оформитель_Основание = "";
		// Удалим данные юр. лица
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").УдалитьСтрокиПоРоли(Объект.ДанныеЮрЛиц, ИмяРолиОформитель);
		// Удалим контактные данные
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").УдалитьСтрокиПоРоли(Объект.КонтактныеДанные, ИмяРолиОформитель);
		
		ЭтаФорма.ОформительСтрокой = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПредставлениеЮрЛицаПоРоли(
			Объект.ДанныеЮрЛиц, ИмяРолиОформитель);

	КонецЕсли;	
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОформительСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		Элемент.Имя, Элемент.Имя);
	ПараметрыРеквизитаФормы.ДополнительныеПоля = "Основание";
	ПараметрыРеквизитаФормы.ТолькоПросмотр = Элементы.ГруппаЗаказчик.ТолькоПросмотр;
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "Оформитель", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		Элемент.Имя, Элемент.Имя);
	ПараметрыРеквизитаФормы.ТолькоПросмотр = Элементы.ГруппаПеревозчик.ТолькоПросмотр;
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "Перевозчик", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Перевозчик_ТелефонПриИзменении(Элемент)
	
	РолиЮрЛиц = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РолиЮрЛиц(ЭтаФорма, "Перевозчик");
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТелефонПриИзменении(
		ЭтаФорма, ЭтаФорма.Перевозчик_Телефон, РолиЮрЛиц, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Перевозчик_ТелефонНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Роль = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РолиЮрЛиц(ЭтаФорма, "Перевозчик");
	
	ПараметрыВыбораТелефона = Новый Структура;
	ПараметрыВыбораТелефона.Вставить("Роль",     Роль);
	ПараметрыВыбораТелефона.Вставить("Значение", ЭтаФорма.Перевозчик_Телефон);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТелефонНачалоВыбора(
		ЭтаФорма, ПараметрыВыбораТелефона, СтандартнаяОбработка, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаполнитьПодачаТСНажатие(Элемент)	
	ИзменитьАдресПодачи(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ПодачаДатаПриИзменении(Элемент)
	
	ПроверкаДатАдресовПунктовВыгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодачаВремяПриИзменении(Элемент)
	
	ПроверкаДатАдресовПунктовВыгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаполнитьКонечнаяТочкаНажатие(Элемент)	
	
	ИзменитьАдресКонечнойТочки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодачаАдресНажатие(Элемент, СтандартнаяОбработка)	
	ИзменитьАдресПодачи(СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура КонечнаяТочкаАдресНажатие(Элемент, СтандартнаяОбработка)	
	ИзменитьАдресКонечнойТочки(СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчикаСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		Элемент.Имя, Элемент.Имя);
	ПараметрыРеквизитаФормы.ДополнительныеПоля = "Основание,Полномочия";
	ПараметрыРеквизитаФормы.ТолькоПросмотр     = Элементы.ГруппаУполномоченныеЛицаПеревозчика.ТолькоПросмотр;
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(
		ЭтаФорма, "УполномоченноеЛицоПеревозчика", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчика_ТелефонПриИзменении(Элемент)
	
	РолиЮрЛиц = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РолиЮрЛиц(ЭтаФорма, "УполномоченноеЛицоПеревозчика");
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТелефонПриИзменении(
		ЭтаФорма, ЭтаФорма.УполномоченноеЛицоПеревозчика_Телефон, РолиЮрЛиц, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчика_ТелефонНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
		СтандартнаяОбработка)
		
	РолиЮрЛиц = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РолиЮрЛиц(ЭтаФорма, "УполномоченноеЛицоПеревозчика");
		
	ПараметрыВыбораТелефона = Новый Структура;
	ПараметрыВыбораТелефона.Вставить("Роль",     РолиЮрЛиц);
	ПараметрыВыбораТелефона.Вставить("Значение", ЭтаФорма.УполномоченноеЛицоПеревозчика_Телефон);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТелефонНачалоВыбора(
		ЭтаФорма, ПараметрыВыбораТелефона, СтандартнаяОбработка, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйЗаПеревозкуСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтветственного = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОтветственного(
		Объект.ОтветственныеЛица, "Ответственный");
	СтруктураОтветственного.Вставить("ТолькоПросмотр", Элементы.СтраницаВодителиИТС.ТолькоПросмотр);
	СтруктураОтветственного.Вставить(
		"ИмяМетаданных",
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ИмяМетаданныхПоФорме(ЭтаФорма));
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").НачатьРедактированиеОтветственногоЛица(
		ЭтаФорма, СтруктураОтветственного, "Ответственный");
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаСНДСПриИзменении(Элемент)
	
	ОбновитьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	ОбновитьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура Оформитель_ОснованиеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчика_ОснованиеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтправительКонтактныеДанные

&НаКлиенте
Процедура ОтправительКонтактныеДанныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ЕстьДанныеЮрЛица("Отправитель") Тогда 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан Заказчик!";
		Сообщение.Поле  = "ОтправительСтрокой";
		Сообщение.Сообщить();		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактныеДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Если Копирование Тогда
			Элементы.ОтправительКонтактныеДанные.ТекущиеДанные.Основной = Ложь;
		КонецЕсли;
		ОбработатьНовуюСтрокуКонтактнойИнформации(Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактныеДанныеПослеУдаления(Элемент)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	РолиЮрЛиц = МодульТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "Отправитель");
	ДопПараметры = МодульТНОбщегоНазначенияКлиентСервер.ДопПараметрыОбновленияКИ(РолиЮрЛиц);
	МодульТНОбщегоНазначенияКлиентСервер.ОбновитьОсновнойНомерТелефона(ЭтаФорма, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактныеДанныеЗначениеПриИзменении(Элемент)
	
	РолиЮрЛиц = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РолиЮрЛиц(ЭтаФорма, "Отправитель");
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЗначениеКонтактныхДанныхПриИзменении(
		ЭтаФорма, Элементы.ОтправительКонтактныеДанные.ТекущиеДанные, РолиЮрЛиц);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактныеДанныеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	РолиЮрЛиц = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РолиЮрЛиц(ЭтаФорма, "Отправитель");
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЗначениеКонтактныхДанныхНачалоВыбора(
		ЭтаФорма, Элементы.ОтправительКонтактныеДанные.ТекущиеДанные, РолиЮрЛиц, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыОтправительКонтактныеДанные

#Область ОбработчикиСобытийЭлементовТаблицыФормыПеревозчикКонтактныеДанные

&НаКлиенте
Процедура ПеревозчикКонтактныеДанныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ЕстьДанныеЮрЛица("Перевозчик") Тогда 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан Перевозчик!";
		Сообщение.Поле  = "ПеревозчикСтрокой";
		Сообщение.Сообщить();		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикКонтактныеДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Если Копирование Тогда
			Элементы.ПеревозчикКонтактныеДанные.ТекущиеДанные.Основной = Ложь;
		КонецЕсли;
		ОбработатьНовуюСтрокуКонтактнойИнформации(Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикКонтактныеДанныеПослеУдаления(Элемент)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	РолиЮрЛиц = МодульТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "Перевозчик");
	ДопПараметры = МодульТНОбщегоНазначенияКлиентСервер.ДопПараметрыОбновленияКИ(РолиЮрЛиц);
	МодульТНОбщегоНазначенияКлиентСервер.ОбновитьОсновнойНомерТелефона(ЭтаФорма, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикКонтактныеДанныеЗначениеПриИзменении(Элемент)
	
	РолиЮрЛиц = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РолиЮрЛиц(ЭтаФорма, "Перевозчик");
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЗначениеКонтактныхДанныхПриИзменении(
		ЭтаФорма, Элементы.ПеревозчикКонтактныеДанные.ТекущиеДанные, РолиЮрЛиц);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикКонтактныеДанныеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	РолиЮрЛиц = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РолиЮрЛиц(ЭтаФорма, "Перевозчик");
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЗначениеКонтактныхДанныхНачалоВыбора(
		ЭтаФорма, Элементы.ПеревозчикКонтактныеДанные.ТекущиеДанные, РолиЮрЛиц, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыПеревозчикКонтактныеДанные

#Область ОбработчикиСобытийЭлементовТаблицыФормыАдресаПунктовВыгрузки

&НаКлиенте
Процедура АдресаПунктовВыгрузкиПриИзменении(Элемент)
	
	ПроверкаДатАдресовПунктовВыгрузки();
	ПроверкаГрузовПунктовВыгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.АдресаПунктовВыгрузки.ТекущиеДанные;
	
	Если ТекущаяСтрока.ЭтоПогрузка И Поле.Имя = "АдресаПунктовВыгрузкиОрганизацияСтрока" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПроцедураПослеИзмененияЮрЛица = Новый ОписаниеОповещения("ПослеИзмененияЮрЛица", ЭтаФорма);
		
		СтандартныеПараметрыСобытия = Новый Структура;
		СтандартныеПараметрыСобытия.Вставить("Элемент",         Элемент);
		СтандартныеПараметрыСобытия.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		СтандартныеПараметрыСобытия.Вставить("Поле",            Поле);
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Роль",                          "Отгрузчик");
		ДополнительныеПараметры.Вставить("ТолькоПросмотр",                Элементы.СтраницаПунктыМаршрута.ТолькоПросмотр);
		ДополнительныеПараметры.Вставить("ПроцедураПослеИзмененияЮрЛица", ПроцедураПослеИзмененияЮрЛица);
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоВТаблицеВыбор(
			ЭтаФорма, СтандартныеПараметрыСобытия, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияЮрЛица(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.АдресаПунктовВыгрузки.ТекущиеДанные.Значение  = Результат.Адрес;
	Элементы.АдресаПунктовВыгрузки.ТекущиеДанные.Структура = Результат.АдресСтруктура;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		СкопироватьДанныеЮрЛиц("АдресаПунктовВыгрузки", Элементы.АдресаПунктовВыгрузки.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	ТекущиеДанные = Элементы.АдресаПунктовВыгрузки.ТекущиеДанные;
	
	ПараметрыВыбораАдреса = Новый Структура;
	ПараметрыВыбораАдреса.Вставить("Роль",     "АдресаПунктовВыгрузки");
	ПараметрыВыбораАдреса.Вставить("Значение", ТекущиеДанные.Структура);
	ПараметрыВыбораАдреса.Вставить("Текст",    ТекущиеДанные.Значение);
		
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").АдресНачалоВыбора(ЭтаФорма, ПараметрыВыбораАдреса, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиДатаВремяПриИзменении(Элемент)
	
	ОбновитьДатуДопустимогоВремени(Элементы.АдресаПунктовВыгрузки.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиДопустимоеВремяПриИзменении(Элемент)
	
	ОбновитьДатуДопустимогоВремени(Элементы.АдресаПунктовВыгрузки.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиЭтоПогрузкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.АдресаПунктовВыгрузки.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
		И Не ТекущиеДанные.ЭтоПогрузка Тогда
		
		// сбросим данные организации
		ТекущиеДанные.ОрганизацияСтрока      = "";
		ТекущиеДанные.ОрганизацияИНН         = "";
		ТекущиеДанные.КлючСтроки_ДанныеЮрЛиц = 0;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыАдресаПунктовВыгрузки

#Область ОбработчикиСобытийЭлементовТаблицыФормыАдресаПромежуточныхПунктов

&НаКлиенте
Процедура АдресаПромежуточныхПунктовЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПараметрыВыбораАдреса = Новый Структура;
	ПараметрыВыбораАдреса.Вставить("Роль",           "АдресаПромежуточныхПунктов");
	ПараметрыВыбораАдреса.Вставить("Значение",       Элементы.АдресаПромежуточныхПунктов.ТекущиеДанные.Структура);
	ПараметрыВыбораАдреса.Вставить("Текст",          Элементы.АдресаПромежуточныхПунктов.ТекущиеДанные.Значение);
	ПараметрыВыбораАдреса.Вставить("ТолькоПросмотр", Ложь);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").АдресНачалоВыбора(ЭтаФорма, ПараметрыВыбораАдреса, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыАдресаПромежуточныхПунктов

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрузы

&НаКлиенте
Процедура ГрузыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ГрузыЗаказчикСтрока" Тогда
		СтандартнаяОбработка = Ложь;
		СтандартныеПараметрыСобытия = Новый Структура;
		СтандартныеПараметрыСобытия.Вставить("Элемент",         Элемент);
		СтандартныеПараметрыСобытия.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		СтандартныеПараметрыСобытия.Вставить("Поле",            Поле);
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Роль",                          "Заказчик");
		ДополнительныеПараметры.Вставить("ТолькоПросмотр",                Элементы.СтраницаГруз.ТолькоПросмотр);
		ДополнительныеПараметры.Вставить("ПроцедураПослеИзмененияЮрЛица", Неопределено);
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоВТаблицеВыбор(
			ЭтаФорма, СтандартныеПараметрыСобытия, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузыПриАктивизацииСтроки(Элемент)
	Грузы_УстановитьОтборПоСвязаннымТаблицам();	
КонецПроцедуры 

&НаКлиенте
Процедура Грузы_УстановитьОтборПоСвязаннымТаблицам()
	ТекущиеДанные = Элементы.Грузы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("КлючСтроки_Грузы", ТекущиеДанные.КлючСтроки);
		
		Отбор = Новый ФиксированнаяСтруктура(СтруктураПоиска);
		
		Элементы.Груз_АдресаПунктов.ОтборСтрок        = Отбор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрузыПередУдалением(Элемент, Отказ)
	
	СтруктураСвязанныхТаблиц = СвязанныеСГрузомТаблицы();
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").УдалитьСтрокиСвязанныхТаблиц(ЭтаФорма, СтруктураСвязанныхТаблиц);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		СтрокаГруза = Элементы.Грузы.ТекущиеДанные;		
		СтрокаГруза.КлючСтроки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(ЭтаФорма, "Грузы");
		Если Не Копирование Тогда 
			СтрокаГруза.Тип = ЗначениеМетаданныхКлиент("ESD_ТипГруза.Груз");
		Иначе
			СкопироватьДанныеЮрЛиц("Грузы", Элементы.Грузы.ТекущаяСтрока);
		КонецЕсли;
		
		Грузы_УстановитьОтборПоСвязаннымТаблицам();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыГрузы

#Область ОбработчикиСобытийЭлементовТаблицыФормыГруз_АдресаПунктов

&НаКлиенте
Процедура Груз_АдресаПунктовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПередНачаломДобавленияСтрокиСвязаннойТаблицы(ЭтаФорма, "Грузы", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Груз_АдресаПунктовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		СтрокаТаблицы = Элементы.Груз_АдресаПунктов.ТекущиеДанные;
		СтрокаТаблицы.КлючСтроки_Грузы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючСвязаннойСтроки(
			ЭтаФорма, "Грузы");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыГруз_АдресаПунктов

#Область ОбработчикиСобытийЭлементовТаблицыФормыОпасныеГрузы

&НаКлиенте
Процедура ОпасныеГрузыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПередНачаломДобавленияСтрокиСвязаннойТаблицы(ЭтаФорма, "Грузы", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		СтрокаТаблицы = Элементы.ОпасныеГрузы.ТекущиеДанные;
		СтрокаТаблицы.КлючСтроки_Грузы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючСвязаннойСтроки(
			ЭтаФорма, "Грузы");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыОпасныеГрузы

#Область ОбработчикиСобытийЭлементовТаблицыФормыСведенияГосСистем

&НаКлиенте
Процедура СведенияГосСистемПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПередНачаломДобавленияСтрокиСвязаннойТаблицы(ЭтаФорма, "Грузы", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		СтрокаТаблицы = Элементы.СведенияГосСистем.ТекущиеДанные;
		СтрокаТаблицы.КлючСтроки_Грузы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючСвязаннойСтроки(
			ЭтаФорма, "Грузы");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыСведенияГосСистем

#Область ОбработчикиСобытийЭлементовТаблицыФормыКонтейнеры

&НаКлиенте
Процедура КонтейнерыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПередНачаломДобавленияСтрокиСвязаннойТаблицы(ЭтаФорма, "Грузы", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		СтрокаТаблицы = Элементы.Контейнеры.ТекущиеДанные;
		СтрокаТаблицы.КлючСтроки_Грузы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючСвязаннойСтроки(
			ЭтаФорма, "Грузы");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыКонтейнеры

#Область ОбработчикиСобытийЭлементовТаблицыФормыУполномоченныеЛицаЗаказчика

&НаКлиенте
Процедура УполномоченныеЛицаЗаказчикаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		"НаименованиеОрганизации",
		"УполномоченныеЛицаЗаказчикаНаименованиеОрганизации",
		ВыбраннаяСтрока);
		
	ПараметрыРеквизитаФормы.ИмяИсходнойТаблицы          = "ДанныеЮрЛиц";
	ПараметрыРеквизитаФормы.ТолькоПросмотр              = Элементы.ГруппаУполномоченныеЛицаЗаказчика.ТолькоПросмотр;
	ПараметрыРеквизитаФормы.ИдентификаторИсходнойСтроки = ВыбраннаяСтрока;
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "УполномоченноеЛицо", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченныеЛицаЗаказчикаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Для Каждого СтруктураОтбора Из Элемент.ОтборСтрок Цикл
			Элемент.ТекущиеДанные[СтруктураОтбора.Ключ] = СтруктураОтбора.Значение;
		КонецЦикла;
		КлючИсходнойСтроки = Элемент.ТекущиеДанные.КлючСтроки;
		Элемент.ТекущиеДанные.КлючСтроки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(
			ЭтаФорма, "ДанныеЮрЛиц");
		Если Копирование Тогда
			СкопироватьКонтактныеДанные(Элемент.ТекущаяСтрока, КлючИсходнойСтроки);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		"НаименованиеОрганизации",
		"УполномоченныеЛицаЗаказчикаНаименованиеОрганизации",
		Элементы.УполномоченныеЛицаЗаказчика.ТекущаяСтрока);
			
	ПараметрыРеквизитаФормы.ИмяИсходнойТаблицы          = "ДанныеЮрЛиц";
	ПараметрыРеквизитаФормы.ИдентификаторИсходнойСтроки = Элементы.УполномоченныеЛицаЗаказчика.ТекущаяСтрока;
			
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "УполномоченноеЛицо", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыУполномоченныеЛицаЗаказчика

#Область ОбработчикиСобытийЭлементовТаблицыФормыУполномоченноеЛицоПеревозчикаКонтактныеДанные

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчикаКонтактныеДанныеПередНачаломДобавления(Элемент, Отказ, Копирование,
		Родитель, Группа, Параметр)
	
	Если Не ЕстьДанныеЮрЛица("УполномоченноеЛицоПеревозчика") Тогда 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указано уполномоченное лицо перевозчика!";
		Сообщение.Поле  = "УполномоченноеЛицоПеревозчикаСтрокой";
		Сообщение.Сообщить();		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчикаКонтактныеДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Если Копирование Тогда
			Элементы.УполномоченноеЛицоПеревозчикаКонтактныеДанные.ТекущиеДанные.Основной = Ложь;
		КонецЕсли;
		ОбработатьНовуюСтрокуКонтактнойИнформации(Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчикаКонтактныеДанныеПослеУдаления(Элемент)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	РолиЮрЛиц = МодульТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(ЭтаФорма, "УполномоченноеЛицоПеревозчика");
	ДопПараметры = МодульТНОбщегоНазначенияКлиентСервер.ДопПараметрыОбновленияКИ(РолиЮрЛиц);
	МодульТНОбщегоНазначенияКлиентСервер.ОбновитьОсновнойНомерТелефона(ЭтаФорма, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчикаКонтактныеДанныеЗначениеПриИзменении(Элемент)
	
	РолиЮрЛиц = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РолиЮрЛиц(ЭтаФорма, "УполномоченноеЛицоПеревозчика");
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЗначениеКонтактныхДанныхПриИзменении(
		ЭтаФорма, Элементы.УполномоченноеЛицоПеревозчикаКонтактныеДанные.ТекущиеДанные, РолиЮрЛиц);
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоПеревозчикаКонтактныеДанныеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
		СтандартнаяОбработка)
	
	РолиЮрЛиц = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").РолиЮрЛиц(ЭтаФорма, "УполномоченноеЛицоПеревозчика");
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЗначениеКонтактныхДанныхНачалоВыбора(
		ЭтаФорма, Элементы.УполномоченноеЛицоПеревозчикаКонтактныеДанные.ТекущиеДанные, РолиЮрЛиц, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыУполномоченноеЛицоПеревозчикаКонтактныеДанные

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрицепы

&НаКлиенте
Процедура ПрицепыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ПроцедураПослеОбновленияДанныхТранспортныхСредств = Новый ОписаниеОповещения(
		"ПослеОбновленияДанныхТранспортныхСредств",
		ЭтаФорма);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТаблицаПрицеповВыбор(
		ЭтаФорма,
		ВыбраннаяСтрока,
		СтандартнаяОбработка,
		ПроцедураПослеОбновленияДанныхТранспортныхСредств,
		Элементы.СтраницаВодителиИТС.ТолькоПросмотр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрицепыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// временно оставляем для старого расширения ce_saby
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ДобавитьНовыйПрицеп(
		ЭтаФорма,
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПрицеп(Команда)
	
	ПроцедураПослеОбновленияДанныхТранспортныхСредств = Новый ОписаниеОповещения(
		"ПослеОбновленияДанныхТранспортныхСредств",
		ЭтаФорма);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ДобавитьНовыйПрицеп(
		ЭтаФорма,
		ПроцедураПослеОбновленияДанныхТранспортныхСредств);

КонецПроцедуры

&НаКлиенте
Процедура ПрицепыПослеУдаления(Элемент)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ОбновитьТранспортныеСредстваНаФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрицепыПриИзменении(Элемент)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ОбновитьТранспортныеСредстваНаФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
    ПроцедураПослеОбновленияДанныхТранспортныхСредств = Новый ОписаниеОповещения(
		"ПослеОбновленияДанныхТранспортныхСредств",
		ЭтаФорма);		
		
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТранспортноеСредствоНажатие(
		ЭтаФорма,
		СтандартнаяОбработка,
		ПроцедураПослеОбновленияДанныхТранспортныхСредств,
		Элементы.СтраницаВодителиИТС.ТолькоПросмотр);
		
КонецПроцедуры

&НаКлиенте
Процедура ПрицепыСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПрицепыНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыПрицепы

#Область ОбработчикиСобытийЭлементовТаблицыФормыВодители

&НаКлиенте
Процедура ВодителиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтруктураОтветственного = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОтветственного(
		Объект.ОтветственныеЛица, "", ВыбраннаяСтрока);
		
	СтруктураОтветственного.Вставить("ТолькоПросмотр", Элементы.СтраницаВодителиИТС.ТолькоПросмотр);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").НачатьРедактированиеОтветственногоЛица(
		ЭтаФорма, СтруктураОтветственного, "Водитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ВодителиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// временно оставляем для старого расширения ce_saby
	
	Если НоваяСтрока Тогда
		Для Каждого СтруктураОтбора Из Элемент.ОтборСтрок Цикл
			Элемент.ТекущиеДанные[СтруктураОтбора.Ключ] = СтруктураОтбора.Значение;
		КонецЦикла;
		
		СтруктураОтветственного = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОтветственного(
			Объект.ОтветственныеЛица, "", Элемент.ТекущаяСтрока);
		
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").НачатьРедактированиеОтветственногоЛица(
			ЭтаФорма, СтруктураОтветственного, "Водитель");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВодителя(Команда)
	
	НоваяСтрока = Объект.ОтветственныеЛица.Добавить();
	ИдентификаторСтроки = НоваяСтрока.ПолучитьИдентификатор();
	
	Элемент = Элементы.Водители;	
	Для Каждого СтруктураОтбора Из Элемент.ОтборСтрок Цикл
		НоваяСтрока[СтруктураОтбора.Ключ] = СтруктураОтбора.Значение;
	КонецЦикла;
	
	СтруктураОтветственного = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОтветственного(
			Объект.ОтветственныеЛица, "", ИдентификаторСтроки);
		
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").НачатьРедактированиеОтветственногоЛица(
			ЭтаФорма, СтруктураОтветственного, "Водитель"); 
						
КонецПроцедуры

&НаКлиенте
Процедура ВодителиПослеУдаления(Элемент)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ОбновитьВодителейНаФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВодителиПриИзменении(Элемент)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ОбновитьВодителейНаФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВодителиСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ЭтаФорма.ТекущийЭлемент = Элементы.Водители;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыВодители

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОшибки

&НаКлиенте
Процедура ТаблицаОшибокПриАктивизацииСтроки(Элемент)

	СоответствиеТаблицФормыИОбъекта = СоответствиеТаблицФормыИОбъекта();
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").РасшифровкаЗаписиТаблицыОшибок(ЭтаФорма, СоответствиеТаблицФормыИОбъекта);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СоответствиеТаблицФормыИОбъекта = СоответствиеТаблицФормыИОбъекта();
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").РасшифровкаЗаписиТаблицыОшибок(ЭтаФорма, СоответствиеТаблицФормыИОбъекта);

КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОшибки

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВСбис(Команда)
	ОписаниеКоманды = Новый Структура("ИмяКоманды", "ВыгрузитьВСбис");
	ОбменСбис(ОписаниеКоманды);	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДокумент(Команда)
	ОписаниеКоманды = Новый Структура("ИмяКоманды", "ПрочитатьДокумент");
	ОбменСбис(ОписаниеКоманды);	
КонецПроцедуры

&НаКлиенте
Процедура ОбменСбис(ОписаниеКоманды)
	ПроцедураОбменДаннымиЗнП = Новый ОписаниеОповещения("ОбменДаннымиЗнП", ЭтаФорма, ОписаниеКоманды);
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПроверитьМодифицированностьИПродолжитьВыполнение(ПроцедураОбменДаннымиЗнП);
КонецПроцедуры

#Область ДокументОснование

&НаКлиенте
Процедура ДекорацияДокументОснование(Элемент)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ДокументОснованиеНажатие(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДокументОснование(Команда)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОчиститьДокументОснованиеНаФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДокументовОснований(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка",        Объект.Ссылка);
	ПараметрыФормы.Вставить("ТипМетаданных", "Документы");
	
	// ToDo: вынести в общие команды
	Если Найти(ЭтаФорма.ИмяФормы, "ESD") > 0 Тогда		
		Префикс = "ESD";
	Иначе 	
		Префикс = "SABY";
	КонецЕсли;
			
	ОткрытьФорму("ОбщаяФорма." + Префикс + "_ВыборТиповЭПД", ПараметрыФормы, ЭтаФорма);
		
КонецПроцедуры

#КонецОбласти // ДокументОснование

#Область КомандыЛенты

&НаКлиенте
Процедура ЛентаВлево(Команда)
	
	СдвинутьЛенту(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛентаВправо(Команда)
	
	СдвинутьЛенту(Истина);
	
КонецПроцедуры

#КонецОбласти // КомандыЛенты

&НаКлиенте
Процедура ПоказатьСкрытьОшибки(Команда)
	
	Элементы.ФормаПоказатьСкрытьОшибки.Пометка = Не Элементы.ФормаПоказатьСкрытьОшибки.Пометка;
	
	ОбновитьВнешнийВидЭлементовОшибок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоОшибкам(Команда)
	
	ПроцедураОбновитьДанныеПоОшибкамНаКлиенте = Новый ОписаниеОповещения(
		"ОбновитьДанныеПоОшибкамНаКлиенте",
		ЭтаФорма);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПроверитьМодифицированностьИПродолжитьВыполнение(
		ПроцедураОбновитьДанныеПоОшибкамНаКлиенте, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ПечатьДокументаQrКода(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВложенияВ1С(Команда)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЗагрузитьАрхивДокумента(ЭтаФорма, Ложь);
	ФормаОбъект = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ФормаОбъект(ЭтаФорма);
	ОповеститьОбИзменении(ФормаОбъект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ПодробныеСведения(Команда)
	Элементы.ГруппаГрузДетализация.Видимость = Не Элементы.ГруппаГрузДетализация.Видимость;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

#Область include_etrn_base_Document_ОбщийФункционал_ФормаДокумента_ОбработчикиОповещений_ОбработкаОповещенияВыход
#КонецОбласти // include_etrn_base_Document_ОбщийФункционал_ФормаДокумента_ОбработчикиОповещений_ОбработкаОповещенияВыход

&НаСервере
Процедура ПриЧтенииСозданииПослеЗаписиНаСервере() Экспорт
	ЗаполнитьРасчетныеРеквизиты();
	ЗаполнитьСписокВыбораСтавокНДС();
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	МодульТНОбщегоНазначенияСервер.ОбновитьЛенту(ЭтаФорма, Истина);
	МодульТНОбщегоНазначенияСервер.ОбновитьВнешнийВидЭлементовОшибок(ЭтаФорма);
		
	ОбновитьВидимостьИДоступностьЭлементов();
	ОбновитьВидимостьПоЭтапуИУчастнику();
	УстановитьОтборУполномоченныхЛиц();
	
	МодульТНОбщегоНазначенияСервер.УстановитьОтборТаблицыОтветственных(Элементы.Водители, "Водитель");
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НастроитьДополнительныеКонтакты(
		ЭтаФорма, "Отправитель,Перевозчик,УполномоченноеЛицоПеревозчика");
		
	Если ЭтоУниверсальноеРасширение() Тогда
		ЭтаФорма.АвтоЗаголовок = Не МодульТНОбщегоНазначенияСервер.ЭтоCF();
		Если Не ЭтаФорма.АвтоЗаголовок Тогда
			ЭтаФорма.Заголовок = МодульТНОбщегоНазначенияСервер.ПредставлениеДокумента(ЭтаФорма.Объект);
		КонецЕсли;
	КонецЕсли;
	
	ПриЧтенииСозданииПослеЗаписиНаСервереПереопределяемый();
КонецПроцедуры

#Область include_etrn_base_Document_ЗаказНаПеревозку_DocumentForm_ФормаДокумента_ПриЧтенииСозданииПослеЗаписиНаСервере
#КонецОбласти

#Область include_etrn_base_Document_ЗаказНаПеревозку_DocumentForm_ФормаДокумента_ПодключаемыйФункционал
#КонецОбласти // include_etrn_base_Document_ЗаказНаПеревозку_DocumentForm_ФормаДокумента_ПодключаемыйФункционал

#Область include_etrn_base_Document_ЗаказНаПеревозку_DocumentForm_ФормаДокумента_ПриСозданииНаСервере
#КонецОбласти

&НаКлиенте
Процедура НастроитьОтображениеДанных()
	ЗаполнитьСписокВыбораГрузовАдресов();
	Грузы_УстановитьОтборПоСвязаннымТаблицам();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасчетныеРеквизиты()
	
	МодульТНОбщегоНазначенияСервер       = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	// Активный этап и индикация состояния
	МодульТНОбщегоНазначенияСервер.ОтобразитьНаФормеСбисЭтапИСостояние(ЭтаФорма);
	
	// Документ основание
	Если ЗначениеЗаполнено(Объект.ДокументОснование_Идентификатор) Тогда
		ДокументОснование = МодульТНОбщегоНазначенияСервер.СсылкаНаОбъектОснование(
			Объект.ДокументОснование_ОбъектМетаданных, Объект.ДокументОснование_Идентификатор);
		Элементы.ДекорацияДокументОснование.Заголовок = СокрЛП(ДокументОснование);
	КонецЕсли;
	
	ЭтаФорма.ОтправительСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, "Отправитель");
		
	ИмяРолиОформитель = "Оформитель";
	ЭтаФорма.ОформительСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, ИмяРолиОформитель);
	СтрокаЮрЛиц = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(Объект.ДанныеЮрЛиц, ИмяРолиОформитель);
	МодульТНОбщегоНазначенияКлиентСервер.ЗаполнитьДополнительныеПоляЮрЛица(
		ЭтаФорма, СтрокаЮрЛиц, "Основание", ИмяРолиОформитель);
		
	ЭтаФорма.ПеревозчикСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, "Перевозчик");
	
	ИмяРолиУполномоченноеЛицоПеревозчика = "УполномоченноеЛицоПеревозчика";
	ЭтаФорма.УполномоченноеЛицоПеревозчикаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, ИмяРолиУполномоченноеЛицоПеревозчика);
	СтрокаЮрЛиц = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, ИмяРолиУполномоченноеЛицоПеревозчика);
	МодульТНОбщегоНазначенияКлиентСервер.ЗаполнитьДополнительныеПоляЮрЛица(
		ЭтаФорма, СтрокаЮрЛиц, "Полномочия,Основание", ИмяРолиУполномоченноеЛицоПеревозчика);
	
	// Телефоны
	РолиЮрЛиц = МодульТНОбщегоНазначенияКлиентСервер.РолиЮрЛиц(
		ЭтаФорма, "Отправитель,Перевозчик,УполномоченноеЛицо,УполномоченноеЛицоПеревозчика");
	ДопПараметры = МодульТНОбщегоНазначенияКлиентСервер.ДопПараметрыОбновленияКИ(РолиЮрЛиц);
	МодульТНОбщегоНазначенияКлиентСервер.ОбновитьОсновнойНомерТелефона(ЭтаФорма, ДопПараметры);
	
	// ТС
	МодульТНОбщегоНазначенияКлиентСервер.ОбновитьТранспортныеСредстваНаФорме(ЭтаФорма);
	
	// Водители
	МодульТНОбщегоНазначенияКлиентСервер.ОбновитьВодителейНаФорме(ЭтаФорма);
	
	СтруктураОтветственного = МодульТНОбщегоНазначенияКлиентСервер.СтруктураОтветственного(
		Объект.ОтветственныеЛица, "Ответственный");
	
	МодульТНОбщегоНазначенияСервер.ОбновитьОтветственногоНаФорме(
		ЭтаФорма, "ОтветственныйЗаПеревозкуСтрокой", СтруктураОтветственного);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьИДоступностьЭлементов()
	Признаки = ПризнакиДокумента();
	// Завершен ДО, блокируем все изменения
	Если Признаки.Этапы.ДОЗавершен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ГруппаПредставительЗаказчика.Видимость = Объект.ПредставительЗаказчика;
		
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ТипДокумента");
	МассивЭлементов.Добавить("ДекорацияЗаполнитьПодачаТС");
	МассивЭлементов.Добавить("ПодачаАдрес");
	МассивЭлементов.Добавить("ДекорацияЗаполнитьКонечнаяТочка");
	МассивЭлементов.Добавить("КонечнаяТочкаАдрес");
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Доступность", НЕ Элементы.Группа_ДанныеОформителя.ТолькоПросмотр, МассивЭлементов);
		
	// если еще доступно то проверяем на "типдокумента"	
	Элементы.Договор.ТолькоПросмотр = (Объект.ТипДокумента = ЗначениеМетаданных("ESD_ТипДокументаЗнП.Заказ"));
	
	Элементы.ДекорацияЗаполнитьПодачаТС.Видимость      = Не ЗначениеЗаполнено(Объект.ПодачаАдрес);
	Элементы.ДекорацияЗаполнитьКонечнаяТочка.Видимость = Не ЗначениеЗаполнено(Объект.КонечнаяТочкаАдрес);
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьПоЭтапуИУчастнику()
	Признаки = ПризнакиДокумента();
	
	Элементы.ГруппаДокументОснование.Видимость = Признаки.Исходящий;
	Элементы.НастройкаДокументовОснований.Видимость = Ложь;
	Элементы.ГруппаКомандыДокументаОснования.Видимость = Признаки.Этапы.ОформлениеДоступно 
		И Не Этаформа.ТолькоПросмотр;
	Элементы.ДекорацияДокументОснование.Видимость = Признаки.Этапы.ОформлениеДоступно 
		Или ЗначениеЗаполнено(ДокументОснование);
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	Если Элементы.Найти("ФормаСоздать_ТранспортнаяНакладная") <> Неопределено Тогда
		ДоЗавершенПоложительно = МодульТНОбщегоНазначенияКлиентСервер.ИндексКартинки_ДОЗавершенПоложительно();	
		Элементы.ФормаСоздать_ТранспортнаяНакладная.Доступность = (ЭтаФорма.ИндексКартинки = ДоЗавершенПоложительно);	
	КонецЕсли;
	
	ПризнакТолькоПросмотр = Не Признаки.Этапы.ОформлениеДоступно Или ЭтаФорма.ТолькоПросмотр;
	СписокЭлементов = Новый Массив;	
	СписокЭлементов.Добавить("Группа_ДанныеОформителя");
	СписокЭлементов.Добавить("ГруппаОсновноеВерх");
	СписокЭлементов.Добавить("ГруппаЗаказчик");
	СписокЭлементов.Добавить("ГруппаПеревозчик");
	СписокЭлементов.Добавить("Договор");
	СписокЭлементов.Добавить("СтраницаПунктыМаршрута");
	СписокЭлементов.Добавить("СтраницаГруз");
	СписокЭлементов.Добавить("ГруппаПараметрыТС");
	СписокЭлементов.Добавить("ГруппаСпециальныеУсловия");
	СписокЭлементов.Добавить("ГруппаУполномоченныеЛицаЗаказчика");
	МодульТНОбщегоНазначенияКлиентСервер.ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "ТолькоПросмотр", ПризнакТолькоПросмотр, СписокЭлементов, Истина);
		
	ПризнакТолькоПросмотр = Не (Признаки.Этапы.ОформлениеДоступно Или Признаки.Этапы.УтверждениеДоступно) 
		Или ЭтаФорма.ТолькоПросмотр;
	СписокЭлементов = Новый Массив;
	СписокЭлементов.Добавить("ГруппаОплата");
	СписокЭлементов.Добавить("ГруппаУполномоченныеЛицаПеревозчика");
	СписокЭлементов.Добавить("СтраницаВодителиИТС");
	МодульТНОбщегоНазначенияКлиентСервер.ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "ТолькоПросмотр", ПризнакТолькоПросмотр, СписокЭлементов, Истина);
		
	СписокЭлементов = Новый Массив;
	СписокЭлементов.Добавить("ПрицепыДобавить");
	СписокЭлементов.Добавить("ВодителиДобавить");
	МодульТНОбщегоНазначенияКлиентСервер.ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Доступность", Не ПризнакТолькоПросмотр, СписокЭлементов, Ложь);
КонецПроцедуры

&НаСервере
Функция ПризнакиДокумента()
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Этапы",     Новый Структура);
	РезультатФункции.Вставить("Исходящий", Объект.Направление <> ЗначениеМетаданных("ESD_Направление.Входящий"));
		
	ДОЗавершен = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ДокументооборотЗавершен(ЭтаФорма.ИндексКартинки);
	
	ОформлениеДоступно = МодульКода("ESD_ТНОбщегоНазначенияСервер").ТипТитулаДоступенУчастнику(
		ЭтаФорма,
		Объект.ТекущиеЭтапы,
		ЗначениеМетаданных("ESD_ТипТитулаЗнП.Оформление"),
		ДОЗавершен);
	РезультатФункции.Этапы.Вставить("ОформлениеДоступно", ОформлениеДоступно);
		
	УтверждениеДоступно = МодульКода("ESD_ТНОбщегоНазначенияСервер").ТипТитулаДоступенУчастнику(
		ЭтаФорма,
	    Объект.ТекущиеЭтапы,
		ЗначениеМетаданных("ESD_ТипТитулаЗнП.Утверждение"),
		ДОЗавершен);
	РезультатФункции.Этапы.Вставить("УтверждениеДоступно", УтверждениеДоступно);
	
	РезультатФункции.Этапы.Вставить("ДОЗавершен", ДОЗавершен);
	
	Если РезультатФункции.Этапы.ОформлениеДоступно Тогда
		ПорядковыйНомер = 1;
	ИначеЕсли РезультатФункции.Этапы.УтверждениеДоступно Тогда
		ПорядковыйНомер = 2;
	ИначеЕсли ДОЗавершен Тогда
		ПорядковыйНомер = 3;
	Иначе
		ПорядковыйНомер = 4;
	КонецЕсли;
	
	РезультатФункции.Этапы.Вставить("Номер", ПорядковыйНомер);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораСтавокНДС()
	Элементы.СтавкаНДС.СписокВыбора.Очистить();
	
	СтавкиНДС_ = ESD_ТНОбщегоНазначенияКлиентСервер.СтавкиНДС_СписокВыбора();
	Для Каждого СтавкаНДС_ Из СтавкиНДС_ Цикл
		Элементы.СтавкаНДС.СписокВыбора.Добавить(СтавкаНДС_.Представление, СтавкаНДС_.Представление);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбменДаннымиЗнП(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ИмяКоманды = Результат;
	Если ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.Свойство("ИмяКоманды") Тогда
		ИмяКоманды = ДополнительныеПараметры.ИмяКоманды;
	КонецЕсли;
	
	Если ИмяКоманды = "ВыгрузитьВСбис" Тогда
		ДанныеДляОбработки = Новый Массив;
		ПараметрыВыгрузки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыВыгрузки(Объект.Ссылка);
		ДанныеДляОбработки.Добавить(ПараметрыВыгрузки);
	Иначе
		ДанныеДляОбработки = Новый Массив;
		ПараметрыЗагрузки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыЗагрузки(Объект.Ссылка);
		Если ИмяКоманды = "ОбновитьАктивныйЭтап" Тогда
			ПараметрыЗагрузки.ТекущийТитул = АктивныйЭтапСтрокой;
			ПараметрыЗагрузки.ТолькоАктивныйЭтап = Истина;
		КонецЕсли;
		ПараметрыЗагрузки.ИзДокумента = Истина;
		ПараметрыЗагрузки.ИмяМетаданных = ЗаказНаПеревозкуКлиент();
		ДанныеДляОбработки.Добавить(ПараметрыЗагрузки);
	КонецЕсли;
	
	ДополнительныеПараметрыОбмена = Новый Структура;
	ДополнительныеПараметрыОбмена.Вставить("ДвоичныеДанныеОбработки", Неопределено);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ВыполнитьКомандуСбис(
		ЭтаФорма,
		ИмяКоманды,
		ДанныеДляОбработки,
		ДополнительныеПараметрыОбмена);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНовуюСтрокуКонтактнойИнформации(ИмяТЧ)
	
	Роль = ЗначениеМетаданныхКлиент("ESD_РолиКонтрагентов.ПустаяСсылка");
	
    Отбор = Новый Структура;
	Отбор.Вставить("Роль", Роль);
	
	НайденныеСтроки = Объект.КонтактныеДанные.НайтиСтроки(Отбор);
	Для Каждого Строка Из НайденныеСтроки Цикл 
		Строка.Роль                   = Элементы[ИмяТЧ].ОтборСтрок.Роль;
		Строка.КлючСтроки_ДанныеЮрЛиц = Элементы[ИмяТЧ].ОтборСтрок.КлючСтроки_ДанныеЮрЛиц;
	КонецЦикла;
				
КонецПроцедуры

&НаКлиенте
Функция ЕстьДанныеЮрЛица(Роль)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Роль", ЗначениеМетаданныхКлиент("ESD_РолиКонтрагентов." + Роль));
	
	Возврат Объект.ДанныеЮрЛиц.НайтиСтроки(Отбор).Количество() > 0;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьИДоступностьЭлементовНаКлиенте() Экспорт
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Функция ДОЗавершен() Экспорт
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	ДОЗавершенОтрицательно = МодульТНОбщегоНазначенияКлиентСервер.ИндексКартинки_ДОЗавершенОтрицательно();
	ДОЗавершенПоложительно = МодульТНОбщегоНазначенияКлиентСервер.ИндексКартинки_ДОЗавершенПоложительно();
	
	Завершен = ИндексКартинки = ДОЗавершенОтрицательно
		Или ИндексКартинки = ДОЗавершенПоложительно;
	
	Возврат Завершен;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СвязанныеСГрузомТаблицы()
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Грузы", Новый Массив);
	
	РезультатФункции.Грузы.Добавить("Груз_АдресаПунктов");
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура УстановитьОтборУполномоченныхЛиц()
	
	Отбор = Новый Структура;
	Отбор.Вставить("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицо"));
	
	ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
	Элементы.УполномоченныеЛицаЗаказчика.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбновленияДанныхТранспортныхСредств(Результат, ДополнительныеПараметры) Экспорт
		
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ОбновитьТранспортныеСредстваНаФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияОтветственногоЛицаНаФорме(СтруктураОтветственногоЛица) Экспорт
	
	Роль = СокрЛП(СтруктураОтветственногоЛица.Роль);
	
	Если Роль = "Ответственный" Тогда
		ЭтаФорма.ОтветственныйЗаПеревозкуСтрокой = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПредставлениеФИО(
			СтруктураОтветственногоЛица);
		Если Не ЗначениеЗаполнено(ЭтаФорма.ОтветственныйЗаПеревозкуСтрокой) Тогда
			ЭтаФорма.ОтветственныйЗаПеревозкуСтрокой = "Заполнить";
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДатуДопустимогоВремени(ИдентификаторСтроки)
	
	СтрокаПункта = Объект.АдресаПунктовВыгрузки.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтрокаПункта.ДопустимоеВремя = Дата(
		Год(СтрокаПункта.ДатаВремя),
		Месяц(СтрокаПункта.ДатаВремя),
		День(СтрокаПункта.ДатаВремя),
		Час(СтрокаПункта.ДопустимоеВремя),
		Минута(СтрокаПункта.ДопустимоеВремя),
		Секунда(СтрокаПункта.ДопустимоеВремя));
	
КонецПроцедуры

&НаСервере
Функция ЗаполнениеНаОснованииINI() Экспорт
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	
	Результат = МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьНаОснованииINI(
		ОбъектДокумента, ДокументОснование, ЗаказНаПеревозку());
	Если ЗначениеЗаполнено(Результат) Тогда		
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ОбработкаОповещений

&НаКлиенте
Процедура ОбработатьОповещениеОбновитьДокумент(Параметр) Экспорт
	Подключаемый_ОбработкаОповещений_ОбновитьДокумент(Параметр);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещениеВыполнитьПереходНаФорме(ПараметрыПерехода = Неопределено) Экспорт
	
	ОбменДаннымиЗнП("ОбновитьАктивныйЭтап");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещениеЗавершениеВыполнитьДействиеНаФорме(Параметр) Экспорт
	
	ОбменДаннымиЗнП("ОбновитьАктивныйЭтап");
	
КонецПроцедуры

#КонецОбласти // ОбработкаОповещений

#Область Ошибки

&НаСервере
Процедура ОбновитьДанныеПоОшибкамНаСервере(Знач Ошибки = Неопределено) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Ссылка", Объект.Ссылка);
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбновитьОшибки(
		ЭтаФорма,
		ДополнительныеПараметры,
		Ошибки);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВнешнийВидЭлементовОшибок()
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбновитьВнешнийВидЭлементовОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДекорациюНаСервере(Знач ПараметрыВыделенияДекорации) Экспорт
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбновитьДекорацию(ЭтаФорма, ПараметрыВыделенияДекорации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоОшибкамНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьДанныеПоОшибкамНаСервере();
	
КонецПроцедуры

&НаКлиенте
Функция СоответствиеТаблицФормыИОбъекта()
	
	СоответствиеТаблицФормыИОбъекта = Новый Соответствие;
	СоответствиеТаблицФормыИОбъекта.Вставить("Водители",                    "ОтветственныеЛица");
	СоответствиеТаблицФормыИОбъекта.Вставить("УполномоченныеЛицаЗаказчика", "ДанныеЮрЛиц");
	СоответствиеТаблицФормыИОбъекта.Вставить("Прицепы",                     "ТранспортныеСредства");
	
	Возврат СоответствиеТаблицФормыИОбъекта;
	
КонецФункции

#КонецОбласти // Ошибки

&НаКлиенте
Процедура ОбновитьСумму()
	НДС = ESD_ТНОбщегоНазначенияКлиентСервер.СтавкиНДС_ПреобразоватьВЧисло(Объект.СтавкаНДС);
	Если ЗначениеЗаполнено(НДС) Тогда
		НДС = Число(НДС);
	Иначе
		НДС = 0;
	КонецЕсли;
	
	СтоПроцентов = 100;
	Объект.СуммаБезНДС = Объект.СуммаСНДС / (1 + НДС / СтоПроцентов);
КонецПроцедуры

&НаСервере
Процедура ОграничитьТипыДокументовОснованийНаСервере() Экспорт
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОграничитьТипыДокументовОснований(ЭтаФорма);
	
КонецПроцедуры

#Область Лента

&НаСервере
Процедура СдвинутьЛенту(Знач Вправо)
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").СдвинутьЛенту(ЭтаФорма, Вправо);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТитулОбработкаНавигационнойСсылки(Элемент,
		НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбработкаНавигационнойСсылкиЛенты(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьРеквизитИзТитула(СтрокаЛенты) Экспорт
		
	Если СтрокаЛенты.НаименованиеТитула = "Оформление" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ТипДокумента;
	ИначеЕсли СтрокаЛенты.НаименованиеТитула = "Утверждение" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ТранспортноеСредствоСтрокой;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТитулОтрицательноЗавершен(СтрокаЛенты) Экспорт
	
	ДОЗавершенОтрицательно = 5;
	
	Возврат СтрокаЛенты.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЗнП.Утверждение")
		И ЭтаФорма.ИндексКартинки = ДОЗавершенОтрицательно;
	
КонецФункции

#КонецОбласти // Лента

&НаСервере
Процедура УстановкаСпискаДоступныхТиповКИ()
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ОтправительКонтактныеДанныеТип");
	МассивЭлементов.Добавить("ПеревозчикКонтактныеДанныеТип");
	МассивЭлементов.Добавить("УполномоченноеЛицоПеревозчикаКонтактныеДанныеТип");
		
	МодульКода("ESD_ТНОбщегоНазначенияСервер").УстановкаСпискаДоступныхТиповКИ(ЭтаФорма, МассивЭлементов);
	   
КонецПроцедуры

#Область ИзменениеАдресов

&НаКлиенте
Процедура ИзменитьАдресПодачи(СтандартнаяОбработка) 
	
	ПараметрыВыбораАдреса = Новый Структура;
	ПараметрыВыбораАдреса.Вставить("Роль",           "ПодачаТС");
	ПараметрыВыбораАдреса.Вставить("Значение",       Объект.ПодачаАдресСтруктура);
	ПараметрыВыбораАдреса.Вставить("Текст",          Объект.ПодачаАдрес);
	ПараметрыВыбораАдреса.Вставить("ТолькоПросмотр", Элементы.СтраницаПунктыМаршрута.ТолькоПросмотр);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").АдресНачалоВыбора(ЭтаФорма, ПараметрыВыбораАдреса, СтандартнаяОбработка);
	
КонецПроцедуры

 &НаКлиенте
Процедура ИзменитьАдресКонечнойТочки(СтандартнаяОбработка) 
	
	ПараметрыВыбораАдреса = Новый Структура;
	ПараметрыВыбораАдреса.Вставить("Роль",           "КонечнаяТочка");
	ПараметрыВыбораАдреса.Вставить("Значение",       Объект.КонечнаяТочкаАдресСтруктура);
	ПараметрыВыбораАдреса.Вставить("Текст",          Объект.КонечнаяТочкаАдрес);
	ПараметрыВыбораАдреса.Вставить("ТолькоПросмотр", Элементы.СтраницаПунктыМаршрута.ТолькоПросмотр);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").АдресНачалоВыбора(ЭтаФорма, ПараметрыВыбораАдреса, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ИзменениеАдресов

&НаКлиенте
Процедура СкопироватьДанныеЮрЛиц(ИмяТаблицы, ИдентификаторСтроки)
	
	СтрокаТаблицы = Объект[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.КлючСтроки_ДанныеЮрЛиц) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПоКлючу = Новый Структура("КлючСтроки", СтрокаТаблицы.КлючСтроки_ДанныеЮрЛиц);
	НайденныеСтроки = Объект.ДанныеЮрЛиц.НайтиСтроки(ОтборПоКлючу);
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаТаблицы.КлючСтроки_ДанныеЮрЛиц = 0;
		Возврат;
	КонецЕсли;
	
	КлючИсходнойСтроки = СтрокаТаблицы.КлючСтроки_ДанныеЮрЛиц;
	СтрокаТаблицы.КлючСтроки_ДанныеЮрЛиц = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(
		ЭтаФорма, "ДанныеЮрЛиц");
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		СтрокаЮрЛиц = Объект.ДанныеЮрЛиц.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЮрЛиц, НайденнаяСтрока);
		СтрокаЮрЛиц.КлючСтроки = СтрокаТаблицы.КлючСтроки_ДанныеЮрЛиц;
	КонецЦикла;
	
	СкопироватьКонтактныеДанные(СтрокаЮрЛиц.ПолучитьИдентификатор(), КлючИсходнойСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьКонтактныеДанные(ИдентификаторСтроки, КлючИсходнойСтроки)
	
	СтрокаЮрЛиц = Объект.ДанныеЮрЛиц.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ОтборПоКлючу = Новый Структура;
	ОтборПоКлючу.Вставить("КлючСтроки_ДанныеЮрЛиц", КлючИсходнойСтроки);
	
	НайденныеСтроки = Объект.КонтактныеДанные.НайтиСтроки(ОтборПоКлючу);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		СтрокаКонтактныхДанных = Объект.КонтактныеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКонтактныхДанных, НайденнаяСтрока);
		СтрокаКонтактныхДанных.КлючСтроки_ДанныеЮрЛиц = СтрокаЮрЛиц.КлючСтроки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаДатАдресовПунктовВыгрузки()
	
	ДатаПогрузки = Дата(1, 1, 1);
	
	ДатаПодачиТС = ?(ЗначениеЗаполнено(Объект.ПодачаДатаВремя), Объект.ПодачаДатаВремя, Дата(1, 1, 1));
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ОчиститьСообщения();
	СтрокиПогрузки = Объект.АдресаПунктовВыгрузки.НайтиСтроки(Новый Структура("ЭтоПогрузка", Истина));
	Для Каждого СтрокаПогрузки Из СтрокиПогрузки Цикл
		ДатаПогрузки = Макс(ДатаПогрузки, СтрокаПогрузки.ДатаВремя);
		Если СтрокаПогрузки.ДатаВремя < ДатаПодачиТС Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата погрузки должна быть позднее даты подачи транспортного средства";
			Сообщение.Поле = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
				"Объект.АдресаПунктовВыгрузки[%1].ДатаВремя",
				Формат(СтрокаПогрузки.ПолучитьИдентификатор(), "ЧДЦ=0; ЧН=0; ЧГ="));
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
	СтрокиВыгрузки = Объект.АдресаПунктовВыгрузки.НайтиСтроки(Новый Структура("ЭтоПогрузка", Ложь));
	Для Каждого СтрокаВыгрузки Из СтрокиВыгрузки Цикл
		Если ДатаПогрузки <> Дата(1, 1, 1) И СтрокаВыгрузки.ДатаВремя <= ДатаПогрузки Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата выгрузки должна быть позднее даты погрузки";
			Сообщение.Поле = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
				"Объект.АдресаПунктовВыгрузки[%1].ДатаВремя",
				Формат(СтрокаВыгрузки.ПолучитьИдентификатор(), "ЧДЦ=0; ЧН=0; ЧГ="));
			Сообщение.Сообщить();
		КонецЕсли;
		Если СтрокаВыгрузки.ДатаВремя < ДатаПодачиТС Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата выгрузки должна быть позднее даты подачи транспортного средства";
			Сообщение.Поле = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
				"Объект.АдресаПунктовВыгрузки[%1].ДатаВремя",
				Формат(СтрокаВыгрузки.ПолучитьИдентификатор(), "ЧДЦ=0; ЧН=0; ЧГ="));
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область РедакторСопоставлений_ЗаполнениеНаОсновании

&НаСервере
Функция ЗаполнениеНаОснованииНаСервере(Знач СсылкаНаОснование) Экспорт
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнениеНаОснованииПоНовомуРедактору(ЭтаФорма, СсылкаНаОснование);
КонецФункции

&НаКлиенте
Процедура ПослеЗаполненияНаОсновании() Экспорт
	НастроитьОтображениеДанных();
КонецПроцедуры

#КонецОбласти // РедакторСопоставлений_ЗаполнениеНаОсновании

#Область include_etrn_base_Document_ЗаказНаПеревозку_DocumentForm_ФормаДокумента_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_Document_ЗаказНаПеревозку_DocumentForm_ФормаДокумента_СлужебныеПроцедурыИФункции   

&НаКлиенте
Процедура ПечатьДокументаQrКода(Команда, ВыборПечатнойФормы = Ложь) Экспорт
	
	ФормаОбъект = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ФормаОбъект(ЭтаФорма);
	
	ЗаголовокПечатнойФормы = "Заказ на перевозку №%1 от %2";
	ЗаголовокПечатнойФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
		ЗаголовокПечатнойФормы, ФормаОбъект.Номер, Формат(ФормаОбъект.Дата, "ДФ=dd.MM.yyyy"));
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПечатьДокумента(ЭтаФорма, Команда.Имя, ЗаголовокПечатнойФормы,, ВыборПечатнойФормы);

КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПрименитьДополнительныеПрава(Результат) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаГрузовПунктовВыгрузки()
	ЗаполнитьСписокВыбораГрузовАдресов();
	ДоступныеПунктыПогрузки = ЭтаФорма.Элементы.Груз_АдресаПунктовПорядковыйНомерПунктаПогрузки.СписокВыбора.ВыгрузитьЗначения();
	ДоступныеПунктыВыгрузки = ЭтаФорма.Элементы.Груз_АдресаПунктовПорядковыйНомерПунктаВыгрузки.СписокВыбора.ВыгрузитьЗначения();
	
	Для Каждого Груз_Адрес Из Объект.Груз_АдресаПунктов Цикл
		Если ДоступныеПунктыВыгрузки.Найти(Груз_Адрес.Выгрузка_КлючСтроки) = Неопределено Тогда
			Груз_Адрес.Выгрузка_КлючСтроки = 0;
		КонецЕсли;
		
		Если ДоступныеПунктыПогрузки.Найти(Груз_Адрес.Погрузка_КлючСтроки) = Неопределено Тогда
			Груз_Адрес.Погрузка_КлючСтроки = 0;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораГрузовАдресов()
	ЭтаФорма.Элементы.Груз_АдресаПунктовПорядковыйНомерПунктаВыгрузки.СписокВыбора.Очистить();
	ЭтаФорма.Элементы.Груз_АдресаПунктовПорядковыйНомерПунктаПогрузки.СписокВыбора.Очистить();
	Для Каждого Пункт Из Объект.АдресаПунктовВыгрузки Цикл 
		НомерСтроки = Пункт.НомерСтроки;
		Если Пункт.ЭтоПогрузка Тогда
			ЭтаФорма.Элементы.Груз_АдресаПунктовПорядковыйНомерПунктаПогрузки.СписокВыбора.Добавить(НомерСтроки, НомерСтроки);
		Иначе
			ЭтаФорма.Элементы.Груз_АдресаПунктовПорядковыйНомерПунктаВыгрузки.СписокВыбора.Добавить(НомерСтроки, НомерСтроки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьНомераПунктовВГрузах(НомерУдаленнойСтроки)
	Индекс = Объект.Груз_АдресаПунктов.Количество() - 1;
	Пока Индекс >= 0 Цикл
		СтрокаТЧ = Объект.Груз_АдресаПунктов[Индекс];
		
		Если СтрокаТЧ.Погрузка_КлючСтроки = НомерУдаленнойСтроки Тогда	 
			СтрокаТЧ.Погрузка_КлючСтроки = 0;
		КонецЕсли;
		
		Если СтрокаТЧ.Погрузка_КлючСтроки > НомерУдаленнойСтроки Тогда
			СтрокаТЧ.Погрузка_КлючСтроки = СтрокаТЧ.Погрузка_КлючСтроки - 1;
		КонецЕсли;
		
		Если СтрокаТЧ.Выгрузка_КлючСтроки = НомерУдаленнойСтроки Тогда
			СтрокаТЧ.Выгрузка_КлючСтроки = 0;
		КонецЕсли;
		
		Если СтрокаТЧ.Выгрузка_КлючСтроки > НомерУдаленнойСтроки Тогда
			СтрокаТЧ.Выгрузка_КлючСтроки = СтрокаТЧ.Выгрузка_КлючСтроки - 1;
		КонецЕсли;
		
		Если СтрокаТЧ.Погрузка_КлючСтроки = 0 И СтрокаТЧ.Выгрузка_КлючСтроки = 0 Тогда
			Объект.Груз_АдресаПунктов.Удалить(СтрокаТЧ.НомерСтроки - 1);
		КонецЕсли;
		
		Индекс = Индекс - 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура АдресаПунктовВыгрузкиПередУдалением(Элемент, Отказ)
	АктуализироватьНомераПунктовВГрузах(Элементы.АдресаПунктовВыгрузки.ТекущиеДанные.НомерСтроки);
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
