#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список_НастроитьОтборНаСервере(Параметры.ОснованиеМетаданные);
	ПредопределенныеДействия_ЗагрузитьСервере();
	НастроитьОтображениеЭлементовФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ПредопределенныеДействияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Элемент.ТекущиеДанные.Значение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьОтображениеЭлементовФормыНаСервере()
	Элементы.ПредопределенныеДействия.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
	Элементы.ПредопределенныеДействия.РастягиватьПоВертикали = Ложь;

	Попытка
		Элементы.ПредопределенныеДействия.ВариантУправленияВысотой = Вычислить("ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы");
	// BSLLS:MissingCodeTryCatchEx-off
	Исключение
	КонецПопытки;
	// BSLLS:MissingCodeTryCatchEx-on
	Элементы.ПредопределенныеДействия.ВысотаВСтрокахТаблицы = ЭтаФорма.ПредопределенныеДействия.Количество();	
КонецПроцедуры

&НаСервере
Процедура ПредопределенныеДействия_ЗагрузитьСервере()
	ЭтаФорма.ПредопределенныеДействия.Очистить();
	
	МодульПредопределенныхДействий = МодульКода("Перечисления.АвтоматическиеСценарииПредопределенныеДействия");
	Если ЗначениеЗаполнено(Параметры.ОснованиеМетаданные) Тогда
		ЭтаФорма.ПредопределенныеДействия.Добавить(МодульПредопределенныхДействий.Saby_ЗакрытиеФазыДокумента);
		ЭтаФорма.ПредопределенныеДействия.Добавить(МодульПредопределенныхДействий.Saby_ОтправкаЧерновика);
		ЭтаФорма.ПредопределенныеДействия.Добавить(МодульПредопределенныхДействий.Saby_ЗаполнениеДокументаЧерезРедакторСопоставлений);
	Иначе
		ЭтаФорма.ПредопределенныеДействия.Добавить(МодульПредопределенныхДействий.Saby_ЗагрузкаДанныхЭПД);
		ЭтаФорма.ПредопределенныеДействия.Добавить(МодульПредопределенныхДействий.Saby_ВыгрузкаДанныхЭПД);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Список_НастроитьОтборНаСервере(ОснованиеМетаданные)
	ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаОтбора.Использование = Истина;
	
	Если ЗначениеЗаполнено(ОснованиеМетаданные) Тогда
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.Владельцы.Владелец");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = ОснованиеМетаданные;
	КонецЕсли;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БезВладельцев");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Истина;
КонецПроцедуры

#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти