#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ОснованиеМетаданные) Тогда
		Список_НастроитьОтборНаСервере(Параметры.ОснованиеМетаданные);
	КонецЕсли;
	ПредопределенныеДействия_ЗагрузитьСервере();
	НастроитьОтображениеЭлементовФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ПредопределенныеДействияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Элемент.ТекущиеДанные.Значение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьОтображениеЭлементовФормыНаСервере()
	Элементы.ПредопределенныеДействия.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
	Элементы.ПредопределенныеДействия.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	Элементы.ПредопределенныеДействия.ВысотаВСтрокахТаблицы = ЭтаФорма.ПредопределенныеДействия.Количество();
	Элементы.ПредопределенныеДействия.РастягиватьПоВертикали = Ложь;	
КонецПроцедуры

&НаСервере
Процедура ПредопределенныеДействия_ЗагрузитьСервере()
	ЭтаФорма.ПредопределенныеДействия.Очистить();
	
	МодульПредопределенныхДействий = МодульКода("Перечисления.АвтоматическиеСценарииПредопределенныеДействия");
	ЭтаФорма.ПредопределенныеДействия.Добавить(МодульПредопределенныхДействий.Saby_ЗакрытиеФазыДокумента);
	ЭтаФорма.ПредопределенныеДействия.Добавить(МодульПредопределенныхДействий.Saby_ОтправкаЧерновика);
	ЭтаФорма.ПредопределенныеДействия.Добавить(МодульПредопределенныхДействий.Saby_ЗаполнениеДокументаЧерезРедакторСопоставлений);
КонецПроцедуры

&НаСервере
Процедура Список_НастроитьОтборНаСервере(ОснованиеМетаданные)
	ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.Владельцы.Владелец");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = ОснованиеМетаданные;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БезВладельцев");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Истина;
КонецПроцедуры

#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти