
&НаКлиенте
Процедура Оформитель_ОснованиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтруктураДокумента = Новый Структура;	
	НачатьРедактированиеДокументаЭПД(ЭтаФорма, СтруктураДокумента, "ОформительОснование", "Основание оформления ЭТрН" );
		
КонецПроцедуры

&НаКлиенте
Процедура Отгрузка_НаОснованииДокументНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтруктураДокумента = Новый Структура;	
	НачатьРедактированиеДокументаЭПД(ЭтаФорма, СтруктураДокумента, "ОтгрузкаОснование", "Основание отгрузки");
	
КонецПроцедуры

&НаКлиенте
// Открывает данные ответственного лица для редактирования
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма источник вызова
//  СтруктураДокумента - Структура - см. Saby_ТНОбщегоНазначенияКлиентСервер.СтруктураОтветственногоЛица()
//  Тип - Строка - тип документа
//  ЗаголовокДляФормы - Строка - имя заголовка формы
//
Процедура НачатьРедактированиеДокументаЭПД(Форма, СтруктураДокумента, Тип, ЗаголовокДляФормы) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма",              Форма);
	ДополнительныеПараметры.Вставить("СтруктураДокумента", СтруктураДокумента);
	
	ОповещениеПослеРедактирования = Новый ОписаниеОповещения(
		"ПослеРедактированияДокументаЭПД", МодульКодаКлиент("Saby_ТНОбщегоНазначенияКлиент"), ДополнительныеПараметры);
	
	//ИмяМетаданных = МодульКодаКлиент("Saby_ТНОбщегоНазначенияКлиентСервер").ИмяМетаданныхПоФорме(Форма);
	//СтруктураОтветственногоЛица.Вставить("ИмяМетаданных", ИмяМетаданных);
	
	СтруктураДокумента.Вставить("Наименование", ЗаголовокДляФормы);
	СтруктураДокумента.Вставить("Тип",          Тип);
	
	ПараметрыОткрытияФормыОбработки = ПараметрыОткрытияФормыОбработки(
		"Обработка.Saby_ДокументыЭПД", СтруктураДокумента, Форма);
	
	ПараметрыОткрытияФормыОбработки.ОписаниеОповещенияОЗакрытии = ОповещениеПослеРедактирования;
	ПараметрыОткрытияФормыОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФормуОбработки(ПараметрыОткрытияФормыОбработки);
	
КонецПроцедуры


&НаКлиенте
// Выполняет действия после редактирования ответственного лица
//
// Параметры:
//  Результат - Структура - см. Saby_ТНОбщегоНазначенияКлиентСервер.СтруктураОтветственногоЛица()
//  ДополнительныеПараметры - Структура - см. НачатьРедактированиеОтветственногоЛица()
//
Процедура ПослеРедактированияДокументаЭПД(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

