
Функция ЗначениеМетаданных(Знач ИмяПредопределенныхДанных, ТипМетаданных = "Перечисление")
	
	МассивИмен = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ИмяПредопределенныхДанных, ".");
	
	Значение = МассивИмен[МассивИмен.ВГраница()];
	
	// преобразование пустых ссылок в значение
	Если Значение = "ПустаяСсылка" Тогда
		Значение = "";
	КонецЕсли;	
		
	Возврат Значение;
	
КонецФункции

&НаКлиенте
Функция ЗначениеМетаданныхКлиент(Знач ИмяПредопределенныхДанных, ТипМетаданных = "Перечисление")
	
	МассивИмен = МодульКодаКлиент("Saby_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ИмяПредопределенныхДанных, ".");
	
	Значение = МассивИмен[МассивИмен.ВГраница()];
	Если Значение = "ПустаяСсылка" Тогда
		Значение = "";
	КонецЕсли;	
	Возврат Значение;
	
КонецФункции

