
&НаКлиенте
Функция ИмяФормыОбработки(ПолноеИмяФормы)
	
	МассивИмен = СтрРазделить(ПолноеИмяФормы, ".");
	
	ИмяФормыВнешнейОбработки = МассивИмен[МассивИмен.ВГраница()];
	
	Если ИмяФормыВнешнейОбработки = "ФормаДинамическихТитулов" Тогда
		ИмяФормыВнешнейОбработки = "ESD_ТранспортнаяНакладнаяДТ";
	КонецЕсли;
	
	ИмяФормыВнешнейОбработки = СтрЗаменить(ИмяФормыВнешнейОбработки, "ESD", "Saby");

	ПрефиксВнешнейОбработки = "ВнешняяОбработка.SABY.Форма.";
	
	Возврат ПрефиксВнешнейОбработки + ИмяФормыВнешнейОбработки;
	
КонецФункции

