
&НаКлиенте
// Открывает форму редактирования опасного груза в ВО
//
Процедура ОткрытьОпасныйГруз() Экспорт
		
	// Получим данные тары	
	ПараметрыФормы = СтрокаТаблицыФормыВСтруктуру(
						ЭтаФорма, 
						"ОпасныеГрузы", 
						Элементы.ОпасныеГрузы.ТекущиеДанные);
						
	ПараметрыФормы.Вставить("ТолькоПросмотр", Элементы.Страница_Груз.ТолькоПросмотр);					
						
	ДополнительныеПараметры = Новый Структура;
	
	ОповещениеПослеРедактирования = Новый ОписаниеОповещения(
		"ПослеРедактированияОпасногоГруза", МодульКодаКлиент("ЭтотОбъект"), ДополнительныеПараметры);
	
	ПараметрыОткрытияФормыОбработки = ПараметрыОткрытияФормыОбработки(
		"Обработка.ОпасныйГрузЭПД", ПараметрыФормы, ЭтаФорма);
	
	ПараметрыОткрытияФормыОбработки.ОписаниеОповещенияОЗакрытии = ОповещениеПослеРедактирования;
	ПараметрыОткрытияФормыОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФормуОбработки(ПараметрыОткрытияФормыОбработки);
	
КонецПроцедуры

&НаКлиенте
// Выполняет действия после редактирования опасного груза
//
// Параметры:
//  Результат - Структура - см. Saby_ТНОбщегоНазначенияКлиентСервер.СтруктураОтветственногоЛица()
//  ДополнительныеПараметры - Структура - см. НачатьРедактированиеОтветственногоЛица()
//
Процедура ПослеРедактированияОпасногоГруза(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Строка = Элементы.ОпасныеГрузы.ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(Строка, Результат);
		
	КонецЕсли;
	
КонецПроцедуры

