
&НаСервере
Функция МодульКода(ИмяМодуля)
	
	МассивМодулейОбработки = Новый Массив;
	МассивМодулейОбработки.Добавить("Документы.Saby_ТранспортнаяНакладная");
	МассивМодулейОбработки.Добавить("Saby_Core");
	МассивМодулейОбработки.Добавить("Перечисления.Saby_ТипТитулаЭтрН");
	МассивМодулейОбработки.Добавить("Перечисления.Saby_ТипТитулаЭПЛ");
	МассивМодулейОбработки.Добавить("Перечисления.Saby_ТипТитулаЗнП");
	МассивМодулейОбработки.Добавить("Документы.");
	МассивМодулейОбработки.Добавить("РегистрыСведений.Saby_ДанныеТитулов");
	МассивМодулейОбработки.Добавить("Saby_ТНОбщегоНазначенияКлиентСервер");
	МассивМодулейОбработки.Добавить("Saby_ТНОбщегоНазначенияСервер");
    МассивМодулейОбработки.Добавить("Saby_ТНЗагрузкаСервер");

	Если МассивМодулейОбработки.Найти(ИмяМодуля) <> Неопределено Тогда
		ИмяФормыСКодом = "МодульОбработки";
	Иначе
		ИмяФормыСКодом = "";
	КонецЕсли;
	
	Если ИмяФормыСКодом = "МодульОбработки" Тогда
		Возврат РеквизитФормыВЗначение("Объект");
	Иначе
		Возврат ЭтаФорма;
	КонецЕсли;
	
КонецФункции

