
// Получает данные печатной формы документа с онлайна.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры загрузки QR из Saby
//
// Возвращаемое значение:
//   Структура - Результат загрузки данных из Saby (см. ОбщийРезультатЗагрузкиДанныхSaby())
//
Функция SabyДанныеПечатнойФормыQR(ПараметрыЗагрузки) Экспорт
	SabyОбработатьПараметрыЗагрузкиДанных(ПараметрыЗагрузки);
	
	РезультатФункции = SabyОбщийРезультатЗагрузкиДанных(ПараметрыЗагрузки.СсылкаНаДокумент);
	РезультатФункции.Вставить("ПечатнаяФормаQR", Неопределено);
	
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.СсылкаНаДокумент) Тогда
		РезультатФункции.ОписаниеОшибки = "Документ еще ни разу не сохранен. QR недоступен.";
		Возврат РезультатФункции;
	КонецЕсли;
	
	ПараметрыЗагрузкиФайловSaby = МодульКода("ESD_ТНЗагрузкаСервер").SabyСформироватьПараметрыЗагрузкиФайлов(
		ПараметрыЗагрузки, , Ложь);
	
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузкиФайловSaby.ИдентификаторСБИС) Тогда
		РезультатФункции.ОписаниеОшибки = "Документ не выгружен в SABY. QR недоступен.";
		РезультатФункции.СписокДокументов = ПараметрыЗагрузкиФайловSaby.СписокДокументов;
		РезультатФункции.ОшибкиОбщие      = ПараметрыЗагрузкиФайловSaby.ОшибкиОбщие;
		Возврат РезультатФункции;
	КонецЕсли;
	
	// Добавим служебный параметр для загрузки двоичных данных QR-кода
	РезультатФункции.Вставить("АдресДвоичныхДанных", Неопределено);
	// Выполним загрузку
	SabyЗагрузитьQR(РезультатФункции, ПараметрыЗагрузкиФайловSaby);
	// Приведем двоичные данные к табличному документу 1С
	РезультатФункции.ПечатнаяФормаQR = СформироватьПечатнуюФормуQR(РезультатФункции, ПараметрыЗагрузки);
	// Удалим служебный параметр
	РезультатФункции.Удалить("АдресДвоичныхДанных");
	
	Если ТипЗнч(РезультатФункции.ПечатнаяФормаQR) = Тип("ТабличныйДокумент") 
		И ПараметрыЗагрузки.Свойство("ЭтоТолстыйКлиент") 
	Тогда
		// Табличный документ в толстом клиенте не передается с сервера на клиент, поэтому заворачиваем в строку внутр.
		РезультатФункции.ПечатнаяФормаQR = ЗначениеВСтрокуВнутр(РезультатФункции.ПечатнаяФормаQR);
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

Процедура SabyЗагрузитьQR(РезультатФункции, ПараметрыЗагрузкиФайловSaby) Экспорт
	РезультатЗагрузкиSaby = МодульКода("ESD_ТНЗагрузкаСервер")
		.АдресДвоичныхДанныхQR(ПараметрыЗагрузкиФайловSaby);
		
	ТекстОшибки = "Не удалось получить QR из Saby.";
	Если РезультатЗагрузкиSaby.Ошибка Тогда
		РезультатФункции.ОписаниеОшибки = ТекстОшибки + "
			|" + РезультатЗагрузкиSaby.Данные;
	ИначеЕсли Не ЗначениеЗаполнено(РезультатЗагрузкиSaby.Данные) Тогда
		РезультатФункции.ОписаниеОшибки = ТекстОшибки;
	Иначе
		РезультатФункции.АдресДвоичныхДанных = РезультатЗагрузкиSaby.Данные;
	КонецЕсли;	
КонецПроцедуры

Функция СформироватьПечатнуюФормуQR(Результат, ДополнительныеПараметры) Экспорт
	Если Не ЗначениеЗаполнено(Результат.АдресДвоичныхДанных) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	QRКодыДляВывода = QRКодыДляВывода(Результат);
	
	ШиринаШтрихкода = 20;
	ШиринаЗаголовка = 80;
	РазмерШрифтаЗаголовка = 14;
	
	ПечатнаяФормаQR = Новый ТабличныйДокумент;
	ПечатнаяФормаQR.Область(1, , 1).СоздатьФорматСтрок();
	ОбластьЗаголовка = ПечатнаяФормаQR.Область(1, 1, 1, 1);
	ОбластьЗаголовка.ШиринаКолонки = ШиринаЗаголовка;
	// BSLLS:StyleElementConstructors-off
	ОбластьЗаголовка.Шрифт = Новый Шрифт(ОбластьЗаголовка.Шрифт, , РазмерШрифтаЗаголовка, Истина);
	// BSLLS:StyleElementConstructors-on
	ОбластьЗаголовка.Текст = ДополнительныеПараметры.Заголовок;
	
	СтрокаДокумента = 2;
	ПечатнаяФормаQR.Область(СтрокаДокумента, , СтрокаДокумента).СоздатьФорматСтрок();
	НомерКартинки = 1;
	Для Каждого КартинкаКода Из QRКодыДляВывода Цикл
		ОбластьШтрихкода = ПечатнаяФормаQR.Область(СтрокаДокумента, НомерКартинки, СтрокаДокумента, НомерКартинки);
		ОбластьШтрихкода.ШиринаКолонки = ШиринаШтрихкода;
		ОбластьШтрихкода.Картинка = КартинкаКода;
		НомерКартинки = НомерКартинки + 1;
	КонецЦикла;
	
	Возврат ПечатнаяФормаQR;
КонецФункции

Функция QRКодыДляВывода(Результат)
	РезультатФункции = Новый Массив;
	
	МассивДвоичныхДанных = ПолучитьИзВременногоХранилища(Результат.АдресДвоичныхДанных);
	УдалитьИзВременногоХранилища(Результат.АдресДвоичныхДанных);
	Для Каждого ДвоичныеДанныеКартинки Из МассивДвоичныхДанных Цикл
		КартинкаКода = Новый Картинка(ДвоичныеДанныеКартинки);
		РезультатФункции.Добавить(КартинкаКода);
	КонецЦикла;
	
	Возврат РезультатФункции;	
КонецФункции

