
#Область ПрограммныйИнтерфейс

// Загружает документы из СБИС
//
// Параметры:
//  ДанныеДляЗагрузки - Массив - массив структур см. Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыЗагрузки
//  context_params - Структура - параметры подключения к СБИС
//  ДополнительныеПараметры - Структура - дополнительные параметры для выгрузки
//
// Возвращаемое значение:
//   Структура - см. Saby_ТНОбщегоНазначенияКлиентСервер.РезультатВзаимодействияСоСБИС
//
Функция РезультатЗагрузкиДокументов(ДанныеДляЗагрузки, context_params, ДополнительныеПараметры) Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	ОбщиеПараметрыЗагрузки = МодульТНОбщегоНазначенияСервер.ОбщиеПараметрыВыгрузкиЗагрузки(context_params);
	
	РезультатФункции = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").РезультатВзаимодействияСоСБИС(
		ДанныеДляЗагрузки.Количество());
	
	Для Каждого ПараметрыЗагрузки Из ДанныеДляЗагрузки Цикл	
		SabyЗагрузитьДанныеДокумента(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, РезультатФункции);
		SabyПослеЗагрузкиДанныхДокумента(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, РезультатФункции);
		РезультатФункции.Выполнение.ИзРасширения = ПараметрыЗагрузки.ИзРасширения;
	КонецЦикла;
	
	Если ДополнительныеПараметры.Свойство("ОпасныеГрузыСОнлайна") Тогда
		РезультатФункции.ОпасныеГрузыСОнлайна = ДополнительныеПараметры.ОпасныеГрузыСОнлайна;
	КонецЕсли;
	Если ДополнительныеПараметры.Свойство("ВидыУпаковкиСОнлайна") Тогда
		РезультатФункции.ВидыУпаковкиСОнлайна = ДополнительныеПараметры.ВидыУпаковкиСОнлайна;
	КонецЕсли;
	
	МодульКода("Справочники.ESD_ОпасныеГрузы").ДозаполнитьНовыеОпасныеГрузы(РезультатФункции, ОбщиеПараметрыЗагрузки);
	МодульКода("Справочники.ESD_ВидыУпаковки").ДозаполнитьНовыеВидыУпаковки(РезультатФункции, ОбщиеПараметрыЗагрузки);
	
	РезультатФункции.Итог.Успех = Не ЗначениеЗаполнено(РезультатФункции.Ошибки);
	
	МодульТНОбщегоНазначенияСервер.ЗаписьОшибокВЖурналРегистрации(РезультатФункции.Ошибки, 
		МодульТНОбщегоНазначенияСервер.ИмяСобытияЖурналаРегистрации_ЗагрузкаИзSaby());
	
	Возврат РезультатФункции;
	
КонецФункции

// Загружает изменения по документам из списка.
//
// Параметры:
//  СтруктураПараметров - Структура - параметры загрузки
//
// Возвращаемое значение:
//   Структура - с фиксированными ключами см. в конце функции
//
Функция ЗагрузкаДокументовПоИзменениям(СтруктураПараметров) Экспорт
	// Изменения для последующей обработки
	СписокИзменений = ЗагрузитьСписокИзмененийДокументов(СтруктураПараметров);
	
	Результат = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").РезультатВзаимодействияСоСБИС(СписокИзменений.Количество());
	ОбработатьИзмененияДокументов(СписокИзменений, Результат, СтруктураПараметров);
	
	Результат.Итог.Успех = Результат.Итог.Количество = Результат.Итог.Всего;
	
	МодульESD_ТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	МодульESD_ТНОбщегоНазначенияСервер.ЗаписьОшибокВЖурналРегистрации(Результат.Ошибки, 
		МодульESD_ТНОбщегоНазначенияСервер.ИмяСобытияЖурналаРегистрации_ЗагрузкаИзSaby());
	
	Возврат Результат;
КонецФункции

// Выполнить загрузку и обработку списка изменений ЭПД Saby
//
// Параметры:
//	СтруктураПараметров - Структура - структура параметров загрузки данных из Saby
//
// Возвращаемое значение:
//	Соответствие - обработанные загруженные данные из Saby
//
Функция ЗагрузитьСписокИзмененийДокументов(СтруктураПараметров) Экспорт
	РезультатФункции = Новый Соответствие;
	
	ПараметрыПолученияИзменений = SabyСписокИзменений_Параметры(СтруктураПараметров);
	
	ЕстьИзменения = Истина;
	Пока ЕстьИзменения Цикл
		СтруктураИзменений = SabyСписокИзменений_Загрузить(ПараметрыПолученияИзменений);
		Для Каждого ДанныеSaby Из СтруктураИзменений.ИзмененияПоДокументам Цикл
			SabyСписокИзменений_ОбработатьДанные(РезультатФункции, ДанныеSaby, ПараметрыПолученияИзменений, 
				СтруктураПараметров.ДопПараметры);
		КонецЦикла;
		
		ЕстьИзменения = СтруктураИзменений.ЕстьИзменения;
	КонецЦикла;
	
	SabyСписокИзменений_ОбработатьПолученныеДанные(РезультатФункции, СтруктураПараметров);
	Возврат РезультатФункции;
КонецФункции

// Загружает данные динамического титула в форму динамического титула по переданному идентификатору.
// Запрос данных с онлайна не происходит, так как берутся ранее загруженные данные из регистра Saby_ДанныеТитулов
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма динамического титула
//  ИдентификаторТитула - Строка - идентификатор динамического титула из СБИС.
//                      Это не идентификатор документа, а идентификатор именно титула.
//
Процедура ЗагрузитьДанныеДинамическогоТитула(Форма, ИдентификаторТитула) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПолучитьДанныеТитулов(Форма, МенеджерВременныхТаблиц);
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ДанныеТитулов.Данные КАК Данные,
	|	ДанныеТитулов.ТипТитула КАК Титул
	|ИЗ
	|	ДанныеТитулов КАК ДанныеТитулов
	|ГДЕ
	|	ДанныеТитулов.ИдентификаторТитула = &ИдентификаторТитула";
	
	ЗапросДанных.УстановитьПараметр("ИдентификаторТитула", ИдентификаторТитула);
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	Если ВыборкаДанных.Следующий() Тогда
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ДляДокумента", ЗначениеИзСтрокиВнутр(ВыборкаДанных.Данные));
		СтруктураДанных.Вставить("Титул",        ВыборкаДанных.Титул);
		
		ДанныеТитула = Новый Массив;
		ДанныеТитула.Добавить(СтруктураДанных);
		
		ИмяМетаданных = МодульКода("ESD_ТНОбщегоНазначенияСервер").ИмяМетаданныхДокумента(Форма.СсылкаНаЭТрН);
		
		ДопПараметрыЗагрузкиВложения = ДопПараметрыЗагрузкиВложения();
		ДопПараметрыЗагрузкиВложения.ЗагрузкаСОнлайна = Ложь;
		ДопПараметрыЗагрузкиВложения.ИмяМетаданных    = ИмяМетаданных;
		
		МодульКода("Документы." + ИмяМетаданных).ВложенияЗагружены(
			ДанныеТитула,
			ВыборкаДанных.Титул,
			Форма,
			ДопПараметрыЗагрузкиВложения);
		
		МассивСсылокНаДокумент = Новый Массив;
		МассивСсылокНаДокумент.Добавить(Форма.СсылкаНаЭТрН);
		
		МассивТитулов = Новый Массив;
		МассивТитулов.Добавить(ИдентификаторТитула);
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").Просмотреть(МассивСсылокНаДокумент, МассивТитулов);
		
	КонецЕсли;
	
КонецПроцедуры

// Загружает документы ЭПД в регламентном задании во внешней обработке
//
Процедура ЗагрузитьДокументыЭПДПоРегламентномуЗаданию() Экспорт
	
	ЗагрузитьПоРегламенту(ЗаказНаПеревозку());
	ЗагрузитьПоРегламенту(ПутевойЛист());
	ЗагрузитьПоРегламенту(ТранспортнаяНакладная());
	
КонецПроцедуры

// Выполняет загрузку документов ЭПЛ в регламентном задании.
//
// Параметры:
//  ТипДокумента - Строка - тип документа для загрузки
//  Начало - Дата - дата начала загрузки данных
//  Окончание - Дата - дата окончания загрузки данных
//
Процедура ЗагрузитьПоРегламенту(ТипДокумента, Начало = Неопределено, Окончание = Неопределено) Экспорт
		
	context_params = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПроверитьНаличиеПараметровПодключенияЭПД();
        
    СтруктураПараметров = Новый Структура;
                
    СтруктураПараметров.Вставить("МассивДокументов", Неопределено);
    СтруктураПараметров.Вставить("context_params",   context_params);
    СтруктураПараметров.Вставить("Источник",         Неопределено);
    
	ДопПараметры = Новый Структура;
	
	Если Начало <> Неопределено И Окончание <> Неопределено Тогда
		ДопПараметры.Вставить("Начало",    Начало);
		ДопПараметры.Вставить("Окончание", Окончание);
	Иначе
		ДатаОбновления = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПоследнееУспешноЗагруженноеИзменение(ТипДокумента);
		ТекДата = ТекущаяДатаСеанса();
		
		Если ДатаОбновления = Неопределено Тогда
			ДатаОбновления = НачалоДня(ТекДата);
		КонецЕсли;
		
		Если ТекДата < ДатаОбновления Тогда
			ДатаОбновления = ТекДата;
		КонецЕсли;
		
		ДопПараметры.Вставить("Начало",    ДатаОбновления);
		ДопПараметры.Вставить("Окончание", КонецДня(ТекДата));
	КонецЕсли;
	
	ДопПараметры.Вставить("ИзРасширения", Истина);
	ДопПараметры.Вставить("ИмяМетаданных", ТипДокумента);
	СтруктураПараметров.Вставить("ДопПараметры", ДопПараметры);
	
    ЗагрузкаДокументовПоИзменениям(СтруктураПараметров);
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Загружает данные с онлайна в документ
//
// Параметры:
//  ПараметрыЗагрузки - Структура - см. Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыЗагрузки()
//  Результат - Структура - см. Saby_ТНОбщегоНазначенияКлиентСервер.РезультатВзаимодействияСоСБИС()
//	ОбщиеПараметрыЗагрузки - Структура - параметры работы "транспорта"
//
Процедура ЗаписатьДанныеДокумента(ПараметрыЗагрузки, Результат = Неопределено, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	ДанныеДокумента = ПараметрыЗагрузки.ДанныеДокумента; 
	Подстановки = ДанныеДокумента["Подстановки"];
	Если Не ЗначениеЗаполнено(Подстановки) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектДок = ОбъектЗагружаемогоДокумента(ПараметрыЗагрузки);
	Если ОбъектДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДокументОснование(ОбъектДок, ПараметрыЗагрузки);
	ЗагрузитьТекущиеЭтапыДокумента(ОбъектДок, ПараметрыЗагрузки);
	
	ОбъектДок.Направление = НаправлениеДокумента(ДанныеДокумента["Направление"], ОбъектДок.Направление);
	Если ТипЗнч(ОбъектДок) <> Тип("Структура") Тогда
		ОбъектДок.ГИС_УИД = ДанныеДокумента["ГИС_УИД"];
	КонецЕсли;
	
	МодульТНОбщегоНазначенияСервер       = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	МодульМенеджераЭПД                   = МодульКода("Документы." + ПараметрыЗагрузки.ИмяМетаданных);
	
	ДопПараметрыЗагрузкиВложения = ДопПараметрыЗагрузкиВложения(ПараметрыЗагрузки, Результат);
	
	МассивТитулов = МодульМенеджераЭПД.ТитулыДляЗагрузки(ОбъектДок, ПараметрыЗагрузки);
	Для Каждого Титул Из МассивТитулов Цикл
		ПредставленияТитула = МодульТНОбщегоНазначенияСервер.РезультатФункцииТитулов(
			ПараметрыЗагрузки.ИмяМетаданных, "ПредставленияТитула", Титул);
		ДанныеПодстановки = Подстановки[ПредставленияТитула.ИмяПодстановки];
		Если Не ЗначениеЗаполнено(ДанныеПодстановки) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоПервыйТитул = МодульТНОбщегоНазначенияСервер.РезультатФункцииТитулов(
			ПараметрыЗагрузки.ИмяМетаданных, "ЭтоПервыйТитул", Титул);
		ДопПараметрыЗагрузкиВложения.Вставить("ЭтоПервыйТитул", ЭтоПервыйТитул);
			
		МодульМенеджераЭПД.ВложенияЗагружены(
			ДанныеПодстановки, Титул, ОбъектДок, ДопПараметрыЗагрузкиВложения);
			
		// Подтянем комментарий из вложения подстановки
		ДанныеДокумента.Вставить("КомментарийПоследнегоТитула", 
			МодульМенеджераЭПД.ОбработкаДанныхSaby_Подстановки_Комментарий(ДанныеПодстановки));
	КонецЦикла;
	
	ОбъектДок.ДатаИзменения = ДатаСобытияПоДокументу(ПараметрыЗагрузки, ОбъектДок.ДатаИзменения);
	УстановитьДоступностьТекущихЭтапов(ОбъектДок, ПараметрыЗагрузки);
	ЗагрузитьДополнительныеДействия(ОбъектДок, ДанныеДокумента["ДопДействия"]);
	
	ДополнительныеПараметры = ДополнительныеПараметрыСохраненияДокумента(ОбъектДок, ПараметрыЗагрузки);
	ПередСохранениемДокумента(ОбъектДок, ПараметрыЗагрузки, ДополнительныеПараметры);
	ПараметрыЗагрузки.Ссылка = СохранитьДокумент(ОбъектДок, ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, ДополнительныеПараметры);
КонецПроцедуры

Функция ТекущиеЗначенияДокумента(ОбъектДок, ПараметрыЗагрузки) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Титул",     Неопределено);
	РезультатФункции.Вставить("Состояние", Неопределено);
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	Если Не ПараметрыЗагрузки.ИзДокумента Тогда
		
		СостояниеВБазе = МодульТНОбщегоНазначенияСервер.ТекущийТитулИИДДокумента(ОбъектДок);
		
		Если ЗначениеЗаполнено(СостояниеВБазе.ИД) Тогда
			РезультатФункции.Титул     = СостояниеВБазе.АктивныйЭтап;
			РезультатФункции.Состояние = СостояниеВБазе.Состояние;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыЗагрузки.ТекущийТитул) Тогда
		РезультатФункции.Титул = МодульТНОбщегоНазначенияСервер.РезультатФункцииТитулов(
			ПараметрыЗагрузки.ИмяМетаданных, "ЗначениеПоПредставлению", ПараметрыЗагрузки.ТекущийТитул);
		Если Не ЗначениеЗаполнено(РезультатФункции.Титул) Тогда
			РезультатФункции.Титул = ПараметрыЗагрузки.ТекущийТитул;
		КонецЕсли;
	Иначе
		РезультатФункции.Титул = МодульТНОбщегоНазначенияСервер.РезультатФункцииТитулов(
			ПараметрыЗагрузки.ИмяМетаданных, "ЗначениеПоПредставлению", РезультатФункции.Титул);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#Область ЗагрузкаТСИнтерфейс

Процедура ДанныеТСПрицеповСпецРазрешений(ОбъектДок, ДляДокумента, СтруктураТССОнлайна) Экспорт
	
	ЭтоВО = ТипЗнч(ОбъектДок) = Тип("Структура");
	
	ИмяТаблицыТранспортныеСредства = "ТранспортныеСредства";

	ДляДокумента.Вставить(ИмяТаблицыТранспортныеСредства, Новый Массив);
	ДляДокумента.Вставить("СпецРазрешения",       Новый Массив);
	
	Если Не ЗначениеЗаполнено(СтруктураТССОнлайна) Тогда
		Возврат;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	СтруктураТС = МодульТНОбщегоНазначенияКлиентСервер.СтруктураТранспортногоСредства();
	СтруктураТС.Вид        = ЗначениеМетаданных("ESD_ВидыТС.Автомобиль");
	СтруктураТС.КлючСтроки = МодульТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(
		ДляДокумента, ИмяТаблицыТранспортныеСредства);
		
	ЗаполнитьСтруктуруТранспортногоСредства(СтруктураТС, СтруктураТССОнлайна, ДляДокумента, ЭтоВО);
	Если ЗначениеЗаполнено(СтруктураТС.РегистрационныйНомер) Тогда
		ДляДокумента.ТранспортныеСредства.Добавить(СтруктураТС);
	КонецЕсли;
	
	Прицепы = СтруктураТССОнлайна["Прицеп"];
	Если ЗначениеЗаполнено(Прицепы) Тогда
		
		Для Каждого Прицеп Из Прицепы Цикл
			
			СтруктураТС = МодульТНОбщегоНазначенияКлиентСервер.СтруктураТранспортногоСредства();
			СтруктураТС.Вид        = ЗначениеМетаданных("ESD_ВидыТС.Прицеп");
			СтруктураТС.КлючСтроки = МодульТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(
				ДляДокумента, ИмяТаблицыТранспортныеСредства);
				
			ЗаполнитьСтруктуруТранспортногоСредства(СтруктураТС, Прицеп, ДляДокумента, ЭтоВО);
			Если ЗначениеЗаполнено(СтруктураТС.РегистрационныйНомер) Тогда
				ДляДокумента.ТранспортныеСредства.Добавить(СтруктураТС);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДляДокумента.Вставить("СпецРазрешения", ДанныеСпецРазрешений(СтруктураТССОнлайна["СпецУсловия"]));
	
	ПередачаЦенностей = ЗначениеМетаданных("ESD_ТипыДокумента.ПередачиЦенностей");
	
	Документ = СтруктураТССОнлайна["Документ"];
	Если ЗначениеЗаполнено(Документ) Тогда
		ОснованиеПередачиГруза = Документ["ПередачаГруза"];
		Если ЗначениеЗаполнено(ОснованиеПередачиГруза) Тогда
			
			ОснованиеПередачиГрузаТС = СсылкаНаДокументЭПД(
				ДляДокумента,
				ОснованиеПередачиГруза,
				ПередачаЦенностей);
				
			ДляДокумента.Вставить("ОснованиеПередачиГрузаТС", ОснованиеПередачиГрузаТС);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеТСИПрицеповДокумента(ОбъектДок, СтруктураТС) Экспорт
	
	Если СтруктураТС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОчищенныеВидыТС = Новый Соответствие;
	
	Если СтруктураТС.Свойство("ТранспортныеСредства") Тогда
		Для Каждого ТранспортноеСредство Из СтруктураТС.ТранспортныеСредства Цикл
			ОчиститьТранспортныеСредства(ОбъектДок, ТранспортноеСредство.Вид, ОчищенныеВидыТС);
			СтрокаТС = ДобавитьИЗаполнитьСтроку(ОбъектДок.ТранспортныеСредства, ТранспортноеСредство, "КлючСтроки");
			Если МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(СтрокаТС, "КлючСтроки") Тогда
				СтрокаТС.КлючСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(
					ОбъектДок, "ТранспортныеСредства");
			КонецЕсли;
			ЗаполнитьОснованияВладения(ОбъектДок, СтрокаТС, СтруктураТС);
		КонецЦикла;
	КонецЕсли;

	Если СтруктураТС.Свойство("СпецРазрешения") Тогда 
		Если ЗначениеЗаполнено(СтруктураТС.СпецРазрешения) Тогда
			ОбъектДок.СпецРазрешения.Очистить();
		КонецЕсли;
		Для Каждого СтруктураСпецРазрешения Из СтруктураТС.СпецРазрешения Цикл
			ДобавитьИЗаполнитьСтроку(ОбъектДок.СпецРазрешения, СтруктураСпецРазрешения);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОснованияВладения(ОбъектДок, СтрокаТС, СтруктураТС) Экспорт
	
	ОбщийМодульКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	// только для во
	ЭтоВО = ТипЗнч(ОбъектДок) = Тип("Структура")
		Или (ОбщийМодульКлиентСервер.ЭтоФормаПриложения(ОбъектДок) И ОбъектДок.ЭтоВО);
	Если Не ЭтоВО Тогда
		Возврат;
	КонецЕсли;
	
	НовыйКлючСтрокиЭПД = ОбщийМодульКлиентСервер.НовыйКлючОсновнойСтроки(ОбъектДок, "ДокументыЭПД");
	НовыйКлючСтрокиЮрЛица = ОбщийМодульКлиентСервер.НовыйКлючОсновнойСтроки(ОбъектДок, "ДанныеЮрЛиц");
	
	ОснованияВладения = ЗначениеИзСтрокиВнутр(СтрокаТС.ОснованияВладения);
	
	Для Каждого СтруктураДокументаЭПД Из ОснованияВладения Цикл
		СтрокаДокументаЭПД = ДобавитьИЗаполнитьСтроку(СтруктураТС.ДокументыЭПД, СтруктураДокументаЭПД);
		СтрокаДокументаЭПД.КлючСтроки = НовыйКлючСтрокиЭПД;
		СтрокаДокументаЭПД.КлючСтроки_ТранспортногоСредства = СтрокаТС.КлючСтроки;
		Для Каждого ДанныеЮрЛица Из СтруктураДокументаЭПД.ДанныеЮрЛиц Цикл
			СтрокаЮрЛица = ДобавитьИЗаполнитьСтроку(СтруктураТС.ДанныеЮрЛиц, ДанныеЮрЛица);
			СтрокаЮрЛица.КлючСтроки = НовыйКлючСтрокиЮрЛица;
			СтрокаЮрЛица.КлючСтроки_ДокументыЭПД = СтрокаДокументаЭПД.КлючСтроки;
			НовыйКлючСтрокиЮрЛица = НовыйКлючСтрокиЮрЛица + 1;
		КонецЦикла;
		НовыйКлючСтрокиЭПД = НовыйКлючСтрокиЭПД + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ЗагрузкаТСИнтерфейс

#Область ЗагрузкаВодителейИнтерфейс

Процедура ДанныеВодителей(ОбъектДок, ДляДокумента, ВодителиСОнлайна, ДопПараметры) Экспорт
	
	ИмяТаблицыВодителей = "ОтветственныеЛица";
	Если Не ДляДокумента.Свойство(ИмяТаблицыВодителей) Тогда
		Водители = Новый Массив;
		ДляДокумента.Вставить(ИмяТаблицыВодителей, Водители);
	Иначе
		Водители = ДляДокумента[ИмяТаблицыВодителей];
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВодителиСОнлайна) Тогда
		Возврат;
	КонецЕсли;
	
	УбратьПустыеСтрокиВодителей(ВодителиСОнлайна, ДопПараметры);
	УдалитьСтарыеПутевыеЛисты(ДляДокумента.ДокументыЭПД, "ПутевойЛист", ДляДокумента);
	
	ПутевойЛист = ЗначениеМетаданных("ESD_ТипыДокумента.ПутевойЛист");
	
	Для Каждого Водитель Из ВодителиСОнлайна["Водитель"] Цикл 
				
		СтруктураВодителя = СтруктураВодителя(Водитель);
		
		Если Не СтруктураВодителя.Заполнена Тогда
			Продолжить;
		КонецЕсли;
		
		Если МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ОбъектДок, ИмяТаблицыВодителей) Тогда
			СтруктураВодителя.КлючСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(
				ОбъектДок, ИмяТаблицыВодителей);
		КонецЕсли;
			
		НачальныйИндекс = ДляДокумента.ДокументыЭПД.Количество();
			
		ЗагрузитьДокументыЭПД(
			ДляДокумента,
			Водитель["ПутевойЛист"],
			ПутевойЛист);
			
		ЗаполнитьСсылкиНаДокументЭПД(ДляДокумента);
			
		ПутевыеЛисты = Новый Массив;		
		Для ИндексДокументаЭПД = НачальныйИндекс По ДляДокумента.ДокументыЭПД.ВГраница() Цикл
			
			СтруктураДокументаЭПД = ДляДокумента.ДокументыЭПД[ИндексДокументаЭПД];
			СтруктураДокументаЭПД.КлючСтроки_ОтветственныеЛица = СтруктураВодителя.КлючСтроки;
			
			СтруктураДокументаЭПД.Вставить("Документ",                СтруктураДокументаЭПД.Ссылка);
			СтруктураДокументаЭПД.Вставить("КлючСтроки_ДокументыЭПД", СтруктураДокументаЭПД.КлючСтроки); 
			
			ПутевыеЛисты.Добавить(СтруктураДокументаЭПД);
			
		КонецЦикла;
		
		СтруктураВодителя.Вставить("ПутевыеЛисты", ПутевыеЛисты);
		
		Водители.Добавить(СтруктураВодителя);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ЗагрузкаВодителейИнтерфейс

Функция ШаблонСтруктурыДанныхДляРегистра(СсылкаНаДокумент, ТипТитула, Основной) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("СсылкаНаДокумент",    СсылкаНаДокумент);
	РезультатФункции.Вставить("ТипТитула",           ТипТитула);
	РезультатФункции.Вставить("Основной",            Основной);
	РезультатФункции.Вставить("ИдентификаторТитула", "");
	РезультатФункции.Вставить("Период",              Дата(1, 1, 1));
	РезультатФункции.Вставить("Просмотрено",         Ложь);
	РезультатФункции.Вставить("ТипТитулаОтказа",     Неопределено);
	РезультатФункции.Вставить("СохранитьДанные",     Ложь);
	РезультатФункции.Вставить("Данные",              Неопределено);
	РезультатФункции.Вставить("ТипТитулаПорядок",    0);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДанныеДляРегистраТитулов(Вложение, ИмяМетаданных, СтруктураДанныхДляРегистра) Экспорт
		
	Если Вложение["ЗагруженВРегистр"] Тогда
		ДляРегистра = Неопределено;
	Иначе
		ДляРегистра = СтруктураДанныхДляРегистра;
		ДляРегистра.ИдентификаторТитула = Вложение["ИдентификаторВложенияТитула"];
		ДляРегистра.Период              = Вложение["ДатаВложенияТитула"];
		ДляРегистра.ТипТитулаПорядок    = Вложение["ТипТитулаПорядок"];
		
		Если ДляРегистра.ТипТитулаОтказа = Неопределено Тогда
			ТипТитулаОтказа = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(ИмяМетаданных, "ПустаяСсылка");
			ДляРегистра.Вставить("ТипТитулаОтказа", ТипТитулаОтказа);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДляРегистра;
	
КонецФункции

Функция СтруктураТитула(Титул, ДляДокумента, ДляРегистра) Экспорт
	
	СтруктураТитула = Новый Структура;
	СтруктураТитула.Вставить("Титул",        Титул);
	СтруктураТитула.Вставить("ДляДокумента", ДляДокумента);
	СтруктураТитула.Вставить("ДляРегистра",  ДляРегистра);
	
	Возврат СтруктураТитула;
	
КонецФункции

#Область ДокументыЭПДИнтерфейс

Процедура ЗагрузитьДокументыЭПД(ДляДокумента, ДанныеДокументовЭПД, ТипДокумента) Экспорт
	
	Если ТипЗнч(ДанныеДокументовЭПД) <> Тип("Массив") Тогда
		ДокументыЭПД = Новый Массив;
		ДокументыЭПД.Добавить(ДанныеДокументовЭПД);
	Иначе
		ДокументыЭПД = ДанныеДокументовЭПД;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Для Каждого ДокументЭПД Из ДокументыЭПД Цикл
		
		Если Не ЗначениеЗаполнено(ДокументЭПД) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДокументаЭПД = МодульТНОбщегоНазначенияКлиентСервер.СтруктураДокументаЭПД();
		СтруктураДокументаЭПД.Тип = ТипДокумента;
		СтруктураДокументаЭПД.КлючСтроки = МодульТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(
			ДляДокумента, "ДокументыЭПД");
		
		ЗаполнитьСтруктуруДокументаЭПД(ДляДокумента, СтруктураДокументаЭПД, ДокументЭПД);
		
		Если СтруктураДокументаЭПД.Заполнена Тогда
			ДляДокумента.ДокументыЭПД.Добавить(СтруктураДокументаЭПД);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСсылкиНаДокументЭПД(ДляДокумента) Экспорт
	
	Если ДляДокумента.ДокументыЭПД.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеМетаданных("ESD_ДокументыЭПД.ПустаяСсылка", "Справочник")) = Тип("Строка") Тогда
		Для Каждого СтруктураДокументаЭПД Из ДляДокумента.ДокументыЭПД Цикл
			СтруктураДокументаЭПД.Ссылка = СтруктураДокументаЭПД.Наименование;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПолучитьТаблицуДокументовЭПД(ДляДокумента.ДокументыЭПД, МенеджерВременныхТаблиц);
	
	ВыборкаСсылок = ВыборкаСсылокНаДокументыЭПД(МенеджерВременныхТаблиц);
	Пока ВыборкаСсылок.Следующий() Цикл
		СтруктураДокументаЭПД = ДляДокумента.ДокументыЭПД[ВыборкаСсылок.ИндексДокументаЭПД];
		СтруктураДокументаЭПД.Ссылка = СсылкаНаОбновленныйДокументЭПД(
			ВыборкаСсылок.СсылкаНаДокументЭПД, СтруктураДокументаЭПД, ДляДокумента.ДанныеЮрЛиц);
	КонецЦикла;
	
КонецПроцедуры

Функция СсылкаНаДокументЭПД(ДляДокумента, ДанныеДокументаЭПД, ТипДокумента) Экспорт
	
	ЗагрузитьДокументыЭПД(ДляДокумента, ДанныеДокументаЭПД, ТипДокумента);
	
	ЗаполнитьСсылкиНаДокументЭПД(ДляДокумента);
	
	Если ДляДокумента.ДокументыЭПД.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ДляДокумента.ДокументыЭПД[ДляДокумента.ДокументыЭПД.ВГраница()].Ссылка;
	
КонецФункции

Процедура ЗаполнитьДокументыЭПД(ОбъектДок, ДляДокумента, ЗаполняемыеТипы, ЭтоСопроводительныйДокумент = Ложь) Экспорт
	
	Если ДляДокумента.ДокументыЭПД.Количество() = 0
		Или Не МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ОбъектДок, "ДокументыЭПД") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТипДокумента Из ЗаполняемыеТипы Цикл	
		
		Для Каждого СтруктураДокументаЭПД Из ДляДокумента.ДокументыЭПД Цикл
			
			Если СтруктураДокументаЭПД.Тип <> ТипДокумента
				Или СтруктураДокументаЭПД.ЭтоСопроводительныйДокумент <> ЭтоСопроводительныйДокумент Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьИЗаполнитьСтроку(ОбъектДок.ДокументыЭПД, СтруктураДокументаЭПД);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ДокументыЭПДИнтерфейс

#Область ЗагрузкаДанныхЮрЛицИнтерфейс

Функция НормализованныеДанныеЮрЛица(ПодстановкиЮрЛица) Экспорт
	
	ИмяКлючаРеквизитов = "ЮЛ";
	
	Если ПодстановкиЮрЛица["СвЮЛ"] <> Неопределено Тогда
		ДанныеОрганизации = ПодстановкиЮрЛица["СвЮЛ"];
	ИначеЕсли ПодстановкиЮрЛица["СвФЛ"] <> Неопределено Тогда
		ДанныеОрганизации = ПодстановкиЮрЛица["СвФЛ"];
		ИмяКлючаРеквизитов = "ИП";
	Иначе
		ДанныеОрганизации = ПодстановкиЮрЛица;
	КонецЕсли;
	
	Адрес = Новый Соответствие;
	Если ДанныеОрганизации["АдресЮридический"] <> Неопределено Тогда
		Юридический = Новый Соответствие;
		Юридический.Вставить("Текст", ДанныеОрганизации["АдресЮридический"]);
		Адрес.Вставить("Юридический", Юридический);
		Адрес.Вставить("КодСтраны",  ДанныеОрганизации["КодСтраны"]);
	КонецЕсли;
	
	ЮрЛицоФИО = ДанныеОрганизации["ФИО"];
	Если Не ЗначениеЗаполнено(ЮрЛицоФИО) Тогда
		ЮрЛицоФИО = ДанныеОрганизации["НазваниеПолное"];
	КонецЕсли;

	РеквизитыЮрЛица = Новый Соответствие;
	РеквизитыЮрЛица.Вставить("ИНН",      ДанныеОрганизации["ИНН"]);
	РеквизитыЮрЛица.Вставить("КПП",      ДанныеОрганизации["КПП"]);
	РеквизитыЮрЛица.Вставить("Название", ДанныеОрганизации["Название"]);
	РеквизитыЮрЛица.Вставить("ОГРН",     ДанныеОрганизации["ОГРН"]);
	РеквизитыЮрЛица.Вставить("ФИО",      ЮрЛицоФИО);
	
	Реквизиты = Новый Соответствие;
	Реквизиты.Вставить(ИмяКлючаРеквизитов, РеквизитыЮрЛица);
	
	РезультатФункции = Новый Соответствие;
	РезультатФункции.Вставить("Реквизиты", Реквизиты);
	РезультатФункции.Вставить("Адрес",     Адрес);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗагрузитьДанныеЮрЛиц(ДляДокумента, ПодстановкиЮрЛиц, Роль, СтруктураЮрЛица = Неопределено) Экспорт
	
	Если ТипЗнч(ПодстановкиЮрЛиц) = Тип("Массив")
		И СтруктураЮрЛица <> Неопределено Тогда
		
		ВызватьИсключение "Некорректное использование процедуры ЗагрузитьДанныеЮрЛица.
		|СтруктураДанныхЮрЛица доступна только для одиночной загрузки";
		
	КонецЕсли;
	
	МассивПодстановокЮрЛиц = МассивПодстановокЮрЛиц(ПодстановкиЮрЛиц);
	
	Если ТипЗнч(Роль) = Тип("Строка") Тогда
		РольСсылка = ЗначениеМетаданных("ESD_РолиКонтрагентов." + Роль);
	Иначе 
		РольСсылка = Роль;
	КонецЕсли;
	
	Для Каждого ПодстановкиЮрЛица Из МассивПодстановокЮрЛиц Цикл
		
		ДанныеЮрЛица = СтруктураДанныхЮрЛица(ДляДокумента, РольСсылка, ПодстановкиЮрЛица, СтруктураЮрЛица);
		Если Не ДанныеЮрЛица.Заполнена Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеЮрЛица.КлючСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(
			ДляДокумента, "ДанныеЮрЛиц");
		
		Для Каждого СтруктураКонтактныхДанных Из ДанныеЮрЛица.КонтактныеДанные Цикл
			СтруктураКонтактныхДанных.КлючСтроки_ДанныеЮрЛиц = ДанныеЮрЛица.КлючСтроки;
			ДляДокумента.КонтактныеДанные.Добавить(СтруктураКонтактныхДанных);
		КонецЦикла;
		
		ДанныеЮрЛица.Удалить("КонтактныеДанные");
		
		ДляДокумента.ДанныеЮрЛиц.Добавить(ДанныеЮрЛица);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКонтактныеДанныеЮрЛица(СтруктураДанныхЮрЛица, КонтактыЮрЛицаОнлайн) Экспорт
	
	Если Не ЗначениеЗаполнено(КонтактыЮрЛицаОнлайн) Тогда
		Возврат;
	КонецЕсли;
	
	МассивТелефонов = КонтактыЮрЛицаОнлайн["Телефон"];
	Если ЗначениеЗаполнено(МассивТелефонов) Тогда
		Для Каждого Телефон Из МассивТелефонов Цикл
			
			ЗначениеТелефона = Телефон["Значение"];
			
			Если Не ЗначениеЗаполнено(ЗначениеТелефона) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураКонтактныхДанных = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураКонтактныхДанных();
			СтруктураКонтактныхДанных.Роль     = СтруктураДанныхЮрЛица.Роль;
			СтруктураКонтактныхДанных.Тип      = ЗначениеМетаданных(ТипыКонтактнойИнформации() + ".Телефон");
			СтруктураКонтактныхДанных.Значение = ЗначениеТелефона;
			СтруктураДанныхЮрЛица.КонтактныеДанные.Добавить(СтруктураКонтактныхДанных);
			
		КонецЦикла;	
	КонецЕсли;
	
	МассивЭлектроннойПочты = КонтактыЮрЛицаОнлайн["ЭлектроннаяПочта"];
	Если ЗначениеЗаполнено(МассивЭлектроннойПочты) Тогда
		Для Каждого ЭлПочта Из МассивЭлектроннойПочты Цикл
			
			ЗначениеЭлектроннойПочты = ЭлПочта["Значение"];
			
			Если Не ЗначениеЗаполнено(ЗначениеЭлектроннойПочты) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураКонтактныхДанных = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураКонтактныхДанных();
			СтруктураКонтактныхДанных.Роль     = СтруктураДанныхЮрЛица.Роль;
			СтруктураКонтактныхДанных.Тип      = ЗначениеМетаданных(ТипыКонтактнойИнформации() + ".АдресЭлектроннойПочты");
			СтруктураКонтактныхДанных.Значение = ЗначениеЭлектроннойПочты;
			СтруктураДанныхЮрЛица.КонтактныеДанные.Добавить(СтруктураКонтактныхДанных);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПреобразоватьСтруктуруАдреса(ДанныеАдреса) Экспорт
	СтруктураАдреса = Новый Структура("АдресСтруктурой, АдресСтрокой, GLN", Новый Структура, "", "");
	Если Не ЗначениеЗаполнено(ДанныеАдреса) Тогда
		Возврат СтруктураАдреса;
	КонецЕсли;
	
	Текст = ДанныеАдреса["Текст"];
	// иногда адрес приходит тут
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Текст = ДанныеАдреса["АдресТекст"];
	КонецЕсли;
	
	СтруктураАдреса.АдресСтрокой = Текст;
	СтруктураАдреса.АдресСтруктурой = ДанныеАдреса["Структура"];
	СтруктураАдреса.GLN = ДанныеАдреса["GLN"];	
	Если Не ЗначениеЗаполнено(СтруктураАдреса.АдресСтрокой) И ЗначениеЗаполнено(СтруктураАдреса.АдресСтруктурой) Тогда
		ШаблонАдреса = МодульКодаКлиент("ESD_ТНОбщегоНазначенияСервер").ОбщийШаблонАдреса().Структура;
		
		СписокЧастейАдреса = Новый Массив;
		Для Каждого КлючЗначение Из ШаблонАдреса Цикл
			ЗначениеЧастиАдреса_ = СтруктураАдреса.АдресСтруктурой[КлючЗначение.Ключ];
			Если Не ЗначениеЗаполнено(ЗначениеЧастиАдреса_) Тогда
				Продолжить;
			КонецЕсли;
			
			СписокЧастейАдреса.Добавить(СокрЛП(ЗначениеЧастиАдреса_));
		КонецЦикла;
		
		СтруктураАдреса.АдресСтрокой = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер")
			.СтрСоединитьЭПД(СписокЧастейАдреса, ", ");
	КонецЕсли;
	
	Возврат СтруктураАдреса;
КонецФункции

Процедура ЗаполнитьДанныеЮрЛицИКонтактнуюИнформацию(ОбъектДок, СтруктураДанных, Роль, ДопПараметры = Неопределено) Экспорт
	
	НеобходимоУдалитьСвязаннуюСЮрЛицомИнформацию = НеобходимоУдалитьСвязаннуюСЮрЛицомИнформацию(
		ОбъектДок, СтруктураДанных.ДанныеЮрЛиц, Роль, ДопПараметры);
				
	ОчиститьПриЗаполненииНаОсновании = Не ДопПараметры.ЗагрузкаСОнлайна
		И НеобходимоУдалитьСвязаннуюСЮрЛицомИнформацию
		И СтруктураДанных.ДанныеЮрЛиц.Количество() = 0;
		
	Если ОчиститьПриЗаполненииНаОсновании Тогда
		УдалитьСвязаннуюСЮрЛицомИнформацию(СтруктураДанных.ДанныеЮрЛиц, ОбъектДок.ДанныеЮрЛиц, Роль);
		УдалитьСвязаннуюСЮрЛицомИнформацию(СтруктураДанных.КонтактныеДанные, ОбъектДок.КонтактныеДанные, Роль);
	КонецЕсли;
		
	Для Каждого СтруктураДанныхЮрЛица Из СтруктураДанных.ДанныеЮрЛиц Цикл
		
		Если СтруктураДанныхЮрЛица.Роль <> Роль Тогда
			Продолжить;
		КонецЕсли;
		
		// очистить данные юр лиц по роли 
		Если НеобходимоУдалитьСвязаннуюСЮрЛицомИнформацию Тогда
			
			УдалитьСвязаннуюСЮрЛицомИнформацию(СтруктураДанных.ДанныеЮрЛиц, ОбъектДок.ДанныеЮрЛиц, Роль);			
			// сбросим флаг для исключения проблемы с удалением новой строки
			НеобходимоУдалитьСвязаннуюСЮрЛицомИнформацию = Ложь;
			
		КонецЕсли;
		
		ДобавитьИЗаполнитьСтроку(ОбъектДок.ДанныеЮрЛиц, СтруктураДанныхЮрЛица);
		
	КонецЦикла;
	
	Если Не МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ОбъектДок, "КонтактныеДанные") Тогда
		Возврат;
	КонецЕсли;
	
	НеобходимоУдалитьСвязаннуюСЮрЛицомИнформацию = НеобходимоУдалитьСвязаннуюСЮрЛицомИнформацию(
		ОбъектДок, СтруктураДанных.ДанныеЮрЛиц, Роль, ДопПараметры);
		
	Для Каждого СтруктураКонтактныхДанных Из СтруктураДанных.КонтактныеДанные Цикл
		
		Если СтруктураКонтактныхДанных.Роль <> Роль Тогда
			Продолжить;
		КонецЕсли;
		
		// очистить контаектные данные по роли
		Если НеобходимоУдалитьСвязаннуюСЮрЛицомИнформацию Тогда
			
			УдалитьСвязаннуюСЮрЛицомИнформацию(СтруктураДанных.КонтактныеДанные, ОбъектДок.КонтактныеДанные, Роль);
			// сбросим флаг для исключения проблемы с удалением новой строки
			НеобходимоУдалитьСвязаннуюСЮрЛицомИнформацию = Ложь;
			
		КонецЕсли; 
		
		ДобавитьИЗаполнитьСтроку(ОбъектДок.КонтактныеДанные, СтруктураКонтактныхДанных);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИННКППОрганизации(ДанныеОрганизацииСОнлайна) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ЕстьДанные", Ложь);
	РезультатФункции.Вставить("ИНН",        "");
	РезультатФункции.Вставить("КПП",        "");
	
	Если Не ЗначениеЗаполнено(ДанныеОрганизацииСОнлайна) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Если ДанныеОрганизацииСОнлайна["СвЮЛ"] <> Неопределено Тогда
		ДанныеОрганизации = ДанныеОрганизацииСОнлайна["СвЮЛ"];
	ИначеЕсли ДанныеОрганизацииСОнлайна["СвФЛ"] <> Неопределено Тогда
		ДанныеОрганизации = ДанныеОрганизацииСОнлайна["СвФЛ"];
	Иначе
		Возврат РезультатФункции;
	КонецЕсли;
	
	РезультатФункции.ИНН = ДанныеОрганизации["ИНН"];
	РезультатФункции.КПП = ДанныеОрганизации["КПП"];
	
	РезультатФункции.ЕстьДанные = Истина;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция СтруктураФИО(Реквизиты) Экспорт
	ДанныеФИО = Реквизиты["ФИО"];
	ТипДанныеФИО = ТипЗнч(ДанныеФИО);
	Если ДанныеФИО <> Неопределено Тогда
		Если ТипДанныеФИО = Тип("Строка") Тогда
			ДанныеФИО = МодульКода("ESD_ТНОбщегоНазначенияСервер").ФИОИзСтроки(Реквизиты["ФИО"]);
		КонецЕсли;	
	Иначе
		ДанныеФИО = Реквизиты;
	КонецЕсли;	
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Фамилия",  "");
	РезультатФункции.Вставить("Имя",      "");
	РезультатФункции.Вставить("Отчество", "");
	
	// Если передана структура, тогда выполним заполнение через метод платформы
	Если ТипДанныеФИО = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(РезультатФункции, ДанныеФИО);
		Возврат РезультатФункции;
	КонецЕсли;
	
	// В иных случаях поддерживаем только заполнение через "Соответствие"
	Для Каждого КлючЗначение Из РезультатФункции Цикл
		ЗначениеФИО = СокрЛП(Строка(ДанныеФИО[КлючЗначение.Ключ]));
		Если Не ПустаяСтрока(ЗначениеФИО) Тогда
			РезультатФункции[КлючЗначение.Ключ] = ЗначениеФИО;		
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ЗагрузкаДанныхЮрЛицИнтерфейс

Процедура ЗагрузитьОтветственного(СтруктураДляЗаполнения, ОтветственныйСОнлайна) Экспорт
	
	Если ОтветственныйСОнлайна = Неопределено Тогда
		ОтветственныйСОнлайна = Новый Соответствие;
	КонецЕсли;
	
	ФИООтветственного = СтруктураФИО(ОтветственныйСОнлайна);
	
	СтруктураДляЗаполнения.Вставить("Фамилия",   ФИООтветственного.Фамилия);
	СтруктураДляЗаполнения.Вставить("Имя",       ФИООтветственного.Имя);
	СтруктураДляЗаполнения.Вставить("Отчество",  ФИООтветственного.Отчество);
	СтруктураДляЗаполнения.Вставить("Должность", ОтветственныйСОнлайна["Должность"]);
	
	Телефоны = ОтветственныйСОнлайна["Телефон"];
	Если ЗначениеЗаполнено(Телефоны) Тогда
		
		МассивТелефонов = Новый Массив;
		Для Каждого Телефон Из Телефоны Цикл	
			МассивТелефонов.Добавить(Телефон["Значение"]);
			
			Если МассивТелефонов.Количество() >= 10 Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если МассивТелефонов.Количество() > 0 Тогда
			СтруктураДляЗаполнения.Вставить("Телефоны", ЗначениеВСтрокуВнутр(МассивТелефонов));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОтветственныхЛиц(ОбъектДок, ДанныеОтветственныхЛиц, РольОтветственного) Экспорт
	
	МодульТНКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ЭтоВодитель      = РольОтветственного = ЗначениеМетаданных("ESD_РолиОтветственных.Водитель");
	
	ОтборОтветственных = Новый Структура;
	ОтборОтветственных.Вставить("Роль", РольОтветственного);
	СтрокиДляЗагрузки = МодульТНКлиентСервер.НайтиСтрокиУниверсально(
		ДанныеОтветственныхЛиц, ОтборОтветственных);
			
	Если ЗначениеЗаполнено(ДанныеОтветственныхЛиц)
		И СтрокиДляЗагрузки.Количество() > 0 Тогда
		
		// предварительная очистка
		ОчисткаОтветственныхЛицПоРоли(ОбъектДок, РольОтветственного, ЭтоВодитель);
		
	КонецЕсли;
	
	// Новый ключ строки
	КлючСтроки = МодульТНКлиентСервер.НовыйКлючОсновнойСтроки(ОбъектДок, "ОтветственныеЛица");
	
	Для Каждого СтруктураОтветственного Из ДанныеОтветственныхЛиц Цикл 
		
		Если СтруктураОтветственного.Роль <> РольОтветственного Тогда
			Продолжить;
		КонецЕсли;
		
		// перезаполним ключи Путевых листов и ДокументовЭПД
		Если ЭтоВодитель Тогда
			УстановитьНовыеКлючиСвязиПутевыхЛистов(ОбъектДок, СтруктураОтветственного, КлючСтроки);				
		КонецЕсли;
				
		СтрокаОтветственного = ДобавитьИЗаполнитьСтроку(ОбъектДок.ОтветственныеЛица, СтруктураОтветственного, "Роль,КлючСтроки");
		СтрокаОтветственного.Роль       = РольОтветственного;		
		СтрокаОтветственного.КлючСтроки = КлючСтроки;	
		
		КлючСтроки = КлючСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ЗагрузкаГрузаИнтерфейс

Процедура ЗаполнитьДанныеПоГрузам(ОбъектДок, ДляДокумента, ДопПараметры = Неопределено) Экспорт
	
	Если Не ДляДокумента.Свойство("Грузы") Или ДляДокумента.Грузы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыПоГрузам = Новый Массив;
	ТаблицыПоГрузам.Добавить("Грузы");
	ТаблицыПоГрузам.Добавить("Контейнеры");
	ТаблицыПоГрузам.Добавить("Маркировки");
	ТаблицыПоГрузам.Добавить("ОпасныеГрузы");
	ТаблицыПоГрузам.Добавить("СведенияГосСистем");
	ТаблицыПоГрузам.Добавить("Груз_АдресаПунктов");
	//ТаблицыПоГрузам.Добавить("ВидыУпаковки");
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Для Каждого ИмяТаблицы Из ТаблицыПоГрузам Цикл
		
		Если Не МодульТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(ОбъектДок, ИмяТаблицы)
			Или Не МодульТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(ДляДокумента, ИмяТаблицы) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДляДокумента[ИмяТаблицы].Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОчиститьТаблицуГрузов(ОбъектДок, ИмяТаблицы, ДопПараметры);
		
		Для Каждого СтруктураСтрокиТаблицы Из ДляДокумента[ИмяТаблицы] Цикл
			ДобавитьИЗаполнитьСтроку(ОбъектДок[ИмяТаблицы], СтруктураСтрокиТаблицы);
			СохранитьНоменклатуруСтроки(ОбъектДок, СтруктураСтрокиТаблицы, ДопПараметры);
		КонецЦикла;
		
	КонецЦикла;
	
	Если ДопПараметры <> Неопределено Тогда
		ДобавитьНовыеОпасныеГрузы(ДляДокумента, ДопПараметры.Результат);
		//ДобавитьНовыеВидыУпаковки(ДляДокумента, ДопПараметры.Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьДанныеПоГрузам(ДляДокумента, ДанныеГруз, ЗагрузкаСОнлайна, ЭтоЭТрН) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеГруз) Тогда
		Возврат;
	КонецЕсли;
	
	ДляДокумента.Вставить("Грузы", Новый Массив);
	
	Если ЭтоЭТрН Тогда
		
		Валюта = ВалютаПоДаннымОнлайна(ДанныеГруз, ЗагрузкаСОнлайна, ДляДокумента.Валюта);
		
		ДляДокумента.Вставить("Валюта",            Валюта);
		ДляДокумента.Вставить("Контейнеры",        Новый Массив);
		ДляДокумента.Вставить("Маркировки",        Новый Массив);
		ДляДокумента.Вставить("ОпасныеГрузы",      Новый Массив);
		ДляДокумента.Вставить("СведенияГосСистем", Новый Массив);
		
	Иначе 
		
		ДляДокумента.Вставить("Груз_АдресаПунктов", Новый Массив);
		
	КонецЕсли;
	
	Позиции = ДанныеГруз["Позиция"];
	Если Не ЗначениеЗаполнено(Позиции) Тогда
		Возврат;
	КонецЕсли;
	
	КлючСтроки = 1;
	Для Каждого Груз Из Позиции Цикл 
		
		СтруктураГруза = Новый Структура;
		СтруктураГруза.Вставить("КлючСтроки",  КлючСтроки);
		СтруктураГруза.Вставить("НомерСтроки", КлючСтроки); 
		
		СтруктураГруза.Вставить("Номенклатура",   Груз["Номенклатура"]);
		
		СтруктураГруза.Вставить("СпособУпаковки", Груз["Упаковка"]);
		СтруктураГруза.Вставить("Примечание",     Груз["ДопИнформация"]);
		СтруктураГруза.Вставить("Состояние",      Груз["Состояние"]);
		СтруктураГруза.Вставить("Наименование",   Груз["Наименование"]);
		
		ЗагрузитьПараметрыГруза(СтруктураГруза, Груз["Параметры"]);
		
		СтруктураВидаУпаковки = СтруктураВидаУпаковки(Груз["ТараКод"]);
		Если СтруктураВидаУпаковки <> Неопределено Тогда			
			СтруктураГруза.Вставить("ВидТары", СтруктураВидаУпаковки.ВидУпаковки);						
		КонецЕсли;
		
		Если ЭтоЭТрН Тогда
			ЗагрузитьДанныеГруза_ТранспортнаяНакладная(Груз, СтруктураГруза, ДляДокумента, КлючСтроки, ЗагрузкаСОнлайна);
		Иначе
			// Заказ на перевозку
			ЗагрузитьДанныеГруза_ЗаказНаПеревозку(ДляДокумента, Груз, СтруктураГруза, КлючСтроки);
		КонецЕсли;
		
		ДляДокумента.Грузы.Добавить(СтруктураГруза);
		
		КлючСтроки = КлючСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ЗагрузкаГрузаИнтерфейс

Функция ДобавитьИЗаполнитьСтроку(ТаблицаДляДобавления, ИсточникДанныхДляЗаполнения, ДополнительныеПоля = "") Экспорт
	
	Если ТипЗнч(ТаблицаДляДобавления) = Тип("Массив") Тогда
		СтрокаТаблицы = ИсточникДанныхДляЗаполнения;
		ТаблицаДляДобавления.Добавить(СтрокаТаблицы);
		
		Поля = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ДополнительныеПоля, ",", Ложь);
		Для Каждого Поле Из Поля Цикл
			СтрокаТаблицы.Вставить(Поле);
		КонецЦикла;
		
	Иначе
		СтрокаТаблицы = ТаблицаДляДобавления.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ИсточникДанныхДляЗаполнения);
	КонецЕсли;
	
	Возврат СтрокаТаблицы;
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область include_etrn_base_CommonModule_ТНЗагрузкаСервер_СлужебныеПроцедурыИФункцииПереопределяемые
#КонецОбласти // include_etrn_base_CommonModule_ТНЗагрузкаСервер_СлужебныеПроцедурыИФункцииПереопределяемые

Процедура ПередСохранениемДокумента(ОбъектДок, ПараметрыЗагрузки, ДополнительныеПараметры)
	ESDОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

	КодСостоянияЗавершеноСПроблемами = ESDОбщегоНазначенияКлиентСервер.КодСостоянияДО_ЗавершеноСПроблемами();
	КодСостоянияОжидаетПодписания = ESDОбщегоНазначенияКлиентСервер.КодСостоянияДО_ОжидаетПодписания();
	
	Если ДополнительныеПараметры.Состояние.ИдентификаторСБИС = КодСостоянияЗавершеноСПроблемами Тогда
		КомментарийУведомление_ = ESDОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ПараметрыЗагрузки.ДанныеДокумента, "КомментарийПоследнегоТитула", "");
		Если ПустаяСтрока(КомментарийУведомление_) Тогда
			КомментарийУведомление_ = ESDОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
				ПараметрыЗагрузки.ДанныеДокумента, "Состояние.Примечание", "");
		КонецЕсли;
		ОбъектДок.КомментарийУведомление = КомментарийУведомление_;
	ИначеЕсли ДополнительныеПараметры.Состояние.ИдентификаторСБИС = КодСостоянияОжидаетПодписания Тогда
		ОбъектДок.КомментарийУведомление = "Ожидает подписания";
	Иначе
		ОбъектДок.КомментарийУведомление = "";	
	КонецЕсли;
КонецПроцедуры

Функция ДополнительныеПараметрыСохраненияДокумента(ОбъектДок, ПараметрыЗагрузки)
	// Сформируем структуру значений перед сохранением документа
	Результат = Новый Структура;

	// Добавим текущий активный этап
	ТекущийАктивныйЭтап = ТекущийЭтапДокумента(ОбъектДок, ПараметрыЗагрузки);
	Результат.Вставить("АктивныйЭтап", ТекущийАктивныйЭтап);

	ESDОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	КодСостояния = ESDОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ПараметрыЗагрузки.ДанныеДокумента, "Состояние.Код");
	КодСостояния = ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(КодСостояния);
	
	Состояние = МодульКода("Справочники.ESD_СостоянияОбъектов").ПолучитьСтатусДокументаСБИС(КодСостояния);
	Результат.Вставить("Состояние", Состояние);

	// Вернем подготовленную структуру
	Возврат Результат;
КонецФункции

Процедура SabyПослеЗагрузкиДанныхДокумента(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, Результат)
	Если Результат.Ошибки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.ДанныеДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		// Статистика. Прямая запись
		Если Не ПараметрыЗагрузки.ЗагрузкаНаКлиенте
			И ПараметрыЗагрузки.ТолькоАктивныйЭтап
			И Не ПараметрыЗагрузки.ЭтоЗагрузкаЧерновика Тогда
			
			ЗаписатьСтатистикуНапрямую(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки);
				
		КонецЕсли;	
		
		ЗаписатьДанныеДокумента(ПараметрыЗагрузки, Результат, ОбщиеПараметрыЗагрузки);
		
		Результат.Успешные.Добавить(ПараметрыЗагрузки);
		Результат.Итог.Количество = Результат.Итог.Количество + 1;		
	Исключение
		ИнфоОшибки = ИнформацияОбОшибке();
		ТекстОшибки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПричинаОшибкиИзЯдра(ИнфоОшибки.Описание);
		
		Ошибки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОшибок(ПараметрыЗагрузки.ИмяМетаданных);
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ДобавитьОшибкуПользователю(Ошибки, Неопределено, ТекстОшибки);
		КлючСоответствия = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").КлючСсылка(
			ПараметрыЗагрузки.Ссылка, ПараметрыЗагрузки.ИдСбис);
		
		Результат.Ошибки.Вставить(КлючСоответствия, Ошибки);
	КонецПопытки;	
КонецПроцедуры

Функция ОбъектЗагружаемогоДокумента(ПараметрыЗагрузки)
	
	Если ПараметрыЗагрузки.Свойство("Объект") Тогда
		Возврат ПараметрыЗагрузки.Объект;
	КонецЕсли;
	
	ЭтоВО = ТипЗнч(ПараметрыЗагрузки.Ссылка) = Тип("Структура");
	МодульОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	// поищем существующий документ по ИдСбис
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.Ссылка) Тогда
		ПараметрыЗагрузки.Ссылка = МодульОбщегоНазначенияСервер.ДокументПоИдентификаторуСбис(ПараметрыЗагрузки.ИдСбис);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.Ссылка) Тогда
		Попытка
			ПараметрыЗагрузки.Ссылка = МодульКода("Документы." + ПараметрыЗагрузки.ИмяМетаданных).ЧерновикПоГис_УИД(ПараметрыЗагрузки);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	РезультатФункции = ДополнимОбъектЗагружаемогоДокумента(ПараметрыЗагрузки, ЭтоВО);
	
	Возврат РезультатФункции;
	
КонецФункции 

Функция ДополнимОбъектЗагружаемогоДокумента(ПараметрыЗагрузки, ЭтоВО)
	Если ЗначениеЗаполнено(ПараметрыЗагрузки.Ссылка) И Не ЭтоВО Тогда
		РезультатФункции = ПараметрыЗагрузки.Ссылка.ПолучитьОбъект();
		РезультатФункции.Прочитать();
		Возврат РезультатФункции;
	КонецЕсли;
	
	Если Не ЭтоВО Тогда
		РезультатФункции = Документы[ПараметрыЗагрузки.ИмяМетаданных].СоздатьДокумент();
	Иначе
		РезультатФункции = ПараметрыЗагрузки.Ссылка;
	КонецЕсли;
	
	Если Не ПараметрыЗагрузки.ЭтоЗаполнениеСПомощьюINI Тогда
		
		РезультатФункции.НомерСбис = ПараметрыЗагрузки.ДанныеДокумента["Номер"];		
		РезультатФункции.Дата      = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(
			ПараметрыЗагрузки.ДанныеДокумента["ДатаВремяСоздания"]);
			
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

Процедура УстановитьДокументОснование(ОбъектДок, ПараметрыЗагрузки)
	
	Если Не ПараметрыЗагрузки.ЭтоЗаполнениеСПомощьюINI
		Или Не ЗначениеЗаполнено(ПараметрыЗагрузки.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектДок.ДокументОснование_ОбъектМетаданных = МодульКода("ESD_ТНОбщегоНазначенияСервер").ИмяМетаданныхДокумента(
		ПараметрыЗагрузки.ДокументОснование);
	
	Если ЗначениеЗаполнено(ОбъектДок.ДокументОснование_ОбъектМетаданных) Тогда 
		ОбъектДок.ДокументОснование_Идентификатор = ПараметрыЗагрузки.ДокументОснование.УникальныйИдентификатор();
	Иначе
		ОбъектДок.ДокументОснование_Идентификатор = "";
	КонецЕсли;
	
КонецПроцедуры

Функция НаправлениеДокумента(НаправлениеСОнлайна, Знач ЗначениеПоУмолчанию = Неопределено)
	
	Если ЗначениеПоУмолчанию = Неопределено Тогда
		ЗначениеПоУмолчанию = ЗначениеМетаданных("ESD_Направление.Исходящий");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НаправлениеСОнлайна) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат МодульКода("Перечисления.ESD_Направление").НаправлениеПоИмени(НаправлениеСОнлайна);
	
КонецФункции

Функция ДопПараметрыЗагрузкиВложения(ПараметрыЗагрузки = Неопределено, Результат = Неопределено)
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Результат",                 Результат);
	РезультатФункции.Вставить("ЗагрузкаСОнлайна",          Истина);
	РезультатФункции.Вставить("Просмотрено",               Ложь);
	РезультатФункции.Вставить("ТолькоАктивныйЭтап",        Ложь);
	РезультатФункции.Вставить("ИмяМетаданных",             "");
	РезультатФункции.Вставить("ЭтоПервоеОснование",        Истина);
	РезультатФункции.Вставить("НоменклатураГруза",         Новый Соответствие);
	РезультатФункции.Вставить("КлючСтроки",                Новый Структура);
	РезультатФункции.Вставить("СопроводительныеДокументы", Новый Массив);
	РезультатФункции.Вставить("Стороны",                   Неопределено);
	РезультатФункции.Вставить("ЭтоЧерновик",               Ложь);
	
	Если ЗначениеЗаполнено(ПараметрыЗагрузки) Тогда 
		ЭПЛ = ПараметрыЗагрузки.ИмяМетаданных = ПутевойЛист();
	Иначе 
		ЭПЛ = Ложь;
	КонецЕсли;
	
	// обработка доп узлов для ЭПЛ
	Если ЭПЛ Тогда
		РезультатФункции.Вставить("ЗаменаВодителя", Неопределено);
	КонецЕсли;
	
	Если ПараметрыЗагрузки <> Неопределено Тогда  
		МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
		
		РезультатФункции.Вставить("Событие",              ПараметрыЗагрузки.ДанныеДокумента["Событие"]);
		РезультатФункции.Вставить("СторонняяОрганизация", ПараметрыЗагрузки.ДанныеДокумента["Контрагент"]);
		РезультатФункции.Вставить("НашаОрганизация",      ПараметрыЗагрузки.ДанныеДокумента["НашаОрганизация"]);
		
		РезультатФункции.Просмотрено = ПараметрыЗагрузки.ТекущийТитул <> Неопределено;
		
		Если ПараметрыЗагрузки.ЭтоЗаполнениеСПомощьюINI Тогда 
			РезультатФункции.ЗагрузкаСОнлайна          = Ложь;
			РезультатФункции.ЭтоПервоеОснование        = ПараметрыЗагрузки.ЭтоПервоеОснование;
			РезультатФункции.НоменклатураГруза         = ПараметрыЗагрузки.НоменклатураГруза;
			РезультатФункции.КлючСтроки                = ПараметрыЗагрузки.КлючСтроки;
			РезультатФункции.СопроводительныеДокументы = ПараметрыЗагрузки.СопроводительныеДокументы;
		Иначе
			РезультатФункции.КлючСтроки = МодульТНОбщегоНазначенияКлиентСервер.СтруктураКлючСтроки();
		КонецЕсли;
		
		РезультатФункции.ТолькоАктивныйЭтап = ПараметрыЗагрузки.Свойство("ТолькоАктивныйЭтап")
			И ПараметрыЗагрузки.ТолькоАктивныйЭтап;
		
		РезультатФункции.ИмяМетаданных = ПараметрыЗагрузки.ИмяМетаданных;
		
		РезультатФункции.Вставить("ПараметрыОснования", ПараметрыЗагрузки.ПараметрыОснования);
		РезультатФункции.Вставить("Стороны",            ПараметрыЗагрузки.ДанныеДокумента["Стороны"]);
		РезультатФункции.Вставить("КодПеревозки",       ПараметрыЗагрузки.ДанныеДокумента["КодПеревозки"]);
		
		Если ЭПЛ Тогда
			РезультатФункции.Вставить("ЗаменаВодителя", ПараметрыЗагрузки.ДанныеДокумента["ЗаменаВодителя"]);
		КонецЕсли;
		
		КодСостояния_ = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ПараметрыЗагрузки.ДанныеДокумента,
			"Состояние.Код");
		РезультатФункции.ЭтоЧерновик = (КодСостояния_ = "0" Или Не ЗначениеЗаполнено(КодСостояния_)); 
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗагрузитьДополнительныеДействия(ОбъектДок, ДопДействия)
	
	Если Не МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ОбъектДок, "ДоступныеДействия") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектДок.Ссылка) Тогда
		ОбъектДок.ДоступныеДействия.Очистить();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДопДействия) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Действие Из ДопДействия Цикл 
		
		СтруктураДоступныхДействий = Новый Структура();
		СтруктураДоступныхДействий.Вставить("Действие", ЗначениеДопДействия(Действие["Название"]));
		Если ЗначениеЗаполнено(СтруктураДоступныхДействий.Действие) Тогда 
			ДобавитьИЗаполнитьСтроку(ОбъектДок.ДоступныеДействия, СтруктураДоступныхДействий);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

Функция ЗначениеДопДействия(Действие)
	
	Если Действие = "Уведомление о переадресовке" Тогда
		Значение = ЗначениеМетаданных("ESD_ДоступныеДействия.УведомлениеОПереадресовке");
	ИначеЕсли Действие = "Изменить стоимость" Тогда
		Значение = ЗначениеМетаданных("ESD_ДоступныеДействия.ИзменитьСтоимость");
	ИначеЕсли Действие = "Согласовать стоимость" Тогда
		Значение = ЗначениеМетаданных("ESD_ДоступныеДействия.СогласоватьСтоимость");
	ИначеЕсли Действие = "Замена водителей/ТС" Тогда
		Значение = ЗначениеМетаданных("ESD_ДоступныеДействия.ЗаменаВодителяТС");
	ИначеЕсли Действие = "Переадресовка" Тогда
		Значение = ЗначениеМетаданных("ESD_ДоступныеДействия.Переадресовка");
	Иначе
		// не нашли соотвествия
		Значение = Неопределено;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ДатаСобытияПоДокументу(Параметры, Знач ДатаПоУмолчанию = Неопределено)
	
	Если ДатаПоУмолчанию = Неопределено Тогда
		ДатаПоУмолчанию = Дата(1, 1, 1);
	КонецЕсли;
	
	Если Параметры.ИзДокумента Тогда
		Возврат ДатаПоУмолчанию;
	КонецЕсли;
	
	События = Параметры.ДанныеДокумента["Событие"];
	Если Не ЗначениеЗаполнено(События) Тогда
		Возврат ДатаПоУмолчанию;
	КонецЕсли;
	
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(События[0]["ДатаВремя"]);
	
КонецФункции

Функция ТекущийЭтапДокумента(ОбъектДок, ПараметрыЗагрузки)
	РезультатФункции = "";
	
	ТекущиеЭтапы = ПараметрыЗагрузки.ДанныеДокумента["ТекущиеЭтапы"];
	Если Не ЗначениеЗаполнено(ТекущиеЭтапы) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатФункции = ЭтапДляПодписания(ОбъектДок, ПараметрыЗагрузки);
	Если РезультатФункции <> Неопределено Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ДатаЭтапа = ДобавитьМесяц(ТекущаяДатаСеанса(), 12);
	Для Каждого ТекущийЭтап Из ТекущиеЭтапы Цикл
		ДатаСобытия = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(ТекущийЭтап["ДатаСобытия"]);
		Если ДатаСобытия < ДатаЭтапа Тогда
			РезультатФункции = ТекущийЭтап["Наименование"];
			ДатаЭтапа = ДатаСобытия;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатФункции;
КонецФункции

Функция ЭтапДляПодписания(ОбъектДок, ПараметрыЗагрузки)
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ОтборЭтапов = Новый Структура("Доступен", Истина);
	ОтборЭтапов.Вставить("ТипТитула", ЗначениеМетаданных("ESD_ТипТитулаЭтрН.Переадресовка"));
	ДоступныеЭтапы = МодульТНОбщегоНазначенияКлиентСервер.НайтиСтрокиУниверсально(
		ОбъектДок.ТекущиеЭтапы, ОтборЭтапов);
	Если ДоступныеЭтапы.Количество() > 0 Тогда
		Возврат ДоступныеЭтапы[0].Наименование;
	КонецЕсли;
	
	ОтборЭтапов = Новый Структура("Доступен", Истина);
	ДоступныеЭтапы = МодульТНОбщегоНазначенияКлиентСервер.НайтиСтрокиУниверсально(
		ОбъектДок.ТекущиеЭтапы, ОтборЭтапов);
	Если ДоступныеЭтапы.Количество() > 0 Тогда
		Возврат ДоступныеЭтапы[0].Наименование;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Процедура ЗагрузитьТекущиеЭтапыДокумента(ОбъектДок, ПараметрыЗагрузки)
	ОбъектДок.ТекущиеЭтапы.Очистить();
	
	ТекущиеЭтапы = ПараметрыЗагрузки.ДанныеДокумента["ТекущиеЭтапы"];
	Если Не ЗначениеЗаполнено(ТекущиеЭтапы) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущийЭтап Из ТекущиеЭтапы Цикл
		НаименованиеЭтапа = ТекущийЭтап["Наименование"];
		Идентификатор     = ТекущийЭтап["Идентификатор"];
		
		ТипТитула = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
			ПараметрыЗагрузки.ИмяМетаданных, "ЗначениеПоЭтапу", НаименованиеЭтапа);
			
		Если ТипЗнч(ОбъектДок.ТекущиеЭтапы) = Тип("Массив") Тогда
			СтрокаТекущегоЭтапа = Новый Структура("Наименование,ТипТитула,Доступен");
			ОбъектДок.ТекущиеЭтапы.Добавить(СтрокаТекущегоЭтапа);
		Иначе
			СтрокаТекущегоЭтапа = ОбъектДок.ТекущиеЭтапы.Добавить();
		КонецЕсли;
		
		СтрокаТекущегоЭтапа.Наименование  = НаименованиеЭтапа;
		СтрокаТекущегоЭтапа.ТипТитула     = ТипТитула;
		
		Если ЭтоУниверсальноеРасширение() Тогда
			СтрокаТекущегоЭтапа.Идентификатор = Идентификатор;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьДоступностьТекущихЭтапов(ОбъектДок, ПараметрыЗагрузки)
	Если Не ЗначениеЗаполнено(ОбъектДок.ТекущиеЭтапы) Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеЭтапы = МодульКода("Документы." + ПараметрыЗагрузки.ИмяМетаданных).ДоступныеОрганизацииЭтапы(
		ОбъектДок, ПараметрыЗагрузки);
	ДоступныеЭтапыПоУзлуЭтап = ДоступныеЭтапыПоУзлуЭтап(ПараметрыЗагрузки);
	
	Для Каждого СтрокаТекущегоЭтапа Из ОбъектДок.ТекущиеЭтапы Цикл 
		Доступен = ДоступныеЭтапы[СтрокаТекущегоЭтапа.Наименование] <> Неопределено
			Или ДоступныеЭтапыПоУзлуЭтап[СтрокаТекущегоЭтапа.Наименование] <> Неопределено;
		Если СтрокаТекущегоЭтапа.Наименование = "Выпуск в рейс" Тогда
			Доступен = Доступен И ОбъектДок.ТекущиеЭтапы.Количество() = 1;
		КонецЕсли;
		
		СтрокаТекущегоЭтапа.Доступен = Доступен;
	КонецЦикла;	
КонецПроцедуры

Функция ДоступныеЭтапыПоУзлуЭтап(ПараметрыЗагрузки)
	
	РезультатФункции = Новый Соответствие;
	Этапы = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		ПараметрыЗагрузки.ДанныеДокумента, "Этап", Новый Массив);
		
	Для Каждого Этап Из Этапы Цикл
		НаименованиеЭтапа = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(Этап, "Название");
		Если НаименованиеЭтапа <> Неопределено Тогда
			РезультатФункции.Вставить(НаименованиеЭтапа, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

#Область ЗагрузкаИзменений

Процедура SabyСписокИзменений_ОбработатьПолученныеДанные(Данные, Параметры)
	Перем ИгнорироватьДанныеБезПодстановки;
	
	Если Параметры.Свойство("ИгнорироватьДанныеБезПодстановки", ИгнорироватьДанныеБезПодстановки)
		И ИгнорироватьДанныеБезПодстановки = Истина
	Тогда
		Возврат;
	КонецЕсли;
	
	// Подчищаем загруженные данные без "подстановок"
	// BSLLS:DeletingCollectionItem-off
	Для Каждого КлючЗначение Из Данные Цикл
		ДанныеДокумента = КлючЗначение.Значение;
		Если Не ЗначениеЗаполнено(ДанныеДокумента["Подстановки"]) Тогда
			Данные.Удалить(КлючЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	// BSLLS:DeletingCollectionItem-on
КонецПроцедуры

Функция SabyСписокИзменений_Параметры(СтруктураПараметров)
	Перем ДатаНачала, ДатаОкончания, ИдентификаторДокумента;
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ОбъектОбработки", ОбъектОбработки());
	РезультатФункции.Вставить("context_params",  СтруктураПараметров.context_params);
	РезультатФункции.Вставить("Параметры",       Новый Структура);
	
	РазмерСтраницы = 30;
	Навигация = Новый Структура("РазмерСтраницы", Формат(РазмерСтраницы, "ЧГ=0"));
	РезультатФункции.Параметры.Вставить("Навигация", Навигация);
	
	Если СтруктураПараметров.ДопПараметры.Свойство("Начало", ДатаНачала)
		И ЗначениеЗаполнено(ДатаНачала) 
	Тогда	
		ПараметрДатаС = Формат(ДатаНачала, "ДФ='dd.MM.yyyy ЧЧ.мм.сс'");
		РезультатФункции.Параметры.Вставить("ДатаВремяС", ПараметрДатаС);
	КонецЕсли;
	
	Если СтруктураПараметров.ДопПараметры.Свойство("Окончание", ДатаОкончания)
		И ЗначениеЗаполнено(ДатаОкончания) 
	Тогда
		ПараметрДатаПо = Формат(ДатаОкончания, "ДФ='dd.MM.yyyy ЧЧ.мм.сс'");
		РезультатФункции.Параметры.Вставить("ДатаВремяПо", ПараметрДатаПо);
	КонецЕсли;
	
	ПараметрыДокументаДляАПИ = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыДокументаДляАПИ(
		СтруктураПараметров.ДопПараметры.ИмяМетаданных);
		
	// Загрузка событий по отдельному документу
	Если СтруктураПараметров.ДопПараметры.Свойство("ИдентификаторДокумента", ИдентификаторДокумента)
		И ЗначениеЗаполнено(ИдентификаторДокумента) 
	Тогда
		РезультатФункции.Параметры.Вставить("ИдентификаторДокумента", ИдентификаторДокумента);
		ДопПоля = "СписокПоДокументу";
	Иначе
		// по ЭПЛ дополним поля
		ДопПоля = "ДопДействия,ТекущиеЭтапы,Подстановки,Стороны,ИдентификаторУчастника";
		Если ПараметрыДокументаДляАПИ.Тип = "Waybill" Тогда
			ДопПоля = ДопПоля + ",ЗаменаВодителя,ГИС_УИД";
		ИначеЕсли ПараметрыДокументаДляАПИ.Тип = "TransportOrder" Тогда
			ДопПоля = ДопПоля + ",ГИС_УИД";
		КонецЕсли;		
	КонецЕсли;
	
	РезультатФункции.Параметры.Вставить("Тип",                ПараметрыДокументаДляАПИ.Тип);
	РезультатФункции.Параметры.Вставить("ДопПоля",            ДопПоля);
	РезультатФункции.Параметры.Вставить("ПолныйСертификатЭП", "Нет");
	РезультатФункции.Параметры.Вставить("ИдентификаторСобытия", "");
	
	Возврат РезультатФункции;
КонецФункции

Функция SabyСписокИзменений_Загрузить(ПараметрыПолученияИзменений)
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ИзмененияПоДокументам", Новый Массив);
	РезультатФункции.Вставить("ЕстьИзменения",         Истина);
	
	Попытка
		СоответствиеИзменений = ПараметрыПолученияИзменений.ОбъектОбработки.local_helper_read_changes(
			ПараметрыПолученияИзменений.context_params, ПараметрыПолученияИзменений.Параметры);
		
		Подключаемый_ЗагрузкаИзSaby_ПослеВыполненияОбмена("СБИС.СписокИзменений", 
			ПараметрыПолученияИзменений.Параметры,
			СоответствиеИзменений,
			ПараметрыПолученияИзменений.context_params
		);

		РезультатФункции.ИзмененияПоДокументам = СоответствиеИзменений["Документ"];
		РезультатФункции.ЕстьИзменения         = Булево(СоответствиеИзменений["Навигация"]["ЕстьЕще"]);
	Исключение
		РезультатФункции.ЕстьИзменения = Ложь;
		ИнфОбОшибке = ИнформацияОбОшибке();
		
		МодульESD_ТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
		МодульESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации(Неопределено, 
			МодульESD_ТНОбщегоНазначенияСервер.ИмяСобытияЖурналаРегистрации_ЗагрузкаИзSaby(), 
			ИнфОбОшибке);	
	КонецПопытки;
	
	Возврат РезультатФункции;
КонецФункции

Процедура SabyСписокИзменений_ОбработатьДанные(Изменения, ДанныеSaby, ПараметрыПолученияИзменений, ДопПараметры)
	Параметры = SabyПараметрыОбработкиДокумента();
	ЗаполнитьЗначенияСвойств(Параметры, ДопПараметры);
	
	ИдентификаторSaby = ДанныеSaby["Идентификатор"];
	// Изменения с онлайна приходят не сгруппированные по документу.
	// Поэтому группируем их по идентификатору документа
	ОбъектДокументаSaby = Изменения.Получить(ИдентификаторSaby);
	Если ОбъектДокументаSaby = Неопределено Тогда
		ОбъектДокументаSaby = SabyСписокИзменений_ОбъектДокумента(ДанныеSaby);
		Изменения.Вставить(ИдентификаторSaby, ОбъектДокументаSaby);
	КонецЕсли;
	
	SabyОбработатьДанныеДокумента(ОбъектДокументаSaby, ДанныеSaby, Параметры);
	
	СобытияДокументаSaby = ДанныеSaby["Событие"];
	// На основе обработанных событий заполняем сопутствующие данные
	Если ЗначениеЗаполнено(СобытияДокументаSaby) Тогда
		ПоследнееСобытие = СобытияДокументаSaby[СобытияДокументаSaby.ВГраница()];
		ПараметрыПолученияИзменений.Параметры.Вставить("ИдентификаторСобытия", ПоследнееСобытие["Идентификатор"]);
		ПараметрыПолученияИзменений.Параметры.Вставить("ДатаВремяС", ПоследнееСобытие["ДатаВремя"]);	
		
		Комментарий = ПоследнееСобытие["Комментарий"];
		Если ЗначениеЗаполнено(Комментарий) Тогда
			ESDОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
			КодСостояния = ESDОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеSaby, "Состояние.Код");
			КодСостояния = ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(КодСостояния);
			КодСостоянияЗавершеноСПроблемами = 9;
			Если КодСостояния = КодСостоянияЗавершеноСПроблемами Тогда
				ОбъектДокументаSaby["Состояние"].Вставить("Примечание", Комментарий);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция SabyСписокИзменений_ОбъектДокумента(ДанныеSaby)
	Результат = Новый Соответствие;
	Результат.Вставить("Подстановки",                 Новый Соответствие);
	Результат.Вставить("ИдТитулов",                   Новый Соответствие);
	Результат.Вставить("Вложения",                    Новый Соответствие);
	Результат.Вставить("Событие",                     Новый Массив);
	Результат.Вставить("ГИС_УИД",                     ДанныеSaby["ГИС_УИД"]);
	Результат.Вставить("ДатаВремяСоздания",           ДанныеSaby["ДатаВремяСоздания"]);
	Результат.Вставить("Номер",                       ДанныеSaby["Номер"]);
	Результат.Вставить("Название",                    ДанныеSaby["Название"]);
	Результат.Вставить("Направление",                 ДанныеSaby["Направление"]);
	Результат.Вставить("Состояние",                   ДанныеSaby["Состояние"]);
	Результат.Вставить("Регламент",                   ДанныеSaby["Регламент"]);
	Результат.Вставить("ТекущиеЭтапы",                ДанныеSaby["ТекущиеЭтапы"]);
	Результат.Вставить("ДопДействия",                 ДанныеSaby["ДопДействия"]);
	Результат.Вставить("Контрагент",                  ДанныеSaby["Контрагент"]);
	Результат.Вставить("НашаОрганизация",             ДанныеSaby["НашаОрганизация"]);
	Результат.Вставить("СсылкаНаPDF",                 ДанныеSaby["СсылкаНаPDF"]);
	Результат.Вставить("СсылкаНаАрхив",               ДанныеSaby["СсылкаНаАрхив"]);
	Результат.Вставить("Стороны",                     ДанныеSaby["Стороны"]);
	Результат.Вставить("ЗаменаВодителя",              ДанныеSaby["ЗаменаВодителя"]);
	Результат.Вставить("КодПеревозки",                ДанныеSaby["КодПеревозки"]);
	Результат.Вставить("КомментарийПоследнегоТитула", "");
	
	Возврат Результат;
КонецФункции

Процедура ОбработатьИзмененияДокументов(СписокИзменений, Результат, СтруктураПараметров)
	
	ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
		СтруктураПараметров.context_params);
	
	Для Каждого Изменение Из СписокИзменений Цикл
		
		СтруктураСостояния = МодульКода("ESD_ТНОбщегоНазначенияСервер").СостояниеПоИдентификаторуСбис(Изменение.Ключ);
		
		ПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыЗагрузки();
		ПараметрыЗагрузки.ИДСбис                 = Изменение.Ключ;
		ПараметрыЗагрузки.ДанныеДокумента        = Изменение.Значение;
		ПараметрыЗагрузки.ИмяМетаданных          = СтруктураПараметров.ДопПараметры.ИмяМетаданных;
		ПараметрыЗагрузки.ТипИсточника           = СтруктураСостояния.ТипИсточника;
		ПараметрыЗагрузки.ИдентификаторИсточника = СтруктураСостояния.ИдентификаторИсточника;
		ПараметрыЗагрузки.ИзРасширения           = СтруктураПараметров.ДопПараметры.ИзРасширения;
        
		SabyПослеЗагрузкиДанныхДокумента(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, Результат);
		
	КонецЦикла;
	
	МодульКода("Справочники.ESD_ОпасныеГрузы").ДозаполнитьНовыеОпасныеГрузы(Результат, ОбщиеПараметрыЗагрузки);
	МодульКода("Справочники.ESD_ВидыУпаковки").ДозаполнитьНовыеВидыУпаковки(Результат, ОбщиеПараметрыЗагрузки);
	
КонецПроцедуры

#КонецОбласти // ЗагрузкаИзменений

#Область ЗагрузкаТС

Процедура ЗаполнитьСтруктуруТранспортногоСредства(СтруктураТС, СтруктураТССОнлайна, ДляДокумента, ЭтоВО)
	
	ESDОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
		
	Грузоподъемность = ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(СтруктураТССОнлайна["Грузоподъемность"]);
	Вместимость      = ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(СтруктураТССОнлайна["Вместимость"]);
	ТипВладения      = МодульКода("Перечисления.ESD_ТипыВладенияТС").ТипыВладенияТСПоКоду(СтруктураТССОнлайна["ТипВладения"]);
	
	СтруктураТС.РегистрационныйНомер = РегНомерБезЛишнихСимволов(СтруктураТССОнлайна["РегНомер"]);
	СтруктураТС.ИнвентарныйНомер     = ЗначениеЕслиЗаполнено(СтруктураТССОнлайна["ИнвентарныйНомер"], "");
	СтруктураТС.Тип                  = СтруктураТССОнлайна["Тип"];
	СтруктураТС.Марка                = СтруктураТССОнлайна["Марка"];
	СтруктураТС.Модель               = ЗначениеЕслиЗаполнено(СтруктураТССОнлайна["Модель"], "");
	СтруктураТС.ВИН                  = СтруктураТССОнлайна["VIN"];
	СтруктураТС.НомерСТС             = СтруктураТССОнлайна["НомерСТС"];
	СтруктураТС.Грузоподъемность     = Грузоподъемность;
	СтруктураТС.Вместимость          = Вместимость;
	СтруктураТС.ТипВладения          = ТипВладения;
	
	СтруктураДляЗагрузкиОснованийВладения = Новый Структура;
	СтруктураДляЗагрузкиОснованийВладения.Вставить("ДокументыЭПД", Новый Массив);
	СтруктураДляЗагрузкиОснованийВладения.Вставить("ДанныеЮрЛиц",  Новый Массив);
	
	ЗагрузитьДокументыЭПД(
		СтруктураДляЗагрузкиОснованийВладения,
		СтруктураТССОнлайна["ОснованиеВладения"],
		ЗначениеМетаданных("ESD_ТипыДокумента.ПодтверждениеВладения"));
		
	ЗаполнитьСсылкиНаДокументЭПД(СтруктураДляЗагрузкиОснованийВладения);
	
	МассивОснованийВладения = Новый Массив;
	
	Для Каждого СтруктураДокументаЭПД Из СтруктураДляЗагрузкиОснованийВладения.ДокументыЭПД Цикл
		СтруктураДокументаЭПД.КлючСтроки_ТранспортногоСредства = СтруктураТС.КлючСтроки;
		МассивОснованийВладения.Добавить(СтруктураДокументаЭПД);
		Для Каждого ДанныеЮрЛица Из СтруктураДляЗагрузкиОснованийВладения.ДанныеЮрЛиц Цикл
			Если СтруктураДокументаЭПД.КлючСтроки = ДанныеЮрЛица.КлючСтроки_ДокументыЭПД Тогда
				СтруктураДокументаЭПД.ДанныеЮрЛиц.Добавить(ДанныеЮрЛица);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЭтоВО Тогда
		СтруктураТС.ОснованияВладения = ЗначениеВСтрокуВнутр(МассивОснованийВладения);
	Иначе
		Если МассивОснованийВладения.Количество() > 0 Тогда
			СтруктураТС.ОснованияВладения = ЗначениеВСтрокуВнутр(МассивОснованийВладения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеЕслиЗаполнено(Значение, ЗначениеПоУмолчанию)
	
	Если Значение = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ДанныеСпецРазрешений(СпецУсловияСОнлайна)
	
	РезультатФункции = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СпецУсловияСОнлайна) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Для Каждого Условие Из СпецУсловияСОнлайна Цикл   
	
		СпецРазрешение = Условие["СпецРазрешение"];	
		Если ЗначениеЗаполнено(СпецРазрешение) Тогда
			
			СтруктураСпецРазрешения = Новый Структура;
			СтруктураСпецРазрешения.Вставить("Номер", СпецРазрешение["Номер"]);
			СтруктураСпецРазрешения.Вставить("Вид",   СпецРазрешение["Вид"]);
			СтруктураСпецРазрешения.Вставить("Срок",  СпецРазрешение["Срок"]);
			СтруктураСпецРазрешения.Вставить("ИД",    СпецРазрешение["Идентификатор"]);
			СтруктураСпецРазрешения.Вставить(
				"Дата",
				МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(СпецРазрешение["Дата"]));
				
			НаименованиеОрганаВласти = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(Условие, "ОИВ.Наименование");
			Если ЗначениеЗаполнено(НаименованиеОрганаВласти) Тогда 
				СтруктураСпецРазрешения.Вставить("НаименованиеОрганаВласти", НаименованиеОрганаВласти); 
			КонецЕсли;
			
			РезультатФункции.Добавить(СтруктураСпецРазрешения);
			
		КонецЕсли;
		
		// - Маршрут не обрабатывается
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ОчиститьТранспортныеСредства(ОбъектДок, Вид, ОчищенныеВидыТС)
	
	Если ОчищенныеВидыТС.Получить(Вид) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчищенныеВидыТС.Вставить(Вид, Истина);
	
	Если ОбъектДок.ТранспортныеСредства.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИндексСтрокиТС = 0;
	Пока ИндексСтрокиТС < ОбъектДок.ТранспортныеСредства.Количество() Цикл
		
		СтрокаТС = ОбъектДок.ТранспортныеСредства[ИндексСтрокиТС];
		
		Если СтрокаТС.Вид = Вид Тогда
			
			// Для ВО делаем очистку данных документов

			Если ТипЗнч(ОбъектДок) = Тип("Структура") Тогда				
				УдалитьДокументыЭПДПоКлючу(ОбъектДок, "КлючСтроки_ТранспортногоСредства", СтрокаТС.КлючСтроки);
			КонецЕсли;

			ОбъектДок.ТранспортныеСредства.Удалить(ИндексСтрокиТС);
			
		Иначе
			ИндексСтрокиТС = ИндексСтрокиТС + 1;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РегНомерБезЛишнихСимволов(РегНомер)
	
	РезультатФункции = СтрЗаменить(РегНомер, " ", "");
	РезультатФункции = СокрЛП(РезультатФункции);
	РезультатФункции = ВРег(РезультатФункции);
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // ЗагрузкаТС

#Область ЗагрузкаВодителей

Функция СтруктураВодителя(Водитель)
	
	СтруктураВодителя = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОтветственногоЛица();
	СтруктураВодителя.Роль = ЗначениеМетаданных("ESD_РолиОтветственных.Водитель");
	
	МодульСервер       = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	МодульКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	СтруктураВодителя.Фамилия        = МодульКлиентСервер.ЗначениеИзКоллекции(Водитель, "Фамилия",        "");
	СтруктураВодителя.Имя            = МодульКлиентСервер.ЗначениеИзКоллекции(Водитель, "Имя",            "");
	СтруктураВодителя.Отчество       = МодульКлиентСервер.ЗначениеИзКоллекции(Водитель, "Отчество",       "");
	СтруктураВодителя.ИНН            = МодульКлиентСервер.ЗначениеИзКоллекции(Водитель, "ИНН",            "");
	СтруктураВодителя.СНИЛС          = МодульКлиентСервер.ЗначениеИзКоллекции(Водитель, "СНИЛС",          "");
	СтруктураВодителя.ТабельныйНомер = МодульКлиентСервер.ЗначениеИзКоллекции(Водитель, "ТабельныйНомер", "");
	
	СтруктураВодителя.Серия = МодульКлиентСервер.ЗначениеИзКоллекции(Водитель, "ВУ.Серия", "");
	СтруктураВодителя.Номер = МодульКлиентСервер.ЗначениеИзКоллекции(Водитель, "ВУ.Номер", "");
	
	СтруктураВодителя.ДатаВыдачи = МодульКлиентСервер.ЗначениеИзКоллекции(Водитель, "ВУ.ДатаВыдачи", "");
	СтруктураВодителя.ДатаВыдачи = МодульСервер.ПреобразоватьСтрокуВДатуЭПД(СтруктураВодителя.ДатаВыдачи);
	
	Если ЗначениеЗаполнено(Водитель["ФИО"]) Тогда
		
		Наименование = Водитель["ФИО"]; 
		ЗаполнитьФИО = ЗначениеЗаполнено(Наименование) 
			И Не ЗначениеЗаполнено(СтруктураВодителя.Фамилия);
		
		Если ЗаполнитьФИО Тогда
			ФИО = МодульСервер.ФИОИзСтроки(Наименование);
			ЗаполнитьЗначенияСвойств(СтруктураВодителя, ФИО);
		КонецЕсли;
		
	Иначе
		
		Массив = Новый Массив;
		Массив.Добавить(СтруктураВодителя.Фамилия);
		Массив.Добавить(СтруктураВодителя.Имя);
		Массив.Добавить(СтруктураВодителя.Отчество);
		
		Наименование = СокрЛП(МодульКлиентСервер.СтрСоединитьЭПД(Массив, " "));
		
	КонецЕсли;
	
	СтруктураВодителя.Вставить("Наименование", Наименование);
	
	Телефоны = МодульКлиентСервер.ЗначениеИзКоллекции(Водитель, "Телефон", Новый Массив);
	Если ЗначениеЗаполнено(Телефоны) Тогда
		
		МассивТелефонов = Новый Массив;
		Для Каждого Телефон Из Телефоны Цикл  
			МассивТелефонов.Добавить(Телефон["Значение"]);
		КонецЦикла;
		
		СтруктураВодителя.Телефоны = ЗначениеВСтрокуВнутр(МассивТелефонов);
		
	КонецЕсли;
	
	СтруктураВодителя.Заполнена = ЗначениеЗаполнено(СтруктураВодителя.Фамилия)
		Или ЗначениеЗаполнено(СтруктураВодителя.Имя)
		Или ЗначениеЗаполнено(СтруктураВодителя.Отчество);
		
	Возврат СтруктураВодителя;
	
КонецФункции

Процедура УбратьПустыеСтрокиВодителей(Водители, ДопПараметры)
	
	// Только для заполнения на основании другого документа
	Если ДопПараметры.ЗагрузкаСОнлайна Тогда
		Возврат;
	КонецЕсли;
	
	МассивВодители = Водители["Водитель"];
	
	Индекс = 0;
	Пока Индекс <= МассивВодители.ВГраница() Цикл
		Водитель = МассивВодители[Индекс];
		Если Водитель["Фамилия"] = "" И Водитель["Имя"] = "" И Водитель["Отчество"] = "" Тогда
			МассивВодители.Удалить(Индекс);
		Иначе
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ЗагрузкаВодителей

#Область ДокументыЭПД

Процедура ЗаполнитьСтруктуруДокументаЭПД(ДляДокумента, СтруктураДокументаЭПД, ДокументЭПД)
	
	ЕстьНаименованиеНомерДата = ЗначениеЗаполнено(ДокументЭПД["Наименование"])
		Или ЗначениеЗаполнено(ДокументЭПД["Дата"])
		Или ЗначениеЗаполнено(ДокументЭПД["Номер"]);
	
	Если Не ЕстьНаименованиеНомерДата Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДокументаЭПД.Заполнена = Истина;
	
	ДатаДокумента = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(ДокументЭПД["Дата"]);
	
	СтруктураДокументаЭПД.Наименование = СокрЛП(ДокументЭПД["Наименование"]);
	СтруктураДокументаЭПД.Номер        = СокрЛП(ДокументЭПД["Номер"]);
	СтруктураДокументаЭПД.Дата         = ДатаДокумента;
	
	// периодически бывает и так... заглушка от пустых документов
	Если Не ЗначениеЗаполнено(СтруктураДокументаЭПД.Номер) Тогда
		СтруктураДокументаЭПД.Номер = СтруктураДокументаЭПД.Наименование;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтруктураДокументаЭПД.Наименование) Тогда
		СтруктураДокументаЭПД.Наименование = "№%1 от %2";
		СтруктураДокументаЭПД.Наименование = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
			СтруктураДокументаЭПД.Наименование,
			СтруктураДокументаЭПД.Номер,
			Формат(СтруктураДокументаЭПД.Дата, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	Стороны = ДокументЭПД["Стороны"];
	Если Не ЗначениеЗаполнено(Стороны) Тогда
		Возврат;
	КонецЕсли;
	
	РольСторонаДокумента = ЗначениеМетаданных("ESD_РолиКонтрагентов.СторонаДокумента");
	Для Каждого Сторона Из Стороны Цикл
		
		СтруктураДанныхЮрЛица = СтруктураДанныхЮрЛица(ДляДокумента, РольСторонаДокумента, Сторона);
		Если Не ЗначениеЗаполнено(СтруктураДанныхЮрЛица.НаименованиеОрганизации) Тогда
			СтруктураДанныхЮрЛица.НаименованиеОрганизации = Строка(СтруктураДанныхЮрЛица.ЮрФизЛицо) + " " + СтруктураДанныхЮрЛица.ИНН;
			СтруктураДанныхЮрЛица.НаименованиеОрганизации = СокрЛП(СтруктураДанныхЮрЛица.НаименованиеОрганизации);
		КонецЕсли;
		
		СтруктураДанныхЮрЛица.КлючСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(
			ДляДокумента, "ДанныеЮрЛиц");
		
		СтруктураДанныхЮрЛица.КлючСтроки_ДокументыЭПД = СтруктураДокументаЭПД.КлючСтроки;
		
		ДляДокумента.ДанныеЮрЛиц.Добавить(СтруктураДанныхЮрЛица);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьТаблицуДокументовЭПД(ДокументыЭПД, МенеджерВременныхТаблиц)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ТипИндексаДокументаЭПД = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Любой));
	ТипДаты                = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ТипНомерНаименование   = МодульТНОбщегоНазначенияКлиентСервер.ОписаниеТипаСтрока(255);
	
	Если ТипЗнч(ЗначениеМетаданных("ESD_ТипыДокумента.ПустаяСсылка")) = Тип("Строка") Тогда
		ТипТипаДокумента = МодульТНОбщегоНазначенияКлиентСервер.ОписаниеТипаСтрока(50);
	Иначе
		ТипСсылка = "ПеречислениеСсылка." + ТипыДокумента();
		ТипТипаДокумента = Новый ОписаниеТипов(ТипСсылка);
	КонецЕсли;
	
	ТаблицаДокументовЭПД = Новый ТаблицаЗначений;
	ТаблицаДокументовЭПД.Колонки.Добавить("Тип",                ТипТипаДокумента);
	ТаблицаДокументовЭПД.Колонки.Добавить("Номер",              ТипНомерНаименование);
	ТаблицаДокументовЭПД.Колонки.Добавить("Дата",               ТипДаты);
	ТаблицаДокументовЭПД.Колонки.Добавить("Наименование",       ТипНомерНаименование);
	ТаблицаДокументовЭПД.Колонки.Добавить("ИндексДокументаЭПД", ТипИндексаДокументаЭПД);
	
	Для ИндексДокументаЭПД = 0 По ДокументыЭПД.ВГраница() Цикл
		СтруктураДокументаЭПД = ДокументыЭПД[ИндексДокументаЭПД];
		Если ЗначениеЗаполнено(СтруктураДокументаЭПД.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДокументаЭПД = ТаблицаДокументовЭПД.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокументаЭПД, СтруктураДокументаЭПД);
		СтрокаДокументаЭПД.ИндексДокументаЭПД = ИндексДокументаЭПД;
	КонецЦикла;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Тип КАК Тип,
	|	ТаблицаДокументов.ИндексДокументаЭПД КАК ИндексДокументаЭПД,
	|	ТаблицаДокументов.Наименование КАК Наименование
	|ПОМЕСТИТЬ ТаблицаДокументовЭПД
	|ИЗ
	|	&ТаблицаДокументов КАК ТаблицаДокументов";
	
	ЗапросДанных.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументовЭПД);
	
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

Функция ВыборкаСсылокНаДокументыЭПД(МенеджерВременныхТаблиц)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокументовЭПД.ИндексДокументаЭПД КАК ИндексДокументаЭПД,
	|	МАКСИМУМ(ЕСТЬNULL(ESD_ДокументыЭПД.Ссылка, ЗНАЧЕНИЕ(Справочник.ESD_ДокументыЭПД.ПустаяСсылка))) КАК СсылкаНаДокументЭПД,
	|	МАКСИМУМ(НЕ ESD_ДокументыЭПД.Ссылка ЕСТЬ NULL) КАК ДокументНайденВБазе
	|ИЗ
	|	ТаблицаДокументовЭПД КАК ТаблицаДокументовЭПД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ESD_ДокументыЭПД КАК ESD_ДокументыЭПД
	|		ПО ТаблицаДокументовЭПД.Номер = ESD_ДокументыЭПД.Номер
	|			И ТаблицаДокументовЭПД.Дата = ESD_ДокументыЭПД.Дата
	|			И ТаблицаДокументовЭПД.Тип = ESD_ДокументыЭПД.Тип
	|			И ТаблицаДокументовЭПД.Наименование = ESD_ДокументыЭПД.Наименование
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументовЭПД.ИндексДокументаЭПД";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ДокументыЭПД", ДокументыЭПД());
	
	Возврат ЗапросДанных.Выполнить().Выбрать();
	
КонецФункции

Функция СсылкаНаОбновленныйДокументЭПД(СсылкаНаДокументЭПД, СтруктураДокументаЭПД, ДанныеЮрЛиц)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(СсылкаНаДокументЭПД) Тогда
		ОбъектДокументаЭПД = СсылкаНаДокументЭПД.ПолучитьОбъект();
		ОбъектДокументаЭПД.ДанныеЮрЛиц.Очистить();
	Иначе
		ОбъектДокументаЭПД = МодульКода("Справочники.ESD_ДокументыЭПД").СоздатьЭлемент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбъектДокументаЭПД, СтруктураДокументаЭПД);
	
	ОтборСторон = Новый Структура("КлючСтроки_ДокументыЭПД", СтруктураДокументаЭПД.КлючСтроки);
	Стороны = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(ДанныеЮрЛиц, ОтборСторон);
	Для Каждого Сторона Из Стороны Цикл
		СтрокаДанныхЮрЛица = ОбъектДокументаЭПД.ДанныеЮрЛиц.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанныхЮрЛица, Сторона);
	КонецЦикла;
	
	ОбъектДокументаЭПД.Записать();
	
	Возврат ОбъектДокументаЭПД.Ссылка;
	
КонецФункции

Процедура УдалитьСтарыеПутевыеЛисты(ДокументыЭПД, ТипДокумента, ДляДокумента)
	
	Если ТипДокумента <> ЗначениеМетаданных("ESD_ТипыДокумента.ПутевойЛист") Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПутевыхЛистов = Новый Структура("Тип", ТипДокумента);
	НайденныеСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(
		ДляДокумента.ДокументыЭПД, ОтборПутевыхЛистов);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Индекс = 0;
	Пока Индекс <= ДокументыЭПД.Количество() - 1 Цикл
		Если ДокументыЭПД[Индекс].Тип = ТипДокумента Тогда
			ДокументыЭПД.Удалить(Индекс);
		Иначе
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДокументыЭПДПоКлючу(ОбъектДок, ИмяКлюча, ЗначениеКлюча)
	
	Индекс = 0;
	Пока Индекс < ОбъектДок.ДокументыЭПД.Количество() Цикл
		СтрокаДокументаЭПД = ОбъектДок.ДокументыЭПД[Индекс];
		Если СтрокаДокументаЭПД[ИмяКлюча] = ЗначениеКлюча Тогда
			УдалитьЮрЛицПоКлючуДокументаЭПД(ОбъектДок, СтрокаДокументаЭПД.КлючСтроки);
			ОбъектДок.ДокументыЭПД.Удалить(Индекс);
		Иначе
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьЮрЛицПоКлючуДокументаЭПД(ОбъектДок, КлючСтрокиЭПД)
	
	Индекс = 0;
	Пока Индекс < ОбъектДок.ДанныеЮрЛиц.Количество() Цикл
		СтрокаСтороныДокумента = ОбъектДок.ДанныеЮрЛиц[Индекс];
		Если СтрокаСтороныДокумента.КлючСтроки_ДокументыЭПД = КлючСтрокиЭПД Тогда
			ОбъектДок.ДанныеЮрЛиц.Удалить(Индекс);
		Иначе
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ДокументыЭПД

#Область ЗагрузкаДанныхЮрЛиц

Функция МассивПодстановокЮрЛиц(ПодстановкиЮрЛиц)
	
	РезультатФункции = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ПодстановкиЮрЛиц) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Если ТипЗнч(ПодстановкиЮрЛиц) = Тип("Массив") Тогда
		РезультатФункции = ПодстановкиЮрЛиц;
	Иначе
		РезультатФункции.Добавить(ПодстановкиЮрЛиц);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция СтруктураДанныхЮрЛица(ДляДокумента, Роль, ДанныеЮрЛицаОнлайн, СтруктураДанныхЮрЛица = Неопределено)
	
	Если СтруктураДанныхЮрЛица = Неопределено Тогда
		РезультатФункции = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ШаблонДанныхЮрЛица();
	Иначе
		РезультатФункции = СтруктураДанныхЮрЛица;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЮрЛицаОнлайн) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ЗаполнитьРеквизитыЮрЛица(Роль, РезультатФункции, ДанныеЮрЛицаОнлайн);
	
	ЗаполнитьКонтактныеДанныеЮрЛица(РезультатФункции, ДанныеЮрЛицаОнлайн["Контакты"]);
	
	ЗаполнитьОснованиеУполномоченногоЛица(ДляДокумента, РезультатФункции, ДанныеЮрЛицаОнлайн);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗаполнитьРеквизитыЮрЛица(Роль, СтруктураДанныхЮрЛица, ДанныеЮрЛицаОнлайн)
	
	Реквизиты = ДанныеЮрЛицаОнлайн["Реквизиты"];
	Если Реквизиты = Неопределено Тогда
		Реквизиты = ДанныеЮрЛицаОнлайн;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Заполнена = Ложь;
	Если ЗначениеЗаполнено(Реквизиты["ЮЛ"]) Тогда
		ЗаполнитьРеквизитыЮЛ(СтруктураДанныхЮрЛица, Реквизиты);
	ИначеЕсли ЗначениеЗаполнено(Реквизиты["ИП"]) Тогда
		ЗаполнитьРеквизитыИП(СтруктураДанныхЮрЛица, Реквизиты);
	ИначеЕсли ЗначениеЗаполнено(Реквизиты["ФЛ"]) Тогда
		ЗаполнитьРеквизитыФЛ(СтруктураДанныхЮрЛица, Реквизиты);
	ИначеЕсли ЗначениеЗаполнено(Реквизиты["ИностранноеЛицо"]) Тогда
		ЗаполнитьРеквизитыИностранногоЛица(СтруктураДанныхЮрЛица, Реквизиты);
		Заполнена = ЗначениеЗаполнено(СтруктураДанныхЮрЛица.НаименованиеОрганизации);
	ИначеЕсли ЗначениеЗаполнено(Реквизиты["ИНН"]) Тогда
		СтруктураДанныхЮрЛица.ИНН        = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Реквизиты, "ИНН", "");
		СтруктураДанныхЮрЛица.КодФилиала = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Реквизиты, "КодФилиала", "");
	Иначе
		// Неизвестный узел данных, ничего не заполняем.
		СтруктураДанныхЮрЛица.ИНН = "";
	КонецЕсли;
	
	СтруктураДанныхЮрЛица.ИдентификаторЭДО = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		ДанныеЮрЛицаОнлайн, "ИдентификаторЭДО", "");
	
	СтруктураДанныхЮрЛица.Заполнена = Заполнена Или ЗначениеЗаполнено(СтруктураДанныхЮрЛица.ИНН);
	
	// для разницы с во3... надо оставлять только роль строкой 
	// и делать дополнение только перед передачей обратно в форму
	ВсеРоли = МодульКода("ESD_ТНОбщегоНазначенияСервер").ВсеЗначенияПеречисления(РолиКонтрагентов(), Истина);
	Если СтруктураДанныхЮрЛица.Заполнена Тогда
		
		СтруктураДанныхЮрЛица.Роль = Роль;
		СтруктураДанныхЮрЛица.Вставить("РольСтрокой", ВсеРоли[Роль]);
		
	КонецЕсли;
	
	ЗаполнитьРеквизитыАдресаЮрЛица(СтруктураДанныхЮрЛица, ДанныеЮрЛицаОнлайн);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыЮЛ(СтруктураДанныхЮрЛица, Реквизиты)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	СтруктураДанныхЮрЛица.ЮрФизЛицо        = ЗначениеМетаданных("ESD_ЮрФизЛицо.ЮрЛицо");
	СтруктураДанныхЮрЛица.ЮрФизЛицоСтрокой = "ЮрЛицо";
	
	СтруктураДанныхЮрЛица.ИНН = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Реквизиты, "ЮЛ.ИНН", "");
	СтруктураДанныхЮрЛица.КПП = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Реквизиты, "ЮЛ.КПП", "");
	
	СтруктураДанныхЮрЛица.КодФилиала   = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Реквизиты, "ЮЛ.КодФилиала", "");
	
	НаименованиеОрганизации = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Реквизиты, "ЮЛ.Название");
	Если Не ЗначениеЗаполнено(НаименованиеОрганизации) Тогда
		НаименованиеОрганизации = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Реквизиты, "ЮЛ.Наименование");
	КонецЕсли;
	
	Если ТипЗнч(НаименованиеОрганизации) = Тип("Соответствие") Тогда
		НаименованиеОрганизации = НаименованиеОрганизации["Полное"];
	КонецЕсли;
	
	СтруктураДанныхЮрЛица.НаименованиеОрганизации = НаименованиеОрганизации;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыФЛ(СтруктураДанныхЮрЛица, Реквизиты)
	
	СтруктураДанныхЮрЛица.ЮрФизЛицо        = ЗначениеМетаданных("ESD_ЮрФизЛицо.ФизЛицо");
	СтруктураДанныхЮрЛица.ЮрФизЛицоСтрокой = "ФизЛицо";
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	СтруктураДанныхЮрЛица.ИНН        = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Реквизиты, "ФЛ.ИНН", "");
	СтруктураДанныхЮрЛица.КодФилиала = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Реквизиты, "ФЛ.КодФилиала", "");
	
	СтруктураФИО = СтруктураФИО(Реквизиты["ФЛ"]);
	ФИОСтрокой = ЗначениеВСтрокуВнутр(СтруктураФИО);
	
	СтруктураДанныхЮрЛица.НаименованиеОрганизации = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПредставлениеФИО(
		СтруктураФИО);
	
	СтруктураДанныхЮрЛица.СтруктураФИО = ФИОСтрокой;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыИП(СтруктураДанныхЮрЛица, Реквизиты)
	
	СтруктураДанныхЮрЛица.ЮрФизЛицо        = ЗначениеМетаданных("ESD_ЮрФизЛицо.ИндивидуальныйПредприниматель");
	СтруктураДанныхЮрЛица.ЮрФизЛицоСтрокой = "ИндивидуальныйПредприниматель";
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	СтруктураДанныхЮрЛица.ИНН        = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Реквизиты, "ИП.ИНН", "");
	СтруктураДанныхЮрЛица.ОГРН       = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Реквизиты, "ИП.ОГРН", "");
	СтруктураДанныхЮрЛица.КодФилиала = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Реквизиты, "ИП.КодФилиала", "");
	
	СтруктураФИО = СтруктураФИО(Реквизиты["ИП"]);
	ФИОСтрокой   = ЗначениеВСтрокуВнутр(СтруктураФИО);
	
	СтруктураДанныхЮрЛица.НаименованиеОрганизации = "ИП " + МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПредставлениеФИО(
		СтруктураФИО);
	
	СтруктураДанныхЮрЛица.СтруктураФИО = ФИОСтрокой;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыИностранногоЛица(СтруктураДанныхЮрЛица, Реквизиты)
	
	СтруктураДанныхЮрЛица.ЮрФизЛицо        = ЗначениеМетаданных("ESD_ЮрФизЛицо.ЮрЛицоНеРезидент");
	СтруктураДанныхЮрЛица.ЮрФизЛицоСтрокой = "ЮрЛицоНеРезидент";
	
	СтруктураДанныхЮрЛица.НаименованиеОрганизации = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		Реквизиты, "ИностранноеЛицо.Наименование", "");
	
	Страна = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(Реквизиты, "ИностранноеЛицо.Страна");
	Если ЗначениеЗаполнено(Страна) Тогда 
		СтруктураДанныхЮрЛица.СтранаРегистрации = СокрЛП(Страна);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыАдресаЮрЛица(СтруктураДанныхЮрЛица, ДанныеЮрЛицаОнлайн)
	
	ЮрАдрес = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(ДанныеЮрЛицаОнлайн, "Адрес.Юридический");
	Если Не ЗначениеЗаполнено(ЮрАдрес) Тогда
		ЮрАдрес = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(ДанныеЮрЛицаОнлайн, "Адрес");
    КонецЕсли;
		
	СтруктураАдрес = ПреобразоватьСтруктуруАдреса(ЮрАдрес);
	Если ЗначениеЗаполнено(СтруктураАдрес) Тогда
		СтруктураДанныхЮрЛица.Адрес          = СтруктураАдрес.АдресСтрокой;
		СтруктураДанныхЮрЛица.АдресСтруктура = СтруктураАдрес.АдресСтруктурой;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОснованиеУполномоченногоЛица(ДляДокумента, СтруктураДанныхЮрЛица, ДанныеЮрЛицаОнлайн)
	
	Основание = ДанныеЮрЛицаОнлайн["Документ"];
	Если Не ЗначениеЗаполнено(Основание) Или Не ЗначениеЗаполнено(Основание["Дата"]) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхЮрЛица.Основание = СсылкаНаДокументЭПД(
		ДляДокумента, Основание, ЗначениеМетаданных("ESD_ТипыДокумента.УполномоченныйНаОсновании"));
	
	СтруктураДанныхЮрЛица.Полномочия = ДанныеЮрЛицаОнлайн["Полномочия"];
	
КонецПроцедуры

Процедура УдалитьСвязаннуюСЮрЛицомИнформацию(ДанныеСОнлайна, ДанныеДокумента, Роль)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Роль", Роль);
	
	СтрокиДляУдаления = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(ДанныеДокумента, Отбор);
	УдалитьСтрокиТаблицыИзМассива(ДанныеДокумента, СтрокиДляУдаления);
		
КонецПроцедуры

Функция НеобходимоУдалитьСвязаннуюСЮрЛицомИнформацию(ОбъектДок, ДанныеЮрЛиц, Роль, ДопПараметры)
	
	Если ДопПараметры.ЗагрузкаСОнлайна Тогда
		
		РезультатФункции = Роль <> ЗначениеМетаданных("ESD_РолиКонтрагентов.СторонаДокумента")
			Или ДопПараметры.ЭтоПервыйТитул;
			
	Иначе
		
		Если Роль <> ЗначениеМетаданных("ESD_РолиКонтрагентов.СторонаДокумента") 
			И Не ДопПараметры.ЭтоПервоеОснование Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("Роль", Роль);
			
			Строки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(ДанныеЮрЛиц, Отбор);
			Если Строки.Количество() Тогда 
				// в случае заполнения повторно данных
				// по одной роли требуется предварительная очистка
				Возврат Истина;
			КонецЕсли;	
			
		КонецЕсли;
		
		РезультатФункции = ДопПараметры.ЭтоПервоеОснование;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // ЗагрузкаДанныхЮрЛиц

#Область Валюта

Функция ВалютаПоДаннымОнлайна(ДанныеГруз, ЗагрузкаСОнлайна, Знач ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	КодВалютыРубль = "643";
	
	Если ЗначениеПоУмолчанию = Неопределено Тогда
		ЗначениеПоУмолчанию = ВалютаПоКоду(КодВалютыРубль);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеГруз["Стоимость"]) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
			
	Валюта = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(ДанныеГруз, "Стоимость.Валюта");
	Если ЗначениеЗаполнено(Валюта) Тогда
		
		КодВалюты = Валюта["Код"];
		
		Если ЗагрузкаСОнлайна 
			Или Не ЗагрузкаСОнлайна 
			И ЗначениеЗаполнено(КодВалюты) Тогда
			
			Возврат ВалютаПоКоду(КодВалюты);
			
		КонецЕсли;
	КонецЕсли;
	
    Возврат ЗначениеПоУмолчанию;
	
КонецФункции

Функция ВалютаПоКоду(Код)
	
	Если Метаданные.Справочники.Найти("Валюты") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатФункции = ЗначениеМетаданных("Валюты.ПустаяСсылка", "Справочник");
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	Валюта.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюта
	|ГДЕ
	|	Валюта.Код = &Код";
	
	ЗапросДанных.УстановитьПараметр("Код", Код);
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	Если ВыборкаДанных.Следующий() Тогда
		РезультатФункции = ВыборкаДанных.Ссылка;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаСправочников

Функция СтруктураВидаУпаковки(Код)
	
	Если Не ЗначениеЗаполнено(Код) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураВидаУпаковки = МодульКода("Справочники.ESD_ВидыУпаковки").ШаблонСтруктурыВидаУпаковки();
	СтруктураВидаУпаковки.Код          = Код;
	СтруктураВидаУпаковки.Наименование = Код;
	
	МодульКода("Справочники.ESD_ВидыУпаковки").ЗаполнитьВидУпаковки(СтруктураВидаУпаковки);
	
	Возврат СтруктураВидаУпаковки;
	
КонецФункции

Процедура ДобавитьНовыеВидыУпаковки(ДляДокумента, Результат)
	
	Если Результат = Неопределено
		Или Не МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ДляДокумента, "ВидыУпаковки") Тогда
		Возврат;
	КонецЕсли;
	
	МассивВидовУпаковки = ДляДокумента["ВидыУпаковки"];
	
	Если Не ЗначениеЗаполнено(МассивВидовУпаковки) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтруктураВидаУпаковки Из МассивВидовУпаковки Цикл
		Если СтруктураВидаУпаковки.Новый Тогда
			Результат.НовыеВидыУпаковки.Добавить(СтруктураВидаУпаковки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СтруктураОпасногоГруза(СтрокаОпасн)
	
	Если Не ЗначениеЗаполнено(СтрокаОпасн) 
		Или Не ЗначениеЗаполнено(СтрокаОпасн["Наименование"]) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураОпасногоГруза = МодульКода("Справочники.ESD_ОпасныеГрузы").ШаблонСтруктурыОпасногоГруза();
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	// Наименование
	СтруктураОпасногоГруза.Наименование = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "Наименование.Отгрузочное", "");
		
	СтруктураОпасногоГруза.ПолноеНаименование = СтруктураОпасногоГруза.Наименование;
	
	СтруктураОпасногоГруза.ТехническоеНаименование = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "Наименование.Техническое", "");
		
	СтруктураОпасногоГруза.Класс = МодульКода("Перечисления.ESD_КлассыОпасностиГрузов").КлассОпасностиГрузаПоКоду(
		СтрокаОпасн["Класс"]);
		
	// Упаковка	
	СтруктураОпасногоГруза.ГруппаУпаковки = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "Упаковка.Группа", "");
		
	СтруктураОпасногоГруза.КатегорияУпаковки = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "Упаковка.Категория", "");
	СтруктураОпасногоГруза.ГруппаУпаковкиЗначение = МодульКода("Перечисления.ESD_ГруппыУпаковки").ГруппаУпаковкиПоКоду(
		СтруктураОпасногоГруза.ГруппаУпаковки);
		
	// Температура	
	СтруктураОпасногоГруза.КонтрольнаяТемпература = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "Температура.Контрольная", "");
		
	СтруктураОпасногоГруза.АварийнаяТемпература = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "Температура.Аварийная", "");
		
	// Радиоактивный	
	СтруктураОпасногоГруза.НазваниеРадионуклида = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "Радиоактивный.Радионуклид", "");
		
	СтруктураОпасногоГруза.ПолнаяАктивность = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "Радиоактивный.ПолнаяАктивность", "");
		
	СтруктураОпасногоГруза.МаксАктивность = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "Радиоактивный.МаксАктивность", "");
		
	// Взрывчатый
	СтруктураОпасногоГруза.МассаНеттоВзрывчатый = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "Взрывчатый.МассаНетто", "");
		
	СтруктураОпасногоГруза.МассаНеттоВзрывчатыйВсего = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "Взрывчатый.МассаНеттоДляВсех", "");
	
	ЗаполнитьОбщиеПараметрыОпасногоГруза(СтруктураОпасногоГруза, СтрокаОпасн);
	
	МодульКода("Справочники.ESD_ОпасныеГрузы").ЗаполнитьОпасныйГруз(СтруктураОпасногоГруза);
	
	Возврат СтруктураОпасногоГруза;
	
КонецФункции

Функция СтруктураОпасногоГруза_ЗаказНаПеревозку(СтрокаОпасн) Экспорт
	
	СтруктураОпасногоГруза = МодульКода("Справочники.ESD_ОпасныеГрузы").ШаблонСтруктурыОпасногоГруза();
	
	Если Не ЗначениеЗаполнено(СтрокаОпасн)
		Или Не ЗначениеЗаполнено(СтрокаОпасн["НаименованиеОтгрузочное"]) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	// Наименование
	СтруктураОпасногоГруза.Наименование = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "НаименованиеОтгрузочное", "");
		
	СтруктураОпасногоГруза.ПолноеНаименование = СтруктураОпасногоГруза.Наименование;
	
	СтруктураОпасногоГруза.ТехническоеНаименование = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "НаименованиеТехническое", "");
	
	СтруктураОпасногоГруза.Класс = МодульКода("Перечисления.ESD_КлассыОпасностиГрузов").КлассОпасностиГрузаПоКоду(
		СтрокаОпасн["Класс"]);

	// Упаковка	
	СтруктураОпасногоГруза.ГруппаУпаковки = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "УпаковкаГруппа", "");
		
	СтруктураОпасногоГруза.КатегорияУпаковки = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "УпаковкаКатегория", "");
	СтруктураОпасногоГруза.ГруппаУпаковкиЗначение = МодульКода("Перечисления.ESD_ГруппыУпаковки").ГруппаУпаковкиПоКоду(
		СтруктураОпасногоГруза.ГруппаУпаковки);
		
	// Температура	
	СтруктураОпасногоГруза.КонтрольнаяТемпература = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "ТемператураКонтрольная", "");
		
	СтруктураОпасногоГруза.АварийнаяТемпература = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "ТемператураАварийная", "");
		
	// Радиоактивный	
	СтруктураОпасногоГруза.НазваниеРадионуклида = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "РадиоактивныйРадионуклид", "");
		
	СтруктураОпасногоГруза.ПолнаяАктивность = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "РадиоактивныйПолнаяАктивность", "");
		
	СтруктураОпасногоГруза.МаксАктивность = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "РадиоактивныйМаксАктивность", "");
		
	// Взрывчатый
	СтруктураОпасногоГруза.МассаНеттоВзрывчатый = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "ВзрывчатыйМассаНетто", "");
		
	СтруктураОпасногоГруза.МассаНеттоВзрывчатыйВсего = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "ВзрывчатыйМассаНеттоДляВсех", "");
	
	ЗаполнитьОбщиеПараметрыОпасногоГруза(СтруктураОпасногоГруза, СтрокаОпасн);
	
	МодульКода("Справочники.ESD_ОпасныеГрузы").ЗаполнитьОпасныйГруз(СтруктураОпасногоГруза);
	
	Возврат СтруктураОпасногоГруза;
	
КонецФункции

Процедура ЗаполнитьОбщиеПараметрыОпасногоГруза(СтруктураОпасногоГруза, СтрокаОпасн)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	СтруктураОпасногоГруза.НомерООН = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "НомерООН", "");
	СтруктураОпасногоГруза.ФизИХимФорма = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "ФизХимФорма", "");
	СтруктураОпасногоГруза.ТранспортныйИндекс = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "ТранспортныйИндекс", "");
	СтруктураОпасногоГруза.ЗнакОпасности = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "ЗнакОпасности", "");
	СтруктураОпасногоГруза.ИндексБезопасности = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "ИндексБезопасности", "");
	СтруктураОпасногоГруза.ОпознавательныйЗнак = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "ОпознавательныйЗнак", "");
	СтруктураОпасногоГруза.ПроцентСмеси = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "ПроцентныйСоставСмеси", "");
	СтруктураОпасногоГруза.Комментарий = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "Описание", "");
	СтруктураОпасногоГруза.КлассификационныйКод = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "КлассификационныйКод", "");
	
	КодОграниченияПроездТуннеля = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		СтрокаОпасн, "КодОграниченияПроездТуннеля", "");
	МодульПеречисленияОграничений = МодульКода("Перечисления.ESD_КодыОграниченийПроездаЧерезТуннели");
	СтруктураОпасногоГруза.ОграничениеПроездаЧерезТуннели = МодульПеречисленияОграничений.ОграничениеПроездаПоКоду(
		КодОграниченияПроездТуннеля);
	
	СтруктураОпасногоГруза.ДатаИстеченияУдержания = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(
		СтрокаОпасн["ДатаИстеченияУдержания"]);
	
КонецПроцедуры

Процедура ДобавитьНовыеОпасныеГрузы(ДляДокумента, Результат)
	
	Если Результат = Неопределено
		Или Не МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ДляДокумента, "ОпасныеГрузы") Тогда
		Возврат;
	КонецЕсли;
	
	МассивОпасныхГрузов = ДляДокумента["ОпасныеГрузы"];
	
	Если Не ЗначениеЗаполнено(МассивОпасныхГрузов) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтруктураОпасногоГруза Из МассивОпасныхГрузов Цикл
		Если СтруктураОпасногоГруза.Новый Тогда
			Результат.НовыеОпасныеГрузы.Добавить(СтруктураОпасногоГруза);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаГруза

Процедура ЗагрузитьПараметрыГруза(СтруктураГруза, ПараметрыГруза)
	
	Если Не ЗначениеЗаполнено(ПараметрыГруза) Тогда
		Возврат;
	КонецЕсли;
	
	ESDОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	КоличествоПаллет = ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(ПараметрыГруза["КоличествоПаллет"]);
	КоличествоМест   = ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(ПараметрыГруза["КоличествоМест"]);
	
	МассаБрутто = ESDОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ПараметрыГруза, "Масса.Брутто");
	МассаБрутто = ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(МассаБрутто);
	МассаНетто  = ESDОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ПараметрыГруза, "Масса.Нетто");
	МассаНетто  = ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(МассаНетто);
	
	СтруктураГруза.Вставить("КоличествоПаллет", КоличествоПаллет);
	СтруктураГруза.Вставить("Количество",       КоличествоМест);
	СтруктураГруза.Вставить("МассаБрутто",      МассаБрутто);
	СтруктураГруза.Вставить("МассаНетто",       МассаНетто);
	СтруктураГруза.Вставить("Длина",            ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(ПараметрыГруза["Длина"]));
	СтруктураГруза.Вставить("Высота",           ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(ПараметрыГруза["Высота"]));
	СтруктураГруза.Вставить("Ширина",           ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(ПараметрыГруза["Ширина"]));
	СтруктураГруза.Вставить("Объем",            ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(ПараметрыГруза["Объем"]));
	СтруктураГруза.Вставить("Плотность",        ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(ПараметрыГруза["Плотность"]));
	
КонецПроцедуры

Процедура ЗагрузитьКонтейнеры(Контейнеры, ДляДокумента, КлючСтроки_Грузы)
	
	Если Не ЗначениеЗаполнено(Контейнеры) Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Контейнер Из Контейнеры Цикл
		КоличествоКонтейнеров = Контейнер["Количество"];
		Для Каждого СтрокаКонт Из Контейнер["Номер"] Цикл
			
			СтруктураКонтейнера = Новый Структура;
			СтруктураКонтейнера.Вставить("Номер",            СтрокаКонт["Значение"]);
			СтруктураКонтейнера.Вставить("КлючСтроки_Грузы", КлючСтроки_Грузы);
			СтруктураКонтейнера.Вставить("Количество",       1);
			
			Если ЗначениеЗаполнено(КоличествоКонтейнеров) Тогда 
				СтруктураКонтейнера.Количество = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЧислоИзСтроки(КоличествоКонтейнеров);
			КонецЕсли;
			
			ДляДокумента.Контейнеры.Добавить(СтруктураКонтейнера);
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьМаркировки(Маркировка, ДляДокумента, КлючСтроки_Грузы)
	
	Если Не ЗначениеЗаполнено(Маркировка) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаМарк Из Маркировка Цикл
		
		СтруктураМаркировка = Новый Структура;
		СтруктураМаркировка.Вставить("Значение",         СтрокаМарк["Значение"]);
		СтруктураМаркировка.Вставить("КлючСтроки_Грузы", КлючСтроки_Грузы);
		ДляДокумента.Маркировки.Добавить(СтруктураМаркировка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьОпасныеГрузы(ОпасныйГруз, ДляДокумента, КлючСтроки_Грузы)
	
	Если Не ЗначениеЗаполнено(ОпасныйГруз) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаОпасн Из ОпасныйГруз Цикл
		
		СтруктураОпасногоГруза = СтруктураОпасногоГруза(СтрокаОпасн);
		Если СтруктураОпасногоГруза = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОпасногоГруза.КлючСтроки_Грузы = КлючСтроки_Грузы;
		
		ДляДокумента.ОпасныеГрузы.Добавить(СтруктураОпасногоГруза);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьСведенияГИС(СведенияГИС, ДляДокумента, СтруктураГруза, КлючСтроки_Грузы)
	
	Если Не ЗначениеЗаполнено(СведенияГИС) Тогда  
		Возврат;
	КонецЕсли;
	
	СтруктураГруза.Вставить("НаименованиеГосСистемы",   СведенияГИС["Наименование"]);
	СтруктураГруза.Вставить("УчетнаяЕдиницаГосСистемы", СведенияГИС["УчетнаяЕдиница"]);
	СтруктураГруза.Вставить("ИнаяИнформацияГосСистемы", СведенияГИС["ДругаяИнформация"]);
	
	Для Каждого СтрокаГос Из СведенияГИС["Идентификатор"] Цикл
		
		СтруктураГосСистемы = Новый Структура;
		СтруктураГосСистемы.Вставить("КлючСтроки_Грузы", КлючСтроки_Грузы);
		СтруктураГосСистемы.Вставить("Идентификатор",    СтрокаГос["Значение"]);
		
		ДляДокумента.СведенияГосСистем.Добавить(СтруктураГосСистемы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьАдресаПунктовГруза(АдресаПунктов, ДляДокумента, КлючСтроки_Грузы)
	
	Если Не ЗначениеЗаполнено(АдресаПунктов) Тогда 
		Возврат;
	КонецЕсли;
	МодульОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Для Каждого АдресПункта Из АдресаПунктов Цикл
		СтруктураПунктГруза = Новый Структура;
		СтруктураПунктГруза.Вставить("КлючСтроки_Грузы", КлючСтроки_Грузы);

		КоличествоГрузовыхМест = АдресПункта["КоличествоГрузовыхМест"]; 
		Если ЗначениеЗаполнено(КоличествоГрузовыхМест) Тогда 
			 КоличествоГрузовыхМест = МодульОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(КоличествоГрузовыхМест);
			 СтруктураПунктГруза.Вставить("КоличествоГрузовыхМест", КоличествоГрузовыхМест);
		КонецЕсли;
		
		ПорядковыйНомерПунктаВыгрузки = АдресПункта["ПорядковыйНомерПунктаВыгрузки"];
		Если ЗначениеЗаполнено(ПорядковыйНомерПунктаВыгрузки) Тогда 
			 ПорядковыйНомерПунктаВыгрузки = МодульОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(ПорядковыйНомерПунктаВыгрузки);
			 СтруктураПунктГруза.Вставить("Выгрузка_КлючСтроки", ПорядковыйНомерПунктаВыгрузки);
		КонецЕсли;
		
		ПорядковыйНомерПунктаПогрузки = АдресПункта["ПорядковыйНомерПунктаПогрузки"];
		Если ЗначениеЗаполнено(ПорядковыйНомерПунктаПогрузки) Тогда 
			 ПорядковыйНомерПунктаПогрузки = МодульОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(ПорядковыйНомерПунктаПогрузки);
			 СтруктураПунктГруза.Вставить("Погрузка_КлючСтроки", ПорядковыйНомерПунктаПогрузки);
		КонецЕсли;
		
		ДляДокумента.Груз_АдресаПунктов.Добавить(СтруктураПунктГруза);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьДанныеГруза_ТранспортнаяНакладная(Груз, СтруктураГруза, ДляДокумента,
		КлючСтроки_Грузы, ЗагрузкаСОнлайна)
	
	Контейнеры = Груз["Контейнер"];
	Если ЗначениеЗаполнено(Контейнеры) Тогда
		ТипГруза = ЗначениеМетаданных("ESD_ТипГруза.Контейнер");
	Иначе
		ТипГруза = ЗначениеМетаданных("ESD_ТипГруза.Груз");
	КонецЕсли;
	
	СтруктураГруза.Вставить("Тип", ТипГруза);
	
	ЗагрузитьКонтейнеры(Контейнеры, ДляДокумента, КлючСтроки_Грузы);
	
	ЗагрузитьМаркировки(Груз["Маркировка"], ДляДокумента, КлючСтроки_Грузы);
	
	ЗагрузитьОпасныеГрузы(Груз["ОпасныйГруз"], ДляДокумента, КлючСтроки_Грузы);
	
	ЗагрузитьСведенияГИС(Груз["СведенияГИС"], ДляДокумента, СтруктураГруза, КлючСтроки_Грузы);
	
	ESDОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	Стоимость = ESDОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Груз, "Стоимость.ВключаяНДС");
	Если ЗначениеЗаполнено(Стоимость) Тогда
		Стоимость = ESDОбщегоНазначенияКлиентСервер.ЧислоИзСтроки(Стоимость);
	Иначе
		Стоимость = 0;
	КонецЕсли;
	СтруктураГруза.Вставить("Стоимость", Стоимость);
	
	СтруктураГруза.Вставить("Валюта", ВалютаПоДаннымОнлайна(Груз, ЗагрузкаСОнлайна));
	
КонецПроцедуры

Процедура ЗагрузитьДанныеГруза_ЗаказНаПеревозку(ДляДокумента, Груз, СтруктураГруза, КлючСтроки_Грузы)
	
	ЭтоКонтейнер = ?(ЗначениеЗаполнено(Груз["ГруженностьКонтейнера"]), Истина, Ложь);
	Если ЭтоКонтейнер Тогда
		ТипГруза = ЗначениеМетаданных("ESD_ТипГруза.Контейнер");
	Иначе
		ТипГруза = ЗначениеМетаданных("ESD_ТипГруза.Груз");
	КонецЕсли;
	
	РаспределениеПоДлине = ?(Груз["РаспределениеПоДлинеПлатформы"] = "0", Истина, Ложь);
	Делимость            = ?(Груз["Делимость"] = "1",                     Истина, Ложь);
	ПогрузкаВодителем    = ?(Груз["ПогрузкаВодителем"] = "0",             Истина, Ложь);
	
	СтруктураГруза.Вставить("Тип",                           ТипГруза);
	СтруктураГруза.Вставить("РаспределениеПоДлинеПлатформы", РаспределениеПоДлине);
	СтруктураГруза.Вставить("Делимость",                     Делимость);
	СтруктураГруза.Вставить("ПогрузкаВодителем",             ПогрузкаВодителем);
	
	СтруктураГруза.Вставить(
		"МетодОпределенияМассы",
		МодульКода("Перечисления.ESD_МетодОпределенияМассы").МетодОпределенияМассыПоКоду(Груз["МетодОпределенияМассы"]));
		
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ОпасныйГруз = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Груз, "ОпасныйГруз");
	
	// пока нет единого формата по ОГ - загружаем отдельным алгоритмом
	СтруктураОпасногоГруза = СтруктураОпасногоГруза_ЗаказНаПеревозку(ОпасныйГруз);
	Если СтруктураОпасногоГруза <> Неопределено Тогда
		СтруктураГруза.Вставить("ОпасныйГруз", СтруктураОпасногоГруза.ОпасныйГруз);
	КонецЕсли;
	
	// Заказчик и договор
	Заказчик = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Груз, "Заказчик");
	Договор  = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Груз, "Договор");
	
	Если ЗначениеЗаполнено(Заказчик) Тогда
		
		ДанныеЗаказчика = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ШаблонДанныхЮрЛица();
		ЗагрузитьДанныеЮрЛиц(ДляДокумента, Заказчик, "Заказчик", ДанныеЗаказчика);
		
		СтруктураГруза.Вставить("ЗаказчикСтрока",         ДанныеЗаказчика.НаименованиеОрганизации);
		СтруктураГруза.Вставить("КлючСтроки_ДанныеЮрЛиц", ДанныеЗаказчика.КлючСтроки);
		
		Если ЗначениеЗаполнено(Договор) И ЗначениеЗаполнено(Договор["Номер"]) Тогда
			СсылкаНаДоговор = СсылкаНаДокументЭПД(ДляДокумента, Договор, ЗначениеМетаданных("ESD_ТипыДокумента.ДоговорПеревозки"));
			СтруктураГруза.Вставить("Договор", СсылкаНаДоговор);
		КонецЕсли;
		
	КонецЕсли;
	
	АдресаПунктов = Груз["ПунктыПогрузкиВыгрузки"];
	
	ЗагрузитьАдресаПунктовГруза(АдресаПунктов, ДляДокумента, КлючСтроки_Грузы);
	
КонецПроцедуры

Процедура ОчиститьТаблицуГрузов(ОбъектДок, ИмяТаблицы, ДопПараметры)
	
	Если ДопПараметры <> Неопределено И Не ДопПараметры.ЭтоПервоеОснование Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектДок[ИмяТаблицы]) = Тип("Массив") Тогда
		ОбъектДок[ИмяТаблицы] = Новый Массив;
	Иначе
		ОбъектДок[ИмяТаблицы].Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьНоменклатуруСтроки(ОбъектДок, СтруктураСтрокиТаблицы, ДопПараметры)
	
	Если ДопПараметры = Неопределено Или ДопПараметры.ЗагрузкаСОнлайна Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураСтрокиТаблицы.Номенклатура <> Неопределено Тогда
		ДопПараметры.НоменклатураГруза.Вставить(ОбъектДок.Грузы.Количество() - 1, СтруктураСтрокиТаблицы.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ЗагрузкаГруза

Процедура УдалитьСтрокиТаблицыИзМассива(ТаблицаДляУдаления, МассивСтрокДляУдаления)
	
	ЭтоМассив = ТипЗнч(ТаблицаДляУдаления) = Тип("Массив");
	
	Для Каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
		Если ЭтоМассив Тогда
			ИндексЗаписи = ТаблицаДляУдаления.Найти(СтрокаДляУдаления);
			ТаблицаДляУдаления.Удалить(ИндексЗаписи);
		Иначе
			ТаблицаДляУдаления.Удалить(СтрокаДляУдаления);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчисткаОтветственныхЛицПоРоли(ОбъектДок, РольОтветственного, ЭтоВодитель)
	
	МодульТНКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ОтборОтветственных = Новый Структура;
	ОтборОтветственных.Вставить("Роль", РольОтветственного);
	МассивСтрокДляУдаления = МодульТНКлиентСервер.НайтиСтрокиУниверсально(
		ОбъектДок.ОтветственныеЛица, ОтборОтветственных);
			
	Если ЭтоВодитель Тогда
		
		// Очистим путевые листы		
		Если ТипЗнч(ОбъектДок) = Тип("Структура") Тогда 						
			
			// в случае ВО зачищаем Документы ЭПД			
			Для Каждого СтрокаВодитель Из МассивСтрокДляУдаления Цикл
				УдалитьДокументыЭПДПоКлючу(ОбъектДок, "КлючСтроки_ОтветственныеЛица", СтрокаВодитель.КлючСтроки);
			КонецЦикла;
			
		Иначе	
			Если МодульТНКлиентСервер.ЕстьРеквизитИлиСвойство(ОбъектДок, "ПутевыеЛисты") Тогда
				ОбъектДок.ПутевыеЛисты.Очистить();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// удалим ответственных
	УдалитьСтрокиТаблицыИзМассива(ОбъектДок.ОтветственныеЛица, МассивСтрокДляУдаления);

КонецПроцедуры

Процедура УстановитьНовыеКлючиСвязиПутевыхЛистов(ОбъектДок, СтруктураОтветственного, НовыйКлючСтроки)
	
	// Сменим ключи связей Путевых листов
	Для Каждого СтруктураПутевогоЛиста Из СтруктураОтветственного.ПутевыеЛисты Цикл
		
		СтрокаПутевогоЛиста = ДобавитьИЗаполнитьСтроку(
			ОбъектДок.ПутевыеЛисты, СтруктураПутевогоЛиста, "КлючСтроки_ОтветственныеЛица");
		СтрокаПутевогоЛиста.КлючСтроки_ОтветственныеЛица = НовыйКлючСтроки;
		
		Если МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ОбъектДок, "ДокументыЭПД") Тогда
			СтрокаПутевогоЛиста = ДобавитьИЗаполнитьСтроку(
				ОбъектДок.ДокументыЭПД, СтруктураПутевогоЛиста, "КлючСтроки_ОтветственныеЛица");
			СтрокаПутевогоЛиста.КлючСтроки_ОтветственныеЛица = НовыйКлючСтроки;
		КонецЕсли;
		
		// Сменим ключи связи документов ЭПД
		Если Не ЗначениеЗаполнено(СтруктураОтветственного.КлючСтроки) Тогда
			Продолжить;
		КонецЕсли;	
		
		Если ТипЗнч(ОбъектДок) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;	
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки_ОтветственныеЛица", СтруктураОтветственного.КлючСтроки);
		
		СтрокиДокументовЭПД = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(ОбъектДок.ДокументыЭПД, Отбор);
		Для Каждого СтрокаЭПД Из СтрокиДокументовЭПД Цикл	
			СтрокаЭПД.КлючСтроки_ОтветственныеЛица = НовыйКлючСтроки; 
		КонецЦикла;
		
	КонецЦикла;	
		
КонецПроцедуры	

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_etrn_base_CommonModule_ТНЗагрузкаСервер_ВзаимодействиеСОнлайном
#КонецОбласти // include_etrn_base_CommonModule_ТНЗагрузкаСервер_ВзаимодействиеСОнлайном

#Область include_etrn_base_CommonModule_ТНЗагрузкаСервер_ИмяПродуктаЭПД
#КонецОбласти // include_etrn_base_CommonModule_ТНЗагрузкаСервер_ИмяПродуктаЭПД

#Область include_etrn_base_InformationRegister_ДанныеТитулов_ПолучениеДанныхТитулов
#КонецОбласти // include_etrn_base_InformationRegister_ДанныеТитулов_ПолучениеДанныхТитулов

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиентСервер
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиентСервер

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_CommonModule_ОбъектОбработки
#КонецОбласти // include_etrn_base_CommonModule_ОбъектОбработки

#Область includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере
#КонецОбласти // includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область include_etrn_base_CommonModule_Метаданные
#КонецОбласти // include_etrn_base_CommonModule_Метаданные

#Область include_etrn_base_CommonModule_МетаданныеКлиентСервер
#КонецОбласти // include_etrn_base_CommonModule_МетаданныеКлиентСервер

