
// Получение и обработка данных документа из Saby
//
// Параметры:
//	ПараметрыЗагрузки - Соответствие - параметры загрузки документа
//	ОбщиеПараметрыЗагрузки - Соответствие - общие параметры загрузки документа
//	Результат - Структура - описание результата загрузки документа
//
//DynamicDirective
Процедура SabyЗагрузитьДанныеДокумента(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, Результат) Экспорт
	// Для ВО - там сначала загружаются данные, а потом идет сюда для обработки. Сделано для того, чтоб сильно не ломать логику	
	Если ЗначениеЗаполнено(ПараметрыЗагрузки.ДанныеДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	// Загружаем данные документа
	SabyДанныеДокумента = SabyПолныеДанныеДокумента(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, Результат);
	Если Не ЗначениеЗаполнено(SabyДанныеДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	// Создаем копию документа
	Документ = Новый Соответствие(Новый ФиксированноеСоответствие(SabyДанныеДокумента));
	// Подготавливаем данные
	Документ.Вставить("Событие",     Новый Массив);
	Документ.Вставить("Вложения",    Новый Соответствие);
	Документ.Вставить("Подстановки", Новый Соответствие);
	Документ.Вставить("ИдТитулов",   Новый Соответствие);
	Документ.Вставить("КомментарийПоследнегоТитула", "");
	
	// Формируем параметры обработки документа
	ПараметрыОбработки = SabyПараметрыОбработкиДокумента();
	ЗаполнитьЗначенияСвойств(ПараметрыОбработки, ПараметрыЗагрузки); 
	
	// Выполняем обработку
	SabyОбработатьДанныеДокумента(Документ, SabyДанныеДокумента, ПараметрыОбработки, Результат);
	
	ПараметрыЗагрузки.ДанныеДокумента = Документ;	
КонецПроцедуры

// Получение полных данных документа из Saby
//
// Параметры:
//	ПараметрыЗагрузки - Соответствие - параметры загрузки документа
//	ОбщиеПараметрыЗагрузки - Соответствие - общие параметры загрузки документа
//	Результат - Структура - описание результата загрузки документа
//
// Возвращаемое значение:
//	Структура - загруженные данные документа из Saby
//
//DynamicDirective
Функция SabyПолныеДанныеДокумента(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, Результат) Экспорт
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	Ошибки = МодульТНОбщегоНазначенияКлиентСервер.СтруктураОшибок(ПараметрыЗагрузки.ИмяМетаданных);
	
	ДопПоля = "ДопДействия,ТекущиеЭтапы,Подстановки,Расширение,Стороны,ИдентификаторУчастника";
	// Стороны - обогащают посдстановки данными по ответсвенным МО, ТО, выезд и заезд
	// ЗаменаВодителя - обогащает данные ид замены водителя - основания и документа замены
	Если ПараметрыЗагрузки.ИмяМетаданных = ПутевойЛистКлиент() Тогда 
		ДопПоля = ДопПоля + ",ЗаменаВодителя";
	ИначеЕсли ПараметрыЗагрузки.ИмяМетаданных = ЗаказНаПеревозкуКлиент() Тогда
		ДопПоля = ДопПоля + ",ГИС_УИД";
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ДопПоля", ДопПоля);
	
	Попытка
		РезультатSaby = ЗагрузитьДанныеДокументаИзSaby(ПараметрыЗагрузки, ДополнительныеПараметры, ОбщиеПараметрыЗагрузки);
		Если НЕ РезультатSaby.Успешно Тогда
			ВызватьИсключение РезультатSaby.Данные;
		КонецЕсли;
		
		ДанныеДокумента = РезультатSaby.Данные;
	Исключение
		ИнфоОшибки = ИнформацияОбОшибке();
		ТекстОшибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПричинаОшибкиИзЯдра", ИнфоОшибки.Описание);
		Ошибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ДобавитьОшибкуПользователю", Ошибки, Неопределено, ТекстОшибки);
		КлючСоответствия = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").КлючСсылка(ПараметрыЗагрузки.Ссылка);
		Результат.Ошибки.Вставить(КлючСоответствия, Ошибки); 
		
		ДанныеДокумента = Неопределено;
	КонецПопытки;
	
	Возврат ДанныеДокумента;
КонецФункции

// Обработка полученных данных документа из Saby
//
// Параметры:
//	Документ - Соответствие - объект обработанного документа из Saby
//	ДанныеSaby - Соответствие - объект полученных данных из Saby
//	ПараметрыОбработки - Структура - параметры обработки документа
//	Результат - Структура - описание результата загрузки документа
//
//DynamicDirective
Процедура SabyОбработатьДанныеДокумента(Документ, ДанныеSaby, ПараметрыОбработки, Результат = Неопределено)
	SabyОбработатьСобытияДокумента(Документ, ДанныеSaby, ПараметрыОбработки);
	
	ДанныеПодстановок = ДанныеSaby["Подстановки"];	
	Если ЗначениеЗаполнено(ДанныеПодстановок) Тогда
		Для Каждого Подстановки Из ДанныеПодстановок Цикл
			ДанныеПодстановки = Новый Структура("КодТитулаОнлайна, Значения", Подстановки.Ключ, Подстановки.Значение);
			ДобавитьПодстановкуТитула(Документ, ДанныеПодстановки, ПараметрыОбработки);
		КонецЦикла;
	КонецЕсли;
	
	Если Результат <> Неопределено Тогда
		МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
		Ошибки = МодульТНОбщегоНазначенияКлиентСервер.СтруктураОшибок(ПараметрыОбработки.ИмяМетаданных);
		Для Каждого Ошибка Из ПараметрыОбработки.Ошибки Цикл
			Ошибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ДобавитьОшибкуПользователю", Ошибки, Неопределено, Ошибка.Значение);
			КлючСоответствия = МодульТНОбщегоНазначенияКлиентСервер.КлючСсылка(ПараметрыОбработки.Ссылка);
			Результат.Ошибки.Вставить(КлючСоответствия, Ошибки); 	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Обработка полученных событий документа из Saby
//
// Параметры:
//	Документ - Соответствие - объект обработанного документа из Saby
//	ДанныеSaby - Соответствие - объект события из Saby
//	ПараметрыОбработки - Структура - параметры обработки документа
//
//DynamicDirective
Процедура SabyОбработатьСобытияДокумента(Документ, ДанныеSaby, ПараметрыОбработки)
	СобытияSaby = ДанныеSaby["Событие"];
	Если Не ЗначениеЗаполнено(СобытияSaby) Тогда
		Возврат;
	КонецЕсли;
	
	// Предопределим списки обработанных данных из "событий"
	События = Документ["Событие"];
	Вложения = Документ["Вложения"];
	
	// Обрабатываем события с онлайна
	Для Каждого СобытиеSaby Из СобытияSaby Цикл
		Событие = SabyСобытиеДокумента(СобытиеSaby);
		События.Добавить(Событие);
		
		Если ПараметрыОбработки.ОбрабатыватьВложения Тогда
			// На основании события собираем вложения
			ДобавитьВложения(Вложения, Событие, ПараметрыОбработки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Получение параметров загрузки документа из Saby
//
// Возвращаемое значение:
//	Структура - параметры загрузки документа из Saby
//
//DynamicDirective
Функция SabyПараметрыОбработкиДокумента()
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", Неопределено);
	Результат.Вставить("ИмяМетаданных", "");
	Результат.Вставить("ОбрабатыватьВложения", Истина);
	Результат.Вставить("ОбрабатыватьПодстановки", Истина);
	Результат.Вставить("Ошибки", Новый Структура);
	
	Возврат Результат;
КонецФункции

// Получение обработанной структуры события документа Saby
//
// Параметры:
//	ДанныеSaby - Соответствие - структура полученных данных события из Saby
//
// Возвращаемое значение:
//	Соответствие - обработанный объект события документа
//
//DynamicDirective
Функция SabyСобытиеДокумента(ДанныеSaby)
	ДатаВремяДокумента = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД", 
		ДанныеSaby["ДатаВремяДокумента"]);
	ДатаВремя          = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД", 
		ДанныеSaby["ДатаВремя"]);
		
	СобытиеСоответствие = Новый Соответствие;
	СобытиеСоответствие.Вставить("ДатаВремя",          ДатаВремя);
	СобытиеСоответствие.Вставить("ДатаВремяДокумента", ДатаВремяДокумента);
	СобытиеСоответствие.Вставить("Идентификатор",      ДанныеSaby["Идентификатор"]);
	СобытиеСоответствие.Вставить("Название",           ДанныеSaby["Название"]);
	СобытиеСоответствие.Вставить("Комментарий",        ДанныеSaby["Комментарий"]);
	СобытиеСоответствие.Вставить("Исполнитель",        Новый Соответствие);
	СобытиеСоответствие.Вставить("Действие",           Новый Соответствие);
	
	ДанныеИсполнителяSaby = ДанныеSaby["Исполнитель"];
	Если ЗначениеЗаполнено(ДанныеИсполнителяSaby) Тогда
		ДанныеИсполнителя = СобытиеСоответствие["Исполнитель"];
		ДанныеИсполнителя.Вставить("Идентификатор", ДанныеИсполнителяSaby["Идентификатор"]);
		ДанныеИсполнителя.Вставить("Фамилия",       ДанныеИсполнителяSaby["Фамилия"]);
		ДанныеИсполнителя.Вставить("Имя",           ДанныеИсполнителяSaby["Имя"]);
		ДанныеИсполнителя.Вставить("Отчество",      ДанныеИсполнителяSaby["Отчество"]);	
	КонецЕсли;
	
	ДанныеДействияSaby = ДанныеSaby["Действие"];
	Если ЗначениеЗаполнено(ДанныеДействияSaby) Тогда
		ДанныеДействия = СобытиеСоответствие["Действие"];
		ДанныеДействия.Вставить("Идентификатор", ДанныеДействияSaby["Идентификатор"]);
		ДанныеДействия.Вставить("Название",      ДанныеДействияSaby["Название"]);
	КонецЕсли;
	
	СписокВложений = ДанныеSaby["Вложение"];
	СобытиеСоответствие.Вставить("Вложение", СписокВложений);
	SabyДополнитьДанныеСобытияИзВложений(СобытиеСоответствие, СписокВложений);
	
	Возврат СобытиеСоответствие;
КонецФункции

// Дополнение события из списка структур вложений документа Saby
//
// Параметры:
//	Событие - Соответствие - объект обработанного события
//	СписокВложений - Массив - массив вложений документа Saby
//
//DynamicDirective
Процедура SabyДополнитьДанныеСобытияИзВложений(Событие, СписокВложений)
	Если Не ЗначениеЗаполнено(СписокВложений) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеИсполнителя = Событие["Исполнитель"];
	// При отсутствии исполнителя подтягиваем ФИО из подписи
	Если Не ЗначениеЗаполнено(ДанныеИсполнителя) Тогда
		// Получим последнее вложение из списка
		Вложение = СписокВложений[СписокВложений.ВГраница()];
		// На основании "подписи" заполняем данные исполнителя
		СписокПодписей = Вложение["Подпись"];
		Если ЗначениеЗаполнено(СписокПодписей) Тогда
			ДанныеПодписи = СписокПодписей[СписокПодписей.ВГраница()];
			
			МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
			ПодписантФИО = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеПодписи, "Сертификат.ФИО", "");
			ДанныеИсполнителя.Вставить("Фамилия", ПодписантФИО);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//DynamicDirective
Функция ИдСбисДокумента(ПараметрыЗагрузки)
	ИДСбис = "";

	ПараметрыЗагрузки.Свойство("ИДСбис", ИДСбис);
	Если ЗначениеЗаполнено(ИДСбис) Тогда
		Возврат ИДСбис;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыЗагрузки.Ссылка) = Тип("Структура") Тогда
		ИДСбис = ПараметрыЗагрузки.Ссылка.Идентификатор;
	Иначе	
		ДанныеСостояния = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ДанныеСостоянияОбъекта", ПараметрыЗагрузки.Ссылка);
		Если ДанныеСостояния <> Неопределено Тогда 
			
			Если МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ДанныеСостояния, "UID") Тогда 
				ИДСбис = ДанныеСостояния.UID;
			Иначе 
				ИДСбис = ДанныеСостояния.ИД;
			КонецЕсли;	
			
			ПараметрыЗагрузки.Вставить("ТипИсточника", ДанныеСостояния.ТипИсточника);
			ПараметрыЗагрузки.Вставить("ИдентификаторИсточника", ДанныеСостояния.ИдентификаторИсточника);
			ПараметрыЗагрузки.Вставить("Ссылка", ДанныеСостояния.Ссылка);		
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ИДСбис;
КонецФункции

// Получение имени файла без расшинения
//
// Параметры:
//	ИмяФайла - Строка - имя файла из поля данных Saby
//	МодульТНОбщегоНазначенияКлиентСервер - ОбщийМодуль - ссылка на общий модуль "ESD_ОбщегоНазначенияКлиентСервер"
//
// Возвращаемое значение:
//  Строка - имя файла без расширения
//	
//DynamicDirective
Функция ИмяФайлаБезРасширения(ИмяФайла, МодульТНОбщегоНазначенияКлиентСервер = Неопределено)
	ИмяФайлаБезРасширения = "";
	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат ИмяФайлаБезРасширения;
	КонецЕсли;
	
	Если МодульТНОбщегоНазначенияКлиентСервер = Неопределено Тогда
		// BSLLS:FunctionOutParameter-off
		МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
		// BSLLS:FunctionOutParameter-on
	КонецЕсли;
	
	СоставИмяФайла = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(ИмяФайла, ".");
	ИмяФайлаБезРасширения = СоставИмяФайла[0];
	
	Возврат ИмяФайлаБезРасширения;
КонецФункции

//DynamicDirective

Функция РаспознаваниеВУ(ДопПараметры, Знач ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	Если ДопПараметры.ОтветНаКлиенте <> Неопределено Тогда
		Возврат ДопПараметры.ОтветНаКлиенте;
	КонецЕсли;
	
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
			ДопПараметры.context_params);
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Файл", ДопПараметры.ЗакодированныеДД);
	
	ИмяМетода = "sabyEmployee.RecognizeDriverLicense";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);	
	Если Ответ.Ошибка Тогда	
		Ошибка   = Истина;
		Описание = Ответ.ОписаниеОшибки;	
	ИначеЕсли Не ЗначениеЗаполнено(Ответ.Результат) Или Не ЗначениеЗаполнено(Ответ.Результат["result"]) Тогда	
		Ошибка   = Истина;
		Описание = "Ошибка выполнения распознавания ВУ / " + ИмяМетода;	
	Иначе
		Ошибка = Ложь;
	КонецЕсли;
	
	Попытка	
		// заберем только распознанные данные 
		ДанныеВУ = Ответ.Результат["result"]["RecognizedData"]["fields"];
		Ответ.Результат = ДанныеВУ;	
	Исключение	
		Ошибка = Истина;
		Описание = "Ошибка обработки результата распознавания ВУ / " + ИмяМетода;	
	КонецПопытки;
	
	Если Ошибка Тогда 	
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			Неопределено,
			"Не удалось выполнить распознавание ВУ / " + ИмяМетода,
			Описание);	
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

//DynamicDirective

Функция ЗагрузитьДанныеТСПоРегНомеру(ДопПараметры, Знач ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДопПараметры.ОтветНаКлиенте <> Неопределено Тогда
		Возврат ДопПараметры.ОтветНаКлиенте;
	КонецЕсли;
	
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
			ДопПараметры.context_params);
	КонецЕсли;
	
	ВнутренниеПараметрыМетода = Новый Структура;
	ВнутренниеПараметрыМетода.Вставить("filter", Новый Структура("RegNumber", ДопПараметры.РегистрационныйНомер));
	ВнутренниеПараметрыМетода.Вставить("limit",  1);
	ВнутренниеПараметрыМетода.Вставить("page",   0);
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("params", ВнутренниеПараметрыМетода);
	
	ИмяМетода = "sabyVehicle.GetList";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда 
		
		Ответ.Результат = Ответ.ОписаниеОшибки;
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			Неопределено,
			"Не удалось выполнить загрузку данных по регистрационному номеру / " + ИмяМетода,
			Ответ.ОписаниеОшибки);
			
	Иначе
		
		НайденныеМашины = Ответ.Результат["result"]["cars"];
		Если НайденныеМашины.Количество() > 0 Тогда
			Ответ.Результат = НайденныеМашины[0];
		Иначе
			Ответ.Результат = "Заполнение не выполнено. Не найдены данные транспортного средства по указанному регистрационному номеру.";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ.Результат;
	
КонецФункции

//DynamicDirective

Функция ЗагрузитьДанныеТСПоВИН(ДопПараметры, Знач ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДопПараметры.ОтветНаКлиенте <> Неопределено Тогда
		Возврат ДопПараметры.ОтветНаКлиенте;
	КонецЕсли;
	
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
			ДопПараметры.context_params);
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("VIN", ДопПараметры.ВИН);
	
	ИмяМетода = "sabyVehicle.ByVIN";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда 
		
		Ответ.Результат = Ответ.ОписаниеОшибки;
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			Неопределено,
			"Не удалось проверить данные в ГИБДД по ВИН / " + ИмяМетода,
			Ответ.ОписаниеОшибки);
			
	Иначе			
		Ответ.Результат = Ответ.Результат["result"];
	КонецЕсли;
			
	Возврат Ответ.Результат;
	
КонецФункции

//DynamicDirective

Функция ЗагрузитьПочтовыеЯщикиКонтрагента(ДопПараметры, Знач ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДопПараметры.ОтветНаКлиенте <> Неопределено Тогда
		Возврат ДопПараметры.ОтветНаКлиенте;
	КонецЕсли;
	
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
			ДопПараметры.context_params);
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Участник", ДопПараметры.Участник);
	
	ИмяМетода = "СБИС.ИнформацияОКонтрагенте";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда 
		
		Ответ.Результат = Ответ.ОписаниеОшибки;
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			Неопределено,
			"Не удалось получить список ящиков контрагента / " + ИмяМетода,
			Ответ.ОписаниеОшибки);
			
	Иначе			
		Ответ.Результат = Ответ.Результат["result"];
	КонецЕсли;
			
	Возврат Ответ.Результат;
	
КонецФункции

// Выполенение метода внешнего API
//
// Параметры:
//  ИмяМетода       - Строка    - название выполняемого метода
//  ПараметрыМетода - Структура - параметры выполнения метода
//  ОбщиеПараметрыЗагрузки - Структура - структура общих параметров
//  ДополнительныеПараметры - Структура - структура дополнительных параметров метода
//
// Возвращаемое значение:
//   Структура - имеет всегда фиксированны набор ключей
//       * Результат      - Соответствие - ответ сервиса. 
//       * Ошибка         - Булево       - признак возникновения ошибки.
//       * ОписаниеОшибки - Строка       - описание ошибки.
//
//DynamicDirective
Функция ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки, ДополнительныеПараметры = Неопределено)
	Ошибка         = Ложь;
	Результат      = Неопределено;
	ОписаниеОшибки = "";
	
	Попытка	
		Результат = ОбщиеПараметрыЗагрузки.ОбъектОбработки.local_helper_exec_method(
			ОбщиеПараметрыЗагрузки.context_params,
			ИмяМетода,
			ПараметрыМетода,
			Истина,
			ДополнительныеПараметры);
	Исключение	
		Ошибка          = Истина;
		ИнфоОшибки      = ИнформацияОбОшибке();
		СтруктураОшибки = СтруктураОшибкиМетодаAPI(ИнфоОшибки);
		ОписаниеОшибки  = СтруктураОшибки.message;
	КонецПопытки;
	
	Подключаемый_ЗагрузкаИзSaby_ПослеВыполненияОбмена(ИмяМетода
		, ПараметрыМетода
		, ?(Результат = Неопределено, СтруктураОшибки, Результат) 
		, ОбщиеПараметрыЗагрузки.context_params
		, ДополнительныеПараметры
	);
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Результат",      Результат);
	СтруктураОтвета.Вставить("Ошибка",         Ошибка);
	СтруктураОтвета.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	
	Возврат СтруктураОтвета;	
КонецФункции

#Область Статистика

// Запись статистики на прямую в облако, в обход стандартных методов
//
// Параметры:
//  ПараметрыЗагрузки - Структура - структура загрузки
//  ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
//DynamicDirective
Процедура ЗаписатьСтатистикуНапрямую(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки) Экспорт
	ПараметрыМетода = ПараметрыМетодаЗаписиСтатистики(ПараметрыЗагрузки.ТекущийТитул, "", ПараметрыЗагрузки.Ссылка);
	
	Если ПараметрыЗагрузки.ИмяМетаданных = ПутевойЛистКлиент() Тогда
		ЗаписатьСтатистику_ЭПЛ(ПараметрыЗагрузки, ПараметрыМетода, ОбщиеПараметрыЗагрузки);			
	Иначе	
		ЗаписатьСтатистикуВОблако(ПараметрыЗагрузки.Ссылка, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	КонецЕсли;
КонецПроцедуры

//DynamicDirective

Функция ПараметрыМетодаЗаписиСтатистики(ТекущийТитул, ИмяДействия, ДокументСсылка = Неопределено,
	ИмяФункционала = "", ИмяКонтекста = "") Экспорт
	
	ИмяФункционалаСтатистики = ИмяФункционала;
	ИмяДействияСтатистики    = ИмяДействия;
	
	Если ДокументСсылка <> Неопределено Тогда
		Если ТипЗнч(ДокументСсылка) = Тип("Структура") Тогда
			ИмяМетаданных = ДокументСсылка.ИмяМетаданных;
		Иначе
			ИмяМетаданных = МодульКода("ESD_ТНОбщегоНазначенияСервер").ИмяМетаданныхДокумента(ДокументСсылка);
		КонецЕсли;
		
		ПараметрыAPI   = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыДокументаДляАПИ(ИмяМетаданных);
		ИмяФункционалаСтатистики = ИмяПродуктаЭПДСтатистика() + ПараметрыAPI.Тип;
		
		ЭтоДинамическийТитул = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов",
			ИмяМетаданных, "ЭтоДинамическийТитул", ТекущийТитул) = Истина;
		
		Если ЭтоДинамическийТитул Тогда
			ИмяДействияСтатистики = "Переход\" + СокрЛП(ТекущийТитул);
		Иначе
			ИмяДействияСтатистики = "Переход";
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	
	Данные = Новый Структура;
	Данные.Вставить("action",     ИмяДействияСтатистики);
	Данные.Вставить("context",    ИмяКонтекста);
	Данные.Вставить("functional", ИмяФункционалаСтатистики);
	
	ПараметрыМетода.Вставить("data", Данные);

	Возврат ПараметрыМетода;
	
КонецФункции

//DynamicDirective

Процедура ЗаписатьСтатистикуВОблако(ДокументСсылка, Знач ПараметрыМетода, Знач ОбщиеПараметрыЗагрузки) Экспорт
	CloudStatisticsSend_ДополнитьПараметры(ПараметрыМетода, ОбщиеПараметрыЗагрузки.ОбъектОбработки);
	ИмяМетода = "CloudStatistics.Send";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда	
		Ошибка   = Истина;
		Описание = Ответ.ОписаниеОшибки;	
	ИначеЕсли Не ЗначениеЗаполнено(Ответ.Результат) Или Не ЗначениеЗаполнено(Ответ.Результат["result"]) Тогда	
		Ошибка   = Истина;
		Описание = "Ошибка выполнения записи статистики / " + ИмяМетода;	
	Иначе
		Ошибка = Ложь;
	КонецЕсли;
	
	Если Ошибка Тогда	
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			ДокументСсылка,
			"Не записана статистика документа / " + ИмяМетода,
			Описание);	
	КонецЕсли;
КонецПроцедуры

//Запись стастики использования редактора сопоставлений
//
//Параметры:
//	Ссылка - СправочникСсылка.ESD_НастройкиСопоставлений - ссылка на измененный элемент справочника
//	Событие - Строка - событие статистики
//
//DynamicDirective
Процедура ЗаписатьСтатистикуРедактора(Ссылка, Событие) Экспорт
	ПараметрыМетода = ПараметрыМетодаЗаписиСтатистики("", Событие, , "1C MappingEditor");
		
	Модуль_ESDСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	ОбработкаОбъект  = Модуль_ESDСервер.ОбъектОбработки();
	context_params   = Модуль_ESDСервер.ПроверитьНаличиеПараметровПодключенияЭПД();
	
	ОбщиеПараметры = Новый Структура;
	ОбщиеПараметры.Вставить("ОбъектОбработки", ОбработкаОбъект);	
	ОбщиеПараметры.Вставить("context_params",  context_params);
	
	ЗаписатьСтатистикуВОблако(Ссылка, ПараметрыМетода, ОбщиеПараметры);
КонецПроцедуры	

//DynamicDirective

Процедура ЗаписатьСтатистикуВызоваВОблако(Событие, Функционал, Форма = Неопределено) Экспорт
	Попытка 	
		ОбщиеПараметры = ОбщиеПараметрыЗагрузки(Форма);		
		ПараметрыМетода = ПараметрыМетодаЗаписиСтатистики("", Событие, , Функционал, ОбщиеПараметры.context);	
		ЗаписатьСтатистикуВОблако(Неопределено, ПараметрыМетода, ОбщиеПараметры);	
	Исключение	
 		Информация = ИнформацияОбОшибке();
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации", Неопределено,
			"Ошибка записи статистики", Информация.Описание);	
	КонецПопытки;
КонецПроцедуры    

// Возвращает Общие параметры для обмена по API со СБИС.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Если ВО, то форма откуда вызов, если расширение, то неопределено
//
// Возвращаемое значение:
//   Структура - адрес двоичных данных файла печатной формы.
//
//DynamicDirective 
Функция ОбщиеПараметрыЗагрузки(Форма) Экспорт
	
	Модуль_ESDСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияСервер");
	Если Форма <> Неопределено И Форма.ЭтоВО Тогда
		context = "ВО2";
		ТранспортВО = Модуль_ESDСервер.ТранспортВО(Форма);
		ОбработкаОбъект = ТранспортВО.ТранспортИнтеграции;
	Иначе	
		Если Модуль_ESDСервер.ЭтоCF() Тогда
			context = "ESDCF";
		Иначе
			context = "ESD";
		КонецЕсли;
		ОбработкаОбъект  = Модуль_ESDСервер.ОбъектОбработки();
	КонецЕсли;
	
	ОбщиеПараметры = Новый Структура;
	ОбщиеПараметры.Вставить("ОбъектОбработки", ОбработкаОбъект);
	ОбщиеПараметры.Вставить("context",  context);
	
	context_params = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД");
	ОбщиеПараметры.Вставить("context_params",  context_params);
	
	Возврат ОбщиеПараметры;
	
КонецФункции

// Заполнение отсутствующих значений структуры параметров выполнения метода "CloudStatistics.Send"
//
// Параметры:
//	ПараметрыМетода - Структура - структура параметров для выполнения метода "CloudStatistics.Send"
//	ОбъектОбработки - ОбработкаОбъект.ESD_SABY - объект обработки ядра
//
//DynamicDirective
Процедура CloudStatisticsSend_ДополнитьПараметры(ПараметрыМетода, ОбъектОбработки)
	Если ЗначениеЗаполнено(ПараметрыМетода.data.context) Тогда
	    Возврат;
	КонецЕсли;
	
	Если ЭтоУниверсальноеРасширение() Тогда			
		context = ИмяФункционалаЭПДСтатистика();					
	Иначе	
		Настройки = ОбъектОбработки.ОбщиеНастройкиПрочитать();			
		Если ЗначениеЗаполнено(Настройки) И Настройки.Свойство("ExtSysSettingsId") Тогда				
			context = Настройки.ExtSysSettingsId;	
		Иначе
			// по дефолту ставим имя продукта, вместо пустого имени конфигурации
			МассивФункционала = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ПараметрыМетода.data.functional, "_");
			ИмяПродукта       = МассивФункционала[1];
			
			context = СтрЗаменить(ИмяПродукта, "1С ", "");
		КонецЕсли;	
	КонецЕсли;
	
	ПараметрыМетода.data.context = context;
КонецПроцедуры

// Запись статистики документа "Путевой лист"
//
// Параметры:
//	ПараметрыЗагрузки - Структура - параметры загрузки документа
//	ПараметрыМетода - Структура - структура параметров для выполнения метода "CloudStatistics.Send"
//	ОбщиеПараметрыЗагрузки - ОбработкаОбъект.ESD_SABY - объект обработки ядра
//
//DynamicDirective
Процедура ЗаписатьСтатистику_ЭПЛ(ПараметрыЗагрузки, ПараметрыМетода, ОбщиеПараметрыЗагрузки)
	// Сохраним текущий "action" в отдельную переменную
	ТекущийAction = ПараметрыМетода.data.action;
	// Очистим "action"
	ПараметрыМетода.data.action = "";
	
	// Обработаем случай отсутствия "текущего титула" (первая запись документа)
	Если ПустаяСтрока(ПараметрыЗагрузки.ТекущийТитул) Тогда
		// Импорт модуля
		МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
		
		// Замена водителя		
		ЗначениеПЛПредыдущий = МодульТНОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ПараметрыЗагрузки.Ссылка, "ПЛПредыдущий");
		Если ЗначениеЗаполнено(ЗначениеПЛПредыдущий) Тогда			
			ПараметрыМетода.data.action = "Переход\ЗаменаВодителя";						
			ЗаписатьСтатистикуВОблако(ПараметрыЗагрузки.Ссылка, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
		КонецЕсли;
		
		// Несколько водителей
		ВодителиСтрокой = МодульТНОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ПараметрыЗагрузки.Ссылка, "Водитель"); 	
		МассивВодителей = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ВодителиСтрокой, ",");	
		Если МассивВодителей.Количество() > 1 Тогда
			ПараметрыМетода.data.action = "Переход\НесколькоВодителей";
			ЗаписатьСтатистикуВОблако(ПараметрыЗагрузки.Ссылка, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
		КонецЕсли;	
	КонецЕсли;
	
	// Прерываем выполнение, если была хотя бы одна запись "особенной" статистики ЭПЛ ("action" заполнен)
	Если Не ПустаяСтрока(ПараметрыМетода.data.action) Тогда
		Возврат;	
	КонецЕсли;
	
	// Вернем "action"
	ПараметрыМетода.data.action = ТекущийAction;
	ЗаписатьСтатистикуВОблако(ПараметрыЗагрузки.Ссылка, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
КонецПроцедуры

#КонецОбласти // Статистика

#Область include_etrn_base_CommonModule_ТНЗагрузкаСервер_ДополнительныйФункционал_ВзаимодействиеСОнлайном_СлужебныйПрограммныйИнтерфейс
#КонецОбласти // include_etrn_base_CommonModule_ТНЗагрузкаСервер_ДополнительныйФункционал_ВзаимодействиеСОнлайном_СлужебныйПрограммныйИнтерфейс

// Загружает данные из Saby по переданному адресу
//
// Параметры:
//	ПараметрыЗагрузки - Структура - параметры подключения Saby
//	Адрес - Строка - адрес загрузки данных из Saby
//
// Возвращаемое значение:
//	Произвольно - коллекция полученных данных из Saby
//	
//DynamicDirective
Функция SabyЗагрузитьДанныеПоСсылке(ПараметрыЗагрузки, Адрес)
	РезультатОбменаSaby = ПараметрыЗагрузки.ОбъектОбработки.local_helper_download_from_link(
		ПараметрыЗагрузки.context_params, Адрес);
		
	Если ТипЗнч(РезультатОбменаSaby) = Тип("Структура") Тогда
		Подключаемый_ЗагрузкаИзSaby_ПослеВыполненияОбмена("local_helper_download_from_link"
			, Новый Структура("Адрес", Адрес)
			, РезультатОбменаSaby 
			, ПараметрыЗагрузки.context_params
		);
	КонецЕсли;
			
	Возврат РезультатОбменаSaby;
КонецФункции

// Получает справочные данные с онлайна.
//
// Параметры:
//  ИмяСправочника - Строка - наименование справочника, который необходимо получить с онлайна.
//  ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
// Возвращаемое значение:
//   Массив - данные зависят от справочника, получаемого с онлайна.
//
//DynamicDirective
Функция СправочникСОнлайна(ИмяСправочника, ОбщиеПараметрыЗагрузки) Экспорт
	// Импорт модуля "ESD_Record"
	мRecord = МодульКодаКлиент("ESD_Record");
	// Создание структуры Record
	Record = мRecord.AppendField(ИмяСправочника, "Справочник", мRecord.tString());
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("ДопПоля",    Новый Массив);
	ПараметрыМетода.Вставить("Фильтр",     мRecord.Expand(Record));
	ПараметрыМетода.Вставить("Сортировка", null);
	ПараметрыМетода.Вставить("Навигация",  null);
	
	Метод = "Классификаторы.ПолучитьСправочникЦеликом";
	ДопПараметры = Новый Структура("protocol", 6);
	
	РезультатSaby = ВыполнитьМетодSaby(Метод, ПараметрыМетода, ДопПараметры, ОбщиеПараметрыЗагрузки); 
	Если РезультатSaby.Ошибка Тогда
		ВызватьИсключение "Ошибка при загрузке данных справочника """ + ИмяСправочника + """: 
			|" + РезультатSaby.ОписаниеОшибки;
	КонецЕсли;

	Результат = РезультатSaby["Результат"];
	Возврат Результат["result"]["d"];
КонецФункции

// Загрузка данных ЭПД из Saby
//
// Параметры:
//	ОбщиеПараметрыЗагрузки - Структура - параметры подключения к Saby
//	ПараметрыМетода - Структура - параметры загрузки данных
//
// Возвращаемое значение:
//	Структура, Соответствие - коллекция обработанных данных, полученных из Saby
//
//DynamicDirective
Функция ВыполнитьМетодSaby_ПрочитатьДокумент(ОбщиеПараметрыЗагрузки, ПараметрыМетода)
	Перем ОбъектОбработки_, context_params;
	
	Если Не ОбщиеПараметрыЗагрузки.Свойство("ОбъектОбработки", ОбъектОбработки_) Тогда
		ОбъектОбработки_ = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбъектОбработки();
	КонецЕсли;
	Если Не ОбщиеПараметрыЗагрузки.Свойство("context_params", context_params) Тогда
		context_params = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПроверитьНаличиеПараметровПодключенияЭПД();
	КонецЕсли;		
	
	РезультатОбменаSaby = ОбъектОбработки_.local_helper_read_document(
		context_params, ПараметрыМетода);
		
	Подключаемый_ЗагрузкаИзSaby_ПослеВыполненияОбмена("СБИС.ПрочитатьДокумент", 
		ПараметрыМетода, РезультатОбменаSaby, context_params);
	
	Возврат РезультатОбменаSaby;
КонецФункции

// Обертка над методом "ВыполнитьМетодAPI"
//
// Параметры:
//  Метод - Строка - имя метода.
//  Параметры - Структура - параметры метода.
//	ДополнительныеПараметры - Структура - дополнительные параметры метода.
//	ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
// Возвращаемое значение:
//   Структура - структура результата запроса.
//
//DynamicDirective
Функция ВыполнитьМетодSaby(Метод, Параметры, Знач ДополнительныеПараметры = Неопределено, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	// BSLLS:FunctionOutParameter-off
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
		ОбщиеПараметрыЗагрузки = МодульТНОбщегоНазначенияСервер.ОбщиеПараметрыВыгрузкиЗагрузки();
	КонецЕсли;
	// BSLLS:FunctionOutParameter-on
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура("protocol", 7);
	КонецЕсли;

	РезультатAPI = ВыполнитьМетодAPI(Метод 
		, Параметры
		, ОбщиеПараметрыЗагрузки
		, ДополнительныеПараметры
	);
	
	Возврат РезультатAPI;
КонецФункции

// Получает данные документа из СБИС.
//
// Параметры:
//  Параметры - Структура - структура обязательных параметров для получения данных из СБИС (ссылка,имяметаданных)
//  ДополнительныеПараметры - Структура - структура дополнительных параметров метода
//  ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки.
//
// Возвращаемое значение:
//   Структура - структура результата запроса.
//
//DynamicDirective
Функция ЗагрузитьДанныеДокументаИзSaby(Параметры, ДополнительныеПараметры = Неопределено, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	Перем SabyID, ДопПоля;
	Результат = Новый Структура("Успешно,Данные", Истина, Неопределено);
	
	SabyID = ИдСбисДокумента(Параметры);
	Если НЕ ЗначениеЗаполнено(SabyID) Тогда 
		Результат.Данные = "У документа нет идентификатора Saby, обновление данных невозможно!";
		Результат.Успешно = Ложь;
		Возврат Результат;
	КонецЕсли;
	Параметры.Вставить("ИДСбис", SabyID); 
	
	// BSLLS:FunctionOutParameter-off
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
		ОбщиеПараметрыЗагрузки = МодульТНОбщегоНазначенияСервер.ОбщиеПараметрыВыгрузкиЗагрузки();
	КонецЕсли;
	// BSLLS:FunctionOutParameter-on
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ДополнительныеПараметры.Свойство("ДопПоля", ДопПоля);
	КонецЕсли;
	
	Если ТипЗнч(ДопПоля) <> Тип("Строка") Тогда
		ДопПоля = "";
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура("Идентификатор,ДопПоля", SabyID, ДопПоля);
	Попытка
		РезультатСБИС = ВыполнитьМетодSaby_ПрочитатьДокумент(ОбщиеПараметрыЗагрузки, ПараметрыМетода);
		Результат.Данные = РезультатСБИС;
	Исключение
		ИнфоОшибки = ИнформацияОбОшибке();
		ТекстОшибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПричинаОшибкиИзЯдра", ИнфоОшибки.Описание);
		Результат.Данные = ТекстОшибки;
		Результат.Успешно = Ложь;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

#Область include_etrn_base_CommonModule_ТНЗагрузкаСервер_ПодключаемыйФункционал_ВзаимодействиеСОнлайном
#КонецОбласти // include_etrn_base_CommonModule_ТНЗагрузкаСервер_ПодключаемыйФункционал_ВзаимодействиеСОнлайном

#Область ВзаимодействиеСОнлайном_СлужебныеПроцедурыИФункции

//DynamicDirective

Процедура УдалитьНеиспользуемуюИнформациюВПодстановках(ДанныеТитула, ПредставленияТитула)
	Если ДанныеТитула[ПредставленияТитула.КодТитула] <> Неопределено Тогда
		ДанныеТитула.Вставить(ПредставленияТитула.КодТитула, Неопределено);
	КонецЕсли;
КонецПроцедуры

// Получает комментарий из подстановок указанного титула, полученного с онлайна.
//
// Параметры:
//  ДанныеПодстановки - Соответствие - значение подстановок с онлайна.
//
// Возвращаемое значение:
//   Строка - значение комментария
//
//DynamicDirective
Функция ОбработкаДанных_Подстановки_Комментарий(Знач ДанныеПодстановки) Экспорт
	Результат = "";
	Если Не ЗначениеЗаполнено(ДанныеПодстановки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеПодстановки) = Тип("Массив") Тогда
		ДанныеПодстановки = ДанныеПодстановки[ДанныеПодстановки.ВГраница()];
	КонецЕсли;
	
	Результат = ДанныеПодстановки["Комментарий"];
	
	Возврат Результат;
КонецФункции

// Получает дату из подстановок указанного титула, полученного с онлайна.
//
// Параметры:
//  ДанныеПодстановки - Соответствие - значение подстановок с онлайна.
//  КодТитула - Строка - код титула, для которого получаем дату.
//  ПараметрыОбработки - Структура - параметры обработки данных Saby.
//
// Возвращаемое значение:
//   Дата - значение даты
//
//DynamicDirective
Функция ОбработкаДанных_Подстановки_Дата(ДанныеПодстановки, КодТитула, ПараметрыОбработки)
	ДатаСтрокой = МодульКодаКлиент("Документы." + ПараметрыОбработки.ИмяМетаданных)
		.СформироватьДатуИзТитулаПодстановки(ДанныеПодстановки, КодТитула);
	Если Не ЗначениеЗаполнено(ДатаСтрокой) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатФункции = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД", ДатаСтрокой);
	Возврат РезультатФункции;
КонецФункции

// Получает идентификатор из подстановок указанного титула, полученного с онлайна.
//
// Параметры:
//  ДанныеПодстановки - Соответствие - значение подстановок с онлайна.
//  КодТитула - Строка - кода титула, для которого получаем дату.
//
// Возвращаемое значение:
//  Строка - идентификатор титула
//
//DynamicDirective
Функция ОбработкаДанных_Подстановки_Идентификатор(ДанныеПодстановки, КодТитула)
	Если КодТитула = "1115113" Тогда
		ИдФайл = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
			ДанныеПодстановки, "Документ.Данные.ИдФайл", "");
	ИначеЕсли КодТитула <> "" Тогда
		ИдФайл = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
			ДанныеПодстановки[КодТитула], "Файл.ИдФайл", "");
	Иначе
		Возврат "";
	КонецЕсли;
	
	РезультатФункции = Прав(ИдФайл, 36);
	Возврат РезультатФункции;
КонецФункции

// Обработка и добавление вложений события в отдельную коллекцию
//
// Параметры:
//	Вложения - Массив - список обработанных вложений
//	Событие - Соответствие - обработанное событие документа Saby
//	ПараметрыОбработки - Структура - параметры обработки данных
//
//DynamicDirective
Процедура ДобавитьВложения(Вложения, Событие, ПараметрыОбработки)
	ВложенияСОнлайна = Событие["Вложение"];
	Если ВложенияСОнлайна = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НазваниеЭтапа = Событие["Название"];
	
	КлючДатаВремя = "ДатаВремя";
	КлючИдентификатор = "Идентификатор";
	КлючКомментарий = "Комментарий";
	
	ДатаВремя_ = Событие[КлючДатаВремя];
	Комментарий_ = Событие[КлючКомментарий];
	
	МодульESD_ОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	МодульESD_ОбщегоНазначенияСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияСервер");
	Для Каждого Вложение Из ВложенияСОнлайна Цикл	
		Если ПараметрыОбработки.ИмяМетаданных = ТранспортнаяНакладнаяКлиент() Тогда
			ИмяФайла = МодульESD_ОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Вложение, "Файл.Имя", "");
			КлючСоответствияВложения = ИмяФайлаБезРасширения(ИмяФайла, МодульESD_ОбщегоНазначенияКлиентСервер);
		Иначе
			КлючСоответствияВложения = Вложение["Подтип"];
			// Если "Подтип" не заполнен, попробуем вытащить подтип (код титула) через название этапа
			Если ПустаяСтрока(КлючСоответствияВложения) И Не ПустаяСтрока(НазваниеЭтапа) Тогда
				ЗначениеЭтапа = МодульESD_ОбщегоНазначенияСервер
					.РезультатФункцииТитулов(ПараметрыОбработки.ИмяМетаданных, "ЗначениеПоЭтапу", НазваниеЭтапа);
				КлючСоответствияВложения = МодульESD_ОбщегоНазначенияСервер
					.РезультатФункцииТитулов(ПараметрыОбработки.ИмяМетаданных, "ПредставленияТитула", ЗначениеЭтапа)["КодТитула"];
			КонецЕсли;
		КонецЕсли;
		
		СтруктураВложения = Вложения[КлючСоответствияВложения];
		Если СтруктураВложения = Неопределено Тогда
			СтруктураВложения = Новый Соответствие;
			СтруктураВложения.Вставить(КлючДатаВремя,     Дата(1, 1, 1));
			СтруктураВложения.Вставить(КлючИдентификатор, "");
			СтруктураВложения.Вставить(КлючКомментарий,   "");
			Вложения.Вставить(КлючСоответствияВложения, СтруктураВложения);	
		КонецЕсли;
	
		Если СтруктураВложения[КлючДатаВремя] < ДатаВремя_ Тогда
			СтруктураВложения[КлючДатаВремя]     = ДатаВремя_;
			СтруктураВложения[КлючКомментарий]   = Комментарий_;
			СтруктураВложения[КлючИдентификатор] = Вложение[КлючИдентификатор];
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

// Обработка и добавление подстановок титула
//
// Параметры:
//	ИзмененияПоДокументу - Соотвествие - объект документа
//	ДанныеПодстановки - Соответствие - обработанные данные подстановки из вложений
//	ПараметрыОбработки - Структура - параметры обработки данных
//
// BSLLS:CognitiveComplexity-off
//
//DynamicDirective
Процедура ДобавитьПодстановкуТитула(ИзмененияПоДокументу, ДанныеПодстановки, ПараметрыОбработки)
	КодТитулаОнлайна = ДанныеПодстановки.КодТитулаОнлайна;
	ЗначенияПодстановок = ДанныеПодстановки.Значения;
	
	ПредставлениеТитула = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов", 
		ПараметрыОбработки.ИмяМетаданных, "ПредставлениеПоИмениПодстановки", КодТитулаОнлайна);
	Если Не ЗначениеЗаполнено(ПредставлениеТитула.КодТитула) Тогда
		Возврат;
	КонецЕсли;
	
	Модуль_ТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	МассивПодстановок = Модуль_ТНОбщегоНазначенияКлиентСервер.ЗначениеВМассив(ЗначенияПодстановок);
	Для Каждого ДанныеТитула Из МассивПодстановок Цикл
		КлючСоответствияВложения = КлючСоответствияВложения(ДанныеТитула);
		Если КлючСоответствияВложения = Неопределено Тогда
			КлючСоответствияВложения = ПредставлениеТитула.КодТитула;
		КонецЕсли;
	
		СтруктураВложения = ИзмененияПоДокументу["Вложения"][КлючСоответствияВложения];
		Если СтруктураВложения <> Неопределено Тогда
			// Дополним данные титула данными из соответствующего вложения
			ДобавитьДанныеИзВложения(ДанныеТитула, СтруктураВложения);
		КонецЕсли;
		
		ДополнитьДанныеИзПодстановки(ДанныеТитула, ПредставлениеТитула.КодТитула, ПараметрыОбработки);
		Подключаемый_ОбработкаДанныхТитула(ИзмененияПоДокументу, ПредставлениеТитула.ТипТитула, ДанныеТитула);
		Если ЕстьОшибкаПриЗагрузкеДанныхТитулов(ДанныеТитула, Модуль_ТНОбщегоНазначенияКлиентСервер) Тогда
			Продолжить;
		КонецЕсли;
		
		УдалитьНеиспользуемуюИнформациюВПодстановках(ДанныеТитула, ПредставлениеТитула);
		
		МассивТитулов = ИзмененияПоДокументу["Подстановки"][КодТитулаОнлайна];
		Если МассивТитулов = Неопределено Тогда
			МассивТитулов = Новый Массив;
			ИзмененияПоДокументу["Подстановки"].Вставить(КодТитулаОнлайна, МассивТитулов);
		КонецЕсли;
		
		ИдентификаторВложения = ДанныеТитула["ИдентификаторВложенияТитула"];
		Если ИдентификаторВложения = "" Тогда
			ИдентификаторВложения = ПредставлениеТитула.ИмяПодстановки;
		КонецЕсли;
		
		ИндексТитула = ИзмененияПоДокументу["ИдТитулов"][ИдентификаторВложения];
		Если ИндексТитула = Неопределено Тогда
			МассивТитулов.Добавить(ДанныеТитула);
			ИзмененияПоДокументу["ИдТитулов"].Вставить(ИдентификаторВложения, МассивТитулов.ВГраница());
		Иначе
			Если МассивТитулов.Количество() Тогда 
				МассивТитулов[ИндексТитула] = ДанныеТитула;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
// BSLLS:CognitiveComplexity-on

//DynamicDirective
Функция ЕстьОшибкаПриЗагрузкеДанныхТитулов(ДанныеТитула, Модуль_ТНОбщегоНазначенияКлиентСервер)
	
	Возврат ЗначениеЗаполнено(ДанныеТитула["ИдентификаторВложенияТитула"]) // для отрицательного закрытия титулов путевого листа
		И Не Модуль_ТНОбщегоНазначенияКлиентСервер.ЭтоУникальныйИдентификатор(ДанныеТитула["ИдентификаторВложенияТитула"]);
	
КонецФункции

// Получение "ключа" соответствия вложения и подстановки
//
// Параметры:
//	ДанныеТитула - Соответствие - данные титула из подстановки Saby
//
// Возвращаемое значение:
//	Строка - ключ соответствия
//
//DynamicDirective
Функция КлючСоответствияВложения(ДанныеТитула)
	
	МодульВыполнения = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	РезультатФункции = МодульВыполнения.ЗначениеИзКоллекции(ДанныеТитула, "Файл.ИмяФайлаБезРасширения");
		
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = МодульВыполнения.ЗначениеИзКоллекции(ДанныеТитула, "Документ.Дополнительная информация.Имя файла");
	КонецЕсли;
	
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = МодульВыполнения.ЗначениеИзКоллекции(ДанныеТитула, "Документ.Данные.НаимДок");
	КонецЕсли;		
		
	Возврат РезультатФункции;
	
КонецФункции

// Получение и запись данных из вложения Saby в коллекцию
//
// Параметры:
//	Соответствие - Соответствие - коллекция, куда добавляются данные
//	ДанныеВложения - Соответствие - источник данных
//
//DynamicDirective
Процедура ДобавитьДанныеИзВложения(Соответствие, ДанныеВложения)
	// Перенесем данные вложения в подстановку
	Соответствие.Вставить("Комментарий", ДанныеВложения["Комментарий"]);
	ДобавитьДатуИзВложения(Соответствие, ДанныеВложения);
	ДобавитьИдентификаторИзВложения(Соответствие, ДанныеВложения);
КонецПроцедуры

// Получение и запись даты из вложения Saby в коллекцию
//
// Параметры:
//	Соответствие - Соответствие - коллекция, куда добавляются данные
//	ДанныеВложения - Соответствие - источник данных
//
//DynamicDirective
Процедура ДобавитьДатуИзВложения(Соответствие, ДанныеВложения)
	Если Соответствие["ДатаВложенияТитула"] <> Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Соответствие.Вставить("ДатаВложенияТитула", 
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД", ДанныеВложения["ДатаВремя"]));
КонецПроцедуры
	
// Получение и запись идентификатора из вложения Saby в коллекцию
//
// Параметры:
//	Соответствие - Соответствие - коллекция, куда добавляются данные
//	ДанныеВложения - Соответствие - источник данных
//
//DynamicDirective
Процедура ДобавитьИдентификаторИзВложения(Соответствие, ДанныеВложения)
	Если Соответствие["ИдентификаторВложенияТитула"] <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Соответствие.Вставить("ИдентификаторВложенияТитула", ДанныеВложения["Идентификатор"]);
КонецПроцедуры

// Обработка и запись данных из подстановки Saby
//
// Параметры:
//	ДанныеПодстановки - Соответствие - данные подстановки Saby
//	КодТитула - Строка - код титула, к которой относится подстановка
//	ПараметрыОбработки - Структура - параметры обработки данных Saby
//
//DynamicDirective
Процедура ДополнитьДанныеИзПодстановки(ДанныеПодстановки, КодТитула, ПараметрыОбработки)
	Дата_ = ОбработкаДанных_Подстановки_Дата(ДанныеПодстановки, КодТитула, ПараметрыОбработки);
	Если ЗначениеЗаполнено(Дата_) Тогда
		ДанныеПодстановки.Вставить("ДатаВложенияТитула", Дата_);
	КонецЕсли;
	
	Если ДанныеПодстановки["ИдентификаторВложенияТитула"] = Неопределено Тогда
		ДанныеПодстановки.Вставить("ИдентификаторВложенияТитула", 
			ОбработкаДанных_Подстановки_Идентификатор(ДанныеПодстановки, КодТитула));
	КонецЕсли;
КонецПроцедуры

// Возвращает структуру параметров результата взаимодействия с Saby
//
// Параметры:
//	Ошибка - Булево - признак ошибки
//	Данные - Произвольно - данные Saby
//
// Возвращаемое значение:
//	Структура - параметры результата
//
//DynamicDirective
Функция SabyРезультатВзаимодействияСОнлайном(Ошибка = Ложь, Данные = Неопределено)
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Ошибка", Ошибка);
	РезультатФункции.Вставить("Данные", Данные);
	
	Возврат РезультатФункции;
КонецФункции

#Область include_etrn_base_CommonModule_ТНЗагрузкаСервер_ДополнительныйФункционал_ВзаимодействиеСОнлайном_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_CommonModule_ТНЗагрузкаСервер_ДополнительныйФункционал_ВзаимодействиеСОнлайном_СлужебныеПроцедурыИФункции

#КонецОбласти // ВзаимодействиеСОнлайном_СлужебныеПроцедурыИФункции

