
//DynamicDirective
// Получает дату из подстановок указанного титула, полученного с онлайна.
//
// Параметры:
//  ДанныеТитула - Соответствие - значение подстановок с онлайна.
//  Титул - ПеречислениеСсылка.Saby_ТипТитулаЗнП - титул, для которого получаем дату.
//  СтруктураВложения - Структура - структура данных вложения.
//
// Возвращаемое значение:
//   Дата - значение даты
//
Функция ДатаВложения(ДанныеТитула, Титул, СтруктураВложения = Неопределено) Экспорт
	
	ИмяФункцииПреобразованияДаты = "ESD_ТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД";
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Если ДанныеТитула["ДатаВложенияТитула"] <> Неопределено Тогда
		
		РезультатФункции = ДанныеТитула["ДатаВложенияТитула"];
		
	ИначеЕсли СтруктураВложения <> Неопределено Тогда
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, СтруктураВложения["ДатаВремя"]);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.Погрузка") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110339.Файл.Документ.ДатИнфГО", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110339.Файл.Документ.ВрИнфГО", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ПолучениеГруза") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110340.Файл.Документ.ДатИнфПрвПрием", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110340.Файл.Документ.ВрИнфПрвПрием", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ПриемкаГруза") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110341.Файл.Документ.ДатИнфГП", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110341.Файл.Документ.ВрИнфГП", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ВыдачаГруза") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110342.Файл.Документ.ДатИнфПрвВыд", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110342.Файл.Документ.ВрИнфПрвВыд", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.Переадресовка") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110343.Файл.Документ.ДатаИнфПА", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110343.Файл.Документ.ВрИнфПА", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ПереадресовкаУведомление") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1167009.Файл.Документ.ДатаУвПА", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1167009.Файл.Документ.ВрУвПА", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ЗаменаВодителяТС") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110344.Файл.Документ.ДатИнфЗамен", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110344.Файл.Документ.ВрИнфЗамен", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.СогласованиеСтоимости") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110346.Файл.Документ.ДатПУДИнфГО", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110346.Файл.Документ.ВрПУДИнфГО", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ИзменениеСтоимости") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110345.Файл.Документ.ДатПУДИнфПрв", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110345.Файл.Документ.ВрПУДИнфПрв", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.УведомлениеОУточнении") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "Документ.Данные.ДатаПол", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "Документ.Данные.ВремяПол", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	Иначе
		
		РезультатФункции = Неопределено;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective
// Получает идентификатор из подстановок указанного титула, полученного с онлайна.
//
// Параметры:
//  ДанныеТитула - Соответствие - значение подстановок с онлайна.
//  Титул - ПеречислениеСсылка.Saby_ТипТитулаЗнП - титул, для которого получаем дату.
//  СтруктураВложения - Структура - структура данных вложения.
//
// Возвращаемое значение:
//  Строка - идентификатор титула
//
Функция ИдентификаторВложения(ДанныеТитула, Титул, СтруктураВложения = Неопределено) Экспорт
	
	ПредставленияТитула = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов",
		ТранспортнаяНакладнаяКлиент(), "ПредставленияТитула", Титул);
	
	Если ДанныеТитула["ИдентификаторВложенияТитула"] <> Неопределено Тогда
		ИдФайл = ДанныеТитула["ИдентификаторВложенияТитула"];
	ИначеЕсли СтруктураВложения <> Неопределено Тогда
		ИдФайл = СтруктураВложения["Идентификатор"];
	ИначеЕсли ПредставленияТитула.КодТитула = "1115113" Тогда
		ИдФайл = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
			ДанныеТитула, "Документ.Данные.ИдФайл", "");
	ИначеЕсли ПредставленияТитула.КодТитула <> "" Тогда
		ИдФайл = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
			ДанныеТитула[ПредставленияТитула.КодТитула], "Файл.ИдФайл", "");
	Иначе
		ИдФайл = "";
	КонецЕсли;
	
	РезультатФункции = Прав(ИдФайл, 36);
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective

Процедура ДанныеДокументаИзСБИС(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, Результат) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыЗагрузки.ДанныеДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	Ошибки = МодульТНОбщегоНазначенияКлиентСервер.СтруктураОшибок(ПараметрыЗагрузки.ИмяМетаданных);
	
	ДопПоля = "ДопДействия,ТекущиеЭтапы,Подстановки,Расширение,Стороны,ИдентификаторУчастника";
	// Стороны - обогащают посдстановки данными по ответсвенным МО, ТО, выезд и заезд
	// ЗаменаВодителя - обогащает данные ид замены водителя - основания и документа замены
	Если ПараметрыЗагрузки.ИмяМетаданных = ПутевойЛистКлиент() Тогда 
		ДопПоля = ДопПоля + ",ЗаменаВодителя";
	ИначеЕсли ПараметрыЗагрузки.ИмяМетаданных = ЗаказНаПеревозкуКлиент() Тогда
		ДопПоля = ДопПоля + ",ГИС_УИД";
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ДопПоля", ДопПоля);
	
	Попытка
		РезультатSaby = ЗагрузитьДанныеДокументаИзSaby(ПараметрыЗагрузки, ДополнительныеПараметры, ОбщиеПараметрыЗагрузки);
		Если НЕ РезультатSaby.Успешно Тогда
			ВызватьИсключение РезультатSaby.Данные;
		КонецЕсли;
		ПараметрыЗагрузки.ДанныеДокумента = РезультатSaby.Данные;
	Исключение
		ИнфоОшибки = ИнформацияОбОшибке();
		ТекстОшибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПричинаОшибкиИзЯдра", ИнфоОшибки.Описание);
		Ошибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ДобавитьОшибкуПользователю", Ошибки, Неопределено, ТекстОшибки);
		КлючСоответствия = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").КлючСсылка(ПараметрыЗагрузки.Ссылка);
		Результат.Ошибки.Вставить(КлючСоответствия, Ошибки); 
		Возврат;
	КонецПопытки;
	
	Вложения = Новый Соответствие;
	ДобавитьВложенияИзСобытий(Вложения, ПараметрыЗагрузки.ДанныеДокумента["Событие"], ПараметрыЗагрузки.ИмяМетаданных);
	ПараметрыЗагрузки.ДанныеДокумента.Вставить("Вложения", Вложения["Вложения"]);
	
	ДанныеПодстановок = ПараметрыЗагрузки.ДанныеДокумента["Подстановки"];
	Если ЗначениеЗаполнено(ДанныеПодстановок) Тогда
		ДополнительныеПараметры = Новый Структура("Ошибки", Новый Структура);
		
		ПараметрыЗагрузки.ДанныеДокумента.Вставить("Подстановки", Новый Соответствие);
		ПараметрыЗагрузки.ДанныеДокумента.Вставить("ИдТитулов",   Новый Соответствие);
		Для Каждого Подстановки Из ДанныеПодстановок Цикл
			ДанныеПодстановки = Новый Структура("КодТитулаОнлайна, Значения", Подстановки.Ключ, Подстановки.Значение);
			
			ДобавитьПодстановкуТитула(
				ПараметрыЗагрузки.ДанныеДокумента,
				ДанныеПодстановки,
				ПараметрыЗагрузки.ИмяМетаданных,
				ДополнительныеПараметры);
		КонецЦикла;
			
		Для Каждого Ошибка Из ДополнительныеПараметры.Ошибки Цикл
			Ошибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ДобавитьОшибкуПользователю", Ошибки, Неопределено, Ошибка.Значение);
			КлючСоответствия = МодульТНОбщегоНазначенияКлиентСервер.КлючСсылка(ПараметрыЗагрузки.Ссылка);
			Результат.Ошибки.Вставить(КлючСоответствия, Ошибки); 	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//DynamicDirective

Функция ИдСбисДокумента(ПараметрыЗагрузки)
	ИДСбис = "";
	
	Если ТипЗнч(ПараметрыЗагрузки.Ссылка) = Тип("Структура") Тогда
		ИДСбис = ПараметрыЗагрузки.Ссылка.Идентификатор;
	Иначе	
		ДанныеСостояния = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ДанныеСостоянияОбъекта", ПараметрыЗагрузки.Ссылка);
		Если ДанныеСостояния <> Неопределено Тогда 
			
			Если МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ДанныеСостояния, "UID") Тогда 
				ИДСбис = ДанныеСостояния.UID;
			Иначе 
				ИДСбис = ДанныеСостояния.ИД;
			КонецЕсли;	
			
			ПараметрыЗагрузки.Вставить("ТипИсточника", ДанныеСостояния.ТипИсточника);
			ПараметрыЗагрузки.Вставить("ИдентификаторИсточника", ДанныеСостояния.ИдентификаторИсточника);
			ПараметрыЗагрузки.Вставить("Ссылка", ДанныеСостояния.Ссылка);		
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ИДСбис;
КонецФункции

//DynamicDirective

Процедура ДобавитьВложенияИзСобытий(ИзмененияПоДокументу, СобытияСОнлайна, ИмяМетаданных)
	
	Вложения = ИзмененияПоДокументу["Вложения"];
	Если Вложения = Неопределено Тогда
		Вложения = Новый Соответствие;
		ИзмененияПоДокументу.Вставить("Вложения", Вложения);
	КонецЕсли;
	
	Если СобытияСОнлайна = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Событие Из СобытияСОнлайна Цикл
		
		Если Событие["Вложение"] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьВложения(Вложения, Событие, ИмяМетаданных);
		
	КонецЦикла;
	
КонецПроцедуры

//DynamicDirective

Процедура ДобавитьВложения(Вложения, Событие, ИмяМетаданных)
	
	ВложенияСОнлайна = Событие["Вложение"];
	
	Если ВложенияСОнлайна = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКлючаДатаВремя     = "ДатаВремя";
	ИмяКлючаИдентификатор = "Идентификатор";
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Для Каждого Вложение Из ВложенияСОнлайна Цикл
		
		Если ИмяМетаданных = ТранспортнаяНакладнаяКлиент() Тогда
			ИмяФайлаСРасширением     = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Вложение, "Файл.Имя", "");
			КлючСоответствияВложения = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(ИмяФайлаСРасширением, ".")[0];
		Иначе
			КлючСоответствияВложения = Вложение["Подтип"];
		КонецЕсли;
		
		СтруктураВложения = Вложения[КлючСоответствияВложения];
		Если СтруктураВложения = Неопределено Тогда
			
			СтруктураВложения = Новый Соответствие;
			СтруктураВложения.Вставить(ИмяКлючаДатаВремя,     Дата(1, 1, 1));
			СтруктураВложения.Вставить(ИмяКлючаИдентификатор, "");
			Вложения.Вставить(КлючСоответствияВложения, СтруктураВложения);
			
		КонецЕсли;
		
		ДатаВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Событие, "ДатаВремя");
		ДатаВремя = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД", ДатаВремя);
		
		Если СтруктураВложения[ИмяКлючаДатаВремя] < ДатаВремя Тогда
			СтруктураВложения[ИмяКлючаДатаВремя]     = ДатаВремя;
			СтруктураВложения[ИмяКлючаИдентификатор] = Вложение[ИмяКлючаИдентификатор];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//DynamicDirective

Процедура ДобавитьПодстановкуТитула(ИзмененияПоДокументу, ДанныеПодстановки, ИмяМетаданных, ДопПараметры = Неопределено)
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура("Ошибки", Новый Структура);
	КонецЕсли;
	
	КодТитулаОнлайна = ДанныеПодстановки.КодТитулаОнлайна;
	ЗначенияПодстановок = ДанныеПодстановки.Значения;
	
	Титул = ВыполнитьНаСервере(
		"ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов", ИмяМетаданных, "ЗначениеПоИмениПодстановки", КодТитулаОнлайна);
	Если Не ЗначениеЗаполнено(Титул) Тогда
		Возврат;
	КонецЕсли;
	
	ПредставленияТитула = ВыполнитьНаСервере(
		"ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов", ИмяМетаданных, "ПредставленияТитула", Титул);
	
	Модуль_ТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	МассивПодстановок = Модуль_ТНОбщегоНазначенияКлиентСервер.ЗначениеВМассив(ЗначенияПодстановок);
	Для Каждого ДанныеТитула Из МассивПодстановок Цикл
		КлючСоответствияВложения = КлючСоответствияВложения(ДанныеТитула, ПредставленияТитула);
		
		СтруктураВложения = ИзмененияПоДокументу["Вложения"][КлючСоответствияВложения];
		
		ДобавитьИнформациюВПодстановки(ДанныеТитула, Титул, СтруктураВложения, ИмяМетаданных);
		Если ЕстьОшибкаПриЗагрузкеДанныхТитулов(ДанныеТитула, Модуль_ТНОбщегоНазначенияКлиентСервер) Тогда
			ДопПараметры.Ошибки.Вставить("ОшибкаЗагрузкиДанныхТитулов", 
				"Обнаружена ошибка при загрузке данных титулов из Saby! Повторно выполните обновление документа");
			Продолжить;
		КонецЕсли;
		УдалитьНеиспользуемуюИнформациюВПодстановках(ДанныеТитула, ПредставленияТитула);
		
		МассивТитулов = ИзмененияПоДокументу["Подстановки"][КодТитулаОнлайна];
		Если МассивТитулов = Неопределено Тогда
			МассивТитулов = Новый Массив;
			ИзмененияПоДокументу["Подстановки"].Вставить(КодТитулаОнлайна, МассивТитулов);
		КонецЕсли;
		
		ИдентификаторВложения = ДанныеТитула["ИдентификаторВложенияТитула"];
		Если ИдентификаторВложения = "" Тогда
			ИдентификаторВложения = ПредставленияТитула.ИмяПодстановки;
		КонецЕсли;
		
		ИндексТитула = ИзмененияПоДокументу["ИдТитулов"][ИдентификаторВложения];
		Если ИндексТитула = Неопределено Тогда
			МассивТитулов.Добавить(ДанныеТитула);
			ИзмененияПоДокументу["ИдТитулов"].Вставить(ИдентификаторВложения, МассивТитулов.ВГраница());
		Иначе
			Если МассивТитулов.Количество() Тогда 
				МассивТитулов[ИндексТитула] = ДанныеТитула;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

//DynamicDirective

Функция ЕстьОшибкаПриЗагрузкеДанныхТитулов(ДанныеТитула, Модуль_ТНОбщегоНазначенияКлиентСервер)
	
	Возврат ЗначениеЗаполнено(ДанныеТитула["ИдентификаторВложенияТитула"]) // для отрицательного закрытия титулов путевого листа
		И Не Модуль_ТНОбщегоНазначенияКлиентСервер.ЭтоУникальныйИдентификатор(ДанныеТитула["ИдентификаторВложенияТитула"]);
	
КонецФункции

//DynamicDirective

Функция КлючСоответствияВложения(ДанныеТитула, ПредставленияТитула)
	
	МодульВыполнения = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	РезультатФункции = МодульВыполнения.ЗначениеИзКоллекции(ДанныеТитула, "Файл.ИмяФайлаБезРасширения");
		
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = МодульВыполнения.ЗначениеИзКоллекции(ДанныеТитула, "Документ.Дополнительная информация.Имя файла");
	КонецЕсли;
	
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = МодульВыполнения.ЗначениеИзКоллекции(ДанныеТитула, "Документ.Данные.НаимДок");
	КонецЕсли;		
		
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = ПредставленияТитула.КодТитула;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective

Процедура ДобавитьИнформациюВПодстановки(ДанныеТитула, Титул, СтруктураВложения, ИмяМетаданных)
	
	ДанныеТитула.Вставить("ДатаВложенияТитула", ДатаВложения(ДанныеТитула, Титул, СтруктураВложения));
	
	ДанныеТитула.Вставить("ИдентификаторВложенияТитула", ИдентификаторВложения(ДанныеТитула, Титул, СтруктураВложения));
	
КонецПроцедуры

//DynamicDirective

Процедура УдалитьНеиспользуемуюИнформациюВПодстановках(ДанныеТитула, ПредставленияТитула)
	
	Если ДанныеТитула[ПредставленияТитула.КодТитула] <> Неопределено Тогда
		ДанныеТитула.Вставить(ПредставленияТитула.КодТитула, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

//DynamicDirective

Функция РаспознаваниеВУ(ДопПараметры, Знач ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДопПараметры.ОтветНаКлиенте <> Неопределено Тогда
		Возврат ДопПараметры.ОтветНаКлиенте;
	КонецЕсли;
	
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
			ДопПараметры.context_params);
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Файл", ДопПараметры.ЗакодированныеДД);
	
	ИмяМетода = "sabyEmployee.RecognizeDriverLicense";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда
		
		Ошибка   = Истина;
		Описание = Ответ.ОписаниеОшибки;
		
	ИначеЕсли Не ЗначениеЗаполнено(Ответ.Результат) Или Не ЗначениеЗаполнено(Ответ.Результат["result"]) Тогда
		
		Ошибка   = Истина;
		Описание = "Ошибка выполнения распознавания ВУ / " + ИмяМетода;
		
	Иначе
		Ошибка = Ложь;
	КонецЕсли;
	
	Попытка 
		
		// заберем только распознанные данные 
		ДанныеВУ = Ответ.Результат["result"]["RecognizedData"]["fields"];
		Ответ.Результат = ДанныеВУ;
		
	Исключение
		
		Ошибка = Истина;
		Описание = "Ошибка обработки результата распознавания ВУ / " + ИмяМетода;
		
	КонецПопытки;
	
	Если Ошибка Тогда 
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			Неопределено,
			"Не удалось выполнить распознавание ВУ / " + ИмяМетода,
			Описание);
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

//DynamicDirective

Функция ЗагрузитьДанныеТСПоРегНомеру(ДопПараметры, Знач ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДопПараметры.ОтветНаКлиенте <> Неопределено Тогда
		Возврат ДопПараметры.ОтветНаКлиенте;
	КонецЕсли;
	
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
			ДопПараметры.context_params);
	КонецЕсли;
	
	ВнутренниеПараметрыМетода = Новый Структура;
	ВнутренниеПараметрыМетода.Вставить("filter", Новый Структура("RegNumber", ДопПараметры.РегистрационныйНомер));
	ВнутренниеПараметрыМетода.Вставить("limit",  1);
	ВнутренниеПараметрыМетода.Вставить("page",   0);
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("params", ВнутренниеПараметрыМетода);
	
	ИмяМетода = "sabyVehicle.GetList";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда 
		
		Ответ.Результат = Ответ.ОписаниеОшибки;
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			Неопределено,
			"Не удалось выполнить загрузку данных по регистрационному номеру / " + ИмяМетода,
			Ответ.ОписаниеОшибки);
			
	Иначе
		
		НайденныеМашины = Ответ.Результат["result"]["cars"];
		Если НайденныеМашины.Количество() > 0 Тогда
			Ответ.Результат = НайденныеМашины[0];
		Иначе
			Ответ.Результат = "Заполнение не выполнено. Не найдены данные транспортного средства по указанному регистрационному номеру.";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ.Результат;
	
КонецФункции

//DynamicDirective

Функция ЗагрузитьДанныеТСПоВИН(ДопПараметры, Знач ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДопПараметры.ОтветНаКлиенте <> Неопределено Тогда
		Возврат ДопПараметры.ОтветНаКлиенте;
	КонецЕсли;
	
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
			ДопПараметры.context_params);
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("VIN", ДопПараметры.ВИН);
	
	ИмяМетода = "sabyVehicle.ByVIN";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда 
		
		Ответ.Результат = Ответ.ОписаниеОшибки;
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			Неопределено,
			"Не удалось проверить данные в ГИБДД по ВИН / " + ИмяМетода,
			Ответ.ОписаниеОшибки);
			
	Иначе			
		Ответ.Результат = Ответ.Результат["result"];
	КонецЕсли;
			
	Возврат Ответ.Результат;
	
КонецФункции

//DynamicDirective

Функция ЗагрузитьПочтовыеЯщикиКонтрагента(ДопПараметры, Знач ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДопПараметры.ОтветНаКлиенте <> Неопределено Тогда
		Возврат ДопПараметры.ОтветНаКлиенте;
	КонецЕсли;
	
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
			ДопПараметры.context_params);
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Участник", ДопПараметры.Участник);
	
	ИмяМетода = "СБИС.ИнформацияОКонтрагенте";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда 
		
		Ответ.Результат = Ответ.ОписаниеОшибки;
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			Неопределено,
			"Не удалось получить список ящиков контрагента / " + ИмяМетода,
			Ответ.ОписаниеОшибки);
			
	Иначе			
		Ответ.Результат = Ответ.Результат["result"];
	КонецЕсли;
			
	Возврат Ответ.Результат;
	
КонецФункции

//DynamicDirective
// Выполенение метода внешнего API
//
// Параметры:
//  ИмяМетода       - Строка    - название выполняемого метода
//  ПараметрыМетода - Структура - параметры выполнения метода
//  ОбщиеПараметрыЗагрузки - Структура - структура общих параметров
//  ДополнительныеПараметры - Структура - структура дополнительных параметров метода
//
// Возвращаемое значение:
//   Структура - имеет всегда фиксированны набор ключей
//       * Результат      - Соответствие - ответ сервиса. 
//       * Ошибка         - Булево       - признак возникновения ошибки.
//       * ОписаниеОшибки - Строка       - описание ошибки.
//
Функция ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки, ДополнительныеПараметры = Неопределено)
	Ошибка         = Ложь;
	Результат      = Неопределено;
	ОписаниеОшибки = "";
	
	Попытка	
		ДополнитьПараметрыМетодаAPI(
			ОбщиеПараметрыЗагрузки.ОбъектОбработки, ИмяМетода, ПараметрыМетода);
		
		Результат = ОбщиеПараметрыЗагрузки.ОбъектОбработки.local_helper_exec_method(
			ОбщиеПараметрыЗагрузки.context_params,
			ИмяМетода,
			ПараметрыМетода,
			Истина,
			ДополнительныеПараметры);
	Исключение
		
		Ошибка          = Истина;
		ИнфоОшибки      = ИнформацияОбОшибке();
		СтруктураОшибки = ОбщиеПараметрыЗагрузки.ОбъектОбработки.NewExtExceptionСтруктура(ИнфоОшибки);
		ОписаниеОшибки  = СтруктураОшибки.message;
		
	КонецПопытки;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Результат",      Результат);
	СтруктураОтвета.Вставить("Ошибка",         Ошибка);
	СтруктураОтвета.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//DynamicDirective

Процедура ДополнитьПараметрыМетодаAPI(ОбъектОбработки, ИмяМетода, ПараметрыМетода)
		
	Если ИмяМетода = "CloudStatistics.Send" И НЕ ЗначениеЗаполнено(ПараметрыМетода.data.context) Тогда
		
		Если ЭтоУниверсальноеРасширение() Тогда			
			context = ИмяФункционалаЭПДСтатистика();					
		Иначе
			
			Настройки = ОбъектОбработки.ОбщиеНастройкиПрочитать();			
			Если ЗначениеЗаполнено(Настройки)
				И Настройки.Свойство("ExtSysSettingsId") Тогда			
				
				context = Настройки.ExtSysSettingsId;
				
			Иначе
				
				// по дефолту ставим имя продукта, вместо пустого имени конфигурации
				МассивФункционала = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ПараметрыМетода.data.functional, "_");
				ИмяПродукта       = МассивФункционала[1];
				
				context = СтрЗаменить(ИмяПродукта, "1С ", "");
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПараметрыМетода.data.context = context;
		
	КонецЕсли;
	
КонецПроцедуры

#Область Статистика

//DynamicDirective
// Запись статистики на прямую в облако, в обход стандартных методов
//
// Параметры:
//  ПараметрыЗагрузки - Структура - структура загрузки
//  ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
Процедура ЗаписатьСтатистикуНапрямую(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки) Экспорт
	
	ПараметрыМетода = ПараметрыМетодаЗаписиСтатистики(ПараметрыЗагрузки.ТекущийТитул, "", ПараметрыЗагрузки.Ссылка);
	
	ЗаписатьСтатистикуВОблако(ПараметрыЗагрузки.Ссылка, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	// Дополнительная запись стастики. Требуется в исключительных случаях
	ЗаписатьДополнительнуюСтатистику(ПараметрыЗагрузки, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
КонецПроцедуры

//DynamicDirective

Функция ПараметрыМетодаЗаписиСтатистики(ТекущийТитул, ИмяДействия, ДокументСсылка = Неопределено,
	ИмяФункционала = "", ИмяКонтекста = "") Экспорт
	
	ИмяФункционалаСтатистики = ИмяФункционала;
	ИмяДействияСтатистики    = ИмяДействия;
	
	Если ДокументСсылка <> Неопределено Тогда
		Если ТипЗнч(ДокументСсылка) = Тип("Структура") Тогда
			ИмяМетаданных = ДокументСсылка.ИмяМетаданных;
		Иначе
			ИмяМетаданных = МодульКода("ESD_ТНОбщегоНазначенияСервер").ИмяМетаданныхДокумента(ДокументСсылка);
		КонецЕсли;
		
		ПараметрыAPI   = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыДокументаДляАПИ(ИмяМетаданных);
		ИмяФункционалаСтатистики = ИмяПродуктаЭПДСтатистика() + ПараметрыAPI.Тип;
		
		ЭтоДинамическийТитул = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов",
			ИмяМетаданных, "ЭтоДинамическийТитул", ТекущийТитул) = Истина;
		
		Если ЭтоДинамическийТитул Тогда
			ИмяДействияСтатистики = "Переход\" + СокрЛП(ТекущийТитул);
		Иначе
			ИмяДействияСтатистики = "Переход";
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	
	Данные = Новый Структура;
	Данные.Вставить("action",     ИмяДействияСтатистики);
	Данные.Вставить("context",    ИмяКонтекста);
	Данные.Вставить("functional", ИмяФункционалаСтатистики);
	
	ПараметрыМетода.Вставить("data", Данные);

	Возврат ПараметрыМетода;
	
КонецФункции

//DynamicDirective

Процедура ЗаписатьСтатистикуВОблако(ДокументСсылка, Знач ПараметрыМетода, Знач ОбщиеПараметрыЗагрузки) Экспорт
	
	ИмяМетода = "CloudStatistics.Send";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда
		
		Ошибка   = Истина;
		Описание = Ответ.ОписаниеОшибки;
		
	ИначеЕсли Не ЗначениеЗаполнено(Ответ.Результат) Или Не ЗначениеЗаполнено(Ответ.Результат["result"]) Тогда
		
		Ошибка   = Истина;
		Описание = "Ошибка выполнения записи статистики / " + ИмяМетода;
		
	Иначе
		Ошибка = Ложь;
	КонецЕсли;
	
	Если Ошибка Тогда
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			ДокументСсылка,
			"Не записана статистика документа / " + ИмяМетода,
			Описание);
		
	КонецЕсли;
	
КонецПроцедуры

//DynamicDirective

Процедура ЗаписатьДополнительнуюСтатистику(ПараметрыЗагрузки, ПараметрыМетода, ОбщиеПараметрыЗагрузки)
	
	// Это первый титул ЭПЛ и это замена водителя или несколько водителей 
	// запишем доп статистику - для сбора данных требуется отдельная метрика
	Если ПараметрыЗагрузки.ИмяМетаданных = ПутевойЛистКлиент() И ПустаяСтрока(ПараметрыЗагрузки.ТекущийТитул) Тогда
		
		ПараметрыМетода.data.action = "";
		
		// Замена водителя		
		ЗначениеПЛПредыдущий = МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗначениеРеквизитаОбъекта(
			ПараметрыЗагрузки.Ссылка, "ПЛПредыдущий");
			
		ЭтоЗаменаВодителя = ЗначениеЗаполнено(ЗначениеПЛПредыдущий);
		Если ЭтоЗаменаВодителя Тогда			
			ПараметрыМетода.data.action = "Переход\ЗаменаВодителя";						
		КонецЕсли;
		
		// Несколько водителей
		ВодителиСтрокой = МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗначениеРеквизитаОбъекта(
			ПараметрыЗагрузки.Ссылка, "Водитель"); 
			
		МассивВодителей = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ВодителиСтрокой, ",");	
		Если МассивВодителей.Количество() > 1 Тогда
			ПараметрыМетода.data.action = "Переход\НесколькоВодителей";
		КонецЕсли;	
		
		// Запись в облако
		Если ЗначениеЗаполнено(ПараметрыМетода.data.action) Тогда						
			ЗаписатьСтатистикуВОблако(ПараметрыЗагрузки.Ссылка, ПараметрыМетода, ОбщиеПараметрыЗагрузки);			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//DynamicDirective

Процедура ЗаписатьСтатистикуРедактора(Ссылка, Событие) Экспорт

	ПараметрыМетода = ПараметрыМетодаЗаписиСтатистики("", Событие, , "1C MappingEditor");
		
	Модуль_ESDСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	ОбработкаОбъект  = Модуль_ESDСервер.ОбъектОбработки();
	context_params   = Модуль_ESDСервер.ПроверитьНаличиеПараметровПодключенияЭПД();
	
	ОбщиеПараметры = Новый Структура;
	ОбщиеПараметры.Вставить("ОбъектОбработки", ОбработкаОбъект);	
	ОбщиеПараметры.Вставить("context_params",  context_params);
	
	ЗаписатьСтатистикуВОблако(Ссылка, ПараметрыМетода, ОбщиеПараметры);
	
КонецПроцедуры	

//DynamicDirective

Процедура ЗаписатьСтатистикуВызоваВОблако(Событие, Функционал, Форма = Неопределено) Экспорт
	
	Попытка 
		
		ОбщиеПараметры = ОбщиеПараметрыЗагрузки(Форма);	
		
		ПараметрыМетода = ПараметрыМетодаЗаписиСтатистики("", Событие, , Функционал, ОбщиеПараметры.context);
		
		ЗаписатьСтатистикуВОблако(Неопределено, ПараметрыМетода, ОбщиеПараметры);
		
	Исключение
		
 		Информация = ИнформацияОбОшибке();
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации", Неопределено,
		"Ошибка записи статистики", Информация.Описание);
		
	КонецПопытки;

КонецПроцедуры    

//DynamicDirective 
// Возвращает Общие параметры для обмена по API со СБИС.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Если ВО, то форма откуда вызов, если расширение, то неопределено
//
// Возвращаемое значение:
//   Структура - адрес двоичных данных файла печатной формы.
//
Функция ОбщиеПараметрыЗагрузки(Форма) Экспорт
	
	Модуль_ESDСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияСервер");
	context_params   = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД", Неопределено);
	
	Если Форма <> Неопределено И Форма.ЭтоВО Тогда
		context = "ВО2";
		ТранспортВО = Модуль_ESDСервер.ТранспортВО(Форма, context_params);
		ОбработкаОбъект = ТранспортВО.ТранспортИнтеграции;
	Иначе
		
		Если Модуль_ESDСервер.ЭтоCF() Тогда
			context = "ESD_CF";
		Иначе
			context = "ESD";
		КонецЕсли;
		ОбработкаОбъект  = Модуль_ESDСервер.ОбъектОбработки();
	КонецЕсли;
	
	ОбщиеПараметры = Новый Структура;
	ОбщиеПараметры.Вставить("ОбъектОбработки", ОбработкаОбъект);
	ОбщиеПараметры.Вставить("context_params",  context_params);
	ОбщиеПараметры.Вставить("context",  context);
	
	Возврат ОбщиеПараметры;
	
КонецФункции

#КонецОбласти // Статистика

//DynamicDirective
// Возвращает двоичные данные файла печатной формы из СБИС.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры загрузки
//  ДополнительныеПараметры - Структура - дополнительные параметры печати
//  АдресФайлаВСбис - Строка - адрес печатной формы pdf
//
// Возвращаемое значение:
//   Строка - адрес двоичных данных файла печатной формы.
//
Функция АдресДвоичныхДанныхФайла(ПараметрыЗагрузки, ДополнительныеПараметры, Знач АдресФайлаВСбис = Неопределено) Экспорт
	
	РезультатФункции = Неопределено;
	
	Если Не ПараметрыЗагрузки.ЗагрузкаТребуется Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Если АдресФайлаВСбис = Неопределено Тогда
		АдресФайлаВСбис = СсылкаНаПечатнуюФорму(ПараметрыЗагрузки, ДополнительныеПараметры);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресФайлаВСбис) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Если ТипЗнч(АдресФайлаВСбис) = Тип("Массив") Тогда
		ДвоичныеДанныеФайла = Новый Массив;
		Для Каждого ТекущийАдресФайлаВСбис Из АдресФайлаВСбис Цикл
			ТекущиеДвоичныеДанные = ПараметрыЗагрузки.ОбъектОбработки.local_helper_download_from_link(
				ПараметрыЗагрузки.context_params,
				ТекущийАдресФайлаВСбис);
			ДвоичныеДанныеФайла.Добавить(ТекущиеДвоичныеДанные);
		КонецЦикла;
	Иначе
		Если ДополнительныеПараметры.Свойство("ПечатнаяФорма") Тогда
			ОбработатьИзменениеПечатнойФормы(АдресФайлаВСбис, ДополнительныеПараметры.ПечатнаяФорма);
		КонецЕсли;
		ДвоичныеДанныеФайла = ПараметрыЗагрузки.ОбъектОбработки.local_helper_download_from_link(
			ПараметрыЗагрузки.context_params,
			АдресФайлаВСбис);
	КонецЕсли;
	
	РезультатФункции = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, ПараметрыЗагрузки.УникальныйИдентификаторФормы);
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective
Функция СсылкаНаПечатнуюФорму(ПараметрыЗагрузки, ДополнительныеПараметры)
	
	РезультатФункции = Неопределено;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.УИДСбис) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Идентификатор", ПараметрыЗагрузки.УИДСбис);
	Если ДополнительныеПараметры.ЭтоПечатьQRКода Тогда
		ПараметрыМетода.Вставить("ДопПоля","Расширение,QRFrameLinks");
	Иначе
		ПараметрыМетода.Вставить("ДопПоля","Подстановки,Расширение");
	КонецЕсли;
	
	Попытка
		Результат = ПараметрыЗагрузки.ОбъектОбработки.local_helper_read_document(
			ПараметрыЗагрузки.context_params,
			ПараметрыМетода);
		
		Если ДополнительныеПараметры.ВыгрузкаАрхива Тогда
			РезультатФункции = Результат["СсылкаНаАрхив"];
		ИначеЕсли ДополнительныеПараметры.ЭтоПечатьQRКода Тогда
			РезультатФункции = Результат["QRFrameLinks"];
		Иначе
			РезультатФункции = Результат["СсылкаНаPDF"];
		КонецЕсли;
	Исключение
		
		ИнфоОшибки = ИнформацияОбОшибке();
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			ПараметрыЗагрузки.СсылкаНаДокумент,
			"Не удалось получить печатную форму",
			ИнфоОшибки.Описание);
		
	КонецПопытки;
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective
// Получает справочные данные с онлайна.
//
// Параметры:
//  ИмяСправочника - Строка - наименование справочника, который необходимо получить с онлайна.
//  ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
// Возвращаемое значение:
//   Массив - данные зависят от справочника, получаемого с онлайна.
//
Функция СправочникСОнлайна(ИмяСправочника, ОбщиеПараметрыЗагрузки) Экспорт
	
	ПараметрыМетода = Новый Структура();
	ПараметрыМетода.Вставить("ДопПоля",    Новый Массив);
	ПараметрыМетода.Вставить("Фильтр",     Новый Структура());
	ПараметрыМетода.Вставить("Сортировка", null);
	ПараметрыМетода.Вставить("Навигация",  null);
	
	ПараметрыМетода.Фильтр.Вставить("s", Новый Массив);
	ПараметрыМетода.Фильтр.Вставить("f", 0);
	ПараметрыМетода.Фильтр.Вставить("d", Новый Массив);
	ПараметрыМетода.Фильтр.Вставить("_type", "record");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("n", "Справочник");
	СтруктураПараметров.Вставить("t", "Строка");
	
	ПараметрыМетода.Фильтр.s.Добавить(СтруктураПараметров);
	
	ПараметрыМетода.Фильтр.d.Добавить(ИмяСправочника);
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("protocol",  6);
	
	result = ОбщиеПараметрыЗагрузки.ОбъектОбработки.local_helper_exec_method(
		ОбщиеПараметрыЗагрузки.context_params,
		"Классификаторы.ПолучитьСправочникЦеликом",
		ПараметрыМетода,
		Истина,
		ДопПараметры,
		ОбщиеПараметрыЗагрузки.context_params.api_url + "/service/?srv=1");
		
	Результат = result["result"];
	
	Возврат Результат["d"];
	
КонецФункции

//DynamicDirective
// Получение из СБИС текущего варианта печатной формы документа
//
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры загрузки печатной формы.
//  ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки 
//
// Возвращаемое значение:
//   Строка - Id печатной формы
//
Функция ТекущийВариантПечатнойФормы(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	ДополнительныеПараметры = Новый Структура("ДопПоля", "Подстановки,Расширение");
	Результат = ЗагрузитьДанныеДокументаИзSaby(ПараметрыЗагрузки, ДополнительныеПараметры, ОбщиеПараметрыЗагрузки);
	Если НЕ Результат.Успешно Тогда
		Возврат "";
	КонецЕсли;
	
	ИнформационныеПоля = ИнформационныеПоляДокументаSaby(Результат.Данные);
	Возврат МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(ИнформационныеПоля, "Текст.VisualForm");	
КонецФункции

//DynamicDirective
// Получение из СБИС вариантов печатной формы документа
//
// Параметры:
//  ИмяМетаданных - Строка - вид документа
//	ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
// Возвращаемое значение:
//   Соответствие - представление объекта Record, содержащий доступные печатные формы документа
//
Функция ВариантыПечатнойФормы(ИмяМетаданных, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	Результат = Новый Структура("Ошибка,Данные", Ложь, Неопределено);
	
	ПараметрыМетода = Новый Структура("ДопПоля,Навигация,Сортировка,Фильтр"
		,Новый Массив
		,Неопределено
		,Неопределено
		,Неопределено
	);
	
	ПараметрыДокументаДляАПИ = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыДокументаДляАПИ(ИмяМетаданных);
	Метод = ПараметрыДокументаДляАПИ.Тип + ".GetVisualVariants";
	
	РезультатSbis = ВыполнитьМетодSaby(Метод, ПараметрыМетода);
	Если РезультатSbis.Ошибка Тогда
		Результат.Ошибка = Истина;
		Результат.Данные = РезультатSbis.ОписаниеОшибки;
	Иначе
		МодульRecord = МодульКода("ESD_Record");
		Результат.Данные = МодульRecord.Decrease(РезультатSbis.Результат["result"]);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

//DynamicDirective
// Обертка над методом "ВыполнитьМетодAPI"
//
// Параметры:
//  Метод - Строка - имя метода.
//  Параметры - Структура - параметры метода.
//	ДополнительныеПараметры - Структура - дополнительные параметры метода.
//	ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
// Возвращаемое значение:
//   Структура - структура результата запроса.
//
Функция ВыполнитьМетодSaby(Метод, Параметры, Знач ДополнительныеПараметры = Неопределено, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	// BSLLS:FunctionOutParameter-off
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
		ОбщиеПараметрыЗагрузки = МодульТНОбщегоНазначенияСервер.ОбщиеПараметрыВыгрузкиЗагрузки();
	КонецЕсли;
	// BSLLS:FunctionOutParameter-on
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура("protocol", 7);
	КонецЕсли;

	РезультатAPI = ВыполнитьМетодAPI(Метод 
		,Параметры
		,ОбщиеПараметрыЗагрузки
		,ДополнительныеПараметры
	);
	
	Возврат РезультатAPI;
КонецФункции

//DynamicDirective
// Получает данные документа из СБИС.
//
// Параметры:
//  Параметры - Структура - структура обязательных параметров для получения данных из СБИС (ссылка,имяметаданных)
//  ДополнительныеПараметры - Структура - структура дополнительных параметров метода
//  ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки.
//
// Возвращаемое значение:
//   Структура - структура результата запроса.
//
Функция ЗагрузитьДанныеДокументаИзSaby(Параметры, ДополнительныеПараметры = Неопределено, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	Перем SabyID, ДопПоля;
	Результат = Новый Структура("Успешно,Данные", Истина, Неопределено);
	
	Параметры.Свойство("ИДСбис", SabyID);
	Если НЕ ЗначениеЗаполнено(SabyID) И Параметры.Свойство("Ссылка") Тогда
		SabyID = ИдСбисДокумента(Параметры);	
	Иначе
		Результат.Успешно = Ложь;
		Результат.Данные = "Отсутствуют обязательные параметры для загрузки данных из Saby";
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(SabyID) Тогда 
		Результат.Данные = "У документа нет идентификатора Saby, обновление данных невозможно!";
		Результат.Успешно = Ложь;
		Возврат Результат;
	КонецЕсли;
	Параметры.Вставить("ИДСбис", SabyID); 
	
	// BSLLS:FunctionOutParameter-off
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
		ОбщиеПараметрыЗагрузки = МодульТНОбщегоНазначенияСервер.ОбщиеПараметрыВыгрузкиЗагрузки();
	КонецЕсли;
	// BSLLS:FunctionOutParameter-on
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ДополнительныеПараметры.Свойство("ДопПоля", ДопПоля);
	КонецЕсли;
	
	Если ТипЗнч(ДопПоля) <> Тип("Строка") Тогда
		ДопПоля = "";
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура("Идентификатор,ДопПоля", SabyID, ДопПоля);
	Попытка
		РезультатСБИС = ОбщиеПараметрыЗагрузки.ОбъектОбработки.local_helper_read_document(
			ОбщиеПараметрыЗагрузки.context_params, ПараметрыМетода);
		
		Результат.Данные = РезультатСБИС;
	Исключение
		ИнфоОшибки = ИнформацияОбОшибке();
		ТекстОшибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПричинаОшибкиИзЯдра", ИнфоОшибки.Описание);
		Результат.Данные = ТекстОшибки;
		Результат.Успешно = Ложь;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

#Область ВзаимодействиеСОнлайном_СлужебныеМетоды

Функция ИнформационныеПоляДокументаSaby(ДокументSaby)
	ИнформационныеПоля = Новый Соответствие;
	
	СписокИнформационныхПолей = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		ДокументSaby, "Подстановки.ОтветственныйЗаВыпуск.Документ.ИнформационноеПоле");	
	Если ТипЗнч(СписокИнформационныхПолей) <> Тип("Массив") Тогда
		Возврат ИнформационныеПоля;
	КонецЕсли;
	
	Для Каждого Данные Из СписокИнформационныхПолей Цикл
		ДобавитьИнформационноеПоле(ИнформационныеПоля, Данные);				
	КонецЦикла;	
	
	Возврат ИнформационныеПоля;
КонецФункции

Процедура ДобавитьИнформационноеПоле(ИнформационныеПоля, ДанныеИнфоПоля)
	Если ТипЗнч(ДанныеИнфоПоля) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из ДанныеИнфоПоля Цикл
		ИнфоПоле = ИнформационныеПоля[КлючЗначение.Ключ];
		Если ИнфоПоле = Неопределено Тогда
			ИнфоПоле = Новый Соответствие;
			ИнформационныеПоля.Вставить(КлючЗначение.Ключ, ИнфоПоле);
		КонецЕсли;
		
		ОписаниеИнфоПоля = КлючЗначение.Значение;
		Для Каждого Данные Из ОписаниеИнфоПоля Цикл
			ИнфоПоле.Вставить(Данные["Ид"], Данные["Значение"]);	
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьИзменениеПечатнойФормы(АдресФайла, ПечатнаяФорма)
	АдресФайла = ИзменитьАдресФайлаПечатногоДокумента(АдресФайла, ПечатнаяФорма);
КонецПроцедуры

Функция ИзменитьАдресФайлаПечатногоДокумента(АдресФайла, ПечатнаяФорма)
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	СоставURL = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(АдресФайла, "?");
	Если СоставURL.Количество() < 2 Тогда
		Возврат АдресФайла;
	КонецЕсли;
	
	СоставПараметровURL = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(СоставURL[1], "&");
	paramsURL = Неопределено;
	paramsIndex = 0;
	
	Для i = 0 По СоставПараметровURL.Количество() - 1 Цикл
		СоставПараметра = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(СоставПараметровURL[i], "=");
		Если СоставПараметра[0] = "params" Тогда
			paramsURL = СоставПараметра[1];
			paramsIndex = i;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если paramsURL = Неопределено Тогда
		Возврат АдресФайла;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	paramsJSON = МодульТНОбщегоНазначенияСервер.ДекодироватьURLВСтроку(paramsURL);
	params = МодульТНОбщегоНазначенияСервер.ДекодироватьJSON(paramsJSON);
	
	ОбновитьАдресФайла = Ложь;
	param = params["Params"];
	Для i = 0 По param["s"].Количество() - 1 Цикл
		col = param["s"][i];
		Если col["n"] = "ReqId" Тогда
			param["d"][i] = param["d"][i] + ПечатнаяФорма;
			ОбновитьАдресФайла = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ОбновитьАдресФайла Тогда
		Возврат АдресФайла;
	КонецЕсли;
	
	paramsJSON = МодульТНОбщегоНазначенияСервер.ЗакодироватьJSON(params);
	paramsURL = МодульТНОбщегоНазначенияСервер.КодироватьСтрокуВURL(paramsJSON);
	СоставПараметровURL[paramsIndex] = "params=" + paramsURL;
	ПараметрыURL = МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(СоставПараметровURL, "&");
	СоставURL[1] = ПараметрыURL;
	Возврат МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(СоставURL, "?");
КонецФункции

#КонецОбласти

