
//DynamicDirective
// Получает дату из подстановок указанного титула, полученного с онлайна.
//
// Параметры:
//  ДанныеТитула - Соответствие - значение подстановок с онлайна.
//  Титул - ПеречислениеСсылка.Saby_ТипТитулаЗнП - титул, для которого получаем дату.
//  СтруктураВложения - Структура - структура данных вложения.
//
// Возвращаемое значение:
//   Дата - значение даты
//
Функция ДатаВложения(ДанныеТитула, Титул, СтруктураВложения = Неопределено) Экспорт
	
	ИмяФункцииПреобразованияДаты = "ESD_ТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД";
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Если ДанныеТитула["ДатаВложенияТитула"] <> Неопределено Тогда
		
		РезультатФункции = ДанныеТитула["ДатаВложенияТитула"];
		
	ИначеЕсли СтруктураВложения <> Неопределено Тогда
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, СтруктураВложения["ДатаВремя"]);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.Погрузка") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110339.Файл.Документ.ДатИнфГО", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110339.Файл.Документ.ВрИнфГО", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ПолучениеГруза") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110340.Файл.Документ.ДатИнфПрвПрием", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110340.Файл.Документ.ВрИнфПрвПрием", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ПриемкаГруза") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110341.Файл.Документ.ДатИнфГП", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110341.Файл.Документ.ВрИнфГП", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ВыдачаГруза") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110342.Файл.Документ.ДатИнфПрвВыд", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110342.Файл.Документ.ВрИнфПрвВыд", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.Переадресовка") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110343.Файл.Документ.ДатаИнфПА", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110343.Файл.Документ.ВрИнфПА", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ПереадресовкаУведомление") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1167009.Файл.Документ.ДатаУвПА", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1167009.Файл.Документ.ВрУвПА", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ЗаменаВодителяТС") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110344.Файл.Документ.ДатИнфЗамен", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110344.Файл.Документ.ВрИнфЗамен", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.СогласованиеСтоимости") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110346.Файл.Документ.ДатПУДИнфГО", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110346.Файл.Документ.ВрПУДИнфГО", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ИзменениеСтоимости") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110345.Файл.Документ.ДатПУДИнфПрв", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "1110345.Файл.Документ.ВрПУДИнфПрв", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.УведомлениеОУточнении") Тогда
		
		ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "Документ.Данные.ДатаПол", "");
		ДатаСтрокой = ДатаСтрокой + " ";
		ДатаСтрокой = ДатаСтрокой + МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеТитула, "Документ.Данные.ВремяПол", "");
		
		РезультатФункции = ВыполнитьНаСервере(ИмяФункцииПреобразованияДаты, ДатаСтрокой);
		
	Иначе
		
		РезультатФункции = Неопределено;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective
// Получает идентификатор из подстановок указанного титула, полученного с онлайна.
//
// Параметры:
//  ДанныеТитула - Соответствие - значение подстановок с онлайна.
//  Титул - ПеречислениеСсылка.Saby_ТипТитулаЗнП - титул, для которого получаем дату.
//  СтруктураВложения - Структура - структура данных вложения.
//
// Возвращаемое значение:
//  Строка - идентификатор титула
//
Функция ИдентификаторВложения(ДанныеТитула, Титул, СтруктураВложения = Неопределено) Экспорт
	
	ПредставленияТитула = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов",
		ТранспортнаяНакладнаяКлиент(), "ПредставленияТитула", Титул);
	
	Если ДанныеТитула["ИдентификаторВложенияТитула"] <> Неопределено Тогда
		ИдФайл = ДанныеТитула["ИдентификаторВложенияТитула"];
	ИначеЕсли СтруктураВложения <> Неопределено Тогда
		ИдФайл = СтруктураВложения["Идентификатор"];
	ИначеЕсли ПредставленияТитула.КодТитула = "1115113" Тогда
		ИдФайл = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
			ДанныеТитула, "Документ.Данные.ИдФайл", "");
	ИначеЕсли ПредставленияТитула.КодТитула <> "" Тогда
		ИдФайл = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
			ДанныеТитула[ПредставленияТитула.КодТитула], "Файл.ИдФайл", "");
	Иначе
		ИдФайл = "";
	КонецЕсли;
	
	РезультатФункции = Прав(ИдФайл, 36);
	
	Возврат РезультатФункции;
	
КонецФункции

// Получение и обработка данных документа из Saby
//
// Параметры:
//	ПараметрыЗагрузки - Соответствие - параметры загрузки документа
//	ОбщиеПараметрыЗагрузки - Соответствие - общие параметры загрузки документа
//	Результат - Структура - описание результата загрузки документа
//
//DynamicDirective
Процедура SabyЗагрузитьДанныеДокумента(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, Результат) Экспорт
	// Для ВО - там сначала загружаются данные, а потом идет сюда для обработки. Сделано для того, чтоб сильно не ломать логику	
	Если ЗначениеЗаполнено(ПараметрыЗагрузки.ДанныеДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	// Загружаем данные документа
	SabyДанныеДокумента = SabyПолныеДанныеДокумента(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, Результат);
	Если Не ЗначениеЗаполнено(SabyДанныеДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	// Создаем копию документа
	Документ = Новый Соответствие(Новый ФиксированноеСоответствие(SabyДанныеДокумента));
	// Подготавливаем данные
	Документ.Вставить("Событие",     Новый Массив);
	Документ.Вставить("Вложения",    Новый Соответствие);
	Документ.Вставить("Подстановки", Новый Соответствие);
	Документ.Вставить("ИдТитулов",   Новый Соответствие);
	
	// Формируем параметры обработки документа
	ПараметрыОбработки = SabyПараметрыОбработкиДокумента();
	ЗаполнитьЗначенияСвойств(ПараметрыОбработки, ПараметрыЗагрузки); 
	
	// Выполняем обработку
	SabyОбработатьДанныеДокумента(Документ, SabyДанныеДокумента, ПараметрыОбработки, Результат);
	
	ПараметрыЗагрузки.ДанныеДокумента = Документ;	
КонецПроцедуры

// Получение полных данных документа из Saby
//
// Параметры:
//	ПараметрыЗагрузки - Соответствие - параметры загрузки документа
//	ОбщиеПараметрыЗагрузки - Соответствие - общие параметры загрузки документа
//	Результат - Структура - описание результата загрузки документа
//
// Возвращаемое значение:
//	Структура - загруженные данные документа из Saby
//
//DynamicDirective
Функция SabyПолныеДанныеДокумента(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, Результат) Экспорт
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	Ошибки = МодульТНОбщегоНазначенияКлиентСервер.СтруктураОшибок(ПараметрыЗагрузки.ИмяМетаданных);
	
	ДопПоля = "ДопДействия,ТекущиеЭтапы,Подстановки,Расширение,Стороны,ИдентификаторУчастника";
	// Стороны - обогащают посдстановки данными по ответсвенным МО, ТО, выезд и заезд
	// ЗаменаВодителя - обогащает данные ид замены водителя - основания и документа замены
	Если ПараметрыЗагрузки.ИмяМетаданных = ПутевойЛистКлиент() Тогда 
		ДопПоля = ДопПоля + ",ЗаменаВодителя";
	ИначеЕсли ПараметрыЗагрузки.ИмяМетаданных = ЗаказНаПеревозкуКлиент() Тогда
		ДопПоля = ДопПоля + ",ГИС_УИД";
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ДопПоля", ДопПоля);
	
	Попытка
		РезультатSaby = ЗагрузитьДанныеДокументаИзSaby(ПараметрыЗагрузки, ДополнительныеПараметры, ОбщиеПараметрыЗагрузки);
		Если НЕ РезультатSaby.Успешно Тогда
			ВызватьИсключение РезультатSaby.Данные;
		КонецЕсли;
		
		ДанныеДокумента = РезультатSaby.Данные;
	Исключение
		ИнфоОшибки = ИнформацияОбОшибке();
		ТекстОшибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПричинаОшибкиИзЯдра", ИнфоОшибки.Описание);
		Ошибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ДобавитьОшибкуПользователю", Ошибки, Неопределено, ТекстОшибки);
		КлючСоответствия = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").КлючСсылка(ПараметрыЗагрузки.Ссылка);
		Результат.Ошибки.Вставить(КлючСоответствия, Ошибки); 
		
		ДанныеДокумента = Неопределено;
	КонецПопытки;
	
	Возврат ДанныеДокумента;
КонецФункции

// Обработка полученных данных документа из Saby
//
// Параметры:
//	Документ - Соответствие - объект обработанного документа из Saby
//	ДанныеSaby - Соответствие - объект полученных данных из Saby
//	ПараметрыОбработки - Структура - параметры обработки документа
//	Результат - Структура - описание результата загрузки документа
//
//DynamicDirective
Процедура SabyОбработатьДанныеДокумента(Документ, ДанныеSaby, ПараметрыОбработки, Результат = Неопределено)
	SabyОбработатьСобытияДокумента(Документ, ДанныеSaby, ПараметрыОбработки);
	
	ДанныеПодстановок = ДанныеSaby["Подстановки"];	
	Если ЗначениеЗаполнено(ДанныеПодстановок) Тогда
		Для Каждого Подстановки Из ДанныеПодстановок Цикл
			ДанныеПодстановки = Новый Структура("КодТитулаОнлайна, Значения", Подстановки.Ключ, Подстановки.Значение);
			ДобавитьПодстановкуТитула(Документ, ДанныеПодстановки, ПараметрыОбработки);
		КонецЦикла;
	КонецЕсли;
	
	Если Результат <> Неопределено Тогда
		МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
		Ошибки = МодульТНОбщегоНазначенияКлиентСервер.СтруктураОшибок(ПараметрыОбработки.ИмяМетаданных);
		Для Каждого Ошибка Из ПараметрыОбработки.Ошибки Цикл
			Ошибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ДобавитьОшибкуПользователю", Ошибки, Неопределено, Ошибка.Значение);
			КлючСоответствия = МодульТНОбщегоНазначенияКлиентСервер.КлючСсылка(ПараметрыОбработки.Ссылка);
			Результат.Ошибки.Вставить(КлючСоответствия, Ошибки); 	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Обработка полученных событий документа из Saby
//
// Параметры:
//	Документ - Соответствие - объект обработанного документа из Saby
//	ДанныеSaby - Соответствие - объект события из Saby
//	ПараметрыОбработки - Структура - параметры обработки документа
//
//DynamicDirective
Процедура SabyОбработатьСобытияДокумента(Документ, ДанныеSaby, ПараметрыОбработки)
	СобытияSaby = ДанныеSaby["Событие"];
	Если Не ЗначениеЗаполнено(СобытияSaby) Тогда
		Возврат;
	КонецЕсли;
	
	// Предопределим списки обработанных данных из "событий"
	События = Документ["Событие"];
	Вложения = Документ["Вложения"];
	
	// Обрабатываем события с онлайна
	Для Каждого СобытиеSaby Из СобытияSaby Цикл
		Событие = SabyСобытиеДокумента(СобытиеSaby);
		События.Добавить(Событие);
		
		Если ПараметрыОбработки.ОбрабатыватьВложения Тогда
			// На основании события собираем вложения
			ДобавитьВложения(Вложения, Событие, ПараметрыОбработки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Получение параметров загрузки документа из Saby
//
// Возвращаемое значение:
//	Структура - параметры загрузки документа из Saby
//
//DynamicDirective
Функция SabyПараметрыОбработкиДокумента()
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", Неопределено);
	Результат.Вставить("ИмяМетаданных", "");
	Результат.Вставить("ОбрабатыватьВложения", Истина);
	Результат.Вставить("ОбрабатыватьПодстановки", Истина);
	Результат.Вставить("Ошибки", Новый Структура);
	
	Возврат Результат;
КонецФункции

// Получение обработанной структуры события документа Saby
//
// Параметры:
//	ДанныеSaby - Соответствие - структура полученных данных события из Saby
//
// Возвращаемое значение:
//	Соответствие - обработанный объект события документа
//
//DynamicDirective
Функция SabyСобытиеДокумента(ДанныеSaby)
	ДатаВремяДокумента = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД", ДанныеSaby["ДатаВремяДокумента"]);
	ДатаВремя = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПреобразоватьСтрокуВДатуЭПД", ДанныеSaby["ДатаВремя"]);
		
	СобытиеСоответствие = Новый Соответствие;
	СобытиеСоответствие.Вставить("ДатаВремя",          ДатаВремя);
	СобытиеСоответствие.Вставить("ДатаВремяДокумента", ДатаВремяДокумента);
	СобытиеСоответствие.Вставить("Идентификатор",      ДанныеSaby["Идентификатор"]);
	СобытиеСоответствие.Вставить("Название",           ДанныеSaby["Название"]);
	СобытиеСоответствие.Вставить("Комментарий",        ДанныеSaby["Комментарий"]);
	СобытиеСоответствие.Вставить("Исполнитель",        Новый Соответствие);
	СобытиеСоответствие.Вставить("Действие",           Новый Соответствие);
	
	ДанныеИсполнителяSaby = ДанныеSaby["Исполнитель"];
	Если ЗначениеЗаполнено(ДанныеИсполнителяSaby) Тогда
		ДанныеИсполнителя = СобытиеСоответствие["Исполнитель"];
		ДанныеИсполнителя.Вставить("Идентификатор", ДанныеИсполнителяSaby["Идентификатор"]);
		ДанныеИсполнителя.Вставить("Фамилия",       ДанныеИсполнителяSaby["Фамилия"]);
		ДанныеИсполнителя.Вставить("Имя",           ДанныеИсполнителяSaby["Имя"]);
		ДанныеИсполнителя.Вставить("Отчество",      ДанныеИсполнителяSaby["Отчество"]);	
	КонецЕсли;
	
	ДанныеДействияSaby = ДанныеSaby["Действие"];
	Если ЗначениеЗаполнено(ДанныеДействияSaby) Тогда
		ДанныеДействия = СобытиеСоответствие["Действие"];
		ДанныеДействия.Вставить("Идентификатор", ДанныеДействияSaby["Идентификатор"]);
		ДанныеДействия.Вставить("Название",      ДанныеДействияSaby["Название"]);
	КонецЕсли;
	
	СписокВложений = ДанныеSaby["Вложение"];
	СобытиеСоответствие.Вставить("Вложение", СписокВложений);
	SabyДополнитьДанныеСобытияИзВложений(СобытиеСоответствие, СписокВложений);	
	
	Возврат СобытиеСоответствие;
КонецФункции

// Дополнение события из списка структур вложений документа Saby
//
// Параметры:
//	Событие - Соответствие - объект обработанного события
//	СписокВложений - Массив - массив вложений документа Saby
//
//DynamicDirective
Процедура SabyДополнитьДанныеСобытияИзВложений(Событие, СписокВложений)
	Если Не ЗначениеЗаполнено(СписокВложений) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеИсполнителя = Событие["Исполнитель"];
	// При отсутствии исполнителя подтягиваем ФИО из подписи
	Если Не ЗначениеЗаполнено(ДанныеИсполнителя) Тогда
		// Получим последнее вложение из списка
		Вложение = СписокВложений[СписокВложений.ВГраница()];
		// На основании "подписи" заполняем данные исполнителя
		СписокПодписей = Вложение["Подпись"];
		Если ЗначениеЗаполнено(СписокПодписей) Тогда
			ДанныеПодписи = СписокПодписей[СписокПодписей.ВГраница()];
			
			МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
			ПодписантФИО = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеПодписи, "Сертификат.ФИО", "");
			ДанныеИсполнителя.Вставить("Фамилия", ПодписантФИО);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//DynamicDirective
Функция ИдСбисДокумента(ПараметрыЗагрузки)
	ИДСбис = "";

	ПараметрыЗагрузки.Свойство("ИДСбис", ИДСбис);
	Если ЗначениеЗаполнено(ИДСбис) Тогда
		Возврат ИДСбис;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыЗагрузки.Ссылка) = Тип("Структура") Тогда
		ИДСбис = ПараметрыЗагрузки.Ссылка.Идентификатор;
	Иначе	
		ДанныеСостояния = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ДанныеСостоянияОбъекта", ПараметрыЗагрузки.Ссылка);
		Если ДанныеСостояния <> Неопределено Тогда 
			
			Если МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ДанныеСостояния, "UID") Тогда 
				ИДСбис = ДанныеСостояния.UID;
			Иначе 
				ИДСбис = ДанныеСостояния.ИД;
			КонецЕсли;	
			
			ПараметрыЗагрузки.Вставить("ТипИсточника", ДанныеСостояния.ТипИсточника);
			ПараметрыЗагрузки.Вставить("ИдентификаторИсточника", ДанныеСостояния.ИдентификаторИсточника);
			ПараметрыЗагрузки.Вставить("Ссылка", ДанныеСостояния.Ссылка);		
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ИДСбис;
КонецФункции

// Получение имени файла без расшинения
//
// Параметры:
//	ИмяФайла - Строка - имя файла из поля данных Saby
//	МодульТНОбщегоНазначенияКлиентСервер - ОбщийМодуль - ссылка на общий модуль "ESD_ОбщегоНазначенияКлиентСервер"
//
// Возвращаемое значение:
//  Строка - имя файла без расширения
//	
//DynamicDirective
Функция ИмяФайлаБезРасширения(ИмяФайла, МодульТНОбщегоНазначенияКлиентСервер = Неопределено)
	ИмяФайлаБезРасширения = "";
	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат ИмяФайлаБезРасширения;
	КонецЕсли;
	
	Если МодульТНОбщегоНазначенияКлиентСервер = Неопределено Тогда
		// BSLLS:FunctionOutParameter-off
		МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
		// BSLLS:FunctionOutParameter-on
	КонецЕсли;
	
	СоставИмяФайла = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(ИмяФайла, ".");
	ИмяФайлаБезРасширения = СоставИмяФайла[0];
	
	Возврат ИмяФайлаБезРасширения;
КонецФункции

// Обработка и добавление вложений события в отдельную коллекцию
//
// Параметры:
//	Вложения - Массив - список обработанных вложений
//	Событие - Соответствие - обработанное событие документа Saby
//	ПараметрыОбработки - Структура - параметры обработки данных
//
//DynamicDirective
Процедура ДобавитьВложения(Вложения, Событие, ПараметрыОбработки)
	ВложенияСОнлайна = Событие["Вложение"];
	Если ВложенияСОнлайна = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	ИмяКлючаДатаВремя = "ДатаВремя";
	ИмяКлючаИдентификатор = "Идентификатор";
	ДатаВремя = Событие[ИмяКлючаДатаВремя];
		
	Для Каждого Вложение Из ВложенияСОнлайна Цикл	
		Если ПараметрыОбработки.ИмяМетаданных = ТранспортнаяНакладнаяКлиент() Тогда
			ИмяФайла = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Вложение, "Файл.Имя", "");
			КлючСоответствияВложения = ИмяФайлаБезРасширения(ИмяФайла, МодульТНОбщегоНазначенияКлиентСервер);
		Иначе
			КлючСоответствияВложения = Вложение["Подтип"];
		КонецЕсли;
		
		СтруктураВложения = Вложения[КлючСоответствияВложения];
		Если СтруктураВложения = Неопределено Тогда
			СтруктураВложения = Новый Соответствие;
			СтруктураВложения.Вставить(ИмяКлючаДатаВремя,     Дата(1, 1, 1));
			СтруктураВложения.Вставить(ИмяКлючаИдентификатор, "");
			Вложения.Вставить(КлючСоответствияВложения, СтруктураВложения);	
		КонецЕсли;
	
		Если СтруктураВложения[ИмяКлючаДатаВремя] < ДатаВремя Тогда
			СтруктураВложения[ИмяКлючаДатаВремя]     = ДатаВремя;
			СтруктураВложения[ИмяКлючаИдентификатор] = Вложение[ИмяКлючаИдентификатор];
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

// Обработка и добавление подстановок титула
//
// Параметры:
//	ИзмененияПоДокументу - Соотвествие - объект документа
//	ДанныеПодстановки - Соответствие - обработанные данные подстановки из вложений
//	ПараметрыОбработки - Структура - параметры обработки данных
//
//DynamicDirective
Процедура ДобавитьПодстановкуТитула(ИзмененияПоДокументу, ДанныеПодстановки, ПараметрыОбработки)
	КодТитулаОнлайна = ДанныеПодстановки.КодТитулаОнлайна;
	ЗначенияПодстановок = ДанныеПодстановки.Значения;
	
	Титул = ВыполнитьНаСервере(
		"ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов", ПараметрыОбработки.ИмяМетаданных, "ЗначениеПоИмениПодстановки", КодТитулаОнлайна);
	Если Не ЗначениеЗаполнено(Титул) Тогда
		Возврат;
	КонецЕсли;
	
	ПредставленияТитула = ВыполнитьНаСервере(
		"ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов", ПараметрыОбработки.ИмяМетаданных, "ПредставленияТитула", Титул);
	
	Модуль_ТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	МассивПодстановок = Модуль_ТНОбщегоНазначенияКлиентСервер.ЗначениеВМассив(ЗначенияПодстановок);
	Для Каждого ДанныеТитула Из МассивПодстановок Цикл
		КлючСоответствияВложения = КлючСоответствияВложения(ДанныеТитула, ПредставленияТитула);
		
		СтруктураВложения = ИзмененияПоДокументу["Вложения"][КлючСоответствияВложения];
		
		ДобавитьИнформациюВПодстановки(ДанныеТитула, Титул, СтруктураВложения, ПараметрыОбработки.ИмяМетаданных);
		Если ЕстьОшибкаПриЗагрузкеДанныхТитулов(ДанныеТитула, Модуль_ТНОбщегоНазначенияКлиентСервер) Тогда
			Продолжить;
		КонецЕсли;
		УдалитьНеиспользуемуюИнформациюВПодстановках(ДанныеТитула, ПредставленияТитула);
		
		МассивТитулов = ИзмененияПоДокументу["Подстановки"][КодТитулаОнлайна];
		Если МассивТитулов = Неопределено Тогда
			МассивТитулов = Новый Массив;
			ИзмененияПоДокументу["Подстановки"].Вставить(КодТитулаОнлайна, МассивТитулов);
		КонецЕсли;
		
		ИдентификаторВложения = ДанныеТитула["ИдентификаторВложенияТитула"];
		Если ИдентификаторВложения = "" Тогда
			ИдентификаторВложения = ПредставленияТитула.ИмяПодстановки;
		КонецЕсли;
		
		ИндексТитула = ИзмененияПоДокументу["ИдТитулов"][ИдентификаторВложения];
		Если ИндексТитула = Неопределено Тогда
			МассивТитулов.Добавить(ДанныеТитула);
			ИзмененияПоДокументу["ИдТитулов"].Вставить(ИдентификаторВложения, МассивТитулов.ВГраница());
		Иначе
			Если МассивТитулов.Количество() Тогда 
				МассивТитулов[ИндексТитула] = ДанныеТитула;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

//DynamicDirective
Функция ЕстьОшибкаПриЗагрузкеДанныхТитулов(ДанныеТитула, Модуль_ТНОбщегоНазначенияКлиентСервер)
	
	Возврат ЗначениеЗаполнено(ДанныеТитула["ИдентификаторВложенияТитула"]) // для отрицательного закрытия титулов путевого листа
		И Не Модуль_ТНОбщегоНазначенияКлиентСервер.ЭтоУникальныйИдентификатор(ДанныеТитула["ИдентификаторВложенияТитула"]);
	
КонецФункции

//DynamicDirective
Функция КлючСоответствияВложения(ДанныеТитула, ПредставленияТитула)
	
	МодульВыполнения = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	РезультатФункции = МодульВыполнения.ЗначениеИзКоллекции(ДанныеТитула, "Файл.ИмяФайлаБезРасширения");
		
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = МодульВыполнения.ЗначениеИзКоллекции(ДанныеТитула, "Документ.Дополнительная информация.Имя файла");
	КонецЕсли;
	
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = МодульВыполнения.ЗначениеИзКоллекции(ДанныеТитула, "Документ.Данные.НаимДок");
	КонецЕсли;		
		
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = ПредставленияТитула.КодТитула;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective
Процедура ДобавитьИнформациюВПодстановки(ДанныеТитула, Титул, СтруктураВложения, ИмяМетаданных)
	
	ДанныеТитула.Вставить("ДатаВложенияТитула", ДатаВложения(ДанныеТитула, Титул, СтруктураВложения));
	
	ДанныеТитула.Вставить("ИдентификаторВложенияТитула", ИдентификаторВложения(ДанныеТитула, Титул, СтруктураВложения));
	
КонецПроцедуры

//DynamicDirective
Процедура УдалитьНеиспользуемуюИнформациюВПодстановках(ДанныеТитула, ПредставленияТитула)
	
	Если ДанныеТитула[ПредставленияТитула.КодТитула] <> Неопределено Тогда
		ДанныеТитула.Вставить(ПредставленияТитула.КодТитула, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

//DynamicDirective
Функция РаспознаваниеВУ(ДопПараметры, Знач ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДопПараметры.ОтветНаКлиенте <> Неопределено Тогда
		Возврат ДопПараметры.ОтветНаКлиенте;
	КонецЕсли;
	
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
			ДопПараметры.context_params);
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Файл", ДопПараметры.ЗакодированныеДД);
	
	ИмяМетода = "sabyEmployee.RecognizeDriverLicense";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда
		
		Ошибка   = Истина;
		Описание = Ответ.ОписаниеОшибки;
		
	ИначеЕсли Не ЗначениеЗаполнено(Ответ.Результат) Или Не ЗначениеЗаполнено(Ответ.Результат["result"]) Тогда
		
		Ошибка   = Истина;
		Описание = "Ошибка выполнения распознавания ВУ / " + ИмяМетода;
		
	Иначе
		Ошибка = Ложь;
	КонецЕсли;
	
	Попытка 
		
		// заберем только распознанные данные 
		ДанныеВУ = Ответ.Результат["result"]["RecognizedData"]["fields"];
		Ответ.Результат = ДанныеВУ;
		
	Исключение
		
		Ошибка = Истина;
		Описание = "Ошибка обработки результата распознавания ВУ / " + ИмяМетода;
		
	КонецПопытки;
	
	Если Ошибка Тогда 
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			Неопределено,
			"Не удалось выполнить распознавание ВУ / " + ИмяМетода,
			Описание);
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

//DynamicDirective
Функция ЗагрузитьДанныеТСПоРегНомеру(ДопПараметры, Знач ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДопПараметры.ОтветНаКлиенте <> Неопределено Тогда
		Возврат ДопПараметры.ОтветНаКлиенте;
	КонецЕсли;
	
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
			ДопПараметры.context_params);
	КонецЕсли;
	
	ВнутренниеПараметрыМетода = Новый Структура;
	ВнутренниеПараметрыМетода.Вставить("filter", Новый Структура("RegNumber", ДопПараметры.РегистрационныйНомер));
	ВнутренниеПараметрыМетода.Вставить("limit",  1);
	ВнутренниеПараметрыМетода.Вставить("page",   0);
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("params", ВнутренниеПараметрыМетода);
	
	ИмяМетода = "sabyVehicle.GetList";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда 
		
		Ответ.Результат = Ответ.ОписаниеОшибки;
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			Неопределено,
			"Не удалось выполнить загрузку данных по регистрационному номеру / " + ИмяМетода,
			Ответ.ОписаниеОшибки);
			
	Иначе
		
		НайденныеМашины = Ответ.Результат["result"]["cars"];
		Если НайденныеМашины.Количество() > 0 Тогда
			Ответ.Результат = НайденныеМашины[0];
		Иначе
			Ответ.Результат = "Заполнение не выполнено. Не найдены данные транспортного средства по указанному регистрационному номеру.";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ.Результат;
	
КонецФункции

//DynamicDirective
Функция ЗагрузитьДанныеТСПоВИН(ДопПараметры, Знач ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДопПараметры.ОтветНаКлиенте <> Неопределено Тогда
		Возврат ДопПараметры.ОтветНаКлиенте;
	КонецЕсли;
	
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
			ДопПараметры.context_params);
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("VIN", ДопПараметры.ВИН);
	
	ИмяМетода = "sabyVehicle.ByVIN";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда 
		
		Ответ.Результат = Ответ.ОписаниеОшибки;
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			Неопределено,
			"Не удалось проверить данные в ГИБДД по ВИН / " + ИмяМетода,
			Ответ.ОписаниеОшибки);
			
	Иначе			
		Ответ.Результат = Ответ.Результат["result"];
	КонецЕсли;
			
	Возврат Ответ.Результат;
	
КонецФункции

//DynamicDirective
Функция ЗагрузитьПочтовыеЯщикиКонтрагента(ДопПараметры, Знач ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	
	Если ДопПараметры.ОтветНаКлиенте <> Неопределено Тогда
		Возврат ДопПараметры.ОтветНаКлиенте;
	КонецЕсли;
	
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки(
			ДопПараметры.context_params);
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Участник", ДопПараметры.Участник);
	
	ИмяМетода = "СБИС.ИнформацияОКонтрагенте";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда 
		
		Ответ.Результат = Ответ.ОписаниеОшибки;
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			Неопределено,
			"Не удалось получить список ящиков контрагента / " + ИмяМетода,
			Ответ.ОписаниеОшибки);
			
	Иначе			
		Ответ.Результат = Ответ.Результат["result"];
	КонецЕсли;
			
	Возврат Ответ.Результат;
	
КонецФункции

//DynamicDirective
// Выполенение метода внешнего API
//
// Параметры:
//  ИмяМетода       - Строка    - название выполняемого метода
//  ПараметрыМетода - Структура - параметры выполнения метода
//  ОбщиеПараметрыЗагрузки - Структура - структура общих параметров
//  ДополнительныеПараметры - Структура - структура дополнительных параметров метода
//
// Возвращаемое значение:
//   Структура - имеет всегда фиксированны набор ключей
//       * Результат      - Соответствие - ответ сервиса. 
//       * Ошибка         - Булево       - признак возникновения ошибки.
//       * ОписаниеОшибки - Строка       - описание ошибки.
//
Функция ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки, ДополнительныеПараметры = Неопределено)
	Ошибка         = Ложь;
	Результат      = Неопределено;
	ОписаниеОшибки = "";
	
	Попытка	
		Результат = ОбщиеПараметрыЗагрузки.ОбъектОбработки.local_helper_exec_method(
			ОбщиеПараметрыЗагрузки.context_params,
			ИмяМетода,
			ПараметрыМетода,
			Истина,
			ДополнительныеПараметры);
	Исключение	
		Ошибка          = Истина;
		ИнфоОшибки      = ИнформацияОбОшибке();
		СтруктураОшибки = ОбщиеПараметрыЗагрузки.ОбъектОбработки.NewExtExceptionСтруктура(ИнфоОшибки);
		ОписаниеОшибки  = СтруктураОшибки.message;
	КонецПопытки;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Результат",      Результат);
	СтруктураОтвета.Вставить("Ошибка",         Ошибка);
	СтруктураОтвета.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	
	Возврат СтруктураОтвета;	
КонецФункции

#Область Статистика

//DynamicDirective
// Запись статистики на прямую в облако, в обход стандартных методов
//
// Параметры:
//  ПараметрыЗагрузки - Структура - структура загрузки
//  ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
Процедура ЗаписатьСтатистикуНапрямую(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки) Экспорт
	ПараметрыМетода = ПараметрыМетодаЗаписиСтатистики(ПараметрыЗагрузки.ТекущийТитул, "", ПараметрыЗагрузки.Ссылка);
	
	Если ПараметрыЗагрузки.ИмяМетаданных = ПутевойЛистКлиент() Тогда
		ЗаписатьСтатистику_ЭПЛ(ПараметрыЗагрузки, ПараметрыМетода, ОбщиеПараметрыЗагрузки);			
	Иначе	
		ЗаписатьСтатистикуВОблако(ПараметрыЗагрузки.Ссылка, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	КонецЕсли;
КонецПроцедуры

//DynamicDirective
Функция ПараметрыМетодаЗаписиСтатистики(ТекущийТитул, ИмяДействия, ДокументСсылка = Неопределено,
	ИмяФункционала = "", ИмяКонтекста = "") Экспорт
	
	ИмяФункционалаСтатистики = ИмяФункционала;
	ИмяДействияСтатистики    = ИмяДействия;
	
	Если ДокументСсылка <> Неопределено Тогда
		Если ТипЗнч(ДокументСсылка) = Тип("Структура") Тогда
			ИмяМетаданных = ДокументСсылка.ИмяМетаданных;
		Иначе
			ИмяМетаданных = МодульКода("ESD_ТНОбщегоНазначенияСервер").ИмяМетаданныхДокумента(ДокументСсылка);
		КонецЕсли;
		
		ПараметрыAPI   = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыДокументаДляАПИ(ИмяМетаданных);
		ИмяФункционалаСтатистики = ИмяПродуктаЭПДСтатистика() + ПараметрыAPI.Тип;
		
		ЭтоДинамическийТитул = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов",
			ИмяМетаданных, "ЭтоДинамическийТитул", ТекущийТитул) = Истина;
		
		Если ЭтоДинамическийТитул Тогда
			ИмяДействияСтатистики = "Переход\" + СокрЛП(ТекущийТитул);
		Иначе
			ИмяДействияСтатистики = "Переход";
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	
	Данные = Новый Структура;
	Данные.Вставить("action",     ИмяДействияСтатистики);
	Данные.Вставить("context",    ИмяКонтекста);
	Данные.Вставить("functional", ИмяФункционалаСтатистики);
	
	ПараметрыМетода.Вставить("data", Данные);

	Возврат ПараметрыМетода;
	
КонецФункции

//DynamicDirective
Процедура ЗаписатьСтатистикуВОблако(ДокументСсылка, Знач ПараметрыМетода, Знач ОбщиеПараметрыЗагрузки) Экспорт
	
	CloudStatisticsSend_ДополнитьПараметры(ПараметрыМетода, ОбщиеПараметрыЗагрузки.ОбъектОбработки);
	ИмяМетода = "CloudStatistics.Send";
	
	Ответ = ВыполнитьМетодAPI(ИмяМетода, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
	
	Если Ответ.Ошибка Тогда
		
		Ошибка   = Истина;
		Описание = Ответ.ОписаниеОшибки;
		
	ИначеЕсли Не ЗначениеЗаполнено(Ответ.Результат) Или Не ЗначениеЗаполнено(Ответ.Результат["result"]) Тогда
		
		Ошибка   = Истина;
		Описание = "Ошибка выполнения записи статистики / " + ИмяМетода;
		
	Иначе
		Ошибка = Ложь;
	КонецЕсли;
	
	Если Ошибка Тогда
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			ДокументСсылка,
			"Не записана статистика документа / " + ИмяМетода,
			Описание);
		
	КонецЕсли;
	
КонецПроцедуры

//DynamicDirective
Процедура ЗаписатьСтатистикуРедактора(Ссылка, Событие) Экспорт

	ПараметрыМетода = ПараметрыМетодаЗаписиСтатистики("", Событие, , "1C MappingEditor");
		
	Модуль_ESDСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	ОбработкаОбъект  = Модуль_ESDСервер.ОбъектОбработки();
	context_params   = Модуль_ESDСервер.ПроверитьНаличиеПараметровПодключенияЭПД();
	
	ОбщиеПараметры = Новый Структура;
	ОбщиеПараметры.Вставить("ОбъектОбработки", ОбработкаОбъект);	
	ОбщиеПараметры.Вставить("context_params",  context_params);
	
	ЗаписатьСтатистикуВОблако(Ссылка, ПараметрыМетода, ОбщиеПараметры);
	
КонецПроцедуры	

//DynamicDirective
Процедура ЗаписатьСтатистикуВызоваВОблако(Событие, Функционал, Форма = Неопределено) Экспорт
	
	Попытка 
		
		ОбщиеПараметры = ОбщиеПараметрыЗагрузки(Форма);	
		
		ПараметрыМетода = ПараметрыМетодаЗаписиСтатистики("", Событие, , Функционал, ОбщиеПараметры.context);
		
		ЗаписатьСтатистикуВОблако(Неопределено, ПараметрыМетода, ОбщиеПараметры);
		
	Исключение
		
 		Информация = ИнформацияОбОшибке();
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации", Неопределено,
		"Ошибка записи статистики", Информация.Описание);
		
	КонецПопытки;

КонецПроцедуры    

//DynamicDirective 
// Возвращает Общие параметры для обмена по API со СБИС.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Если ВО, то форма откуда вызов, если расширение, то неопределено
//
// Возвращаемое значение:
//   Структура - адрес двоичных данных файла печатной формы.
//
Функция ОбщиеПараметрыЗагрузки(Форма) Экспорт
	
	Модуль_ESDСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияСервер");
	context_params   = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД", Неопределено);
	
	Если Форма <> Неопределено И Форма.ЭтоВО Тогда
		context = "ВО2";
		ТранспортВО = Модуль_ESDСервер.ТранспортВО(Форма, context_params);
		ОбработкаОбъект = ТранспортВО.ТранспортИнтеграции;
	Иначе
		
		Если Модуль_ESDСервер.ЭтоCF() Тогда
			context = "ESDCF";
		Иначе
			context = "ESD";
		КонецЕсли;
		ОбработкаОбъект  = Модуль_ESDСервер.ОбъектОбработки();
	КонецЕсли;
	
	ОбщиеПараметры = Новый Структура;
	ОбщиеПараметры.Вставить("ОбъектОбработки", ОбработкаОбъект);
	ОбщиеПараметры.Вставить("context_params",  context_params);
	ОбщиеПараметры.Вставить("context",  context);
	
	Возврат ОбщиеПараметры;
	
КонецФункции

//DynamicDirective
// Заполнение отсутствующих значений структуры параметров выполнения метода "CloudStatistics.Send"
//
// Параметры:
//	ПараметрыМетода - Структура - структура параметров для выполнения метода "CloudStatistics.Send"
//	ОбъектОбработки - ОбработкаОбъект.ESD_SABY - объект обработки ядра
Процедура CloudStatisticsSend_ДополнитьПараметры(ПараметрыМетода, ОбъектОбработки)
	Если ЗначениеЗаполнено(ПараметрыМетода.data.context) Тогда
	    Возврат;
	КонецЕсли;
	
	Если ЭтоУниверсальноеРасширение() Тогда			
		context = ИмяФункционалаЭПДСтатистика();					
	Иначе	
		Настройки = ОбъектОбработки.ОбщиеНастройкиПрочитать();			
		Если ЗначениеЗаполнено(Настройки) И Настройки.Свойство("ExtSysSettingsId") Тогда				
			context = Настройки.ExtSysSettingsId;	
		Иначе
			// по дефолту ставим имя продукта, вместо пустого имени конфигурации
			МассивФункционала = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ПараметрыМетода.data.functional, "_");
			ИмяПродукта       = МассивФункционала[1];
			
			context = СтрЗаменить(ИмяПродукта, "1С ", "");
		КонецЕсли;	
	КонецЕсли;
	
	ПараметрыМетода.data.context = context;
КонецПроцедуры

// Запись статистики документа "Путевой лист"
//
// Параметры:
//	ПараметрыЗагрузки - Структура - параметры загрузки документа
//	ПараметрыМетода - Структура - структура параметров для выполнения метода "CloudStatistics.Send"
//	ОбщиеПараметрыЗагрузки - ОбработкаОбъект.ESD_SABY - объект обработки ядра
//
//DynamicDirective
Процедура ЗаписатьСтатистику_ЭПЛ(ПараметрыЗагрузки, ПараметрыМетода, ОбщиеПараметрыЗагрузки)
	// Сохраним текущий "action" в отдельную переменную
	ТекущийAction = ПараметрыМетода.data.action;
	// Очистим "action"
	ПараметрыМетода.data.action = "";
	
	// Обработаем случай отсутствия "текущего титула" (первая запись документа)
	Если ПустаяСтрока(ПараметрыЗагрузки.ТекущийТитул) Тогда
		// Импорт модуля
		МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
		
		// Замена водителя		
		ЗначениеПЛПредыдущий = МодульТНОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ПараметрыЗагрузки.Ссылка, "ПЛПредыдущий");
		Если ЗначениеЗаполнено(ЗначениеПЛПредыдущий) Тогда			
			ПараметрыМетода.data.action = "Переход\ЗаменаВодителя";						
			ЗаписатьСтатистикуВОблако(ПараметрыЗагрузки.Ссылка, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
		КонецЕсли;
		
		// Несколько водителей
		ВодителиСтрокой = МодульТНОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ПараметрыЗагрузки.Ссылка, "Водитель"); 	
		МассивВодителей = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ВодителиСтрокой, ",");	
		Если МассивВодителей.Количество() > 1 Тогда
			ПараметрыМетода.data.action = "Переход\НесколькоВодителей";
			ЗаписатьСтатистикуВОблако(ПараметрыЗагрузки.Ссылка, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
		КонецЕсли;	
	КонецЕсли;
	
	// Прерываем выполнение, если была хотя бы одна запись "особенной" статистики ЭПЛ ("action" заполнен)
	Если Не ПустаяСтрока(ПараметрыМетода.data.action) Тогда
		Возврат;	
	КонецЕсли;
	
	// Вернем "action"
	ПараметрыМетода.data.action = ТекущийAction;
	ЗаписатьСтатистикуВОблако(ПараметрыЗагрузки.Ссылка, ПараметрыМетода, ОбщиеПараметрыЗагрузки);
КонецПроцедуры

#КонецОбласти // Статистика

//DynamicDirective
// Возвращает двоичные данные файла печатной формы из СБИС.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры загрузки
//  ДополнительныеПараметры - Структура - дополнительные параметры печати
//  АдресФайлаВСбис - Строка - адрес печатной формы pdf
//
// Возвращаемое значение:
//   Строка - адрес двоичных данных файла печатной формы.
//
Функция АдресДвоичныхДанныхФайла(ПараметрыЗагрузки, ДополнительныеПараметры, Знач АдресФайлаВСбис = Неопределено) Экспорт
	
	РезультатФункции = Неопределено;
	
	Если Не ПараметрыЗагрузки.ЗагрузкаТребуется Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Если АдресФайлаВСбис = Неопределено Тогда
		АдресФайлаВСбис = СсылкаНаПечатнуюФорму(ПараметрыЗагрузки, ДополнительныеПараметры);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресФайлаВСбис) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Если ТипЗнч(АдресФайлаВСбис) = Тип("Массив") Тогда
		ДвоичныеДанныеФайла = Новый Массив;
		Для Каждого ТекущийАдресФайлаВСбис Из АдресФайлаВСбис Цикл
			ТекущиеДвоичныеДанные = ПараметрыЗагрузки.ОбъектОбработки.local_helper_download_from_link(
				ПараметрыЗагрузки.context_params,
				ТекущийАдресФайлаВСбис);
			ДвоичныеДанныеФайла.Добавить(ТекущиеДвоичныеДанные);
		КонецЦикла;
	Иначе
		Если ДополнительныеПараметры.Свойство("ПечатнаяФорма") Тогда
			ОбработатьИзменениеПечатнойФормы(АдресФайлаВСбис, ДополнительныеПараметры.ПечатнаяФорма);
		КонецЕсли;
		ДвоичныеДанныеФайла = ПараметрыЗагрузки.ОбъектОбработки.local_helper_download_from_link(
			ПараметрыЗагрузки.context_params,
			АдресФайлаВСбис);
	КонецЕсли;
	
	РезультатФункции = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, ПараметрыЗагрузки.УникальныйИдентификаторФормы);
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective
Функция СсылкаНаПечатнуюФорму(ПараметрыЗагрузки, ДополнительныеПараметры)
	
	РезультатФункции = Неопределено;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.УИДСбис) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Идентификатор", ПараметрыЗагрузки.УИДСбис);
	Если ДополнительныеПараметры.ЭтоПечатьQRКода Тогда
		ПараметрыМетода.Вставить("ДопПоля","Расширение,QRFrameLinks");
	Иначе
		ПараметрыМетода.Вставить("ДопПоля","Подстановки,Расширение");
	КонецЕсли;
	
	Попытка
		Результат = ПараметрыЗагрузки.ОбъектОбработки.local_helper_read_document(
			ПараметрыЗагрузки.context_params,
			ПараметрыМетода);
		
		Если ДополнительныеПараметры.ВыгрузкаАрхива Тогда
			РезультатФункции = Результат["СсылкаНаАрхив"];
		ИначеЕсли ДополнительныеПараметры.ЭтоПечатьQRКода Тогда
			РезультатФункции = Результат["QRFrameLinks"];
		Иначе
			РезультатФункции = Результат["СсылкаНаPDF"];
		КонецЕсли;
	Исключение
		
		ИнфоОшибки = ИнформацияОбОшибке();
		
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			ПараметрыЗагрузки.СсылкаНаДокумент,
			"Не удалось получить печатную форму",
			ИнфоОшибки.Описание);
		
	КонецПопытки;
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective
// Получает справочные данные с онлайна.
//
// Параметры:
//  ИмяСправочника - Строка - наименование справочника, который необходимо получить с онлайна.
//  ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
// Возвращаемое значение:
//   Массив - данные зависят от справочника, получаемого с онлайна.
//
Функция СправочникСОнлайна(ИмяСправочника, ОбщиеПараметрыЗагрузки) Экспорт
	// Импорт модуля "ESD_Record"
	мRecord = МодульКодаКлиент("ESD_Record");
	// Создание структуры Record
	Record = мRecord.AppendField(ИмяСправочника, "Справочник", мRecord.tString());
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("ДопПоля",    Новый Массив);
	ПараметрыМетода.Вставить("Фильтр",     мRecord.Expand(Record));
	ПараметрыМетода.Вставить("Сортировка", null);
	ПараметрыМетода.Вставить("Навигация",  null);
	
	Метод = "Классификаторы.ПолучитьСправочникЦеликом";
	ДопПараметры = Новый Структура("protocol", 6);
	
	РезультатSaby = ВыполнитьМетодSaby(Метод, ПараметрыМетода, ДопПараметры, ОбщиеПараметрыЗагрузки); 
	
	Результат = РезультатSaby["Результат"];
	
	Возврат Результат["result"]["d"];
КонецФункции

//DynamicDirective
// Получение из СБИС текущего варианта печатной формы документа
//
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры загрузки печатной формы.
//  ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки 
//
// Возвращаемое значение:
//   Строка - Id печатной формы
//
Функция ТекущийВариантПечатнойФормы(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	ДополнительныеПараметры = Новый Структура("ДопПоля", "Подстановки,Расширение");
	Результат = ЗагрузитьДанныеДокументаИзSaby(ПараметрыЗагрузки, ДополнительныеПараметры, ОбщиеПараметрыЗагрузки);
	Если НЕ Результат.Успешно Тогда
		Возврат "";
	КонецЕсли;
	
	ИнформационныеПоля = ИнформационныеПоляДокументаSaby(Результат.Данные);
	Возврат МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(ИнформационныеПоля, "Текст.VisualForm");	
КонецФункции

//DynamicDirective
// Получение из СБИС вариантов печатной формы документа
//
// Параметры:
//  ИмяМетаданных - Строка - вид документа
//	ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
// Возвращаемое значение:
//   Соответствие - представление объекта Record, содержащий доступные печатные формы документа
//
Функция ВариантыПечатнойФормы(ИмяМетаданных, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	Результат = Новый Структура("Ошибка,Данные", Ложь, Неопределено);
	
	ПараметрыМетода = Новый Структура("ДопПоля,Навигация,Сортировка,Фильтр"
		,Новый Массив
		,Неопределено
		,Неопределено
		,Неопределено
	);
	
	ПараметрыДокументаДляАПИ = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыДокументаДляАПИ(ИмяМетаданных);
	Метод = ПараметрыДокументаДляАПИ.Тип + ".GetVisualVariants";
	
	РезультатSaby = ВыполнитьМетодSaby(Метод, ПараметрыМетода);
	Если РезультатSaby.Ошибка Тогда
		Результат.Ошибка = Истина;
		Результат.Данные = РезультатSaby.ОписаниеОшибки;
	Иначе
		МодульRecord = МодульКода("ESD_Record");
		Результат.Данные = МодульRecord.Decrease(РезультатSaby.Результат["result"]);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

//DynamicDirective
// Обертка над методом "ВыполнитьМетодAPI"
//
// Параметры:
//  Метод - Строка - имя метода.
//  Параметры - Структура - параметры метода.
//	ДополнительныеПараметры - Структура - дополнительные параметры метода.
//	ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
// Возвращаемое значение:
//   Структура - структура результата запроса.
//
Функция ВыполнитьМетодSaby(Метод, Параметры, Знач ДополнительныеПараметры = Неопределено, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	// BSLLS:FunctionOutParameter-off
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
		ОбщиеПараметрыЗагрузки = МодульТНОбщегоНазначенияСервер.ОбщиеПараметрыВыгрузкиЗагрузки();
	КонецЕсли;
	// BSLLS:FunctionOutParameter-on
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура("protocol", 7);
	КонецЕсли;

	РезультатAPI = ВыполнитьМетодAPI(Метод 
		,Параметры
		,ОбщиеПараметрыЗагрузки
		,ДополнительныеПараметры
	);
	
	Возврат РезультатAPI;
КонецФункции

//DynamicDirective
// Получает данные документа из СБИС.
//
// Параметры:
//  Параметры - Структура - структура обязательных параметров для получения данных из СБИС (ссылка,имяметаданных)
//  ДополнительныеПараметры - Структура - структура дополнительных параметров метода
//  ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки.
//
// Возвращаемое значение:
//   Структура - структура результата запроса.
//
Функция ЗагрузитьДанныеДокументаИзSaby(Параметры, ДополнительныеПараметры = Неопределено, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	Перем SabyID, ДопПоля;
	Результат = Новый Структура("Успешно,Данные", Истина, Неопределено);
	
	SabyID = ИдСбисДокумента(Параметры);
	Если НЕ ЗначениеЗаполнено(SabyID) Тогда 
		Результат.Данные = "У документа нет идентификатора Saby, обновление данных невозможно!";
		Результат.Успешно = Ложь;
		Возврат Результат;
	КонецЕсли;
	Параметры.Вставить("ИДСбис", SabyID); 
	
	// BSLLS:FunctionOutParameter-off
	Если ОбщиеПараметрыЗагрузки = Неопределено Тогда
		МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
		ОбщиеПараметрыЗагрузки = МодульТНОбщегоНазначенияСервер.ОбщиеПараметрыВыгрузкиЗагрузки();
	КонецЕсли;
	// BSLLS:FunctionOutParameter-on
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ДополнительныеПараметры.Свойство("ДопПоля", ДопПоля);
	КонецЕсли;
	
	Если ТипЗнч(ДопПоля) <> Тип("Строка") Тогда
		ДопПоля = "";
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура("Идентификатор,ДопПоля", SabyID, ДопПоля);
	Попытка
		РезультатСБИС = ОбщиеПараметрыЗагрузки.ОбъектОбработки.local_helper_read_document(
			ОбщиеПараметрыЗагрузки.context_params, ПараметрыМетода);
		
		Результат.Данные = РезультатСБИС;
	Исключение
		ИнфоОшибки = ИнформацияОбОшибке();
		ТекстОшибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПричинаОшибкиИзЯдра", ИнфоОшибки.Описание);
		Результат.Данные = ТекстОшибки;
		Результат.Успешно = Ложь;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

#Область ВзаимодействиеСОнлайном_СлужебныеМетоды

Функция ИнформационныеПоляДокументаSaby(ДокументSaby)
	ИнформационныеПоля = Новый Соответствие;
	
	СписокИнформационныхПолей = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		ДокументSaby, "Подстановки.ОтветственныйЗаВыпуск.Документ.ИнформационноеПоле");	
	Если ТипЗнч(СписокИнформационныхПолей) <> Тип("Массив") Тогда
		Возврат ИнформационныеПоля;
	КонецЕсли;
	
	Для Каждого Данные Из СписокИнформационныхПолей Цикл
		ДобавитьИнформационноеПоле(ИнформационныеПоля, Данные);				
	КонецЦикла;	
	
	Возврат ИнформационныеПоля;
КонецФункции

Процедура ДобавитьИнформационноеПоле(ИнформационныеПоля, ДанныеИнфоПоля)
	Если ТипЗнч(ДанныеИнфоПоля) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из ДанныеИнфоПоля Цикл
		ИнфоПоле = ИнформационныеПоля[КлючЗначение.Ключ];
		Если ИнфоПоле = Неопределено Тогда
			ИнфоПоле = Новый Соответствие;
			ИнформационныеПоля.Вставить(КлючЗначение.Ключ, ИнфоПоле);
		КонецЕсли;
		
		ОписаниеИнфоПоля = КлючЗначение.Значение;
		Для Каждого Данные Из ОписаниеИнфоПоля Цикл
			ИнфоПоле.Вставить(Данные["Ид"], Данные["Значение"]);	
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьИзменениеПечатнойФормы(АдресФайла, ПечатнаяФорма)
	АдресФайла = ИзменитьАдресФайлаПечатногоДокумента(АдресФайла, ПечатнаяФорма);
КонецПроцедуры

Функция ИзменитьАдресФайлаПечатногоДокумента(АдресФайла, ПечатнаяФорма)
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	СоставURL = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(АдресФайла, "?");
	Если СоставURL.Количество() < 2 Тогда
		Возврат АдресФайла;
	КонецЕсли;
	
	СоставПараметровURL = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(СоставURL[1], "&");
	paramsURL = Неопределено;
	paramsIndex = 0;
	
	Для i = 0 По СоставПараметровURL.Количество() - 1 Цикл
		СоставПараметра = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(СоставПараметровURL[i], "=");
		Если СоставПараметра[0] = "params" Тогда
			paramsURL = СоставПараметра[1];
			paramsIndex = i;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если paramsURL = Неопределено Тогда
		Возврат АдресФайла;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	paramsJSON = МодульТНОбщегоНазначенияСервер.ДекодироватьURLВСтроку(paramsURL);
	params = МодульТНОбщегоНазначенияСервер.ДекодироватьJSON(paramsJSON);
	
	ОбновитьАдресФайла = Ложь;
	param = params["Params"];
	Для i = 0 По param["s"].Количество() - 1 Цикл
		col = param["s"][i];
		Если col["n"] = "ReqId" Тогда
			param["d"][i] = param["d"][i] + ПечатнаяФорма;
			ОбновитьАдресФайла = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ОбновитьАдресФайла Тогда
		Возврат АдресФайла;
	КонецЕсли;
	
	paramsJSON = МодульТНОбщегоНазначенияСервер.ЗакодироватьJSON(params);
	paramsURL = МодульТНОбщегоНазначенияСервер.КодироватьСтрокуВURL(paramsJSON);
	СоставПараметровURL[paramsIndex] = "params=" + paramsURL;
	ПараметрыURL = МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(СоставПараметровURL, "&");
	СоставURL[1] = ПараметрыURL;
	Возврат МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(СоставURL, "?");
КонецФункции

#КонецОбласти

