
Функция СохранитьДокумент(ОбъектДок, ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, ДополнительныеПараметры)
	// BSLLS:SetPrivilegedMode-off
    УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
    
    Попытка
		Если Не ЗначениеЗаполнено(ОбъектДок.Ссылка) Тогда	
			ОбъектДок.УстановитьНовыйНомер();
			Если Не ЗначениеЗаполнено(ОбъектДок.Дата) Тогда
				ОбъектДок.Дата = ТекущаяДатаСеанса();
			КонецЕсли;	
		КонецЕсли;
		
		ОбъектДок.Записать();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
        МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаписатьОшибкуВЖурналРегистрации(Неопределено, 
            "Сохранение документа", 
            ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат Неопределено;
	КонецПопытки;
	
    Попытка
        ПослеСохраненияДокумента(ОбъектДок, ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, ДополнительныеПараметры); 
	Исключение
        ИнформацияОбОшибке = ИнформацияОбОшибке();
        МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаписатьОшибкуВЖурналРегистрации(Неопределено, 
            "После сохранения документа", 
            ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
    КонецПопытки;
	
    Возврат ОбъектДок.Ссылка;
КонецФункции

Процедура ПослеСохраненияДокумента(ОбъектДок, ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, ДополнительныеПараметры)
    Модуль_ESDСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	ПараметрыЗагрузки.Ссылка = ОбъектДок.Ссылка;
	
    // запись РС "ESD_СостоянияОбъектовИнтеграции"
    ПараметрыСтатус = Модуль_ESDСервер.ПараметрыЗаписиРегистраСостояний();		
    ПараметрыСтатус.ИД                     = ПараметрыЗагрузки.ИдСбис;
    ПараметрыСтатус.АктивныйЭтап           = СокрЛП(ДополнительныеПараметры.АктивныйЭтап);
    ПараметрыСтатус.Ссылка                 = ПараметрыЗагрузки.Ссылка;
    ПараметрыСтатус.ТипИсточника           = ПараметрыЗагрузки.ТипИсточника;
    ПараметрыСтатус.ИдентификаторИсточника = ПараметрыЗагрузки.ИдентификаторИсточника;
    ПараметрыСтатус.Состояние              = ДополнительныеПараметры.Состояние;
    
    Если Не ПараметрыЗагрузки.ИзДокумента Тогда
        ПараметрыСтатус.СбисИД = "Не просмотрен";
    Иначе
        ПараметрыСтатус.СбисИД = "";
    КонецЕсли;

    Если ЗначениеЗаполнено(ПараметрыЗагрузки.ИдентификаторИсточника) Или ПараметрыЗагрузки.ИзРасширения Тогда
        Модуль_ESDСервер.ОбновитьДанныеСостояния(ПараметрыСтатус);
    КонецЕсли;
           
    МодульКода("РегистрыСведений.ESD_ДанныеСобытий").ДобавитьНабор(
        ПараметрыЗагрузки.Ссылка, ПараметрыЗагрузки.ДанныеДокумента["Событие"], Истина);
		
	ДополнительныеПараметры.Вставить("ПараметрыСтатус", ПараметрыСтатус);	
	Подключаемый_ПослеСохраненияДокумента(ОбъектДок, ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, ДополнительныеПараметры);
КонецПроцедуры

