
Функция СохранитьДокумент(ОбъектДок, ПараметрыЗагрузки, ДополнительныеПараметры)
	// BSLLS:SetPrivilegedMode-off
    УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
    
    Попытка
		Если Не ЗначениеЗаполнено(ОбъектДок.Ссылка) Тогда	
			ОбъектДок.УстановитьНовыйНомер();
			Если Не ЗначениеЗаполнено(ОбъектДок.Дата) Тогда
				ОбъектДок.Дата = ТекущаяДатаСеанса();
			КонецЕсли;	
		КонецЕсли;
		
		ОбъектДок.Записать();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
        МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаписатьОшибкуВЖурналРегистрации(Неопределено, 
            "Сохранение документа", 
            ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат Неопределено;
	КонецПопытки;

    Попытка
        ПослеСохраненияДокумента(ОбъектДок, ПараметрыЗагрузки, ДополнительныеПараметры); 
	Исключение
        ИнформацияОбОшибке = ИнформацияОбОшибке();
        МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаписатьОшибкуВЖурналРегистрации(Неопределено, 
            "После сохранения документа", 
            ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
    КонецПопытки;
	
    Возврат ОбъектДок.Ссылка;
КонецФункции

Процедура ПослеСохраненияДокумента(ОбъектДок, ПараметрыЗагрузки, ДополнительныеПараметры)
    Модуль_ESDСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
		
    // запись РС "ESD_СостоянияОбъектовИнтеграции"
    ПараметрыСтатус = Модуль_ESDСервер.ПараметрыЗаписиРегистраСостояний();		
    ПараметрыСтатус.ИД                     = ПараметрыЗагрузки.ИдСбис;
    ПараметрыСтатус.АктивныйЭтап           = СокрЛП(ДополнительныеПараметры.АктивныйЭтап);
    ПараметрыСтатус.Ссылка                 = ОбъектДок.Ссылка;
    ПараметрыСтатус.ТипИсточника           = ПараметрыЗагрузки.ТипИсточника;
    ПараметрыСтатус.ИдентификаторИсточника = ПараметрыЗагрузки.ИдентификаторИсточника;
    ПараметрыСтатус.Состояние              = ДополнительныеПараметры.Состояние;
    
    Если Не ПараметрыЗагрузки.ИзДокумента Тогда
        ПараметрыСтатус.СбисИД = "Не просмотрен";
    Иначе
        ПараметрыСтатус.СбисИД = "";
    КонецЕсли;

    Если ЗначениеЗаполнено(ПараметрыЗагрузки.ИдентификаторИсточника) Или ПараметрыЗагрузки.ИзРасширения Тогда
        Модуль_ESDСервер.ОбновитьДанныеСостояния(ПараметрыСтатус);
    КонецЕсли;
    
    // запись РС "ДополнительныеСведения"
    ДанныеОснования = Новый Структура;
    Если ПараметрыЗагрузки.ИзРасширения Тогда
        ДанныеОснования.Вставить("Метаданные",    ОбъектДок.ДокументОснование_ОбъектМетаданных);
        ДанныеОснования.Вставить("Идентификатор", ОбъектДок.ДокументОснование_Идентификатор);
    Иначе
        МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
        ТипИсточника = ПараметрыЗагрузки.ТипИсточника;
        ЧастиИсточника = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(ТипИсточника, ".");
        Если ЧастиИсточника.Количество() > 0 Тогда
            ТипИсточника = ЧастиИсточника[ЧастиИсточника.ВГраница()];
        КонецЕсли;
        ДанныеОснования.Вставить("Метаданные",    ТипИсточника);
        ДанныеОснования.Вставить("Идентификатор", ПараметрыЗагрузки.ИдентификаторИсточника);
    КонецЕсли;
            
    ПараметрыСтатус.Вставить("ДанныеДокумента", ПараметрыЗагрузки.ДанныеДокумента);
    
    МодульКода("ESD_ТНВыгрузкаСервер").ЗаписатьДополнительныеСведенияОснования(
        ДанныеОснования, ПараметрыСтатус);	

    МодульКода("РегистрыСведений.ESD_ДанныеСобытий").ДобавитьНабор(
        ОбъектДок.Ссылка, ПараметрыЗагрузки.ДанныеДокумента["Событие"], Истина);
		
	Подключаемый_ПослеСохраненияДокумента(ОбъектДок, ПараметрыЗагрузки, ДополнительныеПараметры);
КонецПроцедуры

Процедура ЗагрузитьАрхивВложенийПослеЗавершенияДО(Ссылка, СсылкаНаАрхив)
    // Проверим общую настройку загрузки архива после завершения ДО
    ВыгружатьАрхивВложений = МодульКода("ESD_ТНОбщегоНазначенияСервер").ESD_ЗагрузитьНастройкиОбъекта("ВыгружатьАрхивВложений");
    Если ВыгружатьАрхивВложений <> Истина Тогда
		Возврат;
	КонецЕсли;
	
    // Загрузим архив
    ЗагрузитьАрхивВложениеВоВложенныеФайлы(Ссылка, СсылкаНаАрхив);
КонецПроцедуры

