
// Возвращает наименование события загрузки данных из Saby для журнала регистрациии 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
//DynamicDirective
Функция ИмяСобытияЖурналаРегистрации_ЗагрузкаИзSaby() Экспорт
	Возврат "Загрузка данных из Saby";
КонецФункции

// Возвращает наименование события выгрузке данных в Saby для журнала регистрациии 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
//DynamicDirective
Функция ИмяСобытияЖурналаРегистрации_ВыгрузкаВSaby() Экспорт
	Возврат "Выгрузка данных в Saby";
КонецФункции

// Возвращает наименование события обмена данными с Saby для журнала регистрации 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
//DynamicDirective
Функция ИмяСобытияЖурналаРегистрации_ОбменСSaby() Экспорт
	Возврат "Обмен с Saby";
КонецФункции

// Возвращает наименование события загрузки видов упаковки из Saby для журнала регистрации 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
//DynamicDirective
Функция ИмяСобытияЖурналаРегистрации_ЗагрузкаВидовУпаковки() Экспорт
	Возврат "Загрузка видов упаковки из Saby";
КонецФункции

// Возвращает наименование события загрузки опасных грузов из Saby для журнала регистрации 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
//DynamicDirective
Функция ИмяСобытияЖурналаРегистрации_ЗагрузкаОпасныхГрузов() Экспорт
	Возврат "Загрузка опасных грузов из Saby";
КонецФункции

// Возвращает наименование события записи статистики использования для журнала регистрации 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
//DynamicDirective
Функция ИмяСобытияЖурналаРегистрации_ЗаписьСтатистики() Экспорт
	Возврат "Запись статистики";
КонецФункции

// Возвращает наименование события добавления присоединенного файла для журнала регистрации 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
//DynamicDirective
Функция ИмяСобытияЖурналаРегистрации_ДобавлениеПрисоединенногоФайла() Экспорт
	Возврат "Файлы.Добавление присоединенного файла";
КонецФункции

// Возвращает наименование события сущность "Saby. Сотрудники" для журнала регистрациии 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
//DynamicDirective
Функция ИмяСобытияЖурналаРегистрации_Сотрудники() Экспорт
	Возврат "Сотрудники";
КонецФункции

// Возвращает наименование события сущности "Saby. Транспортные средства" для журнала регистрациии 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
//DynamicDirective
Функция ИмяСобытияЖурналаРегистрации_ТранспортныеСредства() Экспорт
	Возврат "Транспортные средства";
КонецФункции

// Возвращает наименование события сущности "Saby. Контрагенты" для журнала регистрациии 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
//DynamicDirective
Функция ИмяСобытияЖурналаРегистрации_Контрагенты() Экспорт
	Возврат "Контрагенты";
КонецФункции

// Возвращает наименование события функционала "Blockly" для журнала регистрациии 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
//DynamicDirective
Функция ИмяСобытияЖурналаРегистрации_Blockly() Экспорт
	Возврат "Bloсkly";
КонецФункции

