#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  Код - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.Saby_ВидПеревозки - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция ЗначениеПоКоду(Код) Экспорт
	
	Если Код = "КП" Тогда
		Возврат КоммерческиеПеревозки;
	ИначеЕсли Код = "СН" Тогда
		Возврат ДляСобственныхНужд;
	ИначеЕсли Код = "СТ" Тогда
		Возврат СпециальныеТранспортныеСредства;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующий код по указанному значению перечисления.
//
// Параметры:
//  Значение  - ПеречислениеСсылка.Saby_ВидПеревозки - значение перечисления
//
// Возвращаемое значение:
//   Строка - Строковое представление кода.
//
Функция КодПоЗначению(Значение) Экспорт
	
	Если Значение = КоммерческиеПеревозки Тогда
		Возврат "КП";
	ИначеЕсли Значение = ДляСобственныхНужд Тогда
		Возврат "СН";
	ИначеЕсли Значение = СпециальныеТранспортныеСредства Тогда
		Возврат "СТ";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
