
&НаКлиенте
Процедура ПередВыполнениемПечати(Форма, ПараметрыПечати)
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодготовкиПараметровПечати(ПараметрыПечати) Экспорт
	context_params = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД");
    ВыгрузитьЧерновикНаКлиенте(ПараметрыПечати.СсылкаНаДокумент, 
        ПараметрыПечати.Форма, 
        context_params);                                                      
    ПараметрыПечати.Вставить("context_params", context_params);
КонецПроцедуры

