
&НаКлиенте
Процедура ПечатнаяФорма_Сформировать(Результат, ПараметрыПечати) Экспорт
	Форма = ПараметрыПечати.Форма;	
	ПараметрыПечати.Удалить("Форма");
	
	РезультатСоздания = ПечатнаяФорма_Создать(ПараметрыПечати, Форма);
	ПечатнаяФорма_Отобразить(РезультатСоздания, ПараметрыПечати);

    Если Форма.КоличествоОшибок = 0 Тогда
		Форма.Ссылка = ПараметрыПечати.СсылкаНаДокумент;
		Форма.Прочитать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатнаяФорма_ПередФормированием(Результат, ПараметрыПечати) Экспорт
	Форма = ПараметрыПечати.Форма;
	Форма.ЗаполнитьСтруктуруДокумента();

	ФормаОбъект = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ФормаОбъект(Форма);
	СсылкаНаДокумент = ФормаОбъект.Ссылка;
	Если Не ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПечати.Вставить("СсылкаНаДокумент", СсылкаНаДокумент);
	ПослеПодготовкиПараметровПечати(ПараметрыПечати);
	
	ПечатнаяФорма_Сформировать(Неопределено, ПараметрыПечати);	
КонецПроцедуры

&НаКлиенте
Функция ПечатнаяФорма_Создать(ПараметрыПечати, Форма) Экспорт
	Результат = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.SabyДанныеПечатнойФормы", ПараметрыПечати);
    Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда	
        Возврат Результат;	
    КонецЕсли;
        
    ТранспортВО = ТранспортВО(Форма);
    
	ПараметрыЗагрузкиSaby = Результат.ПараметрыЗагрузки;
    ПараметрыЗагрузкиSaby.Вставить("ОбъектОбработки", ТранспортВО.ТранспортИнтеграции);
    
    РезультатЗагрузкиSaby = МодульКодаКлиент("ESD_ТНЗагрузкаСервер").АдресДвоичныхДанныхПечатнойФормы(
        ПараметрыЗагрузкиSaby, ПараметрыЗагрузкиSaby["СсылкаНаPDF"]);
    Если РезультатЗагрузкиSaby.Ошибка Тогда
        Результат.ОписаниеОшибки = РезультатЗагрузкиSaby.Данные;
    Иначе
        Результат.АдресДвоичныхДанных = РезультатЗагрузкиSaby.Данные;
    КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПечатнаяФорма_Отобразить(Результат, ПараметрыПечати) Экспорт
	Если ЗначениеЗаполнено(Результат.АдресДвоичныхДанных) Тогда		
		МодульКодаКлиент("ФайловаяСистемаКлиент").ОткрытьФайл(Результат.АдресДвоичныхДанных, , "ЭПД.pdf");	
	ИначеЕсли ЗначениеЗаполнено(Результат.СсылкаНаПрисоединенныйФайл) Тогда
		ДанныеФайла = МодульКодаКлиент("РаботаСФайламиСлужебныйВызовСервера").ДанныеФайлаДляОткрытия(
			Результат.СсылкаНаПрисоединенныйФайл,
			Неопределено,
			ПараметрыПечати.УникальныйИдентификатор);
		
		МодульКодаКлиент("РаботаСФайламиКлиент").ОткрытьФайл(ДанныеФайла);
	Иначе
		ОткрытьСсылкуИзСпискаДокументов(Результат);
	КонецЕсли;
КонецПроцедуры

