
&НаКлиенте
Функция ИмяФормыОбработки(ПолноеИмяФормы)
	
	МассивИмен = МодульКодаКлиент("Saby_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ПолноеИмяФормы, ".");
	
	ИмяФормыВнешнейОбработки = МассивИмен[МассивИмен.ВГраница()];
	
	Если ИмяФормыВнешнейОбработки = "ФормаДинамическихТитулов" Тогда
		ИмяФормыВнешнейОбработки = "Saby_ТранспортнаяНакладнаяДТ";
	КонецЕсли;
	
	Возврат ПутьКФормамОбработки() + ИмяФормыВнешнейОбработки;
	
КонецФункции

&НаКлиенте
Функция ПутьКФормамОбработки()
	ИмяФормыПС = СтрЗаменить(ЭтаФорма.ИмяФормы, ".", Символы.ПС);
	ПутьКФормам = "";
	Для Счетчик = 1 По СтрЧислоСтрок(ИмяФормыПС)-1 Цикл
	    ПутьКФормам = ПутьКФормам + СтрПолучитьСтроку(ИмяФормыПС, Счетчик) + ".";
	КонецЦикла;
	Возврат ПутьКФормам;
КонецФункции

