
&НаКлиенте
Функция ИмяФормыОбработки(ПолноеИмяФормы)
	
	МассивИмен = МодульКодаКлиент("Saby_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ПолноеИмяФормы, ".");
	
	ИмяФормыВнешнейОбработки = МассивИмен[МассивИмен.ВГраница()];
	
	Если ИмяФормыВнешнейОбработки = "ФормаДинамическихТитулов" Тогда
		ИмяФормыВнешнейОбработки = "Saby_ТранспортнаяНакладнаяДТ";
	КонецЕсли;
	
	Возврат ПутьКФормамОбработки() + ИмяФормыВнешнейОбработки;
	
КонецФункции

Функция ПутьКФормамОбработки() Экспорт
	Возврат ПутьКОбъекту() + "Форма.";
КонецФункции

Функция ПутьКМодулюОбъекта() Экспорт
	Возврат ПутьКОбъекту() + "МодульОбъекта.";
КонецФункции

Функция ПутьКОбъекту()
	ИмяФормыПС = СтрЗаменить(ЭтаФорма.ИмяФормы, ".", Символы.ПС);
	
	Путь = "";
	Для Счетчик = 1 По СтрЧислоСтрок(ИмяФормыПС)-2 Цикл
	    Путь = Путь + СтрПолучитьСтроку(ИмяФормыПС, Счетчик) + ".";
	КонецЦикла;
	
	Возврат Путь;	
КонецФункции

