
&НаСервере
Функция МодульКода(ИмяМодуля)
	
	Если ИмяМодуля = "ДлительныеОперации" Тогда
		Возврат Вычислить(ИмяМодуля);
	КонецЕсли;
	
	ИмяМодуляСтрокой = СтрЗаменить(ИмяМодуля, "Saby", "ESD");
		
	МодулиОбработки = Новый Соответствие;;
	МодулиОбработки.Вставить("Документы.ESD_ТранспортнаяНакладная", Истина);
	МодулиОбработки.Вставить("ESD_Core",                            Истина);
	МодулиОбработки.Вставить("Перечисления.ESD_ТипТитулаЭтрН",      Истина);
	МодулиОбработки.Вставить("Перечисления.ESD_ТипТитулаЭПЛ",       Истина);
	МодулиОбработки.Вставить("Перечисления.ESD_ТипТитулаЗнП",       Истина);
	МодулиОбработки.Вставить("Документы.",                          Истина);
	МодулиОбработки.Вставить("РегистрыСведений.ESD_ДанныеТитулов",  Истина);
	МодулиОбработки.Вставить("ESD_ТНОбщегоНазначенияКлиентСервер",  Истина);
	МодулиОбработки.Вставить("ESD_ТНОбщегоНазначенияСервер",        Истина);
	МодулиОбработки.Вставить("ESD_ТНЗагрузкаСервер",                Истина);
	МодулиОбработки.Вставить("ESD_ТНВыгрузкаСервер",                Истина);
	МодулиОбработки.Вставить("ESD_Record",                          Истина);

	Если МодулиОбработки[ИмяМодуляСтрокой] <> Неопределено Тогда
		ИмяФормыСКодом = "МодульОбработки";
	Иначе
		ИмяФормыСКодом = "";
	КонецЕсли;
	
	Если ИмяФормыСКодом = "МодульОбработки" Тогда
		Возврат РеквизитФормыВЗначение("Объект");
	Иначе
		Возврат ЭтаФорма;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЭтоУниверсальноеРасширение()
	
	Возврат Ложь;
	
КонецФункции

