
// Устанавливает настройки формы списка документов.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма со списком.
//
Процедура ДинСписокДокументов_УстановитьНастройки(Форма) Экспорт 
	УстановитьПараметрАккаунтаВСписке(Форма.Список);
	УстановитьПараметрКодЗавершенПоложительно(Форма.Список);
	УстановитьУсловноеОформлениеПоляДата(Форма);
	
	// для старых форм
	УстановитьУсловноеОформлениеСписка(Форма); 
КонецПроцедуры

// Общий обработчик события "ПриПолученииДанныхНаСервере" дин. списка формы документов
//
// Параметры:
//	ИмяЭлемента - Строка - см. описание "ПриПолученииДанныхНаСервере"
//  Настройки - НастройкиКомпоновкиДанных - см. описание "ПриПолученииДанныхНаСервере"
//  Строки - СтрокиДинамическогоСписка - см. описание "ПриПолученииДанныхНаСервере"
Процедура ДинСписокДокументов_ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки) Экспорт
	Если Не Строки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	СписокДокументов = Строки.ПолучитьКлючи();
	ДополнительныеПараметры = ДинСписокДокументов_ДополнительныеПараметрыЗаполнения(СписокДокументов);
	
	Для Каждого Строка Из Строки Цикл
		Ссылка = Строка.Ключ;
		ДанныеСтроки = Строка.Значение.Данные;
		ДинСписокДокументов_ЗаполнитьТекущийЭтапСтроки(ДанныеСтроки, Ссылка, ДополнительныеПараметры);
	КонецЦикла;	
КонецПроцедуры

// Заполнение дополненного текущего этапа строки дин. списка документов
//
// Параметры:
//	ДанныеСтроки - СтрокаДинамическогоСписка - данные строки дин. списка
//	Ссылка - ДокументСсылка - ссылка на документ/ключ строки дин. списка
//	ДополнительныеПараметры - Структура - структура дополнительных параметров, которая используется для заполнения строк
Процедура ДинСписокДокументов_ЗаполнитьТекущийЭтапСтроки(ДанныеСтроки, Ссылка, ДополнительныеПараметры) Экспорт
	Если ДанныеСтроки.Состояние = ДополнительныеПараметры.КодЗавершенПоложительно Тогда
		КомментарийУведомление = "";
	ИначеЕсли ДанныеСтроки.Состояние = ДополнительныеПараметры.КодЗавершенОтрицательно Тогда
		КомментарийУведомление = ДинСписокДокументов_СформироватьПредставлениеТекущегоЭтапа(ДанныеСтроки, Ссылка, ДополнительныеПараметры);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КомментарийУведомление) Тогда
		ДанныеСтроки.КомментарийУведомление = КомментарийУведомление;
	Иначе
		ОписаниеСостояния = ДополнительныеПараметры.СоответствиеСостояний.Получить(ДанныеСтроки.Состояние);
		ДанныеСтроки.КомментарийУведомление = ОписаниеСостояния.Наименование;
	КонецЕсли;
КонецПроцедуры

// Формирование представления текущего этапа строки дин. списка документов
//
// Параметры:
//	ДанныеСтроки - СтрокаДинамическогоСписка - данные строки дин. списка
//	Ссылка - ДокументСсылка - ссылка на документ/ключ строки дин. списка
//	ДополнительныеПараметры - Структура - структура дополнительных параметров, которая используется для заполнения строк
//
// Возвращаемое значение:
//	Строка - представление текущего этапа дин. списка
Функция ДинСписокДокументов_СформироватьПредставлениеТекущегоЭтапа(ДанныеСтроки, Ссылка, ДополнительныеПараметры) Экспорт

	ТекущийЭтап_ = ДинСписокДокументов_ПредставлениеОтлицательногоДО(ДанныеСтроки, Ссылка, ДополнительныеПараметры);
	КомментарийУведомление = ДанныеСтроки.КомментарийУведомление;
	Если Не ЗначениеЗаполнено(КомментарийУведомление) Тогда
		Возврат ТекущийЭтап_;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущийЭтап_) Тогда
		КомментарийУведомление = Строка(ТекущийЭтап_) + " (" + КомментарийУведомление + ")";
	Иначе
		КомментарийУведомление = "Комментарий: " + КомментарийУведомление;	
	КонецЕсли;
	
	Возврат КомментарийУведомление;
КонецФункции

// Создание и заполнение структуры дополнительных параметров заполнения строк дин. списка документов
//
// Параметры:
//	СписокДокументов - Массив - массив ключей/ссылок строк дин. списка
//
// Возвращаемое значение:
//	Структура - структура дополнительных параметров заполнения строк дин. списка документов
Функция ДинСписокДокументов_ДополнительныеПараметрыЗаполнения(СписокДокументов) Экспорт
	ДополнительныеПараметры = Новый Структура;
	
	ДополнительныеПараметры.Вставить("СоответствиеСостояний", 
		РегистрыСведений.ESD_СостоянияОбъектовИнтеграции.СоответствиеСостояний());
	ДополнительныеПараметры.Вставить("КодЗавершенПоложительно", 
		РегистрыСведений.ESD_СостоянияОбъектовИнтеграции.КодЗавершенПоложительно());
	ДополнительныеПараметры.Вставить("КодЗавершенОтрицательно", 
		РегистрыСведений.ESD_СостоянияОбъектовИнтеграции.КодЗавершенОтрицательно());
	
	ДанныеПоследнихТитулов_ = РегистрыСведений.ESD_ДанныеТитулов.ДанныеПоследнихТитулов(СписокДокументов);
	ДополнительныеПараметры.Вставить("ДанныеПоследнихТитулов", ДанныеПоследнихТитулов_);
	
	Возврат ДополнительныеПараметры;
КонецФункции  

Функция ДинСписокДокументов_ПредставлениеОтлицательногоДО(ДанныеСтроки, Ссылка, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(ДанныеСтроки.ТекущийЭтап) Тогда
		Возврат ДанныеСтроки.ТекущийЭтап;	
	КонецЕсли;	
	
	ДанныеТитула = ДополнительныеПараметры.ДанныеПоследнихТитулов.Найти(Ссылка, "СсылкаНаДокумент");
	Если ДанныеТитула <> Неопределено Тогда
		Возврат ДанныеТитула.ТипТитула;
	КонецЕсли;
	
	Возврат "";
КонецФункции

