
// Установка отбора в динамическом списке по аккаунту
//  Параметры:
// 	 Список - ДинамическийСписок - список для установки отбора
//
Процедура УстановитьПараметрАккаунтаВСписке(Список)
	Аккаунт = ESD_ТНОбщегоНазначенияСервер.АвторизованныйАккаунтСтрокой();
	
	ЗначениеПараметраКомпоновкиДанных = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Аккаунт"));
	Если ЗначениеПараметраКомпоновкиДанных <> Неопределено Тогда
		ЗначениеПараметраКомпоновкиДанных.Значение = Аккаунт;
		ЗначениеПараметраКомпоновкиДанных.Использование = Истина;
	КонецЕсли;
КонецПроцедуры

// Установка значения параметра "КодСостоянияЗавершенПоложительно" в динамическом списке
//  Параметры:
// 	 Список - ДинамическийСписок - список для установки параметра
//
Процедура УстановитьПараметрКодЗавершенПоложительно(Список)
	ЗначениеПараметраКомпоновкиДанных = Список.Параметры
		.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КодСостоянияЗавершенПоложительно"));
	Если ЗначениеПараметраКомпоновкиДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеПараметраКомпоновкиДанных.Значение = РегистрыСведений.ESD_СостоянияОбъектовИнтеграции.КодЗавершенПоложительно();
	ЗначениеПараметраКомпоновкиДанных.Использование = Истина;	
КонецПроцедуры

// Устанавливает представление поля Дата в списках, содержащих реквизит с составом даты Дата и время.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма со списком документов.
//
Процедура УстановитьУсловноеОформлениеПоляДата(Форма)
	
	ПолноеИмяРеквизита = "Список.Дата";
	ИмяЭлемента        = "Дата";
	
	ЧастиПолногоИмени = ESD_ТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(ПолноеИмяРеквизита, ".");
	
	Если ЧастиПолногоИмени.Количество() <> 2 Тогда 
		// Недопустимое значение параметра ПолноеИмяРеквизита.
		// Имя реквизита должно быть в формате ""<ИмяСписка>.<ИмяПоля>""'");
		Возврат;
	КонецЕсли;
	
	ИмяСписка = ЧастиПолногоИмени[0];
	РеквизитСписок = Форма[ИмяСписка];
	
	Если ТипЗнч(РеквизитСписок) = Тип("ДинамическийСписок") Тогда 
		// ДинамическийСписок позволяет установить условное оформление с помощью собственного компоновщика.
		// При этом параметр ИмяЭлемента игнорируется, потому что компоновщик динамического списка
		// не знает как будут отображены реквизиты списка, потому путем к реквизиту и значения отбора и оформления 
		// является имя реквизита динамического списка.
		УсловноеОформление = РеквизитСписок.УсловноеОформление;
		ПутьКРеквизиту = ЧастиПолногоИмени[1];
		ИмяОформляемогоПоля = ПутьКРеквизиту;
	Иначе 
		// Остальные списки, например, ДанныеФормыДерево:
		// не имеют собственного компоновщика, потому используют компоновщик самой формы.
		УсловноеОформление = Форма.УсловноеОформление;
		ПутьКРеквизиту = ПолноеИмяРеквизита;
		ИмяОформляемогоПоля = ИмяЭлемента;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УсловноеОформление.ИдентификаторПользовательскойНастройки) Тогда
		УсловноеОформление.ИдентификаторПользовательскойНастройки = "ОсновноеОформление";
	КонецЕсли;
	
	// Представление даты.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ДЛФ=D");
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяОформляемогоПоля);
	
	// Представление даты сегодня.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", НСтр("ru = 'ДФ=ЧЧ:мм';
																			|en = 'DF=hh:mm tt'"));
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяОформляемогоПоля);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКРеквизиту);
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКРеквизиту);
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоСледующегоДня);
	
КонецПроцедуры

// Устанавливает условное оформление списка для старых форм.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма со списком.
//
Процедура УстановитьУсловноеОформлениеСписка(Форма)
	
	Если Не ESD_ТНОбщегоНазначенияКлиентСервер.ЭтоУниверсальноеРасширение() Тогда
		Возврат;
	КонецЕсли;	
	
	Если Метаданные.ОсновнойРежимЗапуска = РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение Тогда 
	
		Для Каждого ЭлементОформления Из Форма.Список.УсловноеОформление.Элементы Цикл
			
			Если ЭлементОформления.Представление = "НеПросмотренные" Тогда
				ЭлементОформления.Использование = Истина;
			КонецЕсли;
							
		КонецЦикла;		
		
		Форма.Элементы.Дата.Ширина = 9;
		
	КонецЕсли;
	
КонецПроцедуры

