#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТолстыйКлиент_ДинСписок_ОбработатьНастройкиОтбора") Тогда
		ТолстыйКлиент_ДинСписок_ОбработатьНастройкиОтбора();	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	
	ОтборПоТипу = Неопределено;
	
	ПолеТип = Новый ПолеКомпоновкиДанных("Тип");
	Для Каждого ОтборКомпоновки Из Список.Отбор.Элементы Цикл
		Если ОтборКомпоновки.ЛевоеЗначение = ПолеТип Тогда
			ОтборПоТипу = ОтборКомпоновки;
		КонецЕсли; 
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	
	Если ОтборПоТипу <> Неопределено Тогда
		ПараметрыФормы.Вставить("ОтборТипов", ОтборПоТипу.ПравоеЗначение);
	КонецЕсли;
	
	ОткрытьФорму("Справочник." + ДокументыЭПДКлиент() + ".ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТолстыйКлиент_ДинСписок_ОбработатьНастройкиОтбора()
	Если Не Параметры.ФиксированныеНастройки.Отбор.Элементы.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеПараметров = Новый Соответствие;
	
	УсловияОтбора = "ИСТИНА";
	Для Каждого ЭлементОтбора Из Параметры.ФиксированныеНастройки.Отбор.Элементы Цикл
		ИмяПоля_ = Строка(ЭлементОтбора.ЛевоеЗначение);
		Если Найти(ИмяПоля_, ".") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПараметра_ = СтрЗаменить(ИмяПоля_, ".", "");
		УсловияОтбора = УсловияОтбора + " И ДокументыЭПД." + ИмяПоля_ + " В(&" + ИмяПараметра_ + ")";
		СоответствиеПараметров.Вставить(ИмяПараметра_, ЭлементОтбора.ПравоеЗначение);
	КонецЦикла;
	
	ЭтаФорма.Список.ПроизвольныйЗапрос = Истина;
	// BSLLS:QueryParseError-off
	ЭтаФорма.Список.ТекстЗапроса = "
		|ВЫБРАТЬ
		| 	*
		|ИЗ
		|	Справочник." + ДокументыЭПД() + " КАК ДокументыЭПД
		|ГДЕ
		|	" + УсловияОтбора + "
		|";
	// BSLLS:QueryParseError-on
	
	Для Каждого Параметр_ Из СоответствиеПараметров Цикл
		ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра(Параметр_.Ключ, Параметр_.Значение);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции 

#Область include_etrn_base_CommonModule_МетаданныеКлиент
#КонецОбласти // include_etrn_base_CommonModule_МетаданныеКлиент

#Область include_etrn_base_CommonModule_Метаданные //&НаСервереБезКонтекста
#КонецОбласти // include_etrn_base_CommonModule_Метаданные
