#Область ПрограммныйИнтерфейс

// Создание объекта СКД для выполнения отбора автоматического сценария
//
// Параметры:
//	ПолноеИмяМетаданных - Строка - полное имя метаданных объекта для формирования СКД
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных - схема компоновки данных для отработки отбора автоматического сценария
//
Функция СхемаКомпоновкиДанных(ПолноеИмяМетаданных) Экспорт
	СКД = Новый СхемаКомпоновкиДанных;
	Если Не ЗначениеЗаполнено(ПолноеИмяМетаданных) Тогда
		Возврат СКД;
	КонецЕсли;
	
	ИсточникДанных = СКД.ИсточникиДанных.Добавить();
	ИсточникДанных.ТипИсточникаДанных = "Local";
	ИсточникДанных.Имя                = "ИсточникДанных1";
	
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Запрос = 
		"ВЫБРАТЬ
		| *
		|ИЗ
		|	&ИсточникДанных КАК ИсточникДанных";
	НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "&ИсточникДанных", ПолноеИмяМетаданных);
	НаборДанных.ИсточникДанных = ИсточникДанных.Имя;
	НаборДанных.Имя = "НаборДанных1";
	
	Возврат СКД;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Запись в журнал регистрации
//
// Параметры:
//	Объект - Произвольно - объект/источник записи журнала регистрации
//	Подсобытие - Строка - подсобытие записи журнала регистрации
//	Уровень - УровеньЖурналаРегистрации - уровень журнала регистрации
//	Комментарий - Строка - комментарий
//
Процедура ЗаписатьВЖурналРегистрации(Объект, Знач Подсобытие = "", Знач Уровень = Неопределено, Знач Комментарий = "") Экспорт
	ИмяСобытия = ПрефиксСобытияЖР();
	Если Не ПустаяСтрока(Подсобытие) Тогда
		ИмяСобытия = ИмяСобытия + ". " + СокрЛП(Подсобытие);
	КонецЕсли;
	
	Если Уровень = Неопределено Тогда
		Уровень = УровеньЖурналаРегистрации.Ошибка;
	КонецЕсли;
	
	Попытка
		ОбъектМетаданных = Объект.Метаданные();
	Исключение
		ОбъектМетаданных = Неопределено;
	КонецПопытки;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Объект, Комментарий); 
КонецПроцедуры

#КонецОбласти

#Область include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСерверСлужебный_ПрефиксСобытияЖурналаРегистрации
#КонецОбласти