
#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  Код - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ESD_КодыОграниченийПроездаЧерезТуннели - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция ОграничениеПроездаПоКоду(Код) Экспорт
	
	Если Код = "B" Тогда
		Возврат ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.B");
	ИначеЕсли Код = "B1000C" Тогда
		Возврат ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.B1000C");
	ИначеЕсли Код = "B_D" Тогда
		Возврат ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.B_D");
	ИначеЕсли Код = "B_E" Тогда
		Возврат ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.B_E");
	ИначеЕсли Код = "C" Тогда
		Возврат ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.C");
	ИначеЕсли Код = "C5000D" Тогда
		Возврат ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.C5000D");
	ИначеЕсли Код = "C_D" Тогда
		Возврат ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.C_D");
	ИначеЕсли Код = "C_E" Тогда
		Возврат ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.C_E");
	ИначеЕсли Код = "D" Тогда
		Возврат ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.D");
	ИначеЕсли Код = "D_E" Тогда
		Возврат ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.D_E");
	ИначеЕсли Код = "E" Тогда
		Возврат ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.E");
	Иначе
		Возврат ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующий код по указанному значению перечисления.
//
// Параметры:
//  Значение  - ПеречислениеСсылка.ESD_КодыОграниченийПроездаЧерезТуннели - значение перечисления
//
// Возвращаемое значение:
//   Строка - Строковое представление кода.
//
Функция КодПоОграничениюПроезда(Значение) Экспорт
	Результат = "-";

	Если Значение = ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.B") Тогда
		Результат = "B";
	ИначеЕсли Значение = ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.B1000C") Тогда
		Результат = "B1000C";
	ИначеЕсли Значение = ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.B_D") Тогда
		Результат = "B_D";
	ИначеЕсли Значение = ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.B_E") Тогда
		Результат = "B_E";
	ИначеЕсли Значение = ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.C") Тогда
		Результат = "C";
	ИначеЕсли Значение = ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.C5000D") Тогда
		Результат = "C5000D";
	ИначеЕсли Значение = ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.C_D") Тогда
		Результат = "C_D";
	ИначеЕсли Значение = ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.C_E") Тогда
		Результат = "C_E";
	ИначеЕсли Значение = ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.D") Тогда
		Результат = "D";
	ИначеЕсли Значение = ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.D_E") Тогда
		Результат = "D_E";
	ИначеЕсли Значение = ЗначениеМетаданных("ESD_КодыОграниченийПроездаЧерезТуннели.E") Тогда
		Результат = "E";
	Иначе
		Результат = "-";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

