#Область ПеременныеФормы

&НаКлиенте
Перем ТекущееДействие;

#КонецОбласти

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Заполним список выбора оснований метаданных
	ЗаполнитьСписокВыбораОснованийМетаданных();
	// Заполним список выбора событий
	ЗаполнитьСписокВыбораСобытийНаСервере();
	
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьПараметрыНовогоОбъектаНаСервере();	
	КонецЕсли;
	
	НастроитьЭлементыФормыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Элементы.ФормаИзменитьАктивность.Видимость = Истина;
	НастроитьКомандуИзмененияАктивностиНаСервере();
	
	ЗаполнитьКомпоновщикНастроекНаСервере(ТекущийОбъект.НастройкиОтбора.Получить());
	ЗагрузитьДействияОбъектаНаСервере(ТекущийОбъект);
	ОбработатьДополнительныеПараметрыОбъекта(ТекущийОбъект.ДополнительныеПараметры.Получить());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ЭтаФорма.Действие) Тогда
		ТекущееДействие = ЭтаФорма.Действие;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ПроверитьЗаполнениеРеквизитовФормы() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.Свойство("ИзменениеАктивности") Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ИзменениеАктивности", Истина);
		Возврат;
	КонецЕсли;
	
	СохранитьДействияОбъектаНаСервере(ТекущийОбъект);
	СохранитьНастройкиОтбораОбъектаНаСервере(ТекущийОбъект);
	СохранитьДополнительныеПараметрыОбъектаНаСервере(ТекущийОбъект);
	
	// Дополнительно сохраним настройки рег. задания
	ДанныеРегЗадания = Новый Структура;
	ДанныеРегЗадания.Вставить("Расписание", РегЗаданиеРасписание);
	ДанныеРегЗадания.Вставить("ИмяПользователя", РегЗаданиеПользователь);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("РегламентноеЗадание", ДанныеРегЗадания);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Обновим данные из объекта после записи
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ВладелецФормы = ЭтаФорма.ВладелецФормы;
	Если ПараметрыЗаписи.Свойство("ИзменениеАктивности") И ВладелецФормы <> Неопределено Тогда
		Если ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы") Тогда
			ВладелецФормы = ВладелецФормы.Родитель;		
		КонецЕсли;
		Оповестить("ESD_АктивностьИзменена", , ВладелецФормы);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ОснованиеМетаданныхПриИзменении(Элемент)
	ТекущееДействие = Неопределено;
	
	ОснованиеМетаданныхПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеМетаданныеОчистка(Элемент, СтандартнаяОбработка)
	ОснованиеМетаданныхПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
	ПриУдаленииДействия(ТекущееДействие);
	Если ЗначениеЗаполнено(ЭтаФорма.Действие) Тогда	
		ПриДобавленииДействия(ЭтаФорма.Действие);
	КонецЕсли;
	
	НастроитьВидимостьСтраницыПараметрыДействий();
КонецПроцедуры

&НаКлиенте
Процедура ДействиеОчистка(Элемент, СтандартнаяОбработка)
	ПриУдаленииДействия(ТекущееДействие);
КонецПроцедуры

&НаКлиенте
Процедура ДействиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(Объект.ОснованиеМетаданные) Тогда
		Сообщить("Основание не заполнено. Выбрать действие невозможно!");
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ОснованиеМетаданные", Объект.ОснованиеМетаданные);
	ОбработчикОповещения = Новый ОписаниеОповещения("ПослеВыбораДействия", ЭтаФорма);
	ОткрытьФорму("Справочник.ESD_АвтоматическиеСценарииДействия.Форма.ФормаВыбора", 
		ПараметрыФормы, 
		ЭтаФорма,,,,
		ОбработчикОповещения);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДействийПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.НастройкиДействий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыДействий.ТекущаяСтраница = Элементы.Найти(ТекущиеДанные.Префикс + "_Страница");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАктивность(Команда)
	Объект.Активно = Не Объект.Активно;
	ЭтаФорма.Записать(Новый Структура("ИзменениеАктивности", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ВариантВыполненияПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.ВариантВыполнения) Тогда
		Объект.Приоритет = 0;
		Элементы.ГруппаНастройкаСобственногоРегЗадания.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ВариантВыполненияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРасписаниеРегЗаданияНажатие(Элемент)
	Если ЭтаФорма.РегЗаданиеРасписание <> Неопределено Тогда
		Расписание = ЭтаФорма.РегЗаданиеРасписание;		
	Иначе
		Расписание = Новый РасписаниеРегламентногоЗадания;		
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеНастройкиРасписанияРегЗадания", ЭтаФорма);
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы[Элемент.Имя + "Значение"].ОграничениеТипа = Элемент.ТекущиеДанные.Тип;
КонецПроцедуры

#Область include_etrn_base_Modules_АвтоматическиеСценарии_Catalog_АвтоматическиеСценарии_CatalogForm_ФормаЭлемента_ПредопределенноеДействиеНажатие
#КонецОбласти

#Область include_etrn_base_Modules_АвтоматическиеСценарии_Catalog_АвтоматическиеСценарии_CatalogForm_ФормаЭлемента_ОснованиеМетаданныеНачалоВыбора
#КонецОбласти	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВариантВыполненияПриИзмененииНаСервере()
	Если ДоступнаНастройкаРасписанияВыполнения(Объект.ВариантВыполнения) Тогда
		Объект.Приоритет = 0;
		Элементы.ГруппаНастройкаСобственногоРегЗадания.Видимость = Истина;
		Элементы.Приоритет.Видимость = Ложь;
		ЗагрузитьСписокПользователейРегламентногоЗаданияНаСервере();
	Иначе
		Элементы.Приоритет.Видимость = Истина;
		Элементы.ГруппаНастройкаСобственногоРегЗадания.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокПользователейРегламентногоЗаданияНаСервере(Обновить = Ложь)
	// Загружаем, если список пользователей ранее не был загружен
	Если Элементы.РегЗаданиеПользователь.СписокВыбора.Количество() И Не Обновить Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РегЗаданиеПользователь.СписокВыбора.ЗагрузитьЗначения(
		СписокДоступныхПользователейРегЗадания());	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНовогоОбъектаНаСервере()
	Объект.ВариантВыполнения = МодульКода("Перечисления.АвтоматическиеСценарииВариантыВыполнения").Синхронно;
	Объект.КратностьЗапуска = МодульКода("Перечисления.АвтоматическиеСценарииВидыЗапуска").Однократный;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьСтраницыПараметрыДействий()
	Элементы.СтраницаНастройкиДействий.Видимость = ЭтаФорма.НастройкиДействий.Количество();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомпоновщикНастроекНаСервере(ТекущиеНастройки = Неопределено)
	СхемаКомпоновкиДанных = МодульКода("АвтоматическиеСценарииСерверСлужебный").СхемаКомпоновкиДанных(Объект.ОснованиеМетаданные);
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	ЭтаФорма.КомпоновщикНастроекКомпоновкиДанных.Инициализировать(ИсточникНастроек);
	Если ТекущиеНастройки <> Неопределено Тогда
		ЭтаФорма.КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(ТекущиеНастройки);	
	Иначе
		ЭтаФорма.КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;
КонецПроцедуры

#Область ОбработкаОснованияМетаданных

&НаСервере
Процедура ОснованиеМетаданныхПриИзмененииНаСервере()
	// Обновим "компоновщик настроек"
	ЗаполнитьКомпоновщикНастроекНаСервере();
	// Удалим добавленные действия
	УдалитьДействияНаСервере();
	// Перезаполним список доступных событий
	ЗаполнитьСписокВыбораСобытийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОснованияМетаданных(Результат, ДополнительныеПараметры) Экспорт
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОснованиеМетаданные = Результат.Значение;
	ОснованиеМетаданныхПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОснованийМетаданных()
	Элементы.ОснованиеМетаданные.СписокВыбора.Очистить();
	Для Каждого Строка Из МодульКода("АвтоматическиеСценарииСервер").СписокДоступныхОбъектовМетаданных() Цикл
		Элементы.ОснованиеМетаданные.СписокВыбора.Добавить(Строка.Значение, Строка.Представление);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработкаДействия

&НаКлиенте
Процедура ПослеВыбораДействия(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Действие = Результат;
	ДействиеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПриУдаленииДействия(УдаляемоеДействие)
	Если Не ЗначениеЗаполнено(УдаляемоеДействие) Тогда
		Возврат;
	КонецЕсли;
	
	ПриУдаленииДействияНаСервере(УдаляемоеДействие);
	УдаляемоеДействие = Неопределено;
КонецПроцедуры

&НаСервере
Процедура УдалитьДействияНаСервере(Знач ИсточникДействий = Неопределено)
	Если ИсточникДействий = Неопределено Тогда
		ИсточникДействий = ЭтаФорма.НастройкиДействий;
	КонецЕсли;
	
	ПоследнийИндекс = ИсточникДействий.Количество() - 1;
	Пока ПоследнийИндекс >= 0 Цикл
		// Удалим из таблицы настроек действий и добавленные элементы формы
		ПриУдаленииДействияНаСервере(ИсточникДействий[ПоследнийИндекс].Действие);
		ПоследнийИндекс = ПоследнийИндекс - 1;
	КонецЦикла;
	
	ЭтаФорма.Действие = Неопределено;
КонецПроцедуры

&НаСервере
Процедура ПриУдаленииДействияНаСервере(Знач ТекущееДействие)
	СтруктураПоискаДействия = Новый Структура("Действие", ТекущееДействие);	
	НастройкиДействия = ЭтаФорма.НастройкиДействий.НайтиСтроки(СтруктураПоискаДействия);
	Если Не ЗначениеЗаполнено(НастройкиДействия) Тогда
		Возврат;
	КонецЕсли;
	НастройкиДействия = НастройкиДействия[0];
	
	// Вытащим префикс наименований полей и реквизитов
	Префикс = НастройкиДействия.Префикс;
	
	// Удалим строку из таблицы настроек
	ЭтаФорма.НастройкиДействий.Удалить(НастройкиДействия);
	
	Если МодульКода("Справочники.АвтоматическиеСценарииДействия").ЭтоПредопределенноеДействие(ТекущееДействие) Тогда
		// Для предопределенных действий отдельная ветка удаления с формы
		ПредопределенноеДействие_УдалитьНаСервере(Префикс);
	Иначе
		// Найдем группу элементов, добавленных после выбора действия
		ГруппаЭлементовДействия = Элементы.Найти(Префикс + "_Страница");
		// Удалим найденную группу
		Элементы.Удалить(ГруппаЭлементовДействия);		
	КонецЕсли;
	
	РеквизитыНаУдаление = Новый Массив;
	
	// Заполним массив реквизитов на удаление
	ПрефиксОбработчикаДействия = ПрефиксОбработчикаДействия(Префикс);	
	Для Каждого Обработчик Из ДоступныеОбработчикиДействия() Цикл
		РеквизитыНаУдаление.Добавить(ПрефиксОбработчикаДействия + Обработчик.Ключ + "Текст");
		РеквизитыНаУдаление.Добавить(ПрефиксОбработчикаДействия + Обработчик.Ключ + "Параметры");	
	КонецЦикла;
	
	// Удалим реквизиты, добавленные после выбора действия
	ЭтаФорма.ИзменитьРеквизиты(, РеквизитыНаУдаление);
	
	// Установим "модифицированность"
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриДобавленииДействия(ДобавленноеДействие)
	Если ЭтаФорма.НастройкиДействий.НайтиСтроки(Новый Структура("Действие", ДобавленноеДействие)).Количество() Тогда
		Сообщить("Выбранное действие уже присутствует! Добавление невозможно");
		Возврат;
	КонецЕсли;
	
	Попытка
		ПриДобавленииДействияНаСервере(ДобавленноеДействие);
		ТекущееДействие = ДобавленноеДействие;
		
		// Установим "модифицированность"
		ЭтаФорма.Модифицированность = Истина;
	Исключение
		// Основная обработка исключения
		ДобавленноеДействие = Неопределено;
		ТекущееДействие = Неопределено;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПриДобавленииДействияНаСервере(Знач ДобавленноеДействие, Знач Родитель = Неопределено, Знач ПараметрыОбработчиков = Неопределено)
	Если Не ЗначениеЗаполнено(ДобавленноеДействие) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПредопределенноеДействие = МодульКода("Справочники.АвтоматическиеСценарииДействия").ЭтоПредопределенноеДействие(ДобавленноеДействие);
	Если ЭтоПредопределенноеДействие Тогда
		Префикс = МодульКода("Перечисления.АвтоматическиеСценарииПредопределенныеДействия").ИмяЗначения(ДобавленноеДействие);
		// Добавим на форму предопределенное действие
		РеквизитыОбработчиков = ПредопределенноеДействие_ДобавитьНаФорму(Префикс, ДобавленноеДействие);
	Иначе
		Префикс = "Действие" + СтрЗаменить(Строка(ДобавленноеДействие.УникальныйИдентификатор()), "-", "");
		// Добавим на форму необходимые реквизиты и элементы обычного действия
		РеквизитыОбработчиков = ДобавитьЭлементыФормыНастройкиДействия(Префикс, ДобавленноеДействие);	
	КонецЕсли;
		
	// Заполним параметры при наличии данных
	Если ТипЗнч(ПараметрыОбработчиков) = Тип("Структура") Тогда
		ЗаполнитьПараметрыОбработчиковДействияНаСервере(РеквизитыОбработчиков, ПараметрыОбработчиков, ЭтоПредопределенноеДействие);	
	КонецЕсли;
	
	НоваяСтрока = ЭтаФорма.НастройкиДействий.Добавить();
	НоваяСтрока.Действие = ДобавленноеДействие;
	НоваяСтрока.Родитель = Родитель;
	НоваяСтрока.Префикс = Префикс;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыОбработчиковДействияНаСервере(РеквизитыОбработчиков, ПараметрыОбработчиков, ЭтоПредопределенноеДействие = Ложь)
	Для Каждого РеквизитыОбработчика Из РеквизитыОбработчиков Цикл
		ИмяОбработчика = РеквизитыОбработчика.Ключ;
		Если Не ПараметрыОбработчиков.Свойство(ИмяОбработчика) Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаПараметров = ЭтаФорма[РеквизитыОбработчика.Значение.Параметры];
		ЗначенияПараметровОбработчика = ПараметрыОбработчиков[ИмяОбработчика];
		Если ЭтоПредопределенноеДействие Тогда
			Для Каждого ЗначениеПараметра Из ЗначенияПараметровОбработчика Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), ЗначениеПараметра);	
			КонецЦикла;
		Иначе
			ЗаполнитьПараметрыОбработчикаДействияНаСервере(ТаблицаПараметров, ЗначенияПараметровОбработчика);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыОбработчикаДействияНаСервере(ТаблицаПараметров, ЗначенияПараметров)
	Для Каждого Строка Из ТаблицаПараметров Цикл
		ЗначениеПараметра = ЗначенияПараметров[Строка.Ключ];
		// Проверим наличие и заполнение значения параметра
		Если ЗначениеПараметра = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		// Проверим соответствие типа данных значения параметра
		Если Не Строка.Тип.СодержитТип(ТипЗнч(ЗначениеПараметра)) Тогда
			Продолжить;
		КонецЕсли;
		
		Строка.Значение = ЗначениеПараметра;
	КонецЦикла;	
КонецПроцедуры

// BSLLS:MethodSize-off

&НаСервере
Функция ДобавитьЭлементыФормыНастройкиДействия(Знач Префикс, ДобавленноеДействие)
	Результат = Новый Структура;
	
	// Добавим страницу настройки действия
	СтраницаНастройкиДействия = СоздатьСтраницуНастройкиДействия(Префикс);
	
	// Добавим страницы обработчиков действия
	СтраницыОбработчиковДействия = СоздатьСтраницыНастройкиОбработчиковДействия(СтраницаНастройкиДействия, Префикс);
	
	ПрефиксОбработчикаДействия = ПрефиксОбработчикаДействия(Префикс);
	
	ОбработчикиДействия = МодульКода("Справочники.АвтоматическиеСценарииДействия").Обработчики(ДобавленноеДействие);
	Для Каждого КлючЗначение Из ДоступныеОбработчикиДействия() Цикл
		ИмяОбработчика = КлючЗначение.Ключ;
		ПредставлениеОбработчика = КлючЗначение.Значение;
		
		ИмяОбработчикаДействия = ПрефиксОбработчикаДействия + ИмяОбработчика;
		ИменаРеквизитовДействия = СоздатьРеквизитыОбработчикаДействия(ИмяОбработчикаДействия);
		СоздатьЭлементыОбработчикаДействия(СтраницыОбработчиковДействия, ИмяОбработчикаДействия, ПредставлениеОбработчика, ИменаРеквизитовДействия);
		
		ОписаниеОбработчикаДействия = ОбработчикиДействия[ИмяОбработчика];
		ЭтаФорма[ИменаРеквизитовДействия.Текст].УстановитьТекст(ОписаниеОбработчикаДействия.Текст);
		Если ТипЗнч(ОписаниеОбработчикаДействия.Параметры) = Тип("ТаблицаЗначений") Тогда
			ЭтаФорма[ИменаРеквизитовДействия.Параметры].Загрузить(ОписаниеОбработчикаДействия.Параметры);
		КонецЕсли;
		Результат.Вставить(ИмяОбработчика, ИменаРеквизитовДействия);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция СоздатьРеквизитыОбработчикаДействия(ИмяОбработчика)
	Результат = Новый Структура;
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	// Добавим реквизит обработчика
	ИмяРеквизитаОбработчикТекст = ИмяОбработчика + "Текст";
	РеквизитОбработчикТекст = Новый РеквизитФормы(ИмяРеквизитаОбработчикТекст,
		Новый ОписаниеТипов("ТекстовыйДокумент"));
	ДобавляемыеРеквизиты.Добавить(РеквизитОбработчикТекст);
	Результат.Вставить("Текст", ИмяРеквизитаОбработчикТекст);
	
	// Добавим реквизит параметров обработчика
	ИмяРеквизитаОбработчикПараметры = ИмяОбработчика + "Параметры";
	РеквизитОбработчикПараметры = Новый РеквизитФормы(ИмяРеквизитаОбработчикПараметры,
		Новый ОписаниеТипов("ТаблицаЗначений"));
	ДобавляемыеРеквизиты.Добавить(РеквизитОбработчикПараметры);
	Результат.Вставить("Параметры", ИмяРеквизитаОбработчикПараметры);
	
	ИмяРеквизитаКлюч = "Ключ";
	РеквизитТЗ = Новый РеквизитФормы(ИмяРеквизитаКлюч
		, Новый ОписаниеТипов("Строка")
		, ИмяРеквизитаОбработчикПараметры);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	ИмяРеквизитаЗначение = "Значение";
	РеквизитТЗ = Новый РеквизитФормы(ИмяРеквизитаЗначение
		, Новый ОписаниеТипов(Новый Массив)
		, ИмяРеквизитаОбработчикПараметры);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	ИмяРеквизитаТип = "Тип";
	РеквизитТЗ = Новый РеквизитФормы(ИмяРеквизитаТип
		, Новый ОписаниеТипов(Новый Массив)
		, ИмяРеквизитаОбработчикПараметры);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	
	// Изменим форму
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция СоздатьСтраницуНастройкиДействия(Префикс)
	НовыйЭлемент = Элементы.Добавить(Префикс + "_Страница"
		, Тип("ГруппаФормы")
		, Элементы.СтраницыДействий);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	НовыйЭлемент.РастягиватьПоВертикали = Истина;
	
	Возврат НовыйЭлемент;
КонецФункции

&НаСервере
Функция СоздатьСтраницыНастройкиОбработчиковДействия(Контейнер, Префикс)
	НовыйЭлемент = Элементы.Добавить(Префикс + "_СтраницыОбработчиков"
		, Тип("ГруппаФормы")
		, Контейнер);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страницы;
	НовыйЭлемент.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	НовыйЭлемент.РастягиватьПоВертикали = Истина;
	
	Возврат НовыйЭлемент;
КонецФункции

&НаСервере
Процедура СоздатьЭлементыОбработчикаДействия(Контейнер, ИмяРеквизитаОбработчика, Заголовок, ИменаРеквизитов)
	// Добавим страницу обработчика "Перед выполнением"
	ИмяСтраницаОбработчик = ИмяРеквизитаОбработчика + "_Страница";
	СтраницаОбработчика = Элементы.Добавить(ИмяСтраницаОбработчик,
		Тип("ГруппаФормы"), Контейнер);
	СтраницаОбработчика.Вид = ВидГруппыФормы.Страница;
	СтраницаОбработчика.Заголовок = Заголовок;
	СтраницаОбработчика.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СтраницаОбработчика.РастягиватьПоГоризонтали = Истина;
	СтраницаОбработчика.РастягиватьПоВертикали = Истина;
	
	ЭлементОбработчикТекст = Элементы.Добавить(ИменаРеквизитов.Текст
		, Тип("ПолеФормы"), СтраницаОбработчика);
	ЭлементОбработчикТекст.Вид = ВидПоляФормы.ПолеТекстовогоДокумента;
	ЭлементОбработчикТекст.ТолькоПросмотр = Истина;
	ЭлементОбработчикТекст.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементОбработчикТекст.РастягиватьПоГоризонтали = Истина;
	ЭлементОбработчикТекст.РастягиватьПоВертикали = Истина;
	ЭлементОбработчикТекст.ПутьКДанным = ИменаРеквизитов.Текст;
	
	// Добавим таблицу параметров обработчика "Перед выполнением"
	ЭлементОбработчикПараметры = Элементы.Добавить(ИменаРеквизитов.Параметры
		, Тип("ТаблицаФормы")
		, СтраницаОбработчика);
	ЭлементОбработчикПараметры.ПутьКДанным = ИменаРеквизитов.Параметры;
	ЭлементОбработчикПараметры.Отображение = ОтображениеТаблицы.Список;
	ЭлементОбработчикПараметры.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементОбработчикПараметры.РастягиватьПоГоризонтали = Истина;
	ЭлементОбработчикПараметры.РастягиватьПоВертикали = Истина;
    ЭлементОбработчикПараметры.ИзменятьСоставСтрок = Ложь;
	ЭлементОбработчикПараметры.ИзменятьПорядокСтрок = Ложь;
	ЭлементОбработчикПараметры.АвтоВводНовойСтроки = Ложь;
	ЭлементОбработчикПараметры.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ЭлементОбработчикПараметры.УстановитьДействие("ПриАктивизацииСтроки", "ПараметрыПриАктивизацииСтроки");
	
	// Добавим колонку "Ключ" таблицы параметров обработчика 
	НовыйЭлемент = Элементы.Добавить(ИменаРеквизитов.Параметры + "Ключ"
		, Тип("ПолеФормы")
		, ЭлементОбработчикПараметры);       
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = ИменаРеквизитов.Параметры + "." + "Ключ";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	// Добавим колонку "Значение" таблицы параметров обработчика 
	НовыйЭлемент = Элементы.Добавить(ИменаРеквизитов.Параметры + "Значение", 
		Тип("ПолеФормы"), 
		ЭлементОбработчикПараметры);       
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = ИменаРеквизитов.Параметры + "." + "Значение";	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПрефиксОбработчикаДействия(Знач Префикс)
	Возврат Префикс + "_Обработчик";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДоступныеОбработчикиДействия()
	Результат = Новый Структура;
	Результат.Вставить("ПередВыполнением", "Перед выполнением");
	Результат.Вставить("ПриВыполнении", "При выполнении");
	Результат.Вставить("ПослеВыполнения", "После выполнения");
	Возврат Результат;
КонецФункции

// BSLLS:MethodSize-on

&НаСервере
Процедура СохранитьДействияОбъектаНаСервере(ТекущийОбъект)
	ТекущийОбъект.Действия.Очистить();
	
	Для Каждого Строка Из ЭтаФорма.НастройкиДействий Цикл
		Если Не ЗначениеЗаполнено(Строка.Действие) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТекущийОбъект.Действия.Добавить();
		НоваяСтрока.Действие = Строка.Действие;
		Если Не ЗначениеЗаполнено(Строка.Родитель) Тогда
			НоваяСтрока.Родитель = МодульКода("Справочники.АвтоматическиеСценарииДействия").ПустаяСсылка();
		Иначе
			НоваяСтрока.Родитель = Строка.Родитель;
		КонецЕсли;
		
		ПараметрыОбработчиков = ПараметрыОбработчиковВСоответствие(ЭтаФорма, Строка.Префикс);
		НоваяСтрока.Параметры = Новый ХранилищеЗначения(ПараметрыОбработчиков);
	КонецЦикла;	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыОбработчиковВСоответствие(Форма, ПрефиксДействия)
	ПрефиксОбработчикаДействия = ПрефиксОбработчикаДействия(ПрефиксДействия);
	ПараметрыОбработчиков = ДоступныеОбработчикиДействия();
	Для Каждого КлючЗначение Из ПараметрыОбработчиков Цикл
		ИмяОбработчика = КлючЗначение.Ключ;
		ПараметрыОбработчиков[ИмяОбработчика] = ПреобразоватьТаблицуПараметровВСоответствие(
			Форма[ПрефиксОбработчикаДействия + ИмяОбработчика + "Параметры"]
		);		
	КонецЦикла; 
	
	Возврат ПараметрыОбработчиков;
КонецФункции

&НаСервере
Процедура ЗагрузитьДействияОбъектаНаСервере(ТекущийОбъект)
	Если Не ТекущийОбъект.Действия.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьДействияНаСервере(ТекущийОбъект.Действия);
	
	ДанныеДействия = ТекущийОбъект.Действия[0];
	ЭтаФорма.Действие = ДанныеДействия.Действие;
	
	ПриДобавленииДействияНаСервере(ДанныеДействия.Действие,
		ДанныеДействия.Родитель, 
		ДанныеДействия.Параметры.Получить());
КонецПроцедуры

&НаКлиенте
Функция ПараметрыТекущегоДействия(Действие)
	НастройкиДействия = ЭтаФорма.НастройкиДействий.НайтиСтроки(
		Новый Структура("Действие", Действие));
	Если Не НастройкиДействия.Количество() Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	Возврат ПараметрыОбработчиковВСоответствие(ЭтаФорма, НастройкиДействия[0].Префикс);
КонецФункции

#КонецОбласти

#Область ПредопределенныеДействия

&НаСервере
Функция ПредопределенноеДействие_ДобавитьНаФорму(Знач Префикс, ПредопределенноеДействие)
	Результат = Новый Структура;
	
	ПрефиксОбработчикаДействия = ПрефиксОбработчикаДействия(Префикс);
	Для Каждого КлючЗначение Из ДоступныеОбработчикиДействия() Цикл
		ИмяОбработчикаДействия = ПрефиксОбработчикаДействия + КлючЗначение.Ключ;
		ИменаРеквизитовДействия = СоздатьРеквизитыОбработчикаДействия(ИмяОбработчикаДействия);
		Результат.Вставить(КлючЗначение.Ключ, ИменаРеквизитовДействия);
	КонецЦикла;
	
	Если МодульКода("Перечисления.АвтоматическиеСценарииПредопределенныеДействия")
		.ЕстьФормаНастройки(ПредопределенноеДействие) 
	Тогда
		ПредопределенноеДействие_ДобавитьЭлементНастройки(Префикс);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПредопределенноеДействие_ДобавитьЭлементНастройки(Знач Префикс)
	НоваяГруппа = Элементы.Добавить("ГруппаПредопределенноеДействиеНастроить", Тип("ГруппаФормы"), Элементы.ГруппаПредопределенноеДействие);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Поведение = ПоведениеОбычнойГруппы.Обычное;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить(Префикс + "_ВертикальныйОтступ", Тип("ДекорацияФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = "";
	НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.Высота = 0;
	
	НовыйЭлемент = Элементы.Добавить(Префикс, Тип("ДекорацияФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = "Настроить";
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.УстановитьДействие("Нажатие", "ПредопределенноеДействиеНажатие");
	
	Возврат НовыйЭлемент;
КонецФункции

&НаСервере
Процедура ПредопределенноеДействие_УдалитьНаСервере(Префикс)
	Для Каждого Элемент Из Элементы.ГруппаПредопределенноеДействие.ПодчиненныеЭлементы Цикл
		Элементы.Удалить(Элемент);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПредопределенноеДействие_ПослеНастройки(Результат, ДополнительныеПараметры) Экспорт
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ПредопределенноеДействие_ПослеНастройкиНаСервере(Результат, ДополнительныеПараметры.ПредопределенноеДействие);
КонецПроцедуры

&НаСервере
Процедура ПредопределенноеДействие_ПослеНастройкиНаСервере(Знач Результат, Знач ПредопределенноеДействие)
	НастройкиДействия = ЭтаФорма.НастройкиДействий.НайтиСтроки(Новый Структура("Действие", ПредопределенноеДействие));
	Если Не НастройкиДействия.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ПрефиксДействия = НастройкиДействия[0].Префикс;
	ПрефиксОбработчикаДействия = ПрефиксОбработчикаДействия(ПрефиксДействия);
	Для Каждого КлючЗначение Из ДоступныеОбработчикиДействия() Цикл
		ИмяОбработчика = КлючЗначение.Ключ;
		
		ТаблицаПараметров = ЭтаФорма[ПрефиксОбработчикаДействия + ИмяОбработчика + "Параметры"];	
		ТаблицаПараметров.Очистить();
		Для Каждого ПараметрОбработчика Из Результат[ИмяОбработчика] Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), ПараметрОбработчика);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура СохранитьНастройкиОтбораОбъектаНаСервере(ТекущийОбъект)
	НастройкиОтбора_ = ЭтаФорма.КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();
	ТекущийОбъект.НастройкиОтбора = Новый ХранилищеЗначения(НастройкиОтбора_);	
КонецПроцедуры

&НаСервере
Процедура НастроитьКомандуИзмененияАктивностиНаСервере()
	КнопкаКоманды = Элементы.ФормаИзменитьАктивность;
	Если Объект.Активно Тогда
		НастроитьКомандуИзмененияАктивности_Выключить(КнопкаКоманды);	
	Иначе
		НастроитьКомандуИзмененияАктивности_Включить(КнопкаКоманды);		
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьКомандуИзмененияАктивности_Включить(КнопкаКоманды)
	КнопкаКоманды.Заголовок = "Включить";
	КнопкаКоманды.Картинка = БиблиотекаКартинок.ESD_СостояниеЗавершеноПоложительно;		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьКомандуИзмененияАктивности_Выключить(КнопкаКоманды)
	КнопкаКоманды.Заголовок = "Выключить";
	КнопкаКоманды.Картинка = БиблиотекаКартинок.ESD_СостояниеЗавершеноОтрицательно;
КонецПроцедуры

&НаСервере
Процедура ОбработатьДополнительныеПараметрыОбъекта(ДополнительныеПараметрыОбъекта)
	Если ТипЗнч(ДополнительныеПараметрыОбъекта) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = МодульКода("Справочники.АвтоматическиеСценарии").ДополнительныеПараметры();
	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ДополнительныеПараметрыОбъекта);
	
	ЗаполнитьОбработчикиАвтоматическогоСценарияНаСервере(ДополнительныеПараметры.Обработчики);
	
	ЭтаФорма.РегЗаданиеИдентификатор = ДополнительныеПараметры.РегламентноеЗадание.Идентификатор;
	ЗагрузитьДанныеРегламентногоЗаданияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбработчикиАвтоматическогоСценарияНаСервере(ОбработчикиАС)
	Если Не ЗначениеЗаполнено(ОбработчикиАС) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ОбработчикАС Из ОбработчикиАС Цикл
		ПрефиксРеквизита = "Обработчик" + ОбработчикАС.Ключ;
		ЭтаФорма[ПрефиксРеквизита + "Текст"].УстановитьТекст(ОбработчикАС.Значение.Текст);
		Попытка
			ПараметрыОбработчика = ОбработчикАС.Значение.Параметры;
			ЭтаФорма[ПрефиксРеквизита + "Параметры"].Очистить();
			Для Каждого КлючЗначение Из ПараметрыОбработчика Цикл
				НоваяСтрока = ЭтаФорма[ПрефиксРеквизита + "Параметры"].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, КлючЗначение);
			КонецЦикла;
		Исключение
			Продолжить;	
		КонецПопытки;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеРегламентногоЗаданияНаСервере()
	Если Не ЗначениеЗаполнено(ЭтаФорма.РегЗаданиеИдентификатор) Тогда
		Возврат;	
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	РегламентноеЗадание = МодульКода("АвтоматическиеСценарииСервер").РегламентноеЗадание(ЭтаФорма.РегЗаданиеИдентификатор);
	Если РегламентноеЗадание = Неопределено Тогда
		ЭтаФорма.РегЗаданиеИдентификатор = Неопределено;
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.РегЗаданиеРасписание = РегламентноеЗадание.Расписание;
	ЭтаФорма.РегЗаданиеПользователь = РегламентноеЗадание.ИмяПользователя;

	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервере
Процедура СохранитьДополнительныеПараметрыОбъектаНаСервере(ТекущийОбъект)
	ДополнительныеПараметры = МодульКода("Справочники.АвтоматическиеСценарии").ДополнительныеПараметры();
	
	СохранитьОбработчикиВДополнительныеПараметры(ДополнительныеПараметры.Обработчики);
	ДополнительныеПараметры.РегламентноеЗадание.Идентификатор = ЭтаФорма.РегЗаданиеИдентификатор;
	
	ТекущийОбъект.ДополнительныеПараметры = Новый ХранилищеЗначения(ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Процедура СохранитьОбработчикиВДополнительныеПараметры(Обработчики)
	Для Каждого Обработчик Из Обработчики Цикл
		ИмяОбработчика = Обработчик.Ключ;
		ПрефиксОбработчика = "Обработчик" + ИмяОбработчика;
		Обработчики[ИмяОбработчика].Текст = ЭтаФорма[ПрефиксОбработчика + "Текст"].ПолучитьТекст();
		Обработчики[ИмяОбработчика].Параметры = ПреобразоватьТаблицуПараметровВСоответствие(
			ЭтаФорма[ПрефиксОбработчика + "Параметры"].Выгрузить());
	КонецЦикла;
КонецПроцедуры

#Область НастройкаРегламентногоЗадания

&НаСервереБезКонтекста
Функция ДоступнаНастройкаРасписанияВыполнения(ВариантВыполнения)
	Возврат ВариантВыполнения = МодульКода("Перечисления.АвтоматическиеСценарииВариантыВыполнения").СобственноеРегламентноеЗадание;	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыФормыНаСервере()
	ВариантВыполненияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеНастройкиРасписанияРегЗадания(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	Если Результат <> Неопределено Тогда
		ЭтаФорма.РегЗаданиеРасписание = Результат;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокДоступныхПользователейРегЗадания()
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Результат = Новый Массив;
	
	Попытка
		Для Каждого ПользовательИБ Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
			Результат.Добавить(ПользовательИБ.Имя);		
		КонецЦикла;
	Исключение	
		Результат.Добавить(ПользователиИнформационнойБазы.ТекущийПользователь().Имя);	
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

&НаСервере
Процедура ЗаполнитьСписокВыбораСобытийНаСервере()
	ДоступныеСобытия = Новый Массив;
	Если ЗначениеЗаполнено(Объект.ОснованиеМетаданные) Тогда
		ДоступныеСобытия = МодульКода("Перечисления.АвтоматическиеСценарииСобытия")
			.ДоступныеСобытия(Объект.ОснованиеМетаданные);
	КонецЕсли;
		
	Элементы.Событие.СписокВыбора.ЗагрузитьЗначения(ДоступныеСобытия);
	
	Если ЗначениеЗаполнено(Объект.Событие) Тогда
		Если ДоступныеСобытия.Найти(Объект.Событие) = Неопределено Тогда
			Объект.Событие = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПреобразоватьТаблицуПараметровВСоответствие(ТаблицаПараметров) Экспорт
	Результат = Новый Соответствие;
	Для Каждого Строка Из ТаблицаПараметров Цикл
		Если ПустаяСтрока(Строка.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(Строка.Ключ, Строка.Значение);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитовФормы()
	Корректно = Истина;
	Если Не ПроверитьЗаполнение() Тогда
		Корректно = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Действие) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Действие";
		Сообщение.Текст = "Поле ""Действие"" не заполнено";
		Сообщение.Сообщить();
		Корректно = Ложь;
	КонецЕсли;
	
	Возврат Корректно;
КонецФункции

#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода //&НаСервереБезКонтекста
#КонецОбласти