
&НаКлиенте
Процедура ПредопределенноеДействиеНажатие(Элемент)
	ПараметрыОповещения = Новый Структура("ПредопределенноеДействие", ТекущееДействие);
	ПослеНастройкиПредопределенногоДействия = Новый ОписаниеОповещения("ПредопределенноеДействие_ПослеНастройки",
		ЭтаФорма,
		ПараметрыОповещения);
		
	ПараметрыФормы = Новый Структура("Основание", Объект.ОснованиеМетаданные);
	ПараметрыФормы.Вставить("ПараметрыДействия", ПараметрыТекущегоДействия(ТекущееДействие));
		
	ОткрытьФорму("Перечисление.ESD_АвтоматическиеСценарииПредопределенныеДействия.Форма." + Элемент.Имя,
		ПараметрыФормы,
		ЭтаФорма, , , ,
		ПослеНастройкиПредопределенногоДействия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

