
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.СсылкаНаВладельца = Параметры.Ссылка;
	ЭтаФорма.ИмяДокумента      = МодульКода("ESD_ТНОбщегоНазначенияСервер").ИмяМетаданныхДокумента(ЭтаФорма.СсылкаНаВладельца);
	
	ЭтаФорма.ЭтоДобавлениеСопоставления = Параметры.ЭтоДобавлениеСопоставления;
	
	ЭтаФорма.ТипМетаданных = Параметры.ТипМетаданных;
		
	УстановитьЗаголовокФормы();
	
	ЗаполнитьТаблицуМетаданных();
	
	УстановитьВариантОтбораПоУмолчанию();
	
	УстановитьОтбор();
	
	ОбновитьВидимостьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы <> Неопределено И ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтаФорма.Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Отказ = Истина;
	
	ПроцедураЗакрытьФорму = Новый ОписаниеОповещения("ЗакрытьФорму", ЭтаФорма);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПроверитьМодифицированностьИПродолжитьВыполнение(ПроцедураЗакрытьФорму);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантОтбораПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаМетаданных

&НаКлиенте
Процедура ТаблицаМетаданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не ЭтаФорма.ЭтоДобавлениеСопоставления Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = ЭтаФорма.ТаблицаМетаданных.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Результат = Новый Структура;
	Результат.Вставить("Имя",       ТекущаяСтрока.ИмяМетаданных);
	Результат.Вставить("ПолноеИмя", ТекущаяСтрока.ПолноеИмяМетаданных);
	Результат.Вставить("Синоним",   ТекущаяСтрока.Синоним);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМетаданныхПометкаПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПроцедураЗакрытьФорму = Новый ОписаниеОповещения("ЗакрытьФорму", ЭтаФорма);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПроверитьМодифицированностьИПродолжитьВыполнение(
		ПроцедураЗакрытьФорму, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиПоУмолчанию(Команда)
	
	УстановитьНастройкиПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	
	ИзменитьПометки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	ИзменитьПометки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтбор(Команда)
	
	УстановитьОтбор();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Записать() Экспорт
	
	СохранитьИзменения();
	
	ЭтаФорма.Модифицированность = Ложь;
	
	Оповестить("Saby_ИзмененыТипыДокументовОснований", Неопределено, ВладелецФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуМетаданных()
	
	ЭтаФорма.ТаблицаМетаданных.Очистить();
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ТипМетаданных) Тогда 
		
		// заполним справочниками и документами
		ДобавитьСтрокиВТаблицуМетаданных(Истина);
		ДобавитьСтрокиВТаблицуМетаданных(Ложь);
		
	Иначе
		
		ЭтоСправочник = ЭтаФорма.ТипМетаданных = "Справочник";
		ДобавитьСтрокиВТаблицуМетаданных(ЭтоСправочник);
		
	КонецЕсли;		
		
	// таблица была отсортирована именам
	ЭтаФорма.ТаблицаМетаданных.Сортировать("Синоним");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиВТаблицуМетаданных(ЭтоСправочник)
		
	Если ЭтоСправочник Тогда
		КоллекцияМетаданных = Метаданные.Справочники;
		МенеджерОбъекта     = Справочники;
	Иначе
		КоллекцияМетаданных = Метаданные.Документы;
		МенеджерОбъекта     = Документы;
	КонецЕсли;
	
	ОтмеченныеТипы = ОтмеченныеПользователемТипы();
	
	Для Каждого МетаданныеОбъекта Из КоллекцияМетаданных Цикл
		
		СтрокаТаблицы = ЭтаФорма.ТаблицаМетаданных.Добавить();
		СтрокаТаблицы.Тип           = ТипЗнч(МенеджерОбъекта[МетаданныеОбъекта.Имя].ПустаяСсылка());
		СтрокаТаблицы.Пометка       = ОтмеченныеТипы.Получить(СтрокаТаблицы.Тип) <> Неопределено;
		СтрокаТаблицы.ИмяМетаданных = МетаданныеОбъекта.Имя;
		
		Если ЭтоСправочник Тогда
			
			СтрокаМетаданные = "Справочник.";
			СтрокаТаблицы.Синоним = МетаданныеОбъекта.ПредставлениеСписка;			
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Синоним) Тогда
				СтрокаТаблицы.Синоним = МетаданныеОбъекта.Синоним;
			КонецЕсли;
			
		Иначе
			
			СтрокаМетаданные = "Документ.";
			СтрокаТаблицы.Синоним = Строка(СтрокаТаблицы.Тип);
			
		КонецЕсли;
		
		СтрокаТаблицы.ПолноеИмяМетаданных = СтрокаМетаданные + МетаданныеОбъекта.Имя;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОтмеченныеПользователемТипы(ЗначенияПоУмолчанию = Ложь)
	
	РезультатФункции = Новый Соответствие;
	Если ЭтаФорма.ЭтоДобавлениеСопоставления Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	МассивТипов = МодульКода("Документы." + ЭтаФорма.ИмяДокумента).ТипыДляЗаполненияНаОсновании(ЗначенияПоУмолчанию);
	
	Если ЗначениеЗаполнено(МассивТипов) Тогда
		
		Для Каждого Тип Из МассивТипов Цикл
			РезультатФункции.Вставить(Тип, Истина);
		КонецЦикла;
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для вашей конфигурации нет настроек по умолчанию. Воспользуйтесь ручной настройкой";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура УстановитьОтбор()
	
	Если ВариантОтбора = 0 Тогда
		ОтборСтрок = Новый ФиксированнаяСтруктура("Пометка", Истина);
	Иначе
		ОтборСтрок = Неопределено;
	КонецЕсли;
	
	Элементы.ТаблицаМетаданных.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЭтаФорма.Модифицированность = Ложь;
	КонецЕсли;
	
	Если Результат <> КодВозвратаДиалога.Отмена Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзменения()
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Пометка", Истина);
	
	МассивТипов = Новый Массив;
	
	НайденныеСтроки = ТаблицаМетаданных.НайтиСтроки(СтруктураПоиска);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивТипов.Добавить(НайденнаяСтрока.Тип);
	КонецЦикла;
	
	МодульКода("Документы." + ЭтаФорма.ИмяДокумента).СохранитьВыбранныеТипыДляЗаполненияНаОсновании(МассивТипов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиПоУмолчаниюНаСервере()
	
	ОтмеченныеТипы = ОтмеченныеПользователемТипы(Истина);
	
	Для Каждого СтрокаТаблицы Из ТаблицаМетаданных Цикл
		СтрокаТаблицы.Пометка = ОтмеченныеТипы.Получить(СтрокаТаблицы.Тип) <> Неопределено;
	КонецЦикла;
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПометки(Пометка)
	
	ЭтаФорма.Модифицированность = Истина;
	
	Для Каждого СтрокаТаблицы Из ТаблицаМетаданных Цикл
		СтрокаТаблицы.Пометка = Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВариантОтбораПоУмолчанию()
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Пометка", Истина);
	
	НайденныеСтроки = ТаблицаМетаданных.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ЭтаФорма.ВариантОтбора = 0; // отбор выбранных
	Иначе
		ЭтаФорма.ВариантОтбора = 1; // без отбора
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ИмяДокументаСтрокой = СтрЗаменить(ЭтаФорма.ИмяДокумента, "Saby_", "");
	ЭтаФорма.Заголовок  = СтрЗаменить(ЭтаФорма.Заголовок, "<ИмяДокумента>", ИмяДокументаСтрокой);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьЭлементовФормы()
	
	Элементы.ФормаЗаписатьИЗакрыть.Видимость = Не ЭтаФорма.ЭтоДобавлениеСопоставления;
	Элементы.ФормаУстановитьНастройкиПоУмолчанию.Видимость = Не ЭтаФорма.ЭтоДобавлениеСопоставления;
	Элементы.ГруппаОтборы.Видимость = Не ЭтаФорма.ЭтоДобавлениеСопоставления;
	Элементы.ТаблицаМетаданныхУстановитьСнятьФлажки.Видимость = Не ЭтаФорма.ЭтоДобавлениеСопоставления;
	Элементы.ТаблицаМетаданныхПометка.Видимость = Не ЭтаФорма.ЭтоДобавлениеСопоставления;
	
КонецПроцедуры

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область includr_etrn_src_vo2_CommonForm_ВыборТиповЭПД_СлужебныеПроцедурыИФункции
#КонецОбласти // includr_etrn_src_vo2_CommonForm_ВыборТиповЭПД_СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
