
Функция СтруктураОшибкиМетодаAPI(ИнформацияОбОшибке)
	Возврат ESD_ТНОбщегоНазначенияСервер
		.ОбъектОбработки()
		.NewExtExceptionСтруктура(ИнформацияОбОшибке);
КонецФункции

Процедура ЗаполнитьПараметрыЗагрузкиФайловПоСсылке(ПараметрыЗагрузки, ДополнительныеПараметры, ПовторноеПолучение = Ложь)
	ДанныеСостояния = МодульКода("ESD_ТНОбщегоНазначенияСервер")
		.ДанныеСостоянияОбъекта(ПараметрыЗагрузки.СсылкаНаДокумент);
	ЗаполнитьПараметрыЗагрузкиПоСсылкеДляРасширения(ПараметрыЗагрузки, ДанныеСостояния);
	
	Если ПовторноеПолучение Или Не ПараметрыЗагрузки.ТребуетсяОбновление Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("УстановитьПечатнуюФорму") Тогда
		ПараметрыЗагрузки.Вставить("УстановитьПечатнуюФорму", ДополнительныеПараметры.УстановитьПечатнуюФорму);			
	КонецЕсли;

	РезультатОбновления = SabyОбновитьДанныеФайлов(ПараметрыЗагрузки, ДополнительныеПараметры);
	Если РезультатОбновления.Итог.Количество Тогда
		// Перенесем после выгрузки полученные ссылки на файлы
		ДанныеДокументаСБИС = РезультатОбновления.Успешные[0];
		ПараметрыЗагрузки.СсылкаНаPDF = ДанныеДокументаСБИС["СсылкаНаPDF"];
		ПараметрыЗагрузки.СсылкаНаАрхив = ДанныеДокументаСБИС["СсылкаНаАрхив"];
		// Заполним параметры загрузки данных по ссылкам
		ЗаполнитьПараметрыЗагрузкиФайловПоСсылке(ПараметрыЗагрузки, ДополнительныеПараметры, Истина);
	Иначе	
		ПараметрыЗагрузки.СписокДокументов = РезультатОбновления.Ошибки;
		ПараметрыЗагрузки.ОшибкиОбщие = РезультатОбновления.ОшибкиОбщие;
	КонецЕсли;	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЗагрузкиПоСсылкеДляРасширения(ПараметрыЗагрузки, ДанныеСостояния)
	ИмяМетаданных = МодульКода("ESD_ТНОбщегоНазначенияСервер")
		.ИмяМетаданныхДокумента(ПараметрыЗагрузки.СсылкаНаДокумент);
	ТипДокумента  = "Документ." + ИмяМетаданных;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.УстановитьПараметр("СсылкаНаДокумент", ПараметрыЗагрузки.СсылкаНаДокумент);
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ESD_Документ.Номер КАК Номер,
	|	ESD_Документ.Дата КАК Дата
	|ИЗ
	|	ТипДокументаSaby КАК ESD_Документ
	|ГДЕ
	|	ESD_Документ.Ссылка = &СсылкаНаДокумент";
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ТипДокументаSaby", ТипДокумента);
	РезультатЗапроса = ЗапросДанных.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	ВыборкаДанных.Следующий();	
	ЗаполнитьЗначенияСвойств(ПараметрыЗагрузки, ВыборкаДанных, "Номер, Дата");
	
	Если ДанныеСостояния = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеСостояния) Тогда
		ИдентификаторСБИС = "";	 
	ИначеЕсли МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ДанныеСостояния, "UID") Тогда
		ИдентификаторСБИС = ДанныеСостояния.UID;
	Иначе
		ИдентификаторСБИС = ДанныеСостояния.ИД;
	КонецЕсли;	
	
	ПараметрыЗагрузки.ИдентификаторСБИС = ИдентификаторСБИС;
	Если ЗначениеЗаполнено(ДанныеСостояния.Состояние) Тогда
		Если МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер")
			.ДокументооборотЗавершен(ДанныеСостояния.Состояние.ИндексКартинки)
		Тогда
			ПараметрыЗагрузки.ЭтоЧерновик = Ложь;
			ПараметрыЗагрузки.ТребуетсяОбновление = Ложь;
		Иначе
			// Состояние может присутствовать, но быть = 0 - это тоже "черновик", статус "документ редактируется"
			ПараметрыЗагрузки.ЭтоЧерновик = Не ДанныеСостояния.Состояние.ИндексКартинки;
		КонецЕсли;
	Иначе
		ПараметрыЗагрузки.ЭтоЧерновик = Истина;
	КонецЕсли;
КонецПроцедуры

Функция SabyПараметрыОбновленияДанныхФайлов(Параметры)
	// Сформируем параметры выгрузки документа в Saby
	ПараметрыВыгрузки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыВыгрузки(Параметры.СсылкаНаДокумент);
	ПараметрыВыгрузки.ИдентификаторСБИС = Параметры.ИдентификаторСБИС;
	Если ТипЗнч(Параметры.СсылкаНаДокумент) = Тип("Структура") Тогда
		ПараметрыВыгрузки.ДанныеДокумента = Параметры.СсылкаНаДокумент;
	КонецЕсли;
	
	Возврат ПараметрыВыгрузки;
КонецФункции

Функция SabyОбновитьДанныеФайлов(Параметры, ДополнительныеПараметры)
	ПараметрыОбновления = SabyПараметрыОбновленияДанныхФайлов(Параметры);
	Если ДополнительныеПараметры.Свойство("ИмяМетаданных") Тогда
		ПараметрыОбновления.ИмяМетаданных = ДополнительныеПараметры.ИмяМетаданных;
	КонецЕсли;
	// Отключаем проверку ФЛК при выгрузке данных документа через доп. команды
	ПараметрыОбновления.ВыполнитьФЛК = Не ЗначениеЗаполнено(Параметры.ИдентификаторСБИС);
	
	// Определим данные для выгрузки
	ДанныеДляВыгрузки = Новый Массив;
	ДанныеДляВыгрузки.Добавить(ПараметрыОбновления);
	
	// Выполним выгрузку данных	
	РезультатОбновления = МодульКода("ESD_ТНВыгрузкаСервер")
		.РезультатВыгрузкиДокументов(ДанныеДляВыгрузки, Неопределено, Новый Структура);	
		
	// Вернем результат выгрузки
	Возврат РезультатОбновления;
КонецФункции

#Область include_etrn_base_CommonModule_ТНЗагрузкаСервер_ДополнительныйФункционал_ВзаимодействиеСОнлайном_Печать_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_CommonModule_ТНЗагрузкаСервер_ДополнительныйФункционал_ВзаимодействиеСОнлайном_Печать_СлужебныеПроцедурыИФункции

