
Процедура События_ЗагрузитьВФоне(СсылкаНаДокумент, Форма, context_params = Неопределено, Знач УникальныйИдентификатор = Неопределено) Экспорт
	Если УникальныйИдентификатор = Неопределено Тогда
		УникальныйИдентификатор = Форма.УникальныйИдентификатор;
	КонецЕсли;
	
	ДлительнаяОперация = ESD_ДлительныеОперацииКлиентСервер.ДлительнаяОперация(УникальныйИдентификатор);
	ДлительнаяОперация.ВыполняетсяВФоне = Истина;
	ДлительнаяОперация.ОтображатьПрогресс = Ложь;
	ДлительнаяОперация.ИспользоватьФорму = Истина;
	ДлительнаяОперация.Заполнена = Истина;
	ДлительнаяОперация.ИмяПроцедурыОповещения = "События_ЗагрузитьВФоне_ОбработчикЗавершения";
	ДлительнаяОперация.МодульОповещения = "ESD_ОбщийФункционалКлиент";
	
	ДлительнаяОперация.Метод = "ESD_ОбщийФункционалСервер.События_ТабличныйДокументИзSaby";
	ДлительнаяОперация.Параметры.Добавить(СсылкаНаДокумент);
	ДлительнаяОперация.Параметры.Добавить(context_params);
	
	ESD_ТНОбщегоНазначенияСервер.ДлительнаяОперация(ДлительнаяОперация);
	
	ДлительнаяОперация.ВладелецФормы = Форма;
	ESD_ДлительныеОперацииКлиент.ПослеЗапуска(ДлительнаяОперация);
КонецПроцедуры

Процедура События_ЗагрузитьВФоне_ОбработчикЗавершения(ОписаниеЗавершения, ДополнительныеПараметры = Неопределено) Экспорт
	Если ТипЗнч(ОписаниеЗавершения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ОписаниеЗавершения.ОК Тогда
		ОписаниеЗавершения.Владелец[ESD_ОбщийФункционалКлиентСервер.События_ИмяРеквизита()] = ОписаниеЗавершения.Результат;
	Иначе
		Сообщить(ОписаниеЗавершения.Ошибка);
	КонецЕсли;
КонецПроцедуры

