
//DynamicDirective
Функция МодульКода(Наименование)
	Если ПустаяСтрока(Наименование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДоступныеМодулиКода()[Наименование];
КонецФункции

//DynamicDirective
Функция ДоступныеМодулиКода()
	ДоступныеМодулиКода = Новый Соответствие;
	ДобавитьОбщиеМодули(ДоступныеМодулиКода);
	ДобавитьМодулиСправочников(ДоступныеМодулиКода);
	ДобавитьМодулиРегистровСведений(ДоступныеМодулиКода);
	ДобавитьМодулиПеречислений(ДоступныеМодулиКода);
	
	Возврат ДоступныеМодулиКода; 
КонецФункции

//DynamicDirective
Процедура ДобавитьОбщиеМодули(ДоступныеМодулиКода)
	ДоступныеМодулиКода.Вставить("АвтоматическиеСценарииСерверСлужебный",
		ESD_АвтоматическиеСценарииСерверСлужебный);
	ДоступныеМодулиКода.Вставить("АвтоматическиеСценарииСервер",
		ESD_АвтоматическиеСценарииСервер);	
КонецПроцедуры

//DynamicDirective
Процедура ДобавитьМодулиСправочников(ДоступныеМодулиКода)
	ДоступныеМодулиКода.Вставить("Справочники.АвтоматическиеСценарии",
		Справочники.ESD_АвтоматическиеСценарии);
	ДоступныеМодулиКода.Вставить("Справочники.АвтоматическиеСценарииДействия",
		Справочники.ESD_АвтоматическиеСценарииДействия);	
КонецПроцедуры
	
//DynamicDirective
Процедура ДобавитьМодулиРегистровСведений(ДоступныеМодулиКода)
	ДоступныеМодулиКода.Вставить("РегистрыСведений.АвтоматическиеСценарииЖурнал",
		РегистрыСведений.ESD_АвтоматическиеСценарииЖурнал);
	ДоступныеМодулиКода.Вставить("РегистрыСведений.АвтоматическиеСценарии",
		РегистрыСведений.ESD_АвтоматическиеСценарии);
КонецПроцедуры
	
//DynamicDirective
Процедура ДобавитьМодулиПеречислений(ДоступныеМодулиКода)
	ДоступныеМодулиКода.Вставить("Перечисления.АвтоматическиеСценарииСтатусыВыполнения",
		Перечисления.ESD_АвтоматическиеСценарииСтатусыВыполнения);
	ДоступныеМодулиКода.Вставить("Перечисления.АвтоматическиеСценарииСобытия",
		Перечисления.ESD_АвтоматическиеСценарииСобытия);
	ДоступныеМодулиКода.Вставить("Перечисления.АвтоматическиеСценарииВидыЗапуска",
		Перечисления.ESD_АвтоматическиеСценарииВидыЗапуска);
	ДоступныеМодулиКода.Вставить("Перечисления.АвтоматическиеСценарииВариантыВыполнения",
		Перечисления.ESD_АвтоматическиеСценарииВариантыВыполнения);
	ДоступныеМодулиКода.Вставить("Перечисления.АвтоматическиеСценарииПредопределенныеДействия",
		Перечисления.ESD_АвтоматическиеСценарииПредопределенныеДействия);
КонецПроцедуры
	
