
Процедура ДокументОснование_Команды_Создать(Форма, ГруппаВладелец)
	// Гиперссылка выбора документа-основания
	ДокументОснование_Команда_Выбрать_Создать(Форма, ГруппаВладелец);

	// Подгруппа команд документа-основания
	ГруппаКоманд_ = ESD_КомпонентыСервер.ГруппаЭлементов_Создать(Форма, ГруппаВладелец, "ГруппаКомандыДокументаОснования");
	ДокументОснование_Команда_ФормаЗаполнения_Создать(Форма, ГруппаКоманд_);
	ДокументОснование_Команда_Очистить_Создать(Форма, ГруппаКоманд_);
	ДокументОснование_Команда_Настройка_Создать(Форма, ГруппаКоманд_);
КонецПроцедуры

Функция ДокументОснование_Команда_Выбрать_Создать(Форма, ГруппаВладелец)
	Описание_ = ESD_КомпонентыСервер.Декорация_Описание("ДекорацияДокументОснование", "Выбрать документ основание",
		"Подключаемый_ДокументОснование_Выбрать");
	Возврат ESD_КомпонентыСервер.Декорация_Создать(Форма, ГруппаВладелец, Описание_);
КонецФункции

Функция ДокументОснование_Команда_Очистить_Создать(Форма, ГруппаВладелец)
	Описание_ = ESD_КомпонентыСервер.Команда_Описание("ОчиститьДокументОснование", "Очистить", "ESD_ПолеВводаОчистить",
		"Подключаемый_ДокументОснование_Очистить");
	Кнопка_ = ESD_КомпонентыСервер.Команда_Создать(Форма, ГруппаВладелец, Описание_);
	Кнопка_.Отображение = ОтображениеКнопки.Картинка;

	Попытка
		Кнопка_["ОтображениеФигуры"] = Вычислить("ОтображениеФигурыКнопки.ПриАктивности");
	// BSLLS:MissingCodeTryCatchEx-off
	Исключение
	КонецПопытки;
	// BSLLS:MissingCodeTryCatchEx-on

	Возврат Кнопка_;
КонецФункции

Функция ДокументОснование_Команда_Настройка_Создать(Форма, ГруппаВладелец)
	Описание_ = ESD_КомпонентыСервер.Команда_Описание("НастройкаДокументовОснований", "Настройка документов оснований", "",
		"Подключаемый_ДокументОснование_Настройка");
	Возврат ESD_КомпонентыСервер.Команда_Создать(Форма, ГруппаВладелец, Описание_);
КонецФункции

Функция ДокументОснование_Команда_ФормаЗаполнения_Создать(Форма, ГруппаВладелец)
	Описание_ = ESD_КомпонентыСервер.Команда_Описание("ОткрытьФормуЗаполнения", "Открыть форму заполнения",
		"КомандаМенюФункций", "Подключаемый_ДокументОснование_ОткрытьФормуЗаполнения");
	Кнопка_ = ESD_КомпонентыСервер.Команда_Создать(Форма, ГруппаВладелец, Описание_);
	Кнопка_.Отображение = ОтображениеКнопки.Картинка;

	Попытка
		Кнопка_["ОтображениеФигуры"] = Вычислить("ОтображениеФигурыКнопки.ПриАктивности");
	// BSLLS:MissingCodeTryCatchEx-off
	Исключение
	КонецПопытки;
	// BSLLS:MissingCodeTryCatchEx-on

	Возврат Кнопка_;
КонецФункции

Функция ДокументОснование_РеквизитФормы_ПараметрыЗаполнения()
	РезультатФункции = СлужебныеРеквизитыФормы_ОписаниеРеквизита("ДокументОснование_ПараметрыЗаполнения",
		Новый ОписаниеТипов("ТаблицаЗначений"));

	Колонки_ = РезультатФункции.Колонки;
	
	ОписаниеКолонки_ = СлужебныеРеквизитыФормы_ОписаниеРеквизита("Основание", Новый ОписаниеТипов);
	Колонки_.Добавить(ОписаниеКолонки_);
	
	ОписаниеКолонки_ = СлужебныеРеквизитыФормы_ОписаниеРеквизита("Сопоставление",
		Новый ОписаниеТипов("СправочникСсылка.ESD_НастройкиСопоставлений"));
	Колонки_.Добавить(ОписаниеКолонки_);
	
	ОписаниеКолонки_ = СлужебныеРеквизитыФормы_ОписаниеРеквизита("ОснованиеМетаданные", Новый ОписаниеТипов("Строка"));
	Колонки_.Добавить(ОписаниеКолонки_);
	
	ОписаниеКолонки_ = СлужебныеРеквизитыФормы_ОписаниеРеквизита("ОснованиеУИД", Новый ОписаниеТипов("Строка"));
	Колонки_.Добавить(ОписаниеКолонки_);
	
	ОписаниеКолонки_ = СлужебныеРеквизитыФормы_ОписаниеРеквизита("Основной", Новый ОписаниеТипов("Булево"));
	Колонки_.Добавить(ОписаниеКолонки_);

	Возврат РезультатФункции;
КонецФункции 

