
// Сохраняем статус документ в дополнительные сведения через ядро
//
// Параметры:
// 	Документ - Ссылка - ссылка на документ основание для ВО
//           - Структура - данные документа основания в ESD
//	ДанныеДляЗаписи - Соответствие - ответ онлайна на выгрузку вложения
//
Процедура ЗаписатьДополнительныеСведенияОснования(Документ, ДанныеДляЗаписи) Экспорт
	Если Не (ЭтоУниверсальноеРасширение() 
		И ESD_ТНОбщегоНазначенияСервер.ХранитьСтатусыВДополнительныхСведениях_Загрузить()) 
	Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОснование = ТиповоеОснованиеИзСсылкиДокументаРасширения(Документ);
		
	// нет типового документа к которому запишем статус
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
		
	ЗаписатьДопСведенияВРасширении(ДокументОснование, ДанныеДляЗаписи);
КонецПроцедуры

Функция ТиповоеОснованиеИзСсылкиДокументаРасширения(Документ)
	Модуль_ESDСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	ДокументОснование  = Модуль_ESDСервер.СсылкаНаОбъектОснование(
		Документ.Метаданные, Документ.Идентификатор);
		
    // проверка что основанием документа ESD не является другой документ ESD
	Если ЗначениеЗаполнено(ДокументОснование) Тогда	
		ТипЗначения          = ТипЗнч(ДокументОснование);
		Регистр_ESDСостояния = Метаданные.РегистрыСведений["ESD_СостоянияОбъектовИнтеграции"];
		ЭтоДокументESD       = Регистр_ESDСостояния.Измерения.ОбъектРасширения.Тип.СодержитТип(ТипЗначения);
		
		// отбивка на основания из расширения ESD
		Если ЭтоДокументESD Тогда
			ДокументОснование = Неопределено;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ДокументОснование;
КонецФункции

Процедура ЗаписатьДопСведенияВРасширении(ДокументОснование, ДанныеДляЗаписи)	
	МодульESD_ОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	Регламент = МодульESD_ОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеДляЗаписи, "ДанныеДокумента.Регламент.Название");
	Состояние = МодульESD_ОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеДляЗаписи, "ДанныеДокумента.Состояние.Название");

	// инициализация свойств
	context_params = Неопределено;
	// Обращение в ядро...
	Модуль_ESDЯдро = ОбъектОбработки();
 	Модуль_ESDЯдро.СтатусыДокументовИнициализация(context_params, Регламент);
	
	Данные = Новый Структура;
	Данные.Вставить("UID",          ДанныеДляЗаписи.ИД);
	Данные.Вставить("Состояние",    Состояние);
	Данные.Вставить("АктивныйЭтап", ДанныеДляЗаписи.АктивныйЭтап);
	Данные.Вставить("Объект",       ДокументОснование);
	Данные.Вставить("Регламент",    Регламент);
	Данные.Вставить("Сервис",       context_params["service"]);
	Данные.Вставить("Аккаунт",      context_params["session"]["accountId"]);
	
	// запись
	Модуль_ESDЯдро.СтатусыДокументовПоДопСведениямОбновитьПоUID(Данные);
КонецПроцедуры

