
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьВесьСправочник(Команда)
	
	РезультатЗагрузки = РезультатЗагрузкиСправочника();
	
	ПоказатьРезультатЗагрузки(РезультатЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоНаименованию(Команда)
	
	ПроцедураПослеВводаНаименования = Новый ОписаниеОповещения("ПослеВводаНаименования", ЭтаФорма);
	
	ПоказатьВводСтроки(
		ПроцедураПослеВводаНаименования,
		НаименованиеСправочникаДляПоиска,
		"Введите наименование справочника, который нужно загрузить.");
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВводаНаименования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	МассивНаименований = Новый Массив;
	МассивНаименований.Добавить(ВРег(СокрЛП(Результат)));
	
	РезультатЗагрузки = РезультатЗагрузкиСправочника(МассивНаименований);
	
	ПоказатьРезультатЗагрузки(РезультатЗагрузки);
	
КонецПроцедуры

&НаСервере
Функция РезультатЗагрузкиСправочника(Знач МассивНаименований = Неопределено)
	
	ОбщиеПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбщиеПараметрыВыгрузкиЗагрузки();
	
	Возврат МодульКода("Справочники.ESD_ОпасныеГрузы").ЗагрузитьОпасныеГрузыСОнлайна(ОбщиеПараметрыЗагрузки, МассивНаименований);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьРезультатЗагрузки(РезультатЗагрузки)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = РезультатЗагрузки.Текст;
	Сообщение.Сообщить();
	
	Если ЗначениеЗаполнено(РезультатЗагрузки.ОписаниеОшибок) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = РезультатЗагрузки.ОписаниеОшибок;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода
