
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийДень = ТекущаяДатаСеанса();
	ЭтаФорма.ДатаВремяНачала    = НачалоДня(ТекущийДень);
	ЭтаФорма.ДатаВремяОкончания = ТекущийДень;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("Начало",    ДатаВремяНачала);
	Структура.Вставить("Окончание", ДатаВремяОкончания);
	
	Закрыть(Структура);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы