
Процедура НастройкиЭЗЗ_СоздатьЭлементы(Форма, ГруппаВладелец) Экспорт
	НастройкиЭЗЗ_СоздатьРеквизиты(Форма);

	ИмяГруппы = "ГруппаНастройкиЭЗЗ";
	Если Форма.Элементы.Найти(ИмяГруппы) <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	ГруппаНастроек_ = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаВладелец);
	ГруппаНастроек_.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНастроек_.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаНастроек_.Отображение          = ОтображениеОбычнойГруппы.Нет;
	ГруппаНастроек_.Подсказка 			 = "";
	ГруппаНастроек_.ОтображатьЗаголовок  = Истина;
	ГруппаНастроек_.Заголовок            = "ЭПД. Заказ на перевозку";
	
	ИмяЭлемента = ESD_ОбщийФункционалКлиентСервер
		.НастройкиЭЗЗ_ОформлениеПредзаполнятьДанныеПеревозчика_ИмяРеквизита();
	ЭлементФормы = Форма.Элементы.Найти(ИмяЭлемента);
	Если ЭлементФормы = Неопределено Тогда
		ЭлементФормы = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаНастроек_);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
		Попытка
			ЭлементФормы.ВидФлажка = Вычислить("ВидФлажка.Выключатель");
		// BSLLS:MissingCodeTryCatchEx-off
		Исключение
		КонецПопытки;
		// BSLLS:MissingCodeTryCatchEx-on
		ЭлементФормы.Заголовок = "Оформление. Предзаполнять данные ""Перевозчика""";
		ЭлементФормы.ПутьКДанным = ИмяЭлемента;
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		ЭлементФормы.Подсказка = "Устанавливает значение по умолчанию
		|у соответствующего переключателя
		|на форме документа ""Заказ на перевозку"".";
		ЭлементФормы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		ЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемый_НастройкиЭЗЗ_ОформлениеПредзаполнятьДанныеПеревозчика_Изменить");
	КонецЕсли;
КонецПроцедуры

Процедура НастройкиЭЗЗ_СоздатьРеквизиты(Форма) Экспорт
	НовыеРеквизиты = Новый Массив;
	
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.НастройкиЭЗЗ_ОформлениеПредзаполнятьДанныеПеревозчика_ИмяРеквизита();
	Если ESD_ТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(Форма, ИмяРеквизита_) Тогда
		Возврат;		
	КонецЕсли;
	
	РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита_, Новый ОписаниеТипов("Булево"));
	НовыеРеквизиты.Добавить(РеквизитФормы);
	
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);	
КонецПроцедуры

Процедура НастройкиЭЗЗ_ЗаполнитьЗначенияНастроек(Форма, Значения) Экспорт
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.НастройкиЭЗЗ_ОформлениеПредзаполнятьДанныеПеревозчика_ИмяРеквизита();
	Форма[ИмяРеквизита_] = Значения["ОформлениеПредзаполнятьДанныеПеревозчика"];	
КонецПроцедуры

