
Процедура РезультатФЛК_Инициализация(Форма, Знач ГруппаВладелец = Неопределено) Экспорт
	РезультатФЛК_ДобавитьРеквизиты(Форма);
	РезультатФЛК_СоздатьКоманды(Форма);
	
	Если ГруппаВладелец = Неопределено Тогда
		ГруппаВладелец = Форма;
	КонецЕсли;
	
	РезультатФЛК_СоздатьЭлементы(Форма, ГруппаВладелец);
КонецПроцедуры

#Область РезультатФЛК_СозданиеРеквизитовФормы

Процедура РезультатФЛК_ДобавитьРеквизиты(Форма) Экспорт
	ДобавляемыеРеквизиты = Новый Массив;
	РезультатФЛК_ТаблицаОшибок_ДобавитьРеквизиты(Форма, ДобавляемыеРеквизиты);	
	РезультатФЛК_ПодробноеОписаниеОшибки_ДобавитьРеквизиты(Форма, ДобавляемыеРеквизиты);
	РезультатФЛК_КоличествоОшибок_ДобавитьРеквизиты(Форма, ДобавляемыеРеквизиты);
	
	Если ЗначениеЗаполнено(ДобавляемыеРеквизиты) Тогда
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
КонецПроцедуры

Процедура РезультатФЛК_ТаблицаОшибок_ДобавитьРеквизиты(Форма, ДобавляемыеРеквизиты) Экспорт
	ИмяРеквизита_ = "ТаблицаОшибок";
	Если ESD_ТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(Форма, ИмяРеквизита_) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита_, Новый ОписаниеТипов("ТаблицаЗначений"));
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	
	// Добавим колонки
	РеквизитТЗ = Новый РеквизитФормы("Ошибка"
		, Новый ОписаниеТипов("Строка"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("РеквизитОбъекта"
		, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(64)), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("ЭлементФормы"
		, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(64)), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("ИндексСтроки"
		, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3)), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
КонецПроцедуры

Процедура РезультатФЛК_КоличествоОшибок_ДобавитьРеквизиты(Форма, ДобавляемыеРеквизиты) Экспорт
	ИмяРеквизита_ = "КоличествоОшибок";
	Если ESD_ТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(Форма, ИмяРеквизита_) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита_, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3)));
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);	
КонецПроцедуры

Процедура РезультатФЛК_ПодробноеОписаниеОшибки_ДобавитьРеквизиты(Форма, ДобавляемыеРеквизиты) Экспорт
	ИмяРеквизита_ = "ПодробноеОписаниеОшибки";
	Если ESD_ТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(Форма, ИмяРеквизита_) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита_, Новый ОписаниеТипов("Строка"));
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
КонецПроцедуры

#КонецОбласти // РезультатФЛК_СозданиеРеквизитовФормы 

#Область РезультатФЛК_СозданиеЭлементовФормы

Процедура РезультатФЛК_СоздатьЭлементы(Форма, ГруппаВладелец) Экспорт
	// По умолчанию, располагаем команду в ком. панели формы
	РезультатФЛК_ПоказатьСкрытьОшибки_СоздатьЭлементы(Форма, Форма.КоманднаяПанель);
	
	РезультатФЛК_ГруппаОшибки = РезультатФЛК_ГруппаОшибки_СоздатьЭлементы(Форма, ГруппаВладелец);
	РезультатФЛК_ТаблицаОшибок_СоздатьЭлементы(Форма, РезультатФЛК_ГруппаОшибки);
	РезультатФЛК_ПодробноеОписаниеОшибки_СоздатьЭлементы(Форма, РезультатФЛК_ГруппаОшибки);
КонецПроцедуры

Функция РезультатФЛК_ГруппаОшибки_СоздатьЭлементы(Форма, ГруппаВладелец) Экспорт
	ИмяГруппы = "ГруппаОшибки";
	Группа_ = Форма.Элементы.Найти(ИмяГруппы);
	Если Группа_ = Неопределено Тогда
		Группа_ = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаВладелец);
		Группа_.Вид                      = ВидГруппыФормы.ОбычнаяГруппа;
		Группа_.Отображение              = ОтображениеОбычнойГруппы.Нет;
		Группа_.Группировка              = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Группа_.Подсказка 			     = "";
		Группа_.Заголовок                = "";
		Группа_.ОтображатьЗаголовок      = Ложь;
		Группа_.РастягиватьПоГоризонтали = Истина;
		Группа_.РастягиватьПоВертикали   = Истина;
		// По умолчанию не отображаем
		Группа_.Видимость = Ложь;
		
		ГруппаЗаголовок_ = Форма.Элементы.Добавить(ИмяГруппы + "Заголовок", Тип("ГруппаФормы"), Группа_);
		ГруппаЗаголовок_.Вид                      = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЗаголовок_.Отображение              = ОтображениеОбычнойГруппы.Нет;
		ГруппаЗаголовок_.Группировка              = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаЗаголовок_.Подсказка 			      = "";
		ГруппаЗаголовок_.Заголовок                = "";
		ГруппаЗаголовок_.ОтображатьЗаголовок      = Ложь;
		ГруппаЗаголовок_.РастягиватьПоГоризонтали = Истина;
		ГруппаЗаголовок_.РастягиватьПоВертикали   = Истина;
		
		ИмяДекорации_ = "Декорация" + ИмяГруппы;
		ДекорацияЗаголовок_ = Форма.Элементы.Добавить(ИмяДекорации_, Тип("ДекорацияФормы"), ГруппаЗаголовок_);
		ДекорацияЗаголовок_.Вид        = ВидДекорацииФормы.Надпись;
		ДекорацияЗаголовок_.Заголовок  = "Ошибки";
        // BSLLS:StyleElementConstructors-off
		ДекорацияЗаголовок_.Шрифт      = Новый Шрифт(ДекорацияЗаголовок_.Шрифт, , 12, Истина);
        // BSLLS:StyleElementConstructors-on
		ДекорацияЗаголовок_.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
		
		ИмяКнопки_ = "ОбновитьДанныеПоОшибкам";
		КомандаОбновить = Форма.Элементы.Добавить(ИмяКнопки_, Тип("КнопкаФормы"), ГруппаЗаголовок_);
		КомандаОбновить.Вид         = ВидКнопкиФормы.ОбычнаяКнопка;
		КомандаОбновить.ИмяКоманды  = ИмяКнопки_;
	КонецЕсли;
	
	// Перенесем признак "ТолькоПросмотр" с формы на элемент
	Группа_.ТолькоПросмотр = Форма.ТолькоПросмотр;
		
	Возврат Группа_;		
КонецФункции

Процедура РезультатФЛК_ТаблицаОшибок_СоздатьЭлементы(Форма, ГруппаВладелец)
	ИмяРеквизита_ = "ТаблицаОшибок";
	ЭлементФормы_ = Форма.Элементы.Найти(ИмяРеквизита_);
	Если ЭлементФормы_ = Неопределено Тогда
		// Добавим таблицу
		ЭлементФормы_ = Форма.Элементы.Добавить(ИмяРеквизита_, Тип("ТаблицаФормы"), ГруппаВладелец);
		ЭлементФормы_.ПутьКДанным = ИмяРеквизита_;
		ЭлементФормы_.Отображение = ОтображениеТаблицы.Список;
		ЭлементФормы_.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормы_.РастягиватьПоГоризонтали = Истина;
		ЭлементФормы_.РастягиватьПоВертикали = Истина;
	    ЭлементФормы_.ИзменятьСоставСтрок = Ложь;
		ЭлементФормы_.ИзменятьПорядокСтрок = Ложь;
		ЭлементФормы_.АвтоВводНовойСтроки = Ложь;
		ЭлементФормы_.УстановитьДействие("Выбор", "ТаблицаОшибокВыбор");
		
		// Добавим колонку "Значение" таблицы параметров обработчика 
		ЭлементФормыКолонка = Форма.Элементы.Добавить(ИмяРеквизита_ + "Ошибка", 
			Тип("ПолеФормы"), ЭлементФормы_);       
		ЭлементФормыКолонка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормыКолонка.ТолькоПросмотр = Истина;
		ЭлементФормыКолонка.ПутьКДанным = ИмяРеквизита_ + "." + "Ошибка";
	КонецЕсли;
	
	ЭлементФормы_.ТолькоПросмотр = Форма.ТолькоПросмотр; 
КонецПроцедуры

Процедура РезультатФЛК_ПоказатьСкрытьОшибки_СоздатьЭлементы(Форма, ГруппаВладелец) Экспорт
	ИмяКоманды_ = "ПоказатьСкрытьОшибки";
	ИмяКнопки_ = "Форма" + ИмяКоманды_;
	Если Форма.Элементы.Найти(ИмяКнопки_) = Неопределено Тогда
		КнопкаКоманды = Форма.Элементы.Добавить(ИмяКнопки_, Тип("КнопкаФормы"), ГруппаВладелец);
		КнопкаКоманды.Вид         = ВидКнопкиФормы.ОбычнаяКнопка;
		КнопкаКоманды.ИмяКоманды  = ИмяКоманды_;
		КнопкаКоманды.Заголовок   = "Ошибки";
	    // BSLLS:StyleElementConstructors-off
		КнопкаКоманды.Шрифт       = Новый Шрифт(КнопкаКоманды.Шрифт, , , Истина);
	    // BSLLS:StyleElementConstructors-on
		КнопкаКоманды.ЦветТекста  = ЦветаСтиля.ЦветОсобогоТекста;
		КнопкаКоманды.Видимость   = Ложь;
		// По умолчанию включим "Пометку"
		КнопкаКоманды.Пометка     = Истина;	
	КонецЕсли;
КонецПроцедуры

Процедура РезультатФЛК_ПодробноеОписаниеОшибки_СоздатьЭлементы(Форма, ГруппаВладелец) Экспорт
	ИмяПоля_ = "ПодробноеОписаниеОшибки";
	Если Форма.Элементы.Найти(ИмяПоля_) = Неопределено Тогда
		Поле_ = Форма.Элементы.Добавить(ИмяПоля_, Тип("ПолеФормы"), ГруппаВладелец);
		Поле_.Вид                = ВидПоляФормы.ПолеВвода;
		Поле_.ПутьКДанным        = ИмяПоля_;
		Поле_.Заголовок          = "";
		Поле_.МногострочныйРежим = Истина;
		Поле_.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Поле_.РастягиватьПоГоризонтали = Истина;
		Поле_.АвтоМаксимальнаяШирина = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // РезультатФЛК_СозданиеЭлементовФормы

#Область РезультатФЛК_СозданиеКомандФормы

Процедура РезультатФЛК_СоздатьКоманды(Форма) Экспорт
	РезультатФЛК_ПоказатьСкрытьОшибки_СоздатьКоманды(Форма);
	РезультатФЛК_ОбновитьДанныеПоОшибкам_СоздатьКоманды(Форма);
КонецПроцедуры

Процедура РезультатФЛК_ПоказатьСкрытьОшибки_СоздатьКоманды(Форма) Экспорт
	ИмяКоманды_ = "ПоказатьСкрытьОшибки";
	Если Форма.Команды.Найти(ИмяКоманды_) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КомандаФормы_ = Форма.Команды.Добавить(ИмяКоманды_);
	КомандаФормы_.Заголовок = "Ошибки";
	КомандаФормы_.Действие = ИмяКоманды_;
КонецПроцедуры

Процедура РезультатФЛК_ОбновитьДанныеПоОшибкам_СоздатьКоманды(Форма) Экспорт
	ИмяКоманды_ = "ОбновитьДанныеПоОшибкам";
	Если Форма.Команды.Найти(ИмяКоманды_) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КомандаФормы_ = Форма.Команды.Добавить(ИмяКоманды_);
	КомандаФормы_.Заголовок = "Обновить ошибки ФЛК";
	КомандаФормы_.Действие = ИмяКоманды_;
	
	Попытка
		КомандаФормы_.Картинка = БиблиотекаКартинок.Обновить;
		КомандаФормы_.Отображение = ОтображениеКнопки.Картинка;
	// BSLLS:MissingCodeTryCatchEx-off
	Исключение
	КонецПопытки;
	// BSLLS:MissingCodeTryCatchEx-on
КонецПроцедуры

#КонецОбласти // РезультатФЛК_СозданиеКомандФормы

