
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОграничитьТипыДокументовОснованийНаСервере();
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииПослеЗаписиНаСервере();
	Иначе
		МодульКода("ESD_ТНОбщегоНазначенияСервер").УбратьПризнакНеПросмотрен(Объект.Ссылка);
	КонецЕсли;
	
	НастроитьФормуДляСтарыхПлатформ();
	
	Если Не ЭтоУниверсальноеРасширение() И Не ЭтаФорма.ЭтоВО И Не ЗначениеЗаполнено(Объект.НомерСбис) Тогда
		Объект.НомерСбис = Объект.Номер;
	КонецЕсли;
	
	Если Параметры.ОбновитьОшибки Тогда
		ОбновитьДанныеПоОшибкамНаСервере();
	КонецЕсли; 
	
	ПриСозданииНаСервереПереопределяемый();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОповеститьОбИзменении(Объект.Ссылка);
	Подключаемый_ПриОткрытии();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбработатьОповещенияДляФормы(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)	
	ПриЧтенииСозданииПослеЗаписиНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриЧтенииСозданииПослеЗаписиНаСервере();
	
	Признаки = ПризнакиДокумента();
	
	ПараметрыЗаписи.Вставить("ЭтоЗаменаВодителя", Признаки.ЭтоЗаменаВодителя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.ЭтоЗаменаВодителя Тогда
		Оповестить("ОбновитьЛенту", , ЭтаФорма.ВладелецФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Подключаемый_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Подключаемый_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Подключаемый_СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница);
КонецПроцедуры

#Область ДокументОснование

&НаКлиенте
Процедура ДекорацияДокументОснование(Элемент)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ДокументОснованиеНажатие(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДокументОснование(Команда)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОчиститьДокументОснованиеНаФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДокументовОснований(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка",        Объект.Ссылка);
	ПараметрыФормы.Вставить("ТипМетаданных", "Документы");
	
	// ToDo: вынести в общие команды
	Префикс = "SABY";
	Если Найти(ЭтаФорма.ИмяФормы, "ESD") > 0 Тогда		
		Префикс = "ESD";
	КонецЕсли;
			
	ОткрытьФорму("ОбщаяФорма." + Префикс + "_ВыборТиповЭПД", ПараметрыФормы, ЭтаФорма);
		
КонецПроцедуры

#КонецОбласти // ДокументОснование

&НаКлиенте
Процедура ДоРейса_МедосмотрСторонняяОрганизацияПриИзменении(Элемент)
	ПриИзмененииВидаМедицинскогоРаботника("МедосмотрВыезд", "ДоРейса");
	ОбновитьВидимостьИДоступностьЭлементов_Медосмотр();
КонецПроцедуры  

&НаКлиенте
Процедура ДоРейса_МедицинскаяОрганизацияПриИзменении(Элемент) 
	ПриИзмененииСтороннейОрганизации("МедосмотрВыезд", "ДоРейса");
	ОбновитьВидимостьИДоступностьЭлементов_Медосмотр();
КонецПроцедуры

&НаКлиенте
Процедура ПослеРейса_МедосмотрСторонняяОрганизацияПриИзменении(Элемент)
	ПриИзмененииВидаМедицинскогоРаботника("МедосмотрЗаезд", "ПослеРейса");
	ОбновитьВидимостьИДоступностьЭлементов_Медосмотр();
КонецПроцедуры 

&НаКлиенте
Процедура ПослеРейса_МедицинскаяОрганизацияПриИзменении(Элемент)
	ПриИзмененииСтороннейОрганизации("МедосмотрЗаезд", "ПослеРейса");
	ОбновитьВидимостьИДоступностьЭлементов_Медосмотр();
КонецПроцедуры

#Область ДатаВремяПоОтдельнымРеквизитам

&НаКлиенте
Процедура ТО_ДатаПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТО_ВремяПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Выезд_ДатаПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	ПроверкаКорректностиЗаполненияРеквизитов(Элемент, "ГруппаВыезд_ДатаВремя");
	
КонецПроцедуры

&НаКлиенте
Процедура Выезд_ВремяПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	ПроверкаКорректностиЗаполненияРеквизитов(Элемент, "ГруппаВыезд_ДатаВремя");

КонецПроцедуры

&НаКлиенте
Процедура Заезд_ДатаПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;	
	ПроверкаКорректностиЗаполненияРеквизитов(Элемент, "ГруппаЗаезд_ДатаВремя");
	
КонецПроцедуры

&НаКлиенте
Процедура Заезд_ВремяПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;	
	ПроверкаКорректностиЗаполненияРеквизитов(Элемент, "ГруппаЗаезд_ДатаВремя");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоРейса_ДатаМедосмотраПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоРейса_ВремяМедосмотраПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеРейса_ДатаМедосмотраПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеРейса_ВремяМедосмотраПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Выезд_ОдометрПриИзменении(Элемент)
	ПроверкаКорректностиЗаполненияРеквизитов(Элемент, "Заезд_Одометр");
КонецПроцедуры

&НаКлиенте
Процедура Заезд_ОдометрПриИзменении(Элемент)
	ПроверкаКорректностиЗаполненияРеквизитов(Элемент, "Заезд_Одометр");
КонецПроцедуры

#КонецОбласти

#Область ТранспортныеСредства

&НаКлиенте
Процедура ПрицепыСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПрицепыНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	ПроцедураПослеОбновленияДанныхТранспортныхСредств = Новый ОписаниеОповещения(
		"ПослеОбновленияДанныхТранспортныхСредств",
		ЭтаФорма);
		
	УстановитьПросмотр = Элементы.СтраницаОсновное.ТолькоПросмотр
							Или Элементы.ТранспортноеСредствоСтрокой.ТолькоПросмотр;
		
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТранспортноеСредствоНажатие(
		ЭтаФорма,
		СтандартнаяОбработка,
		ПроцедураПослеОбновленияДанныхТранспортныхСредств,
		УстановитьПросмотр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрицепыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПроцедураПослеОбновленияДанныхТранспортныхСредств = Новый ОписаниеОповещения(
		"ПослеОбновленияДанныхТранспортныхСредств",
		ЭтаФорма);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТаблицаПрицеповВыбор(
		ЭтаФорма,
		ВыбраннаяСтрока,
		СтандартнаяОбработка,
		ПроцедураПослеОбновленияДанныхТранспортныхСредств,
		Элементы.ГруппаПрицепы.ТолькоПросмотр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрицепыПослеУдаления(Элемент)
	
	ПослеОбновленияДанныхТранспортныхСредств(Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрицепыПриИзменении(Элемент)
	
	ПослеОбновленияДанныхТранспортныхСредств(Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПрицеп(Команда)
	
	ПроцедураПослеОбновленияДанныхТранспортныхСредств = Новый ОписаниеОповещения(
		"ПослеОбновленияДанныхТранспортныхСредств",
		ЭтаФорма);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ДобавитьНовыйПрицеп(
		ЭтаФорма,
		ПроцедураПослеОбновленияДанныхТранспортныхСредств);

КонецПроцедуры

&НаКлиенте
Процедура ПрицепыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// временно оставляем для старого расширения ce_saby
	
	ПроцедураПослеОбновленияДанныхТранспортныхСредств = Новый ОписаниеОповещения(
		"ПослеОбновленияДанныхТранспортныхСредств",
		ЭтаФорма);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ДобавитьНовыйПрицеп(
		ЭтаФорма,
		ПроцедураПослеОбновленияДанныхТранспортныхСредств,
		Истина);
	
КонецПроцедуры

#КонецОбласти // ТранспортныеСредства

#Область ОтветственныеЛица

#Область Водители

&НаКлиенте
Процедура ВодителиСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.ТекущийЭлемент = Элементы.Водители;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодителиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтветственного = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОтветственного(
		Объект.ОтветственныеЛица, "", ВыбраннаяСтрока);
		
	СтруктураОтветственного.Вставить("ТолькоПросмотр", Элементы.СтраницаОсновное.ТолькоПросмотр);
	
	ДобавитьДанныеОрганизации(СтруктураОтветственного);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").НачатьРедактированиеОтветственногоЛица(
		ЭтаФорма, СтруктураОтветственного, "Водитель");

КонецПроцедуры

&НаКлиенте
Процедура ВодителиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		РольВодитель = ЗначениеМетаданныхКлиент("ESD_РолиОтветственных.Водитель");
		
		ОтборПоРоли  = Новый Структура;
		ОтборПоРоли.Вставить("Роль", РольВодитель);
		
		НайденныеСтроки             = Объект.ОтветственныеЛица.НайтиСтроки(ОтборПоРоли);
		КоличествоВодителей         = НайденныеСтроки.Количество();
		КоличествоВодителейМаксимум = 5;
		
		Если КоличествоВодителей = КоличествоВодителейМаксимум Тогда
			
			ТекстПредупреждения = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
				"ru = 'Количество водителей в путевом листе не должно быть больше %1'", КоличествоВодителейМаксимум);
			
			ПоказатьПредупреждение(, Нстр(ТекстПредупреждения));
				
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодителиПослеУдаления(Элемент)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ОбновитьВодителейНаФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВодителиПриИзменении(Элемент)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ОбновитьВодителейНаФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияОтветственногоЛицаНаФорме(СтруктураОтветственногоЛица) Экспорт
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВодителя(Команда)
	
	РольВодитель = ЗначениеМетаданныхКлиент("ESD_РолиОтветственных.Водитель");
	
	Модуль_ТНКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ОтборПоРоли  = Новый Структура;
	ОтборПоРоли.Вставить("Роль", РольВодитель);
	
	НайденныеСтроки             = Объект.ОтветственныеЛица.НайтиСтроки(ОтборПоРоли);
	КоличествоВодителей         = НайденныеСтроки.Количество();
	КоличествоВодителейМаксимум = 5;
	
	Если КоличествоВодителей = КоличествоВодителейМаксимум Тогда
		ТекстПредупреждения = Модуль_ТНКлиентСервер.СтрШаблонЭПД(
			"ru = 'Количество водителей в путевом листе не должно быть больше %1'", КоличествоВодителейМаксимум);
		ПоказатьПредупреждение(, Нстр(ТекстПредупреждения));
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Объект.ОтветственныеЛица.Добавить();
	ИдентификаторСтроки = НоваяСтрока.ПолучитьИдентификатор();
	
	Элемент = Элементы.Водители;	
	Для Каждого СтруктураОтбора Из Элемент.ОтборСтрок Цикл
		НоваяСтрока[СтруктураОтбора.Ключ] = СтруктураОтбора.Значение;
	КонецЦикла;
	
	СтруктураОтветственного = Модуль_ТНКлиентСервер.СтруктураОтветственного(
		Объект.ОтветственныеЛица, "", ИдентификаторСтроки);
	
	ДобавитьДанныеОрганизации(СтруктураОтветственного);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").НачатьРедактированиеОтветственногоЛица(
			ЭтаФорма, СтруктураОтветственного, "Водитель"); 
						
КонецПроцедуры

&НаКлиенте
Процедура ВодителиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// временно оставляем для старого расширения ce_saby
	
	Если НоваяСтрока Тогда
		
		Для Каждого СтруктураОтбора Из Элемент.ОтборСтрок Цикл
			Элемент.ТекущиеДанные[СтруктураОтбора.Ключ] = СтруктураОтбора.Значение;
		КонецЦикла;
		
		СтруктураОтветственного = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОтветственного(
			Объект.ОтветственныеЛица, "", Элемент.ТекущаяСтрока);
			
		ДобавитьДанныеОрганизации(СтруктураОтветственного);
			
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").НачатьРедактированиеОтветственногоЛица(
			ЭтаФорма, СтруктураОтветственного, "Водитель");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // Водители

&НаКлиенте
Процедура ДоРейса_МедработникНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИзменитьДанныеОтветственногоЛица("МедосмотрВыезд", "Медосмотр");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРейса_МедработникНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИзменитьДанныеОтветственногоЛица("МедосмотрЗаезд", "Медосмотр");
	
КонецПроцедуры

&НаКлиенте
Процедура ТехосмотрСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИзменитьДанныеОтветственногоЛица("Техосмотр");

КонецПроцедуры

&НаКлиенте
Процедура ОдометрВыездСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИзменитьДанныеОтветственногоЛица("ОдометрВыезд", "Показания одометра");

КонецПроцедуры

&НаКлиенте
Процедура ОдометрЗаездСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИзменитьДанныеОтветственногоЛица("ОдометрЗаезд", "Показания одометра");
	
КонецПроцедуры

#КонецОбласти // ОтветственныеЛица

&НаКлиенте
Процедура ОрганизацияСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		Элемент.Имя, Элемент.Имя);
	ПараметрыРеквизитаФормы.ТолькоПросмотр = Элементы.СтраницаОсновное.ТолькоПросмотр;
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "Оформитель", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаИсполненияПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	
	Если Объект.ДатаОкончанияИсполнения = НачалоДня(Объект.ДатаОкончанияИсполнения) Тогда 
		Объект.ДатаОкончанияИсполнения = КонецДня(Объект.ДатаНачалаИсполнения);
	КонецЕсли;
	
	ПроверкаКорректностиЗаполненияРеквизитов(Элемент, "ГруппаДлительностьИсполнения");
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияИсполненияПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	ПроверкаКорректностиЗаполненияРеквизитов(Элемент, "ГруппаДлительностьИсполнения");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоРейса_ОрганизацияСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		Элемент.Имя, Элемент.Имя);
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "МедосмотрВыезд", ПараметрыРеквизитаФормы);

КонецПроцедуры

&НаКлиенте
Процедура ПослеРейса_ОрганизацияСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		Элемент.Имя, Элемент.Имя);
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "МедосмотрЗаезд", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПеревозкиПриИзменении(Элемент)
	
	Если Объект.ВидПеревозки <> ЗначениеМетаданныхКлиент("ESD_ВидПеревозки.КоммерческиеПеревозки") Тогда
		Объект.ВидКоммерческойПеревозки = ЗначениеМетаданныхКлиент("ESD_ВидКоммерческойПеревозки.ПустаяСсылка");
	КонецЕсли;
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура МестоОтправленияНажатие(Элемент, СтандартнаяОбработка)
	ИзменитьМестоОтправления(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МестоОтправленияЗаполнить(Элемент, СтандартнаяОбработка)
	ИзменитьМестоОтправления(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПослерейсовыйМедосмотрТребуетсяПриИзменении(Элемент)
	ПослерейсовыйМедосмотрТребуетсяПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаполнитьЛицензияДоРейсаНажатие(Элемент)
	ИзменитьДанныеОтветственногоЛица("МедосмотрВыезд", "Медосмотр");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаполнитьЛицензияПослеРейсаНажатие(Элемент)
	ИзменитьДанныеОтветственногоЛица("МедосмотрЗаезд", "Медосмотр");
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОшибки

&НаКлиенте
Функция СоответствиеТаблицФормыИОбъекта()
	
	СоответствиеТаблицФормыИОбъекта = Новый Соответствие;
	СоответствиеТаблицФормыИОбъекта.Вставить("Водители", "ОтветственныеЛица");
	СоответствиеТаблицФормыИОбъекта.Вставить("Прицепы",  "ТранспортныеСредства");
	
	Возврат СоответствиеТаблицФормыИОбъекта;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаОшибокПриАктивизацииСтроки(Элемент)

	ОбработатьВызовТаблицыОшибок();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ОбработатьВызовТаблицыОшибок();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВызовТаблицыОшибок()
	
	СоответствиеТаблиц = СоответствиеТаблицФормыИОбъекта();
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").РасшифровкаЗаписиТаблицыОшибок(ЭтаФорма, СоответствиеТаблиц);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОшибки

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВСбис(Команда, ЭтапДляПерехода = Неопределено)
	ОписаниеКоманды = Новый Структура("ИмяКоманды", "ВыгрузитьВСбис");
	Если ЭтапДляПерехода <> Неопределено Тогда
		ОписаниеКоманды.Вставить("ЭтапДляПерехода", ЭтапДляПерехода);
	КонецЕсли;
	ОбменСБИС(ОписаниеКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДокумент(Команда)
	ОписаниеКоманды = Новый Структура("ИмяКоманды", "ПрочитатьДокумент");
	ОбменСБИС(ОписаниеКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ОбменСБИС(ОписаниеКоманды) 
	ПроцедураОбменДаннымиЭПЛ = Новый ОписаниеОповещения("ОбменДаннымиЭПЛ", ЭтаФорма, ОписаниеКоманды);
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПроверитьМодифицированностьИПродолжитьВыполнение(ПроцедураОбменДаннымиЭПЛ);
КонецПроцедуры

#Область КомандыЛенты

&НаКлиенте
Процедура ЛентаВлево(Команда)
	
	СдвинутьЛенту(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛентаВправо(Команда)
	
	СдвинутьЛенту(Истина);
	
КонецПроцедуры

#КонецОбласти // КомандыЛенты

&НаКлиенте
Процедура ОбновитьДанныеПоОшибкам(Команда)
	
	ПроцедураОбновитьДанныеПоОшибкамНаКлиенте = Новый ОписаниеОповещения(
		"ОбновитьДанныеПоОшибкамНаКлиенте",
		ЭтаФорма);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПроверитьМодифицированностьИПродолжитьВыполнение(
		ПроцедураОбновитьДанныеПоОшибкамНаКлиенте, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьОшибки(Команда)
	
	Элементы.ФормаПоказатьСкрытьОшибки.Пометка = Не Элементы.ФормаПоказатьСкрытьОшибки.Пометка;
	
	ОбновитьВнешнийВидЭлементовОшибок();
	
КонецПроцедуры

#Область Печать

&НаКлиенте
Процедура Печать(Команда)
	ПечатьДокументаQrКода(Команда);	
КонецПроцедуры

&НаКлиенте
Процедура Печать_ВыборПечатнойФормы(Команда)
	ПечатьДокументаQrКода(Команда, Истина);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗагрузитьВложенияВ1С(Команда)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЗагрузитьАрхивДокумента(ЭтаФорма, Ложь);
	ФормаОбъект = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ФормаОбъект(ЭтаФорма);
	ОповеститьОбИзменении(ФормаОбъект.Ссылка);
	
КонецПроцедуры
	
#Область ПараллельныеЭтапы

&НаКлиенте
Процедура ВыгрузитьМО(Команда)
	ТитулМО = ЭтапДляПерехода("Внутренний МО");
	ВыгрузитьВСбис(Неопределено, ТитулМО);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТО(Команда)
	ТитулТО = ЭтапДляПерехода("Техосмотр");
	ВыгрузитьВСбис(Неопределено, ТитулТО);
КонецПроцедуры

#КонецОбласти // ПараллельныеЭтапы 

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

#Область include_etrn_base_Document_ОбщийФункционал_ФормаДокумента_ОбработчикиОповещений_ОбработкаОповещенияВыход
#КонецОбласти // include_etrn_base_Document_ОбщийФункционал_ФормаДокумента_ОбработчикиОповещений_ОбработкаОповещенияВыход

&НаКлиенте
Процедура ПриИзмененииВидаМедицинскогоРаботника(РольСтрокой, ВидМедосмотра)
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	// Удалим данные ответственного лица из ТЧ
	МодульТНОбщегоНазначенияКлиентСервер.УдалитьСтрокиПоРоли(Объект.ОтветственныеЛица, РольСтрокой, Истина);
	// Обновим ответственное лицо
	ОбновитьОтветственноеЛицо(РольСтрокой);
	
	// По умолчанию установим в организации "Другая организация"
	Объект[ВидМедосмотра + "_МедицинскаяОрганизация"] = Неопределено;
	// Обработаем изменение медицинской организации
	ПриИзмененииСтороннейОрганизации(РольСтрокой, ВидМедосмотра);	
КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииСтороннейОрганизации(РольСтрокой, ВидМедосмотра) 
	МодульТНОбщегоНазначенияКлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	// Удалим текущие данные организации из ТЧ по роли
	МодульТНОбщегоНазначенияКлиентСервер.УдалитьСтрокиПоРоли(Объект.ДанныеЮрЛиц, РольСтрокой);
	
	// Заполним строковое представление медицинской организации значением тумблера
	ТекущаяМедицинскаяОрганизация = Объект[ВидМедосмотра + "_МедицинскаяОрганизация"];
	Если Не ЗначениеЗаполнено(ТекущаяМедицинскаяОрганизация) Тогда
		ПредставлениеМедицинскойОрганизации = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
			Объект.ДанныеЮрЛиц, РольСтрокой);
	Иначе
		ПредставлениеМедицинскойОрганизации = ТекущаяМедицинскаяОрганизация;
	КонецЕсли;
	ЭтаФорма[ВидМедосмотра + "_ОрганизацияСтрокой"] = ПредставлениеМедицинскойОрганизации;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииПослеЗаписиНаСервере() Экспорт
	ЗаполнитьРасчетныеРеквизиты();
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	МодульТНОбщегоНазначенияСервер.ОбновитьЛенту(ЭтаФорма, Истина);
	
	МодульТНОбщегоНазначенияСервер.ОбновитьВнешнийВидЭлементовОшибок(ЭтаФорма);
	
	ОбновитьВидимостьИДоступностьЭлементов();
	
	ОбновитьВидимостьПоЭтапуИУчастнику();
	
	МодульТНОбщегоНазначенияСервер.УстановитьОтборТаблицыОтветственных(Элементы.Водители, "Водитель");
	
	Если ЭтоУниверсальноеРасширение() Тогда
		ЭтаФорма.АвтоЗаголовок = Не МодульТНОбщегоНазначенияСервер.ЭтоCF();
		Если Не ЭтаФорма.АвтоЗаголовок Тогда
			ЭтаФорма.Заголовок = МодульТНОбщегоНазначенияСервер.ПредставлениеДокумента(ЭтаФорма.Объект);
		КонецЕсли;
	КонецЕсли;
	
	ПриЧтенииСозданииПослеЗаписиНаСервереПереопределяемый();
КонецПроцедуры

#Область include_etrn_base_Document_ПутевойЛист_DocumentForm_ФормаДокумента_ПриЧтенииСозданииПослеЗаписиНаСервере
#КонецОбласти

#Область include_etrn_base_Document_ПутевойЛист_DocumentForm_ФормаДокумента_ПриСозданииНаСервере
#КонецОбласти

#Область include_etrn_base_Document_ПутевойЛист_DocumentForm_ФормаДокумента_ПодключаемыйФункционал
#КонецОбласти // include_etrn_base_Document_ПутевойЛист_DocumentForm_ФормаДокумента_ПодключаемыйФункционал

#Область ВизуальнаяНастройкаЭлементовФормы

&НаКлиенте
Процедура ОбновитьВидимостьИДоступностьЭлементовНаКлиенте() Экспорт
	ОбновитьВидимостьИДоступностьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьИДоступностьЭлементов()
	
	ЭтоКоммерческаяПеревозка = (Объект.ВидПеревозки = ЗначениеМетаданных("ESD_ВидПеревозки.КоммерческиеПеревозки"));
	
	Элементы.ВидКоммерческойПеревозки.Видимость           = ЭтоКоммерческаяПеревозка;
	Элементы.ДекорацияЗаполнитьМестоОтправления.Видимость = Не ЗначениеЗаполнено(Объект.МестоОтправления);
	Элементы.МестоОтправления.Видимость = ЗначениеЗаполнено(Объект.МестоОтправления);
	
	Признаки = ПризнакиДокумента();
	
	// Скрытие данных медработников
	ОбновитьВидимостьИДоступностьЭлементов_Медосмотр(Признаки);
	
	// Завершен ДО, блокируем все изменения
	Если Признаки.Этапы.ДОЗавершен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// СНИЛС
	Элементы.ВодителиСНИЛС.Видимость = ЭтаФорма.ИспользоватьСНИЛС; 
	
	// Техосмотр
	Если ЗначениеЗаполнено(Объект.ТО_ДатаВремя) И ЗначениеЗаполнено(Объект.ТО_ДатаВремяВыпускаВРейс) Тогда
		Элементы.ГруппаТехосмотр_Дата.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	Иначе
		Элементы.ГруппаТехосмотр_Дата.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	КонецЕсли;
	
	// Команды
	ОтборДоступных = Новый Структура("Доступен", Истина);
	НайденныеДоступныеЭтапы = ESD_ТНОбщегоНазначенияКлиентСервер.НайтиСтрокиУниверсально(Объект.ТекущиеЭтапы, ОтборДоступных);
	НесколькоЭтапов = НайденныеДоступныеЭтапы.Количество() > 1;
	
	Если ЭтоУниверсальноеРасширение() Тогда
		Элементы.ФормаВыгрузитьВСбис.Видимость       = Не НесколькоЭтапов И Не ЭтаФорма.ТолькоПросмотр;
		Элементы.ГруппаКнопок_ОтправитьКак.Видимость = НесколькоЭтапов И Не ЭтаФорма.ТолькоПросмотр;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьИДоступностьЭлементов_Медосмотр(Признаки = Неопределено)
	Если Признаки = Неопределено Тогда
		Признаки = ПризнакиДокумента();
	КонецЕсли;
	
	Элементы.ГруппаМедосмотрПослеРейса.Видимость         = Объект.ПослерейсовыйМедосмотрТребуется;
	Элементы.ДоРейса_МедицинскаяОрганизация.Видимость    = Объект.ДоРейса_МедосмотрСторонняяОрганизация;
	Элементы.ПослеРейса_МедицинскаяОрганизация.Видимость = Объект.ПослеРейса_МедосмотрСторонняяОрганизация;
	
	Элементы.ДоРейса_ОрганизацияСтрокой.Видимость    = Объект.ДоРейса_МедосмотрСторонняяОрганизация 
		И Не ЗначениеЗаполнено(Объект.ДоРейса_МедицинскаяОрганизация);
	Элементы.ПослеРейса_ОрганизацияСтрокой.Видимость = Объект.ПослеРейса_МедосмотрСторонняяОрганизация  
		И Не ЗначениеЗаполнено(Объект.ПослеРейса_МедицинскаяОрганизация);
		
	СкрытьМедРаботника_ДоРейса = 
		Объект.ДоРейса_МедосмотрСторонняяОрганизация И Признаки.Этапы.ВыпускДоступен 
		ИЛИ ЗначениеЗаполнено(Объект.ДоРейса_МедицинскаяОрганизация);
		
	СкрытьМедРаботника_ПослеРейса = 
		Объект.ПослеРейса_МедосмотрСторонняяОрганизация И Признаки.Этапы.ВыпускДоступен 
		ИЛИ ЗначениеЗаполнено(Объект.ПослеРейса_МедицинскаяОрганизация);
		
	Элементы.МедосмотрВыездСтрокой.Видимость     = Не СкрытьМедРаботника_ДоРейса; 
	Элементы.ГруппаДоРейса_Лицензия.Видимость    = Не СкрытьМедРаботника_ДоРейса;
	
	Элементы.МедосмотрЗаездСтрокой.Видимость     = Не СкрытьМедРаботника_ПослеРейса;
	Элементы.ГруппаПослеРейса_Лицензия.Видимость = Не СкрытьМедРаботника_ПослеРейса;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьПоЭтапуИУчастнику()
	
	Признаки = ПризнакиДокумента();
	
	Элементы.ГруппаДокументОснование.Видимость = Признаки.Этапы.ВыпускДоступен
		Или ЗначениеЗаполнено(Объект.ДокументОснование_Идентификатор);
	Элементы.НастройкаДокументовОснований.Видимость = Ложь;
	Элементы.ГруппаКомандыДокументаОснования.Видимость = Признаки.Этапы.ВыпускДоступен И Не ЭтаФорма.ТолькоПросмотр;
	Элементы.ДекорацияДокументОснование.Доступность = ЗначениеЗаполнено(Объект.ДокументОснование_Идентификатор) 
															Или Не ЭтаФорма.ТолькоПросмотр;
		
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("СтраницаОсновное");
	МассивЭлементов.Добавить("СтраницаМедосмотр");
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", Признаки.Этапы.Номер >= 1, МассивЭлементов);
		
	Элементы.СтраницаТехОсмотр.Видимость = Не Признаки.ЭтоЗаменаВодителя;
		
	МассивЭлементов.Очистить();
	МассивЭлементов.Добавить("СтраницаОсновное");
	МассивЭлементов.Добавить("ГруппаНомерДата");
	МассивЭлементов.Добавить("ВодителиСтрокой");
	МассивЭлементов.Добавить("ГруппаПрицепы");
	МассивЭлементов.Добавить("ПослерейсовыйМедосмотрТребуется");
	МассивЭлементов.Добавить("ГруппаМестоОтправления");
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "ТолькоПросмотр", Не Признаки.Этапы.ВыпускДоступен Или ЭтаФорма.ТолькоПросмотр, МассивЭлементов);
		
	МассивЭлементов.Очистить();
	МассивЭлементов.Добавить("ДоРейса_МедосмотрСторонняяОрганизация");
	МассивЭлементов.Добавить("ПослеРейса_МедосмотрСторонняяОрганизация");
	МассивЭлементов.Добавить("ДоРейса_МедицинскаяОрганизация");
	МассивЭлементов.Добавить("ПослеРейса_МедицинскаяОрганизация");
	МассивЭлементов.Добавить("МестоОтправления");
	МассивЭлементов.Добавить("ДекорацияЗаполнитьМестоОтправления");
	МассивЭлементов.Добавить("ВодителиДобавитьВодителя");
	МассивЭлементов.Добавить("ПрицепыДобавить");
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Доступность", Признаки.Этапы.ВыпускДоступен И Не ЭтаФорма.ТолькоПросмотр, МассивЭлементов);

	ОбновитьВидимостьПолейПредрейсовогоМедосмотра(Признаки);
	
	ОбновитьВидимостьПолейПредрейсовогоТехосмотра(Признаки);
	
	ОбновитьВидимостьПолейПослерейсовогоМедосмотра(Признаки);
	
	Элементы.ГруппаВыезд.ТолькоПросмотр = Не Признаки.Этапы.ВыпускающийДоступен;
	Элементы.ГруппаЗаезд.ТолькоПросмотр = Не Признаки.Этапы.ПринимающийДоступен;
	
	ОбновитьДоступностьПолейЗаменыВодителя();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьПолейПредрейсовогоМедосмотра(Признаки)
	
	Элементы.ГруппаДоРейса.ТолькоПросмотр = Не (Признаки.Этапы.ПредрейсовыйМедосмотрДоступен
		Или Признаки.Этапы.ВыпускДоступен) Или ЭтаФорма.ТолькоПросмотр;
	
	Элементы.ДоРейса_ОрганизацияСтрокой.ТолькоПросмотр = Не Признаки.Этапы.ВыпускДоступен Или ЭтаФорма.ТолькоПросмотр;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьПолейПредрейсовогоТехосмотра(Признаки)
	
	Элементы.СтраницаТехОсмотр.ТолькоПросмотр = Не (Признаки.Этапы.ПредрейсовыйТехосмотрДоступен
												Или Признаки.Этапы.ВыпускДоступен) Или ЭтаФорма.ТолькоПросмотр;
													
	Если Не Элементы.СтраницаТехОсмотр.ТолькоПросмотр Тогда
		
		МассивЭлементов = Новый Массив;
		МассивЭлементов.Добавить("ГруппаВыпуск_Дата");
		МассивЭлементов.Добавить("ТО_РазрешенВыпускПосле");
		МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
			ЭтаФорма, "ТолькоПросмотр", Не Признаки.Этапы.ПредрейсовыйТехосмотрДоступен, МассивЭлементов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьПолейПослерейсовогоМедосмотра(Признаки)
	
	Элементы.ГруппаПослеРейса.ТолькоПросмотр = Не (Признаки.Этапы.ПослерейсовыйМедосмотрДоступен
		Или Признаки.Этапы.ВыпускДоступен) Или ЭтаФорма.ТолькоПросмотр;
												   
	Элементы.ПослеРейса_ОрганизацияСтрокой.ТолькоПросмотр = Не Признаки.Этапы.ВыпускДоступен Или ЭтаФорма.ТолькоПросмотр;											   										   
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьПолейЗаменыВодителя()
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	РезультатПроверкиДоступностиЗаменыВодителя = ОбъектДокумента.РезультатПроверкиДоступностиЗаменыВодителя();
	ДоступнаЗаменаВодителя = РезультатПроверкиДоступностиЗаменыВодителя.ОК И Не ДокументЗаменыВодителяУжеЕсть();
	
	Если Элементы.Найти("ФормаДокументПутевойЛистСоздатьНаОсновании") <> Неопределено Тогда
		Элементы.ФормаДокументПутевойЛистСоздатьНаОсновании.Доступность = ДоступнаЗаменаВодителя;
    КонецЕсли;
		
	ОснованиеПутевойЛист = ЗначениеЗаполнено(Объект.ДокументОснование_Идентификатор)
		И Объект.ДокументОснование_ОбъектМетаданных = ПутевойЛист();
	
	ЭтоПутевойЛистЗаменыВодителя = ЗначениеЗаполнено(Объект.ПЛПредыдущий) Или ОснованиеПутевойЛист;
	
	Если ЭтоПутевойЛистЗаменыВодителя Тогда		
		ПодсказкаПризнакНачалаРейса = ОтображениеПодсказки.Кнопка;
	Иначе
		ПодсказкаПризнакНачалаРейса = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	Элементы.ПризнакНачалаРейса.ОтображениеПодсказки = ПодсказкаПризнакНачалаРейса;
	
	Если ЭтоПутевойЛистЗаменыВодителя Тогда
			
		МассивЭлементов = Новый Массив;
		МассивЭлементов.Добавить("ОрганизацияСтрокой");
		МассивЭлементов.Добавить("ТранспортноеСредствоСтрокой");
		МассивЭлементов.Добавить("ГруппаПрицепы");
		МассивЭлементов.Добавить("ПрицепыСтрокой");
		МассивЭлементов.Добавить("ГруппаДлительностьИсполнения");
		МассивЭлементов.Добавить("ВидПеревозки");
		МассивЭлементов.Добавить("ГруппаВидКоммерческойПеревозки");
		МассивЭлементов.Добавить("ВидТранспортногоСообщения");
		МассивЭлементов.Добавить("ГруппаМестоОтправления");
		МассивЭлементов.Добавить("ГруппаАдресаПогрузкиВыгрузки");
		
		МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
			ЭтаФорма, "ТолькоПросмотр", ЭтоПутевойЛистЗаменыВодителя, МассивЭлементов);
			
		Элементы.ПрицепыДобавить.Доступность = Ложь;
			
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПараметрыДокумента

&НаСервере
Процедура ЗагрузитьСлужебныеПризнакиДокумента()
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	ЭтаФорма.СлужебныеПризнаки = Новый ХранилищеЗначения(ОбъектДокумента.ПризнакиДокумента());
КонецПроцедуры

&НаСервере
Функция ПризнакиДокумента()
	Возврат ЭтаФорма.СлужебныеПризнаки.Получить();
КонецФункции

&НаСервере
Функция ДОЗавершен() Экспорт
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	ДОЗавершенОтрицательно = МодульТНОбщегоНазначенияКлиентСервер.ИндексКартинки_ДОЗавершенОтрицательно();
	ДОЗавершенПоложительно = МодульТНОбщегоНазначенияКлиентСервер.ИндексКартинки_ДОЗавершенПоложительно();
	
	Завершен = ИндексКартинки = ДОЗавершенОтрицательно
		Или ИндексКартинки = ДОЗавершенПоложительно;
	
	Возврат Завершен;
	
КонецФункции

#КонецОбласти

// Заполнение реквизитов формы при изменение, связанной информации
// или первоначальной инициализации формы
&НаСервере
Процедура ЗаполнитьРасчетныеРеквизиты()
	ЗагрузитьСлужебныеПризнакиДокумента();
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	// Документ основание
	Если ЗначениеЗаполнено(Объект.ДокументОснование_Идентификатор) Тогда 
		ДокументОснование = МодульКода("ESD_ТНОбщегоНазначенияСервер").СсылкаНаОбъектОснование(
			Объект.ДокументОснование_ОбъектМетаданных, Объект.ДокументОснование_Идентификатор);
		Элементы.ДекорацияДокументОснование.Заголовок = СокрЛП(ДокументОснование);
	КонецЕсли;
	
	// ТС
	МодульТНОбщегоНазначенияКлиентСервер.ОбновитьТранспортныеСредстваНаФорме(ЭтаФорма);
	
	// Водители
	МодульТНОбщегоНазначенияКлиентСервер.ОбновитьВодителейНаФорме(ЭтаФорма);
	
	ОбновитьВсеОтветственныеЛица();
	
	// Активный этап и индикация состояния
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОтобразитьНаФормеСбисЭтапИСостояние(ЭтаФорма);
	
	ОбновитьВсеОрганизации();
	
	// СНИЛС
	ЭтаФорма.ИспользоватьСНИЛС = ESD_ТНОбщегоНазначенияСервер
		.ESD_ЗагрузитьНастройкиОбъекта("ИспользоватьСНИЛС", , "");
	
	ЭтаФорма.ИспользоватьТабельныйНомер = ESD_ТНОбщегоНазначенияСервер
		.ESD_ЗагрузитьНастройкиОбъекта("ИспользоватьТабельныйНомер", , "");
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсеОтветственныеЛица() Экспорт
	
	ОбновитьОтветственноеЛицо("МедосмотрВыезд");
	ОбновитьОтветственноеЛицо("МедосмотрЗаезд");
	ОбновитьОтветственноеЛицо("Техосмотр");
	ОбновитьОтветственноеЛицо("ОдометрВыезд");
	ОбновитьОтветственноеЛицо("ОдометрЗаезд");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсеОрганизации()
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ЭтаФорма.ОрганизацияСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, "Оформитель");
	ЭтаФорма.ДоРейса_ОрганизацияСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, "МедосмотрВыезд");
	ЭтаФорма.ПослеРейса_ОрганизацияСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, "МедосмотрЗаезд");
	
КонецПроцедуры

#Область ОбработкаОповещений

&НаКлиенте
Процедура ОбработатьОповещениеОбновитьДокумент(Параметр) Экспорт
	Подключаемый_ОбработкаОповещений_ОбновитьДокумент(Параметр);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещениеВыполнитьПереходНаФорме(ПараметрыПерехода = Неопределено) Экспорт
	
	ОбменДаннымиЭПЛ("ОбновитьАктивныйЭтап");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещениеЗавершениеВыполнитьДействиеНаФорме(Параметр) Экспорт
	
	ОбменДаннымиЭПЛ("ОбновитьАктивныйЭтап");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбновленияДанныхТранспортныхСредств(Результат, ДополнительныеПараметры) Экспорт
		
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ОбновитьТранспортныеСредстваНаФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДанныхОтветственного(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Роль", РезультатЗакрытия.Роль);
	
	НайденныеСтроки = Объект.ОтветственныеЛица.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() Тогда
		Строка = НайденныеСтроки[0];
	Иначе
		Строка = Объект.ОтветственныеЛица.Добавить();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Строка, РезультатЗакрытия);
	
	Если Не ЗначениеЗаполнено(Строка.Фамилия) И Не ЗначениеЗаполнено(Строка.Имя) И Не ЗначениеЗаполнено(Строка.Отчество) Тогда
		Объект.ОтветственныеЛица.Удалить(Строка);
	КонецЕсли;
	
	ОбновитьОтветственноеЛицо(РезультатЗакрытия.Роль, , РезультатЗакрытия);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти // ОбработкаОповещений

&НаКлиенте
Процедура ОбменДаннымиЭПЛ(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДополнительныеПараметрыОбмена = Новый Структура;
	ДополнительныеПараметрыОбмена.Вставить("ДвоичныеДанныеОбработки", Неопределено);
	
	ИмяКоманды      = Результат;
	ЭтапДляПерехода = Неопределено;
	Если ДополнительныеПараметры <> Неопределено Тогда 
		
		Если ДополнительныеПараметры.Свойство("ИмяКоманды") Тогда
			ИмяКоманды = ДополнительныеПараметры.ИмяКоманды;
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ЭтапДляПерехода") Тогда
			ЭтапДляПерехода = ДополнительныеПараметры.ЭтапДляПерехода;
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеПараметрыОбмена.Вставить("ЭтапДляПерехода", ЭтапДляПерехода);
	
	МодульESD_КлиентСервер = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ДанныеДляОбработки = Новый Массив;
	Если ИмяКоманды = "ВыгрузитьВСбис" Тогда
		
		ПараметрыВыгрузки = МодульESD_КлиентСервер.ПараметрыВыгрузки(Объект.Ссылка);
		Если ЭтапДляПерехода <> Неопределено Тогда
			ПараметрыВыгрузки.Этап = ЭтапДляПерехода.Наименование;
		КонецЕсли;
		ДанныеДляОбработки.Добавить(ПараметрыВыгрузки);
		
	Иначе
		
		ПараметрыЗагрузки = МодульESD_КлиентСервер.ПараметрыЗагрузки(Объект.Ссылка);
		ПараметрыЗагрузки.ИзДокумента   = Истина;
		ПараметрыЗагрузки.ИмяМетаданных = ПутевойЛист();
		
		Если ИмяКоманды = "ОбновитьАктивныйЭтап" Тогда
			ПараметрыЗагрузки.ТекущийТитул = АктивныйЭтапСтрокой;
			ПараметрыЗагрузки.ТолькоАктивныйЭтап = Истина;
		КонецЕсли;
		
		ДанныеДляОбработки.Добавить(ПараметрыЗагрузки);
		
	КонецЕсли;
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ВыполнитьКомандуСбис(
		ЭтаФорма,
		ИмяКоманды,
		ДанныеДляОбработки,
		ДополнительныеПараметрыОбмена);
		
КонецПроцедуры

#Область Лента

&НаКлиенте
Процедура ДекорацияТитулОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбработкаНавигационнойСсылкиЛенты(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьРеквизитИзТитула(СтрокаЛенты) Экспорт
	
	Если СтрокаЛенты.НаименованиеТитула = "Выпуск" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ПризнакНачалаРейса;
	ИначеЕсли СтрокаЛенты.НаименованиеТитула = "ПредрейсовыйМедосмотр" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ДоРейса_МедосмотрСторонняяОрганизация;
	ИначеЕсли СтрокаЛенты.НаименованиеТитула = "ПредрейсовыйТехосмотр" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ТО_ДатаВыпускаВРейс;
	ИначеЕсли СтрокаЛенты.НаименованиеТитула = "Выпускающий" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Выезд_Дата;
	ИначеЕсли СтрокаЛенты.НаименованиеТитула = "Принимающий" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Заезд_Дата;
	ИначеЕсли СтрокаЛенты.НаименованиеТитула = "ПослерейсовыйМедосмотр" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ПослеРейса_МедосмотрСторонняяОрганизация;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуТитула(НаименованиеТитула, ИдентификаторТитула, Описание) Экспорт
	
	Если Описание <> "ПредыдущийПутевойЛист" И Описание <> "ЗаменаВодителя" Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаДокумент = ПолучитьСсылкуНаПутевойЛист(ИдентификаторТитула);
	
	Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		ПоказатьЗначение(, СсылкаНаДокумент);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден путевой лист по идентификатору %1.";
		Сообщение.Текст = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(Сообщение.Текст, ИдентификаторТитула);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТитулОтрицательноЗавершен(СтрокаЛенты) Экспорт
	
	ОтрицательноЗавершенПослеТО = СтрокаЛенты.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.ПредрейсовыйТехосмотр")
		И Объект.ТО_НеРазрешенВыпускПосле;
		
	ОтрицательноЗавершенПослеМО = СтрокаЛенты.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЭПЛ.ПредрейсовыйМедосмотр")
		И Объект.ДоРейса_НеДопущенПослеМедосмотра;
	
	Возврат ОтрицательноЗавершенПослеТО Или ОтрицательноЗавершенПослеМО;
	
КонецФункции

&НаСервере
Процедура СдвинутьЛенту(Знач Вправо)
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").СдвинутьЛенту(ЭтаФорма, Вправо);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЛентуНаСервере() Экспорт
	
	ЭтаФорма.Прочитать();
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбновитьЛенту(ЭтаФорма, Истина);
	
	ОбновитьВидимостьПоЭтапуИУчастнику();
	
КонецПроцедуры

#КонецОбласти // Лента

#Область Ошибки

&НаКлиенте
Процедура ОбновитьДанныеПоОшибкамНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьДанныеПоОшибкамНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоОшибкамНаСервере(Знач Ошибки = Неопределено) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Ссылка", Объект.Ссылка);
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбновитьОшибки(
		ЭтаФорма,
		ДополнительныеПараметры,
		Ошибки);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВнешнийВидЭлементовОшибок()
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбновитьВнешнийВидЭлементовОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДекорациюНаСервере(Знач ПараметрыВыделенияДекорации) Экспорт
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбновитьДекорацию(ЭтаФорма, ПараметрыВыделенияДекорации);
	
КонецПроцедуры

#КонецОбласти // Ошибки

&НаСервере
Функция ЗаполнениеНаОснованииINI() Экспорт
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	
	Результат = МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьНаОснованииINI(
		ОбъектДокумента, ДокументОснование, ПутевойЛист());
	Если ЗначениеЗаполнено(Результат) Тогда
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОграничитьТипыДокументовОснованийНаСервере() Экспорт
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОграничитьТипыДокументовОснований(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДанныеОтветственногоЛица(РольСтрокой, ИмяФормы = "")
	
	Если ПустаяСтрока(ИмяФормы) Тогда
		ИмяФормы = РольСтрокой;
	КонецЕсли;
	
	ФормаТолькоПросмотр = ФормаОтветственногоТолькоПросмотр(РольСтрокой);
	
	ПараметрыФормы = ДанныеИзТаблицыПоОтбору("ОтветственныеЛица", РольСтрокой);
	ПараметрыФормы.Вставить("Наименование", ИмяФормы);
	ПараметрыФормы.Вставить("РольСтрокой",  РольСтрокой);
	
	СкрываемыеЭлементы = Новый Массив;
	СкрываемыеЭлементы.Добавить("ГруппаТелефоны");
	
	ПараметрыФормы.Вставить("СкрываемыеЭлементы", СкрываемыеЭлементы);
	
	Если ФормаТолькоПросмотр Тогда
		ПараметрыФормы.Вставить("ТолькоПросмотр", ФормаТолькоПросмотр);
	КонецЕсли;
	
	ДобавитьДанныеОрганизации(ПараметрыФормы);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ИзменитьДанныеВодителяОтветственногоЛица(
		ЭтаФорма,
		ПараметрыФормы,
		"ПослеВводаДанныхОтветственного");
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДанныеОрганизации(ПараметрыФормы)
	
	Если ЭтаФорма.ИспользоватьТабельныйНомер Тогда
		СтруктураЮрЛица = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ДанныеЮрЛицаПоРоли(
			Объект.ДанныеЮрЛиц, "Оформитель");
		Если Не СтруктураЮрЛица.Заполнена Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнена организация путевого листа";
			Сообщение.Поле = "ОрганизацияСтрокой";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы.Вставить("ИННОрганизации", СтруктураЮрЛица.ИНН);
		ПараметрыФормы.Вставить("КППОрганизации", СтруктураЮрЛица.КПП);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ФормаОтветственногоТолькоПросмотр(РольСтрокой)
	
	Признаки = ПризнакиДокумента();
	ФормаТолькоПросмотр = Признаки.Этапы.ДОЗавершен Или ЭтаФорма.ТолькоПросмотр;
	Если ФормаТолькоПросмотр Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если РольСтрокой = "МедосмотрВыезд" Тогда
		
		ФормаТолькоПросмотр = Не Признаки.Этапы.ПредрейсовыйМедосмотрДоступен И Не Признаки.Этапы.ВыпускДоступен;
		
	ИначеЕсли РольСтрокой = "МедосмотрЗаезд" Тогда
		
		ФормаТолькоПросмотр = Не Признаки.Этапы.ПослерейсовыйМедосмотрДоступен И Не Признаки.Этапы.ВыпускДоступен;
		
	ИначеЕсли РольСтрокой = "Техосмотр" Тогда
		
		ФормаТолькоПросмотр = Не Признаки.Этапы.ПредрейсовыйТехосмотрДоступен И Не Признаки.Этапы.ВыпускДоступен;
		
	ИначеЕсли РольСтрокой = "ОдометрВыезд" Тогда
		
		ФормаТолькоПросмотр = Не Признаки.Этапы.ВыпускающийДоступен;
		
	ИначеЕсли РольСтрокой = "ОдометрЗаезд" Тогда
		
		ФормаТолькоПросмотр = Не Признаки.Этапы.ВыпускающийДоступен И Не Признаки.Этапы.ПринимающийДоступен;
		
	ИначеЕсли РольСтрокой = "Водитель" Тогда
		
		ФормаТолькоПросмотр = Не Признаки.Этапы.ВыпускДоступен;
		
	Иначе 
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат ФормаТолькоПросмотр;
	
КонецФункции

&НаСервере
Функция ДанныеИзТаблицыПоОтбору(Знач ИмяТЧ, Знач Роль)
	
	ЭтоЮрЛицо = ИмяТЧ = "ДанныеЮрЛиц";
	
	Если ТипЗнч(Роль) = Тип("Строка") Тогда
		Если ЭтоЮрЛицо Тогда
			РольДляОтбора = ЗначениеМетаданных("ESD_РолиКонтрагентов." + Роль);
		Иначе 	
			РольДляОтбора = ЗначениеМетаданных("ESD_РолиОтветственных." + Роль);
		КонецЕсли;
	Иначе
		РольДляОтбора = Роль;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Роль", РольДляОтбора);
	
	НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() Тогда
		
		Строка = НайденныеСтроки[0];
		
		Если ЭтоЮрЛицо Тогда
			Структура = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ШаблонДанныхЮрЛица();
			Структура.Заполнена = Истина;
		Иначе
			Структура = МодульКода("ESD_ТНОбщегоНазначенияСервер").СтруктураДанныхОтветственногоЛица();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Структура, Строка);
	Иначе 
		Структура = Новый Структура;
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Процедура ОбновитьОтветственноеЛицо(Знач Роль, ЭлементФормы = "", Структура = Неопределено)
	
	Если ПустаяСтрока(ЭлементФормы) Тогда
		ЭлементФормы = СокрЛП(Роль) + "Строкой";
	КонецЕсли;
	
	Если ТипЗнч(Роль) = Тип("Строка") Тогда
		Роль = ЗначениеМетаданных("ESD_РолиОтветственных." + Роль);
	КонецЕсли;
	
	Если Структура = Неопределено Тогда
		Структура = ДанныеИзТаблицыПоОтбору("ОтветственныеЛица", Роль);
	КонецЕсли;
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОбновитьОтветственногоНаФорме(ЭтаФорма, ЭлементФормы, Структура);
	
	ОбновитьДополнительныеРеквизиты(Роль, Структура);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДополнительныеРеквизиты(Роль, Структура)
	
	Если Роль = ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрВыезд") Тогда
		Элементы.ДекорацияЗаполнитьЛицензияДоРейса.Заголовок = СформироватьНаименованиеЛицензии(Структура);
	ИначеЕсли Роль = ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрЗаезд") Тогда
		Элементы.ДекорацияЗаполнитьЛицензияПослеРейса.Заголовок = СформироватьНаименованиеЛицензии(Структура);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаименованиеЛицензии(Знач Структура)
	
	Если Не ЗначениеЗаполнено(Структура) Тогда
		Лицензия = "Заполнить";
	Иначе 	
		
		ШаблонЛицензии = "%1 №%2 Действует с %3 по %4";
		
		Лицензия = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
			ШаблонЛицензии,
			Структура.Серия,
			Структура.Номер,
			Формат(Структура.ДатаВыдачи, "ДФ=dd.MM.yyyy"),
			Формат(Структура.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy"));
		
	КонецЕсли;
	
	Возврат Лицензия;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьМестоОтправления(СтандартнаяОбработка)
	
	ПараметрыВыбораАдреса = Новый Структура;
	ПараметрыВыбораАдреса.Вставить("Роль",           "Оформитель");
	ПараметрыВыбораАдреса.Вставить("Значение",       Объект.МестоОтправленияЗначение);
	ПараметрыВыбораАдреса.Вставить("Текст",          Объект.МестоОтправления);
	ПараметрыВыбораАдреса.Вставить("ТолькоПросмотр", Элементы.ГруппаМестоОтправления.ТолькоПросмотр);
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").АдресНачалоВыбора(ЭтаФорма, ПараметрыВыбораАдреса, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПослерейсовыйМедосмотрТребуетсяПриИзмененииНаСервере()
	
	ОчиститьДанныеПослерейсовогоМедосмотра();
	
	Если Объект.ПослерейсовыйМедосмотрТребуется Тогда
		ЗаполнитьПослерейсовыйМедосмотрНаОснованииПредрейсового();
	КонецЕсли;
	
	ОбновитьОтветственноеЛицо("МедосмотрЗаезд");
	ЭтаФорма.ПослеРейса_ОрганизацияСтрокой = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПредставлениеЮрЛицаПоРоли(
		Объект.ДанныеЮрЛиц, "МедосмотрЗаезд");
	
	ОбновитьВидимостьИДоступностьЭлементов_Медосмотр();
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеПослерейсовогоМедосмотра()
	
	Объект.ПослеРейса_МедосмотрСторонняяОрганизация = Ложь; 
	Объект.ПослеРейса_МедицинскаяОрганизация = Неопределено;
	
	ОтборПоРоли = Новый Структура;
	ОтборПоРоли.Вставить("Роль", ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрЗаезд"));
	
	НайденныеОтветственные = Объект.ОтветственныеЛица.НайтиСтроки(ОтборПоРоли);
	Для Каждого СтрокаОтветственного Из НайденныеОтветственные Цикл
		Объект.ОтветственныеЛица.Удалить(СтрокаОтветственного);
	КонецЦикла;
	
	ОтборПоРоли.Вставить("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрЗаезд"));
	
	НайденныеЮрЛица = Объект.ДанныеЮрЛиц.НайтиСтроки(ОтборПоРоли);
	Для Каждого СтрокаЮрЛица Из НайденныеЮрЛица Цикл
		
		ОтборПоРоли.Вставить("КлючСтроки_ДанныеЮрЛиц", СтрокаЮрЛица.КлючСтроки);
		
		НайденныеКонтактныеДанные = Объект.КонтактныеДанные.НайтиСтроки(ОтборПоРоли);
		Для Каждого СтрокаКонтактныхДанных Из НайденныеКонтактныеДанные Цикл
			Объект.КонтактныеДанные.Удалить(СтрокаКонтактныхДанных);
		КонецЦикла;
		
		Объект.ДанныеЮрЛиц.Удалить(СтрокаЮрЛица);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПослерейсовыйМедосмотрНаОснованииПредрейсового()
	
	Объект.ПослеРейса_МедосмотрСторонняяОрганизация = Объект.ДоРейса_МедосмотрСторонняяОрганизация;
	
	ОтборПоРоли = Новый Структура;
	ОтборПоРоли.Вставить("Роль", ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрВыезд"));
	
	РольМедосмотрЗаезд = ЗначениеМетаданных("ESD_РолиОтветственных.МедосмотрЗаезд");
	
	НайденныеОтветственные = Объект.ОтветственныеЛица.НайтиСтроки(ОтборПоРоли);
	Для Каждого СтрокаОтветственного Из НайденныеОтветственные Цикл
		НоваяСтрокаОтветственного = Объект.ОтветственныеЛица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОтветственного, СтрокаОтветственного);
		НоваяСтрокаОтветственного.КлючСтроки = 0;
		НоваяСтрокаОтветственного.Роль       = РольМедосмотрЗаезд;
	КонецЦикла;
	
	ОтборПоРоли.Вставить("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрВыезд"));
	
	РольМедосмотрЗаезд = ЗначениеМетаданных("ESD_РолиКонтрагентов.МедосмотрЗаезд");
	
	НайденныеЮрЛица = Объект.ДанныеЮрЛиц.НайтиСтроки(ОтборПоРоли);
	Для Каждого СтрокаЮрЛица Из НайденныеЮрЛица Цикл
		
		НоваяСтрокаЮрЛица = Объект.ДанныеЮрЛиц.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаЮрЛица, СтрокаЮрЛица);
		НоваяСтрокаЮрЛица.КлючСтроки = 0;
		НоваяСтрокаЮрЛица.Роль       = РольМедосмотрЗаезд;
		
		ОтборПоРоли.Вставить("КлючСтроки_ДанныеЮрЛиц", СтрокаЮрЛица.КлючСтроки);
		
		НайденныеКонтактныеДанные = Объект.КонтактныеДанные.НайтиСтроки(ОтборПоРоли);
		Для Каждого СтрокаКонтактныхДанных Из НайденныеКонтактныеДанные Цикл
			НоваяСтрокаКонтактныхДанных = Объект.КонтактныеДанные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаКонтактныхДанных, СтрокаКонтактныхДанных);
			НоваяСтрокаКонтактныхДанных.КлючСтроки_ДанныеЮрЛиц = НоваяСтрокаЮрЛица.КлючСтроки;
			НоваяСтрокаКонтактныхДанных.Роль                   = РольМедосмотрЗаезд;
		КонецЦикла;
		
	КонецЦикла; 
	
	Объект.ПослеРейса_МедицинскаяОрганизация = Объект.ДоРейса_МедицинскаяОрганизация;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаПутевойЛист(Знач ИдентификаторДокумента)
	
	СсылкаНаДокумент = МодульКода("Документы.ESD_ПутевойЛист").ПолучитьСсылку(
		Новый УникальныйИдентификатор(ИдентификаторДокумента));
	Если МодульКода("ESD_ТНОбщегоНазначенияСервер").СсылкаСуществует(СсылкаНаДокумент) Тогда
		Возврат СсылкаНаДокумент;
	КонецЕсли;
	
	СсылкаНаДокумент = МодульКода("ESD_ТНОбщегоНазначенияСервер").ДокументПоИдентификаторуСбис(ИдентификаторДокумента);
	Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Возврат СсылкаНаДокумент;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ДокументЗаменыВодителяУжеЕсть()
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ESD_ПутевойЛист.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ESD_ПутевойЛист КАК ESD_ПутевойЛист
	|ГДЕ
	|	ESD_ПутевойЛист.Ссылка <> &Ссылка
	|	И ESD_ПутевойЛист.ДокументОснование_Идентификатор = &ИдентификаторДокумента";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ПутевойЛист", ПутевойЛист());
	
	ЗапросДанных.УстановитьПараметр("Ссылка",                 Объект.Ссылка);
	ЗапросДанных.УстановитьПараметр("ИдентификаторДокумента", Строка(Объект.Ссылка.УникальныйИдентификатор()));
	
	Возврат Не ЗапросДанных.Выполнить().Пустой() Или ЗначениеЗаполнено(Объект.ПЛСледующий);
	
КонецФункции

#Область ПроверкаКорректностиЗаполненияРеквизитов

&НаКлиенте
Процедура ПроверкаКорректностиЗаполненияРеквизитов(Элемент, ИмяЭлементаПодсказки)
	
	ЕстьОшибка = Ложь;
	
	// Проверка что заезд происходит позже чем был выезд
	Если Элемент = Элементы.Заезд_Дата Или Элемент = Элементы.Заезд_Время Тогда
		
		ЕстьОшибка = (Объект.Заезд_ДатаВремя < Объект.Выезд_ДатаВремя);
		
		Если Не ЕстьОшибка Тогда
			ЕстьОшибка = НеВходитВПериодДействияПутевогоЛиста(Объект.Заезд_ДатаВремя);
		КонецЕсли;
		
		ВключитьОтключитьУсловноеОформление("ОтметкаНеВерногоЗаезда", ЕстьОшибка);
		
	// дата то в периоде действия путевого листа
	ИначеЕсли Элемент = Элементы.ТО_ДатаВыпускаВРейс Тогда
		
		ЕстьОшибка = НеВходитВПериодДействияПутевогоЛиста(Объект.ТО_ДатаВремяВыпускаВРейс);
		ВключитьОтключитьУсловноеОформление("ОтметкаНеВерногоВыпуска", ЕстьОшибка);
		
	// дата выезда
	ИначеЕсли Элемент = Элементы.Выезд_Дата Или Элемент = Элементы.Выезд_Время Тогда
		
		ЕстьОшибка = НеВходитВПериодДействияПутевогоЛиста(Объект.Выезд_ДатаВремя);
		ВключитьОтключитьУсловноеОформление("ОтметкаНеВерногоВыезда", ЕстьОшибка);
		
	ИначеЕсли Элемент = Элементы.ДатаНачалаИсполнения Или Элемент = Элементы.ДатаОкончанияИсполнения Тогда
		
		ЕстьОшибка = (Объект.ДатаНачалаИсполнения > Объект.ДатаОкончанияИсполнения);
		ВключитьОтключитьУсловноеОформление("ОтметкаНеВернойДатыОкончания", ЕстьОшибка);
		
	ИначеЕсли Элемент = Элементы.Выезд_Одометр Или Элемент = Элементы.Заезд_Одометр Тогда
		
		ЕстьОшибка = (Объект.Выезд_Одометр > Объект.Заезд_Одометр);
		ВключитьОтключитьУсловноеОформление("ОтметкаНеВерногоОдометраЗаезда", ЕстьОшибка);
		
	Иначе
		Возврат;
	КонецЕсли;
	
	УстановитьСнятьПодсказкуЭлемента(ИмяЭлементаПодсказки, ЕстьОшибка);
	
КонецПроцедуры

&НаКлиенте
Функция НеВходитВПериодДействияПутевогоЛиста(ДатаПроверки)
	
	Ошибка = (ДатаПроверки < НачалоДня(Объект.ДатаНачалаИсполнения)
				Или КонецДня(Объект.ДатаОкончанияИсполнения) < ДатаПроверки);

    Возврат Ошибка;
	
КонецФункции

&НаКлиенте
Процедура УстановитьСнятьПодсказкуЭлемента(ИмяЭлементаПодсказки, ЕстьОшибка = Ложь)

	Если ЕстьОшибка Тогда
		СпособОтображения = ОтображениеПодсказки.ОтображатьСправа;				
	Иначе 	
		СпособОтображения = ОтображениеПодсказки.Нет;	
	КонецЕсли;
	
	Элементы[ИмяЭлементаПодсказки].ОтображениеПодсказки = СпособОтображения;
	
КонецПроцедуры

&НаСервере
Процедура ВключитьОтключитьУсловноеОформление(Знач ИмяСвойства, Знач ЕстьОшибки)
	
	Отключить = "Отключить" + ИмяСвойства;
	Включить  = "Включить"  + ИмяСвойства;
	
	Для Каждого ЭлементУО Из УсловноеОформление.Элементы Цикл 
		
		Если ЭлементУО.Представление = Отключить Тогда			
			ЭлементУО.Использование = Не ЕстьОшибки;			
		ИначеЕсли ЭлементУО.Представление = Включить Тогда
			ЭлементУО.Использование = ЕстьОшибки;
		Иначе
			Продолжить;
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти // ПроверкаКорректностиЗаполненияРеквизитов

&НаСервере
Функция ЗаполнениеНаОснованииНаСервере(Знач СсылкаНаОснование) Экспорт
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнениеНаОснованииПоНовомуРедактору(ЭтаФорма, СсылкаНаОснование);
КонецФункции

#Область include_etrn_base_Document_ПутевойЛист_DocumentForm_ФормаДокумента_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_Document_ПутевойЛист_DocumentForm_ФормаДокумента_СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЭтапДляПерехода(Титул)
		
	Отбор = Новый Структура;
	Отбор.Вставить("Наименование", Титул);
	
	НайденныеСтроки = Объект.ТекущиеЭтапы.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() Тогда
		
		КолонкиИсключения = Новый Массив;
		КолонкиИсключения.Добавить("НомерСтроки");
		
		ЭтапПерехода = Новый Структура("Наименование, Идентификатор");
		ЗаполнитьЗначенияСвойств(ЭтапПерехода, НайденныеСтроки[0]);
		
	Иначе
		ЭтапПерехода = Неопределено;
	КонецЕсли;
	
	Возврат ЭтапПерехода;
	
КонецФункции

&НаКлиенте
Процедура ПечатьДокументаQrКода(Команда, ВыборПечатнойФормы = Ложь) Экспорт
	
	ФормаОбъект = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ФормаОбъект(ЭтаФорма);
	
	// BSLLS:DeprecatedCurrentDate-off
	ТекущаяДатаКлиента = ТекущаяДата();
	// BSLLS:DeprecatedCurrentDate-on
	
	Если Команда.Имя = "QRКод" И КонецДня(ФормаОбъект.ДатаОкончанияИсполнения) < ТекущаяДатаКлиента Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "QR-код не действителен после исполнения путевого листа.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЗаголовокПечатнойФормы = "Путевой лист №%1 от %2";
	ЗаголовокПечатнойФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
		ЗаголовокПечатнойФормы, ФормаОбъект.Номер, Формат(ФормаОбъект.Дата, "ДФ=dd.MM.yyyy"));
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПечатьДокумента(ЭтаФорма, Команда.Имя, ЗаголовокПечатнойФормы,,ВыборПечатнойФормы);

КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПрименитьДополнительныеПрава(Результат) Экспорт
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
