
&НаСервере
Процедура Подключаемый_ПриСозданииНаСервере()
	ESD_ОбщийФункционалСервер.ФЛК_Инициализация(ЭтаФорма, ЭтаФорма.КоманднаяПанель);
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ESD_ОбщийФункционалСервер.События_СоздатьСтраницу(ЭтаФорма, Элементы.Страницы);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриОткрытии()
	ПодключитьОбработчикОжидания("Подключаемый_ПослеОткрытия", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПослеОткрытия()
	ESD_ОбщийФункционалКлиент.ОбщиеНастройкиЭПД_ОбработатьЗначенияНаФормеЭПД(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_Выполнить() Экспорт
	ОбменСбис(Новый Структура("ИмяКоманды", "ПрочитатьДокумент"));
КонецПроцедуры

#Область include_etrn_base_Document_ПодключаемыйФункционал_ФормаДокумента_ОбработчикиСобытийЭлементов
#КонецОбласти // include_etrn_base_Document_ПодключаемыйФункционал_ФормаДокумента_ОбработчикиСобытийЭлементов

#Область include_etrn_base_Document_ПодключаемыйФункционал_ФормаДокумента_ОбработчикиОповещений
#КонецОбласти // include_etrn_base_Document_ПодключаемыйФункционал_ФормаДокумента_ОбработчикиОповещений

#Область include_etrn_base_Document_ПодключаемыйФункционал_ФормаДокумента_ОбработчикиКоманд
#КонецОбласти // include_etrn_base_Document_ПодключаемыйФункционал_ФормаДокумента_ОбработчикиКоманд

#Область include_etrn_base_Document_ПодключаемыйФункционал_ФормаДокумента_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_Document_ПодключаемыйФункционал_ФормаДокумента_СлужебныеПроцедурыИФункции

&НаСервере
Функция Подключаемый_События_ДополнительныеПараметры()
	АльтернативныеНазвания_ = Новый Соответствие;
	Если Объект.ДоРейса_МедосмотрСторонняяОрганизация = Истина Тогда
		НазваниеСобытия_ = Строка(Перечисления.ESD_ТипТитулаЭПЛ.ПредрейсовыйМедосмотр);
		АльтернативноеНазвание_ = НазваниеСобытия_ 
			+ " (" + События_АльтернативноеНазвание_ПредрейсовыйМО() + ")";
		АльтернативныеНазвания_.Вставить(НРег(НазваниеСобытия_), АльтернативноеНазвание_);
	КонецЕсли;
	
	Если Объект.ПослерейсовыйМедосмотрТребуется И Объект.ПослеРейса_МедосмотрСторонняяОрганизация Тогда
		НазваниеСобытия_ = Строка(Перечисления.ESD_ТипТитулаЭПЛ.ПослерейсовыйМедосмотр);
		АльтернативноеНазвание_ = НазваниеСобытия_ 
			+ " (" + События_АльтернативноеНазвание_ПослерейсовыйМО() + ")";
		АльтернативныеНазвания_.Вставить(НРег(НазваниеСобытия_), АльтернативноеНазвание_);
	КонецЕсли;
	
	Возврат ESD_ОбщийФункционалКлиентСервер.События_ДополнительныеПараметры(АльтернативныеНазвания_);
КонецФункции

&НаСервере
Функция События_АльтернативноеНазвание_ПредрейсовыйМО()
	РезультатФункции = "";
	Если ЗначениеЗаполнено(Объект.ДоРейса_МедицинскаяОрганизация) Тогда
		РезультатФункции = Перечисления.ESD_МедицинскиеОрганизации
			.ПредставлениеПоЗначению(Объект.ДоРейса_МедицинскаяОрганизация);
	Иначе
		РезультатФункции = ЭтаФорма.ДоРейса_ОрганизацияСтрокой;
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

&НаСервере
Функция События_АльтернативноеНазвание_ПослерейсовыйМО()
	РезультатФункции = "";
	Если ЗначениеЗаполнено(Объект.ПослеРейса_МедицинскаяОрганизация) Тогда
		РезультатФункции = Перечисления.ESD_МедицинскиеОрганизации
			.ПредставлениеПоЗначению(Объект.ПослеРейса_МедицинскаяОрганизация);
	Иначе
		РезультатФункции = ЭтаФорма.ПослеРейса_ОрганизацияСтрокой;
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

&НаСервере
Функция Подключаемый_События_СлужебныеПараметры()
	Возврат ESD_ОбщийФункционалКлиентСервер.События_СлужебныеПараметры();
КонецФункции

