
Функция СлужебныеНастройки_Загрузить() Экспорт
	СтруктураОбъекта_ = СлужебныеНастройки_СтруктураОбъекта();
	ТекущиеНастройки_ = ESD_ЗагрузитьНастройкиОбъекта(СлужебныеНастройки_Ключ());
	Если ТипЗнч(ТекущиеНастройки_) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта_, ТекущиеНастройки_);
	КонецЕсли;
	
	Возврат СтруктураОбъекта_;
КонецФункции

Процедура СлужебныеНастройки_Записать(НовыеЗначения) Экспорт
	Если ТипЗнч(НовыеЗначения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеНастройки_ = СлужебныеНастройки_Загрузить();
	ЗаполнитьЗначенияСвойств(ТекущиеНастройки_, НовыеЗначения);
	ESD_СохранитьНастройкиОбъекта(СлужебныеНастройки_Ключ(), ТекущиеНастройки_);
КонецПроцедуры

Функция ХранитьСтатусыВДополнительныхСведениях_Загрузить() Экспорт
	ТекущееЗначение_ = СлужебныеНастройки_Загрузить().ХранитьСтатусыВДополнительныхСведениях;
	Если ТипЗнч(ТекущееЗначение_) <> Тип("Булево") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ТекущееЗначение_;
КонецФункции

Процедура ХранитьСтатусыВДополнительныхСведениях_Записать(НовоеЗначение) Экспорт
	Если ТипЗнч(НовоеЗначение) <> Тип("Булево") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеНастройки_ = СлужебныеНастройки_Загрузить();
	ТекущиеНастройки_.ХранитьСтатусыВДополнительныхСведениях = НовоеЗначение;
	ESD_СохранитьНастройкиОбъекта(СлужебныеНастройки_Ключ(), ТекущиеНастройки_);	
КонецПроцедуры

Функция ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_Загрузить() Экспорт
	ТекущееЗначение_ = СлужебныеНастройки_Загрузить().ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД;
	Если ТипЗнч(ТекущееЗначение_) <> Тип("Булево") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ТекущееЗначение_;		
КонецФункции

Процедура ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_Записать(НовоеЗначение) Экспорт
	Если ТипЗнч(НовоеЗначение) <> Тип("Булево") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеНастройки_ = СлужебныеНастройки_Загрузить();
	ТекущиеНастройки_.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД = НовоеЗначение;
	ESD_СохранитьНастройкиОбъекта(СлужебныеНастройки_Ключ(), ТекущиеНастройки_);
КонецПроцедуры

