
Функция СлужебныеНастройки_Загрузить() Экспорт
	СтруктураОбъекта_ = СлужебныеНастройки_СтруктураОбъекта();
	ТекущиеНастройки_ = ESD_ЗагрузитьНастройкиОбъекта(СлужебныеНастройки_Ключ());
	Если ТипЗнч(ТекущиеНастройки_) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта_, ТекущиеНастройки_);
	КонецЕсли;
	
	Возврат СтруктураОбъекта_;
КонецФункции  

Функция СлужебнаяНастройка_Загрузить(Знач ИмяНастройки) Экспорт
	
	ПоУмолчанию_ = Неопределено;
	Если Не СлужебныеНастройки_СтруктураОбъекта().Свойство(ИмяНастройки, ПоУмолчанию_) Тогда
		Возврат Неопределено;  
	КонецЕсли;

	Значение_ = ПоУмолчанию_;
	СлужебныеНастройки_Загрузить().Свойство(ИмяНастройки, Значение_);
 
	Если ТипЗнч(Значение_) <> ТипЗнч(ПоУмолчанию_) Тогда
		Возврат ПоУмолчанию_;
	КонецЕсли;
	
	Возврат Значение_;  
	
КонецФункции

Процедура СлужебныеНастройки_Записать(НовыеЗначения) Экспорт
	Если ТипЗнч(НовыеЗначения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеНастройки_ = СлужебныеНастройки_Загрузить();
	ЗаполнитьЗначенияСвойств(ТекущиеНастройки_, НовыеЗначения);
	ESD_СохранитьНастройкиОбъекта(СлужебныеНастройки_Ключ(), ТекущиеНастройки_);
КонецПроцедуры

Функция ХранитьСтатусыВДополнительныхСведениях_Загрузить() Экспорт
	ТекущееЗначение_ = СлужебныеНастройки_Загрузить().ХранитьСтатусыВДополнительныхСведениях;
	Если ТипЗнч(ТекущееЗначение_) <> Тип("Булево") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ТекущееЗначение_;
КонецФункции

Процедура ХранитьСтатусыВДополнительныхСведениях_Записать(НовоеЗначение) Экспорт
	Если ТипЗнч(НовоеЗначение) <> Тип("Булево") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеНастройки_ = СлужебныеНастройки_Загрузить();
	ТекущиеНастройки_.ХранитьСтатусыВДополнительныхСведениях = НовоеЗначение;
	ESD_СохранитьНастройкиОбъекта(СлужебныеНастройки_Ключ(), ТекущиеНастройки_);	
КонецПроцедуры

Функция ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_Загрузить() Экспорт
	ТекущееЗначение_ = СлужебныеНастройки_Загрузить().ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД;
	Если ТипЗнч(ТекущееЗначение_) <> Тип("Булево") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ТекущееЗначение_;		
КонецФункции

Процедура ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_Записать(НовоеЗначение) Экспорт
	Если ТипЗнч(НовоеЗначение) <> Тип("Булево") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеНастройки_ = СлужебныеНастройки_Загрузить();
	ТекущиеНастройки_.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД = НовоеЗначение;
	ESD_СохранитьНастройкиОбъекта(СлужебныеНастройки_Ключ(), ТекущиеНастройки_);
КонецПроцедуры

Функция ЛогироватьОбменSaby_Загрузить() Экспорт
	Возврат СлужебнаяНастройка_Загрузить("ЛогироватьОбменSaby");
КонецФункции

Функция НастройкаПрефиксаДляДокументов_Загрузить() Экспорт  
	ОбщиеНастройкиЭПД_Префикс = ESD_ОбщийФункционалКлиентСервер.ОбщиеНастройкиЭПД_ОбщиеНастройкиЭПД_Префикс_ИмяРеквизита();
	Возврат СлужебнаяНастройка_Загрузить(ОбщиеНастройкиЭПД_Префикс);
КонецФункции  

