
// Возвращает структуру параметров загрузки файлов из Saby
//
// Параметры:
//	СсылкаНаДокумент - Произвольно - ссылка на ЭПД (основание)
//	УникальныйИдентификатор - УникальныйИдентификатор - уникальный идентификатор, применяемый для записи во временное хранилище
//	ТребуетсяОбновление - Булево - признак запуска обновления данных в Saby перед получением данных файла
//
// Возвращаемое значение:
//   Структура - структура параметров.
//
Функция SabyПараметрыЗагрузкиФайлов(СсылкаНаДокумент, УникальныйИдентификатор = Неопределено, ТребуетсяОбновление = Ложь) Экспорт
	РезультатФункции = Новый Структура;
	// Параметры ЭПД
	РезультатФункции.Вставить("СсылкаНаДокумент",         СсылкаНаДокумент);
	РезультатФункции.Вставить("ИмяМетаданных",            "");
	РезультатФункции.Вставить("ИдентификаторСБИС",        "");
	РезультатФункции.Вставить("Номер",                    "");
	РезультатФункции.Вставить("Дата",                     Дата(1, 1, 1, 0, 0, 0));
	// Параметры загрузки
	РезультатФункции.Вставить("УникальныйИдентификатор",  УникальныйИдентификатор);
	РезультатФункции.Вставить("ЭтоЧерновик",              Истина);
	РезультатФункции.Вставить("ТребуетсяОбновление",      ТребуетсяОбновление);
	// Параметры результата выполнения
	РезультатФункции.Вставить("СписокДокументов",         Неопределено);
	РезультатФункции.Вставить("ОшибкиОбщие",              "");
	РезультатФункции.Вставить("СсылкаНаPDF",              "");
	РезультатФункции.Вставить("СсылкаНаАрхив",            "");
	
	Возврат РезультатФункции;
КонецФункции

// Возвращает заполненные параметры для загрузки файлов из Saby.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры загрузки.
//	ИмяМетаданных - Строка - тип документа ESD
//  ТребуетсяОбновление - Булево - признак необходимости загрузки
//
// Возвращаемое значение:
//   Структура - структура параметров.
//
Функция SabyСформироватьПараметрыЗагрузкиФайлов(ПараметрыЗагрузки,
	Знач ИмяМетаданных = "",
	Знач ТребуетсяОбновление = Истина
) Экспорт
    МодульESD_ОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	РезультатФункции = SabyПараметрыЗагрузкиФайлов(ПараметрыЗагрузки.СсылкаНаДокумент, 
		ПараметрыЗагрузки.УникальныйИдентификатор, 
		ТребуетсяОбновление);
	
	// Отдельно заполним параметры "транспорта"
	РезультатФункции.Вставить("ОбъектОбработки", МодульESD_ОбщегоНазначенияСервер.ОбъектОбработки());
	context_params = МодульESD_ОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД();
	РезультатФункции.Вставить("context_params", context_params);
	
	Если Не ЗначениеЗаполнено(ИмяМетаданных) Тогда
		Если ПараметрыЗагрузки.Свойство("ИмяМетаданных") И ЗначениеЗаполнено(ПараметрыЗагрузки.ИмяМетаданных) Тогда
			ИмяМетаданных = ПараметрыЗагрузки.ИмяМетаданных;		
		Иначе
			ИмяМетаданных = МодульКода("ESD_ТНОбщегоНазначенияСервер")
				.ИмяМетаданныхДокумента(ПараметрыЗагрузки.СсылкаНаДокумент);
		КонецЕсли;
	КонецЕсли;
	РезультатФункции.ИмяМетаданных = ИмяМетаданных;
	
	Если ПараметрыЗагрузки.СсылкаНаДокумент <> Неопределено Тогда
		ЗаполнитьПараметрыЗагрузкиФайловПоСсылке(РезультатФункции, ПараметрыЗагрузки, Ложь);
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

