
// Загружает архив документа 
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - источник перехода
//  ЭтоФормаСписка - Булево - истина если форма - форма списка
//
&НаКлиенте
Процедура ЗагрузитьАрхивВложений(Форма, ЭтоФормаСписка = Ложь) Экспорт
	ПараметрыЗагрузки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыЗагрузкиАрхиваВложений(
		Форма.УникальныйИдентификатор,
		ЭтоФормаСписка
	);
	ПараметрыЗагрузки.Вставить("Форма", Форма);
	
	ПроцедураВыгрузитьАрхив = Новый ОписаниеОповещения("АрхивВложений_ПередЗагрузкой",
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент"),
		ПараметрыЗагрузки);
	ПроверитьМодифицированностьИПродолжитьВыполнение(ПроцедураВыгрузитьАрхив);
КонецПроцедуры

