
&НаКлиенте
Процедура АрхивВложений_ПередЗагрузкой(Результат, ПараметрыЗагрузки) Экспорт
	РезультатЗагрузки = Новый Массив;
	
	Форма = ПараметрыЗагрузки.Форма;
	ПараметрыЗагрузки.Удалить("Форма");
	Если ПараметрыЗагрузки.ЭтоФормаСписка Тогда
		МассивСсылокНаДокумент = Форма.Элементы.Список.ВыделенныеСтроки;
		Для Каждого СсылкаНаДокумент Из МассивСсылокНаДокумент Цикл
			ПараметрыЗагрузки.Вставить("СсылкаНаДокумент", СсылкаНаДокумент); 
			РезультатЗагрузки.Добавить(АрхивВложений_Загрузить(ПараметрыЗагрузки));
		КонецЦикла;
	Иначе
		СсылкаНаДокумент = ОснованиеПечатнойФормы(Форма, ПараметрыЗагрузки);
		Если Не ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
			Возврат;
		КонецЕсли;
		ПараметрыЗагрузки.Вставить("СсылкаНаДокумент", СсылкаНаДокумент); 
		РезультатЗагрузки.Добавить(АрхивВложений_Загрузить(ПараметрыЗагрузки));
	КонецЕсли;
	
	АрхивВложений_ПослеЗагрузки(Форма, РезультатЗагрузки, ПараметрыЗагрузки);
КонецПроцедуры

