
&НаКлиенте
Функция АрхивВложений_Загрузить(ПараметрыЗагрузки)
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер")
		.ЗагрузитьАрхивВложенийВоВложенныеФайлы(ПараметрыЗагрузки);	
КонецФункции

&НаКлиенте
Процедура АрхивВложений_ПослеЗагрузки(Форма, РезультатЗагрузки, ПараметрыЗагрузки)
	Для Каждого Результат Из РезультатЗагрузки Цикл
		Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
			СообщитьПользователю(Результат.ОписаниеОшибки);
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыЗагрузки.ЭтоФормаСписка Тогда
			Продолжить;
		КонецЕсли;
		
		Если Результат.Свойство("СсылкаНаДокумент") Тогда	
			ПараметрыФормы = Новый Структура("ВладелецФайла", Результат.СсылкаНаДокумент);
			ПараметрыОткрытияФормыОбработки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент")
				.ПараметрыОткрытияФормыОбработки("Обработка.ESD_РаботаСФайлами.Форма.ПрисоединенныеФайлы", 
					ПараметрыФормы, Форма);	
			ОткрытьФормуОбработки(ПараметрыОткрытияФормыОбработки);	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

