#Область ИнтерфейсПодписокНаСобытия

// Обработчик подписки на событие "ESD_АвтоматическиеСценарииПриЗаписи"
//
// Параметры:
//  Источник - ДокументОбъект, СправочникОбъект - Источник запуска подписки на событие
//  Отказ - Булево - Признак отказа в записи (транзакции)
//
Процедура ESD_АвтоматическиеСценарииПриЗаписи(Источник, Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьАвтоматическиеСценарии(Источник, МодульКода("Перечисления.АвтоматическиеСценарииСобытия").ПриЗаписи);
КонецПроцедуры

// Обработчик подписки на событие "ESD_АвтоматическиеСценарииОбработкаПроведения"
//
// Параметры:
//  Источник - ДокументОбъект - Источник запуска подписки на событие
//  Отказ - Булево - Признак отказа в записи (транзакции)
//	РежимПроведения - РежимПроведенияДокумента - режим проведения документа
//
Процедура ESD_АвтоматическиеСценарииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьАвтоматическиеСценарии(Источник, МодульКода("Перечисления.АвтоматическиеСценарииСобытия").ОбработкаПроведения);
КонецПроцедуры

// Обработчик подписки на событие "ESD_АвтоматическиеСценарииОбработкаУдаленияПроведения"
//
// Параметры:
//  Источник - ДокументОбъект - Источник запуска подписки на событие
//  Отказ - Булево - Признак отказа в записи (транзакции)
//
Процедура ESD_АвтоматическиеСценарииОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьАвтоматическиеСценарии(Источник, МодульКода("Перечисления.АвтоматическиеСценарииСобытия").ОбработкаУдаленияПроведения);
КонецПроцедуры

#КонецОбласти

#Область ПрограмнныйИнтерфейс

// Запуск автоматических сценариев по отрабатываемому событию объекта
//
// Параметры:
//  Основание - ДокументОбъект, СправочникОбъект - основание запуска автоматического сценария
//  Событие - Перечисления.АвтоматическиеСценарииСобытия - отрабатываемое событие
//
Процедура ЗапуститьАвтоматическиеСценарии(Основание, Событие) Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	// Проверим параметры основания и отменим запуск АС при необходимости
	Если ОтменитьОбработкуОснования(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Активно", Истина);
	СтруктураОтбора.Вставить("ОснованиеМетаданные", Основание.Метаданные().ПолноеИмя());
	СтруктураОтбора.Вставить("Событие", Событие);
	
	АвтоматическиеСценарии = МодульКода("Справочники.АвтоматическиеСценарии").НайтиПоОтбору(СтруктураОтбора);
	Если Не ЗначениеЗаполнено(АвтоматическиеСценарии) Тогда
		Возврат;
	КонецЕсли;
	
	МодульESD_АвтоматическиеСценарииВызовСервера = МодульКода("АвтоматическиеСценарииВызовСервера");
	
	СинхронныеАС = Новый Массив;
	Для Каждого АвтоматическийСценарий Из АвтоматическиеСценарии Цикл
		Объект = АвтоматическийСценарий.Ссылка.ПолучитьОбъект();
		Объект.Основание = Основание.Ссылка;
		
		Попытка
			// Запустим на выполнение автоматический сценарий
			ИдентификаторАС = Объект.Запустить();
			Если ИдентификаторАС = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Зарегистрируем первые действия на выполнение
			МодульESD_АвтоматическиеСценарииВызовСервера.ПослеВыполненияДействия(АвтоматическийСценарий.Ссылка, ИдентификаторАС);
			// Проверим вариант выполнения
			Если Объект.ВариантВыполнения = МодульКода("Перечисления.АвтоматическиеСценарииВариантыВыполнения").Синхронно Тогда
				// Добавим "синхронные" запущенные АС в отдельный список
				СинхронныеАС.Добавить(Новый Структура("АвтоматическийСценарий, ID", 
					АвтоматическийСценарий.Ссылка, 
					ИдентификаторАС));
			КонецЕсли;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			МодульКода("АвтоматическиеСценарииСерверСлужебный")
				.ЗаписатьВЖурналРегистрации(Объект, "Запуск", , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;
	КонецЦикла;
	
	// Отдельно обработаем сихнонные автоматические сценарии
	МодульESD_АвтоматическиеСценарииВызовСервера.ВыполнитьДействияЗапущенных(СинхронныеАС);
	
	Основание.Прочитать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирование списка доступных метаданных для работы автоматических сценариев
//
// Параметры:
//	Сгруппировать - Булево - признак группировки доступных видов метаданных
//
// Возвращаемое значение:
//  СписокЗначений - доступные метаданные для работы автоматических сценариев
//
Функция СписокДоступныхОбъектовМетаданных(Сгруппировать = Ложь) Экспорт
	Если Сгруппировать Тогда
		Результат = Новый Структура("Документы,Справочники", Новый СписокЗначений, Новый СписокЗначений);
		ДоступныеОснованияМетаданных_ДобавитьСправочники(Результат.Справочники);
		ДоступныеОснованияМетаданных_ДобавитьДокументы(Результат.Документы);
	Иначе
		Результат = Новый СписокЗначений;
		ДоступныеОснованияМетаданных_ДобавитьСправочники(Результат);
		ДоступныеОснованияМетаданных_ДобавитьДокументы(Результат);	
	КонецЕсли;
		
	Возврат Результат;	
КонецФункции

#Область include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_НастройкаРегламентныхЗаданий
#КонецОбласти // include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_НастройкаРегламентныхЗаданий

#Область include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_ВыполнениеОбработчика 
#КонецОбласти // include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_ВыполнениеОбработчика

Процедура ЗапросОтбора_ПрименитьСтруктуруОтбора(Запрос, СтруктураОтбора, ИмяОсновнойТаблицы, ИмяОтбора) Экспорт
	УсловияОтбора = Новый Массив;
	ПорядковыйНомер = 1;
	Для Каждого КлючЗначение Из СтруктураОтбора Цикл
		ИмяПараметра = "Параметр" + Строка(ПорядковыйНомер);
		Если ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
			СтрокаУсловия = КлючЗначение.Ключ + " В(&" + ИмяПараметра + ")";
		Иначе
			СтрокаУсловия = КлючЗначение.Ключ + " = &" + ИмяПараметра;
		КонецЕсли;
		УсловияОтбора.Добавить(ИмяОсновнойТаблицы + "." + СтрокаУсловия);
		Запрос.УстановитьПараметр(ИмяПараметра, КлючЗначение.Значение);
		
		ПорядковыйНомер = ПорядковыйНомер + 1;
	КонецЦикла;
	
	ОбщийТекстОтбора = МодульКода("АвтоматическиеСценарииКлиентСервер")
		.СтрСоединить82(УсловияОтбора, " И ");	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ИмяОтбора, ОбщийТекстОтбора);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДоступныеОснованияМетаданных_ДобавитьСправочники(Список)
	Для Каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		Список.Добавить(ПолноеИмя, ОбъектМетаданных.Синоним + " (" + ПолноеИмя + ")");		
	КонецЦикла;	
КонецПроцедуры

Процедура ДоступныеОснованияМетаданных_ДобавитьДокументы(Список)
	Для Каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		Список.Добавить(ПолноеИмя, ОбъектМетаданных.Синоним + " (" + ПолноеИмя + ")");		
	КонецЦикла;	
КонецПроцедуры

Функция ОтменитьОбработкуОснования(Основание)
	Отказ = Ложь;
	// Исключим обработку объектов, измененных через механизмы обмена 
	Если Основание.ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли;
	
	// Для справочников исключим обработку групп
	Если Не Отказ И Метаданные.Справочники.Найти(Основание.Метаданные().Имя) <> Неопределено Тогда
		Если Основание.ЭтоГруппа Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Возможность отменить запуск АС при записи объектов внутри действий
	Если Не Отказ И Основание.ДополнительныеСвойства.Свойство("ИсключитьЗапускАвтоматическогоСценария") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Отказ;
КонецФункции

#КонецОбласти

#Область include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти // include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
