
#Область ИнтерфейсПодписокНаСобытия

// Обработчик подписки на событие "ESD_АвтоматическиеСценарииПриЗаписи"
//
// Параметры:
//  Источник - ДокументОбъект, СправочникОбъект - Источник запуска подписки на событие
//  Отказ - Булево - Признак отказа в записи (транзакции)
//
Процедура ESD_АвтоматическиеСценарииПриЗаписи(Источник, Отказ) Экспорт
	Если Отказ Или ИсточникПодпискиНаСобытие_ОтменитьОбработку(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКода("АвтоматическиеСценарииВызовСервера").ЗапуститьАвтоматическиеСценарии(Источник.Ссылка, 
		МодульКода("Перечисления.АвтоматическиеСценарииСобытия").ПриЗаписи);
КонецПроцедуры

// Обработчик подписки на событие "ESD_АвтоматическиеСценарииОбработкаПроведения"
//
// Параметры:
//  Источник - ДокументОбъект - Источник запуска подписки на событие
//  Отказ - Булево - Признак отказа в записи (транзакции)
//	РежимПроведения - РежимПроведенияДокумента - режим проведения документа
//
Процедура ESD_АвтоматическиеСценарииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Отказ Или ИсточникПодпискиНаСобытие_ОтменитьОбработку(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКода("АвтоматическиеСценарииВызовСервера").ЗапуститьАвтоматическиеСценарии(Источник.Ссылка, 
		МодульКода("Перечисления.АвтоматическиеСценарииСобытия").ОбработкаПроведения);
КонецПроцедуры

// Обработчик подписки на событие "ESD_АвтоматическиеСценарииОбработкаУдаленияПроведения"
//
// Параметры:
//  Источник - ДокументОбъект - Источник запуска подписки на событие
//  Отказ - Булево - Признак отказа в записи (транзакции)
//
Процедура ESD_АвтоматическиеСценарииОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	Если Отказ Или ИсточникПодпискиНаСобытие_ОтменитьОбработку(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКода("АвтоматическиеСценарииВызовСервера").ЗапуститьАвтоматическиеСценарии(Источник.Ссылка, 
		МодульКода("Перечисления.АвтоматическиеСценарииСобытия").ОбработкаУдаленияПроведения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирование списка доступных метаданных для работы автоматических сценариев
//
// Параметры:
//	Сгруппировать - Булево - признак группировки доступных видов метаданных
//
// Возвращаемое значение:
//  СписокЗначений - доступные метаданные для работы автоматических сценариев
//
Функция СписокДоступныхОбъектовМетаданных(Сгруппировать = Ложь) Экспорт
	Если Сгруппировать Тогда
		Результат = Новый Структура("Документы,Справочники", Новый СписокЗначений, Новый СписокЗначений);
		ДоступныеОснованияМетаданных_ДобавитьСправочники(Результат.Справочники);
		ДоступныеОснованияМетаданных_ДобавитьДокументы(Результат.Документы);
	Иначе
		Результат = Новый СписокЗначений;
		ДоступныеОснованияМетаданных_ДобавитьСправочники(Результат);
		ДоступныеОснованияМетаданных_ДобавитьДокументы(Результат);	
	КонецЕсли;
		
	Возврат Результат;	
КонецФункции

#Область include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_НастройкаРегламентныхЗаданий
#КонецОбласти // include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_НастройкаРегламентныхЗаданий

#Область include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_ВыполнениеОбработчика 
#КонецОбласти // include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_ВыполнениеОбработчика

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДоступныеОснованияМетаданных_ДобавитьСправочники(Список)
	Для Каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		Список.Добавить(ПолноеИмя, ОбъектМетаданных.Синоним + " (" + ПолноеИмя + ")");		
	КонецЦикла;	
КонецПроцедуры

Процедура ДоступныеОснованияМетаданных_ДобавитьДокументы(Список)
	Для Каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		Список.Добавить(ПолноеИмя, ОбъектМетаданных.Синоним + " (" + ПолноеИмя + ")");		
	КонецЦикла;	
КонецПроцедуры

Функция ИсточникПодпискиНаСобытие_ОтменитьОбработку(Источник)
	Отказ = Ложь;
	
	СтруктураПроверки_ = Новый Структура("ЭтоГруппа, ОбменДанными");
	ЗаполнитьЗначенияСвойств(СтруктураПроверки_, Источник);
	
	// Исключим обработку групп
	Если Не Отказ И СтруктураПроверки_.ЭтоГруппа = Истина Тогда
		Отказ = Истина;
	КонецЕсли;
	
	// Исключим обработку объектов, измененных через механизмы обмена 
	Если Не Отказ И ТипЗнч(СтруктураПроверки_.ОбменДанными) = Тип("ПараметрыОбменаДанными") Тогда
		Если СтруктураПроверки_.ОбменДанными.Загрузка Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Возможность отменить запуск АС при записи объектов внутри действий
	Если Не Отказ И Источник.ДополнительныеСвойства.Свойство("ИсключитьЗапускАвтоматическогоСценария") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Отказ;
КонецФункции

#КонецОбласти

#Область include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти // include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
