#Область ИнтерфейсПодписокНаСобытия

// Обработчик подписки на событие "ESD_АвтоматическиеСценарииПриЗаписи"
//
// Параметры:
//  Источник - ДокументОбъект, СправочникОбъект - Источник запуска подписки на событие
//  Отказ - Булево - Признак отказа в записи (транзакции)
//
Процедура ESD_АвтоматическиеСценарииПриЗаписи(Источник, Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьАвтоматическиеСценарии(Источник, МодульКода("Перечисления.АвтоматическиеСценарииСобытия").ПриЗаписи);
КонецПроцедуры

// Обработчик подписки на событие "ESD_АвтоматическиеСценарииОбработкаПроведения"
//
// Параметры:
//  Источник - ДокументОбъект - Источник запуска подписки на событие
//  Отказ - Булево - Признак отказа в записи (транзакции)
//	РежимПроведения - РежимПроведенияДокумента - режим проведения документа
//
Процедура ESD_АвтоматическиеСценарииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьАвтоматическиеСценарии(Источник, МодульКода("Перечисления.АвтоматическиеСценарииСобытия").ОбработкаПроведения);
КонецПроцедуры

// Обработчик подписки на событие "ESD_АвтоматическиеСценарииОбработкаУдаленияПроведения"
//
// Параметры:
//  Источник - ДокументОбъект - Источник запуска подписки на событие
//  Отказ - Булево - Признак отказа в записи (транзакции)
//
Процедура ESD_АвтоматическиеСценарииОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьАвтоматическиеСценарии(Источник, МодульКода("Перечисления.АвтоматическиеСценарииСобытия").ОбработкаУдаленияПроведения);
КонецПроцедуры

#КонецОбласти

#Область ПрограмнныйИнтерфейс

// Запуск автоматических сценариев по отрабатываемому событию объекта
//
// Параметры:
//  Основание - ДокументОбъект, СправочникОбъект - основание запуска автоматического сценария
//  Событие - Перечисления.АвтоматическиеСценарииСобытия - отрабатываемое событие
//
Процедура ЗапуститьАвтоматическиеСценарии(Основание, Событие) Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	// Проверим параметры основания и отменим запуск АС при необходимости
	Если ОтменитьОбработкуОснования(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Активно", Истина);
	СтруктураОтбора.Вставить("ОснованиеМетаданные", Основание.Метаданные().ПолноеИмя());
	СтруктураОтбора.Вставить("Событие", Событие);
	
	АвтоматическиеСценарии = МодульКода("Справочники.АвтоматическиеСценарии").НайтиПоОтбору(СтруктураОтбора);
	Если Не ЗначениеЗаполнено(АвтоматическиеСценарии) Тогда
		Возврат;
	КонецЕсли;
	
	СинхронныеАС = Новый Массив;
	Для Каждого АвтоматическийСценарий Из АвтоматическиеСценарии Цикл
		Объект = АвтоматическийСценарий.Ссылка.ПолучитьОбъект();
		Объект.Основание = Основание.Ссылка;
		
		Попытка
			// Запустим на выполнение автоматический сценарий
			ИдентификаторАС = Объект.Запустить();
			Если ИдентификаторАС = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Зарегистрируем первые действия на выполнение
			ПослеВыполненияДействия(АвтоматическийСценарий.Ссылка, ИдентификаторАС);
			// Проверим вариант выполнения
			Если Объект.ВариантВыполнения = МодульКода("Перечисления.АвтоматическиеСценарииВариантыВыполнения").Синхронно Тогда
				// Добавим "синхронные" запущенные АС в отдельный список
				СинхронныеАС.Добавить(Новый Структура("АвтоматическийСценарий, ID", 
					АвтоматическийСценарий.Ссылка, 
					ИдентификаторАС));
			КонецЕсли;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			МодульКода("АвтоматическиеСценарииСерверСлужебный")
				.ЗаписатьВЖурналРегистрации(Объект, "Запуск", , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;
	КонецЦикла;
	
	// Отдельно обработаем сихнонные автоматические сценарии
	ВыполнитьДействияЗапущенных(СинхронныеАС);
	
	Основание.Прочитать();
КонецПроцедуры

// Выбор и выполнение активных действий автоматических сценариев (со статусом "Создано")
// Процедура используется для обработки выполнения общего и собственных регламентных заданий
//
// Параметры:
//	АвтоматическиеСценарии - Массив - список автоматических сценариев, по которым необходимо отобрать действия.
//
Процедура ВыполнитьДействия(Знач АвтоматическиеСценарии = Неопределено) Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	СоответствиеОтбора = Новый Соответствие;
	Если АвтоматическиеСценарии = Неопределено Тогда
		// Для всех автоматических сценариев, выполняемыми общим рег. заданием 
		СоответствиеОтбора.Вставить("АвтоматическийСценарий.ВариантВыполнения", 
			МодульКода("Перечисления.АвтоматическиеСценарииВариантыВыполнения").ОбщееРегламентноеЗадание);
	Иначе
		// Укажем переданные автоматические сценарии параметром отбора		
		СоответствиеОтбора.Вставить("АвтоматическийСценарий", АвтоматическиеСценарии);	
	КонецЕсли;
	СоответствиеОтбора.Вставить("Завершен", Ложь);
	
	Попытка
		ЗапущенныеАвтоматическиеСценарии = МодульКода("РегистрыСведений.АвтоматическиеСценарии").НайтиПоОтбору(СоответствиеОтбора);
	Исключение
		Возврат;
	КонецПопытки;
	
	ВыполнитьДействияЗапущенных(ЗапущенныеАвтоматическиеСценарии);
КонецПроцедуры

// Выполнение действий запущенных автоматических сценариев
//
// Параметры:
//	ЗапущенныеАвтоматическиеСценарии - Массив, ТаблицаЗначений - список данных запущенных автоматических сценариев
//
Процедура ВыполнитьДействияЗапущенных(ЗапущенныеАвтоматическиеСценарии = Неопределено) Экспорт
	Для Каждого ДанныеЗапущенногоАС Из ЗапущенныеАвтоматическиеСценарии Цикл
		ВыполнитьДействияЗапущенного(ДанныеЗапущенногоАС);				
	КонецЦикла;
КонецПроцедуры

// Выполнение действий запущенного автоматического сценария
//
// Параметры:
//	ЗапущенныйАвтоматическийСценарий - Структура - данные запущенного автоматического сценария
//
Процедура ВыполнитьДействияЗапущенного(ЗапущенныйАвтоматическийСценарий) Экспорт
	// Найдем активные действия переданных/найденных автоматических сценариев
	АктивныеДействия = МодульКода("РегистрыСведений.АвтоматическиеСценарииЖурнал").АктивныеДействия(
		ЗапущенныйАвтоматическийСценарий.АвтоматическийСценарий,
		ЗапущенныйАвтоматическийСценарий.ID);
		
	АвтоматическийСценарийЗавершен = Ложь;
	Для Каждого ДанныеДействия Из АктивныеДействия Цикл
		АвтоматическийСценарийОбъект = ДанныеДействия.АвтоматическийСценарий.ПолучитьОбъект();
		// Выполним действие
		АвтоматическийСценарийОбъект.ВыполнитьДействие(ДанныеДействия.ID, ДанныеДействия.Действие);
		// Получим результат постобработки выполнения действия
		Результат = ПослеВыполненияДействия(ДанныеДействия.ID, ДанныеДействия.Действие);
		
		АвтоматическийСценарийЗавершен = Результат.Завершен;
		
		// Прерываем выполнение других действий, если АС завершен
		Если Результат.Завершен Тогда
			Прервать;	
		КонецЕсли;	
	КонецЦикла;
	
	Если АвтоматическийСценарийЗавершен Тогда
		Завершить(ЗапущенныйАвтоматическийСценарий.АвтоматическийСценарий, ЗапущенныйАвтоматическийСценарий.ID);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обработка после выполнения действия
//
// Параметры:
//	АвтоматическийСценарий - СправочникСсылка.АвтоматическиеСценарии - элемент настроек автоматического сценария
//	ID - Строка - идентификатор запущенного автоматического сценария
//	ЗавершенноеДействие - СправочникСсылка.АвтоматическиеСценарииДействия - завершенное действие автоматического сценария
//
// Возвращаемое значение:
//	Структура - коллекция параметров результата обработки выполнения
//
Функция ПослеВыполненияДействия(АвтоматическийСценарий, ID, ЗавершенноеДействие = Неопределено) Экспорт
	Результат = Новый Структура("Завершен", Ложь);
	
	СледующиеДействия = МодульКода("Справочники.АвтоматическиеСценарии")
		.СледующиеДействия(АвтоматическийСценарий, ЗавершенноеДействие);
	
	Если Не СледующиеДействия.Количество() Тогда
		Если Не МодульКода("АвтоматическиеСценарииСервер").НевыполненныеДействия(ID).Количество() Тогда
			Результат.Завершен = Истина;	
		КонецЕсли;
	Иначе
		Для Каждого ДанныеДействия Из СледующиеДействия Цикл
			ЗарегистрироватьНовоеДействие(АвтоматическийСценарий, ID, ДанныеДействия.Действие);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Обработка после выполнения действия
//
// Параметры:
//	АвтоматическийСценарий - СправочникСсылка.АвтоматическиеСценарии - элемент настроек автоматического сценария
//	ID - Строка - идентификатор запущенного автоматического сценария
//	Действие - СправочникСсылка.АвтоматическиеСценарииДействия - завершенное действие автоматического сценария
//
Процедура ЗарегистрироватьНовоеДействие(АвтоматическийСценарий, ID, Действие) Экспорт
	МодульКода("РегистрыСведений.АвтоматическиеСценарииЖурнал").ДобавитьНовыйСтатус(АвтоматическийСценарий, ID, Действие);
КонецПроцедуры

// Завершение выполнения автоматического сценария
//
// Параметры:
//	АвтоматическийСценарий - СправочникСсылка.АвтоматическиеСценарии - элемент настроек автоматического сценария
//	ID - Строка - уникальный идентификатор запущенного автоматического сценария
//
Процедура Завершить(АвтоматическийСценарий, ID) Экспорт
	МодульКода("РегистрыСведений.АвтоматическиеСценарии").Завершить(АвтоматическийСценарий, ID);
КонецПроцедуры

// Получение списка всех невыполненных действий запущенного автоматического сценария
//
// Параметры:
//	ID - Строка - идентификатор запущенного автоматического сценария
// 
// Возвращаемое значение:
//	ТаблицаЗначений - список невыполненных действий
//
Функция НевыполненныеДействия(ID) Экспорт
	Запрос = Новый Запрос;
	// BSLLS:QueryParseError-off
	Запрос.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		| 	АвтоматическиеСценарии.АвтоматическийСценарий КАК АвтоматическийСценарий,
		|	АвтоматическиеСценарии.ID КАК ID
		|ПОМЕСТИТЬ ДанныеАвтоматическогоСценария
		|ИЗ
		|	РегистрСведений." + МодульКода("РегистрыСведений.АвтоматическиеСценарии").ИмяОбъекта() + " КАК АвтоматическиеСценарии
		|ГДЕ
		|	АвтоматическиеСценарии.ID = &ID
		|;////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЖурналВыполненияАвтоматическихСценариев.АвтоматическийСценарий КАК АвтоматическийСценарий,
		|	ЖурналВыполненияАвтоматическихСценариев.Действие КАК Действие,
		|	ЖурналВыполненияАвтоматическихСценариев.Статус КАК Статус
		|ПОМЕСТИТЬ ЖурналВыполненияАвтоматическихСценариев
		|ИЗ
		|	РегистрСведений." + МодульКода("РегистрыСведений.АвтоматическиеСценарииЖурнал").ИмяОбъекта() + ".СрезПоследних(,
		|   	(АвтоматическийСценарий, ID) В (ВЫБРАТЬ АвтоматическийСценарий, ID ИЗ ДанныеАвтоматическогоСценария) 
		|	) КАК ЖурналВыполненияАвтоматическихСценариев
		|;////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДействияАвтоматическихСценариев.Ссылка КАК АвтоматическийСценарий,
		|	ДействияАвтоматическихСценариев.Действие КАК Действие
		|ПОМЕСТИТЬ ВсеДействия
		|ИЗ
		|	ДанныеАвтоматическогоСценария КАК ДанныеАвтоматическогоСценария
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник." + МодульКода("Справочники.АвтоматическиеСценарии").ИмяОбъекта() + ".Действия КАК ДействияАвтоматическихСценариев
		|		ПО ДанныеАвтоматическогоСценария.АвтоматическийСценарий = ДействияАвтоматическихСценариев.Ссылка
		|;////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеДействия.Действие КАК Действие,
		|	(ЖурналВыполненияАвтоматическихСценариев.Статус = &СтатусСоздано) КАК НаВыполнении	
		|ИЗ
		|	ВсеДействия КАК ВсеДействия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЖурналВыполненияАвтоматическихСценариев КАК ЖурналВыполненияАвтоматическихСценариев
		|		ПО ВсеДействия.АвтоматическийСценарий = ЖурналВыполненияАвтоматическихСценариев.АвтоматическийСценарий
		|			И ВсеДействия.Действие = ЖурналВыполненияАвтоматическихСценариев.Действие
		|ГДЕ
		|	(ЖурналВыполненияАвтоматическихСценариев.Действие ЕСТЬ NULL 
		|		ИЛИ ЖурналВыполненияАвтоматическихСценариев.Статус = &СтатусСоздано)		
		|";
	// BSLLS:QueryParseError-on
	Запрос.УстановитьПараметр("ID", ID);
	Запрос.УстановитьПараметр("СтатусСоздано", МодульКода("Перечисления.АвтоматическиеСценарииСтатусыВыполнения").Создано);
	
	Возврат Запрос.Выполнить().Выгрузить(); 
КонецФункции

// Формирование списка доступных метаданных для работы автоматических сценариев
//
// Параметры:
//	Сгруппировать - Булево - признак группировки доступных видов метаданных
//
// Возвращаемое значение:
//  СписокЗначений - доступные метаданные для работы автоматических сценариев
//
Функция СписокДоступныхОбъектовМетаданных(Сгруппировать = Ложь) Экспорт
	Если Сгруппировать Тогда
		Результат = Новый Структура("Документы,Справочники", Новый СписокЗначений, Новый СписокЗначений);
		ДоступныеОснованияМетаданных_ДобавитьСправочники(Результат.Справочники);
		ДоступныеОснованияМетаданных_ДобавитьДокументы(Результат.Документы);
	Иначе
		Результат = Новый СписокЗначений;
		ДоступныеОснованияМетаданных_ДобавитьСправочники(Результат);
		ДоступныеОснованияМетаданных_ДобавитьДокументы(Результат);	
	КонецЕсли;
		
	Возврат Результат;	
КонецФункции

#Область include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_НастройкаРегламентныхЗаданий
#КонецОбласти // include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_НастройкаРегламентныхЗаданий

#Область include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_ВыполнениеОбработчика 
#КонецОбласти // include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_ВыполнениеОбработчика

Процедура ЗапросОтбора_ПрименитьСтруктуруОтбора(Запрос, СтруктураОтбора, ИмяОсновнойТаблицы, ИмяОтбора) Экспорт
	УсловияОтбора = Новый Массив;
	ПорядковыйНомер = 1;
	Для Каждого КлючЗначение Из СтруктураОтбора Цикл
		ИмяПараметра = "Параметр" + Строка(ПорядковыйНомер);
		Если ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
			СтрокаУсловия = КлючЗначение.Ключ + " В(&" + ИмяПараметра + ")";
		Иначе
			СтрокаУсловия = КлючЗначение.Ключ + " = &" + ИмяПараметра;
		КонецЕсли;
		УсловияОтбора.Добавить(ИмяОсновнойТаблицы + "." + СтрокаУсловия);
		Запрос.УстановитьПараметр(ИмяПараметра, КлючЗначение.Значение);
		
		ПорядковыйНомер = ПорядковыйНомер + 1;
	КонецЦикла;
	
	ОбщийТекстОтбора = МодульКода("АвтоматическиеСценарииКлиентСервер")
		.СтрСоединить82(УсловияОтбора, " И ");	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ИмяОтбора, ОбщийТекстОтбора);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДоступныеОснованияМетаданных_ДобавитьСправочники(Список)
	Для Каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		Список.Добавить(ПолноеИмя, ОбъектМетаданных.Синоним + " (" + ПолноеИмя + ")");		
	КонецЦикла;	
КонецПроцедуры

Процедура ДоступныеОснованияМетаданных_ДобавитьДокументы(Список)
	Для Каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		Список.Добавить(ПолноеИмя, ОбъектМетаданных.Синоним + " (" + ПолноеИмя + ")");		
	КонецЦикла;	
КонецПроцедуры

Функция ОтменитьОбработкуОснования(Основание)
	Отказ = Ложь;
	// Исключим обработку объектов, измененных через механизмы обмена 
	Если Основание.ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли;
	
	// Для справочников исключим обработку групп
	Если Не Отказ И Метаданные.Справочники.Найти(Основание.Метаданные().Имя) <> Неопределено Тогда
		Если Основание.ЭтоГруппа Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Возможность отменить запуск АС при записи объектов внутри действий
	Если Не Отказ И Основание.ДополнительныеСвойства.Свойство("ИсключитьЗапускАвтоматическогоСценария") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Отказ;
КонецФункции

#КонецОбласти

#Область include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти
