
Процедура ВыполнитьОбработчик(Текст, Основание, Параметры, Результат = Неопределено) Экспорт
	Если Результат = Неопределено Тогда
		Результат = РезультатВыполнения();
	КонецЕсли;
	
	Попытка		
		Выполнить(Текст);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		// На всякий случай добавил возможность "отменять" выполнение обработчика через "исключение"
		Если КраткоеПредставлениеОшибки(ИнформацияОбОшибке) = "<Отказ>" Тогда
			Результат.Отказ = Истина;
		Иначе
			Результат.Комментарий = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			Результат.Ошибка = Истина;
		КонецЕсли;
	КонецПопытки;
КонецПроцедуры

Функция РезультатВыполнения() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("Ошибка", Ложь);
	Результат.Вставить("Комментарий", "");
	
	ЗначенияРезультата = Новый ТаблицаЗначений;
	ЗначенияРезультата.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ЗначенияРезультата.Колонки.Добавить("Значение", Новый ОписаниеТипов(Новый Массив));
	Результат.Вставить("Значения", ЗначенияРезультата);
	
	Возврат Результат;
КонецФункции

