
Функция РегламентноеЗадание(Знач Идентификатор) Экспорт
	Возврат ESD_РегламентныеЗаданияСлужебный.НайтиРегламентноеЗаданиеПоИдентификатору(Идентификатор);
КонецФункции

Функция РегламентноеЗаданиеРасписание(Знач РегламентноеЗадание) Экспорт
	Если ТипЗнч(РегламентноеЗадание) = Тип("Строка") Тогда
		Расписание = ESD_РегламентныеЗаданияСервер.РасписаниеРегламентногоЗадания(РегламентноеЗадание);	
		Если Расписание = Неопределено Тогда
			Расписание = Новый РасписаниеРегламентногоЗадания;
		КонецЕсли;
	Иначе
		Расписание = РегламентноеЗадание.Расписание; 
	КонецЕсли;
	
	Возврат Расписание;
КонецФункции

Функция РегламентноеЗаданиеСоздать(Параметры) Экспорт
	Перем РегламентноеЗадание;
	
	Попытка
		РегламентноеЗадание = ESD_РегламентныеЗаданияСлужебный.СоздатьРегламентноеЗадание(Параметры);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		МодульКода("АвтоматическиеСценарииСерверСлужебный").ЗаписатьВЖурналРегистрации("Создание регламентного задания", , , 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
			
	Возврат РегламентноеЗадание;
КонецФункции

Функция РегламентноеЗаданиеНаименование(НаименованиеАС) Экспорт
	ШаблонНаименования = РегламентноеЗаданиеМетаданные().Синоним;
	Возврат СокрЛП(ШаблонНаименования + " """ + НаименованиеАС + """");
КонецФункции

Процедура РегламентноеЗаданиеОбновить(Знач Идентификатор, Параметры) Экспорт
	РегламентноеЗадание = РегламентноеЗадание(Идентификатор);
	Если РегламентноеЗадание = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РегламентноеЗадание, Параметры);
	РегламентноеЗадание.Записать();
КонецПроцедуры

Процедура РегламентноеЗаданиеУдалить(Знач Идентификатор) Экспорт
	РегламентноеЗадание = РегламентноеЗадание(Идентификатор);
	// Если по какой-то причине не нашли - прерываем
	Если РегламентноеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Не трогаем "предопределенные" рег. задания
	Если РегламентноеЗадание.Предопределенное Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		РегламентноеЗадание.Удалить();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		МодульКода("АвтоматическиеСценарииСерверСлужебный").ЗаписатьВЖурналРегистрации("Удаление регламентного задания", , , 
			"Идентификатор: " + Идентификатор + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
КонецПроцедуры

Функция РегламентноеЗаданиеПараметры() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "");
	Результат.Вставить("ИмяПользователя", "");
	Результат.Вставить("Расписание", Новый РасписаниеРегламентногоЗадания);
	Результат.Вставить("Использование", Ложь);
	Результат.Вставить("Параметры", Новый Массив);
	
	Возврат Результат;
КонецФункции

#Область include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_МетаданныеРегламентныхЗаданий
#КонецОбласти // include_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_АвтоматическиеСценарииСервер_МетаданныеРегламентныхЗаданий

