
#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  Код - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.Saby_ВладелецОбъектаОтгрузки - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция ВладелецОбъектаОтгрузкиПоКоду(Код) Экспорт
	
	Если Код = "1" Тогда
		Возврат ЗначениеМетаданных("Saby_ВладелецОбъектаОтгрузки.Отправитель");
	ИначеЕсли Код = "2" Тогда
		Возврат ЗначениеМетаданных("Saby_ВладелецОбъектаОтгрузки.ДругоеЮрЛицо");
	ИначеЕсли Код = "3" Тогда
		Возврат ЗначениеМетаданных("Saby_ВладелецОбъектаОтгрузки.Неизвестен");
	Иначе
		Возврат ЗначениеМетаданных("Saby_ВладелецОбъектаОтгрузки.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующий код по указанному значению перечисления.
//
// Параметры:
//  Значение  - ПеречислениеСсылка.Saby_ВладелецОбъектаОтгрузки - значение перечисления
//
// Возвращаемое значение:
//   Строка - Строковое представление кода.
//
Функция КодПоВладельцуОбъектаОтгрузки(Значение) Экспорт
	
	Если Значение = ЗначениеМетаданных("Saby_ВладелецОбъектаОтгрузки.Отправитель") Тогда
		Возврат "1";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_ВладелецОбъектаОтгрузки.ДругоеЮрЛицо") Тогда
		Возврат "2";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_ВладелецОбъектаОтгрузки.Неизвестен") Тогда
		Возврат "3";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

