
&НаКлиенте
Процедура Подключаемый_ОбработкаОповещений_ОбновитьДокумент(Параметры)
	// Сначала обработаем подключаемые обработчики (они могут изменить что-то)
	Подключаемый_ОбработкаОповещений_ОбновитьДокументНаСервере(Параметры);

	// Очистим результат ФЛК
	ЭтаФорма.ТаблицаОшибок.Очистить();
	ЭтаФорма.КоличествоОшибок = 0;

	// Выполним обновление данных на форме
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбработкаОповещений_ОбновитьДокументНаСервере(Знач Параметры)
	ДанныеДокумента = Параметры["ДанныеДокумента"];
	Если ЗначениеЗаполнено(ДанныеДокумента) Тогда
		ДанныеСобытий = ESD_ОбщийФункционалСервер.События_ОбработатьСписок(ДанныеДокумента["Событие"]);
		ЭтаФорма[ESD_ОбщийФункционалКлиентСервер.События_ИмяРеквизита()] = 
			ESD_ОбщийФункционалСервер.События_СформироватьТабличныйДокумент(Объект.Ссылка, ДанныеСобытий);
	КонецЕсли;
КонецПроцедуры

