#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьОснованияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

#КонецОбласти

#Область СобытияКоманд

&НаКлиенте
Процедура Выбрать(Команда)
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Пользовательские Тогда
		ТаблицаВыбора = Элементы.ОснованияОсновнойКонфигурации;
	Иначе
		ТаблицаВыбора = Элементы.ОснованияSaby;
	КонецЕсли;
	
	ТекущиеДанные = ТаблицаВыбора.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Закрыть(Неопределено);
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура("Значение,Представление", 
		ТекущиеДанные.Значение, 
		ТекущиеДанные.Представление);
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Выбрать("");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьОснованияНаСервере()
	ДоступныеОснованияМетаданных = МодульКода("АвтоматическиеСценарииСервер").СписокДоступныхОбъектовМетаданных(Истина);
	ПодстрокаПоискаESD = ".esd_";
	
	SabyЭлементы = РеквизитФормыВЗначение("ОснованияSaby");
	SabyЭлементы.Строки.Очистить();
	ОсновнаяКонфигурацияЭлементы = РеквизитФормыВЗначение("ОснованияОсновнойКонфигурации");
	ОсновнаяКонфигурацияЭлементы.Строки.Очистить();
	Для Каждого КлючЗначение Из ДоступныеОснованияМетаданных Цикл
		SabyТип = SabyЭлементы.Строки.Добавить();
		SabyТип.Тип = КлючЗначение.Ключ;
		ОсновнаяКонфигурацияТип = ОсновнаяКонфигурацияЭлементы.Строки.Добавить();
		ОсновнаяКонфигурацияТип.Тип = КлючЗначение.Ключ;
		Для Каждого Строка Из КлючЗначение.Значение Цикл
			Если Найти(НРег(Строка.Значение), ПодстрокаПоискаESD) > 0 Тогда
				НоваяСтрока = SabyТип.Строки.Добавить();	
			Иначе
				НоваяСтрока = ОсновнаяКонфигурацияТип.Строки.Добавить();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;
	КонецЦикла;
	
	SabyЭлементы.Строки.Сортировать("Представление ВОЗР");
	ОсновнаяКонфигурацияЭлементы.Строки.Сортировать("Представление ВОЗР");
	
	ЗначениеВРеквизитФормы(SabyЭлементы, "ОснованияSaby");
	ЗначениеВРеквизитФормы(ОсновнаяКонфигурацияЭлементы, "ОснованияОсновнойКонфигурации");
КонецПроцедуры

#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти

