
// Единая точка входа для всего функционала описанного в модулях перечислений
//
// Параметры:
//  ИмяМетаданных - Строка - имя метаданных документа
//  ИмяФункции - Строка - имя функции описанной в данном модуле
//  Параметр1 - Произвольный - первый параметр вызываемой функции
//  Параметр2 - Произвольный - второй параметр вызываемой функции
//  Параметр3 - Произвольный - третий параметр вызываемой функции
//
// Возвращаемое значение:
//   Произвольный - зависит от конкретной вызванной функции
//
Функция РезультатФункцииТитулов(ИмяМетаданных, ИмяФункции,
		Параметр1 = Неопределено, Параметр2 = Неопределено, Параметр3 = Неопределено) Экспорт
	Перем РезультатФункции;
	
	Если ИмяМетаданных = ТранспортнаяНакладная() Тогда
		РезультатФункции = МодульКода("Перечисления.ESD_ТипТитулаЭтрН")
			.РезультатФункцииТитуловЭТрН(ИмяФункции, Параметр1, Параметр2, Параметр3);
	ИначеЕсли ИмяМетаданных = ПутевойЛист() Тогда
		РезультатФункции = МодульКода("Перечисления.ESD_ТипТитулаЭПЛ")
			.РезультатФункцииТитуловЭПЛ(ИмяФункции, Параметр1, Параметр2, Параметр3);
	ИначеЕсли ИмяМетаданных = ЗаказНаПеревозку() Тогда
		РезультатФункции = МодульКода("Перечисления.ESD_ТипТитулаЗнП")
			.РезультатФункцииТитуловЗнП(ИмяФункции, Параметр1, Параметр2, Параметр3);
	Иначе
		РезультатФункции = Неопределено;
	КонецЕсли;

	Возврат РезультатФункции;
КонецФункции

