
#Область ПрограммныйИнтерфейс

#Область includr_core_base_ОсобенностиПлатформы_РаботаСоСтрокамиОФ
#КонецОбласти // includr_core_base_ОсобенностиПлатформы_РаботаСоСтрокамиОФ

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ВидЗапуска_СобытиеОбъекта() Экспорт
	Возврат 0;
КонецФункции

Функция ВидЗапуска_РегламентноеЗадание() Экспорт
	Возврат 1;
КонецФункции

Функция ПараметрыЗапуска(Вид = 0) Экспорт
	РезультатФункции = Новый Структура("Вид", Вид);
	Возврат РезультатФункции;
КонецФункции

Функция ОснованиеID_РегламентноеЗадание() Экспорт
	Возврат "Запуск через регламентное задание";
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
