
// Перерисовывает визуализацию ленты сверху документа
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для отрисовки ленты
//  ОбновитьДанные - Булево - признак необходимости перечитать данные из регистра ДанныеТитулов
//  Горизонтально - Булево - признак группировки элементов
//
Процедура ЛентаТитулов_Обновить(Форма, ОбновитьДанные = Истина, Горизонтально = Истина) Экспорт
	ЛентаТитулов_СоздатьТаблицуДанных(Форма);
	Если ОбновитьДанные Тогда
		ЛентаТитулов_ОбновитьДанные(Форма);
	КонецЕсли;
	
	ЛентаТитулов_Очистить(Форма);
	Если Горизонтально Тогда
		ЛентаТитулов_ВывестиГоризонтально(Форма);
	Иначе
		ЛентаТитулов_ВывестиВертикально(Форма);
	КонецЕсли;
КонецПроцедуры

Процедура ЛентаТитулов_ВывестиГоризонтально(Форма) Экспорт
	ЛентаТитулов_ДобавитьКнопку(Форма, "ЛентаВлево");
	
	ВыведеноТитулов = 0;
	Для Каждого СтрокаЛенты Из Форма.Лента Цикл
		Если ВыведеноТитулов = ЛентаТитулов_КоличествоОтображаемых() Тогда
			Прервать;
		КонецЕсли;
		
		Если Не СтрокаЛенты.Видимость Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыведеноТитулов = 0 И Форма.Лента[0] <> СтрокаЛенты Тогда
			ЛентаТитулов_ДобавитьДекорациюЛинию(Форма, СтрокаЛенты, 2, "НачальнаяЛиния");
		Иначе
			Если ВыведеноТитулов > 0 Тогда
				ЛентаТитулов_ДобавитьДекорациюЛинию(Форма, СтрокаЛенты);
			КонецЕсли;
		КонецЕсли;
		ЛентаТитулов_ДобавитьДекорациюТитула(Форма, СтрокаЛенты);
		ВыведеноТитулов = ВыведеноТитулов + 1;	
	КонецЦикла;
	
	Если Форма.Лента.Количество() > 0 И Не Форма.Лента[Форма.Лента.Количество() - 1].Видимость Тогда
		ЛентаТитулов_ДобавитьДекорациюЛинию(Форма, СтрокаЛенты, 2, "КонечнаяЛиния");
	КонецЕсли;
	
	ЛентаТитулов_ДобавитьКнопку(Форма, "ЛентаВправо");
	ЛентаТитулов_ДобавитьПодсказку(Форма);	
КонецПроцедуры

Процедура ЛентаТитулов_ВывестиВертикально(Форма) Экспорт
	Если Форма.Элементы.Найти("ГруппаЛента") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтображения = ЛентаТитулов_ПараметрыОтображения(, ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная);
	ПараметрыОтображения.ОбщаяШирина = 0;
	ПараметрыОтображения.КартинкаШирина = 4;
	ПараметрыОтображения.КартинкаВысота = 2;
	ПараметрыОтображения.ТекстГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
	Для Каждого СтрокаЛенты Из Форма.Лента Цикл
		Если Не СтрокаЛенты.Видимость Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтображения.ТекстВысота = ЛентаТитулов_ВысотаПоТитулу(СтрокаЛенты.Представление);
		ЛентаТитулов_ДобавитьДекорациюТитула(Форма, СтрокаЛенты, ПараметрыОтображения);
	КонецЦикла;
	
	ЛентаТитулов_ДобавитьПодсказку(Форма, ОтображениеПодсказки.ОтображатьСнизу);
КонецПроцедуры

// Сдвигает отображаемые титулы, когда их больше чем РазмерЛентыВТитулах()
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма с лентой
//  Вправо - Булево - признак направления сдвига
//
Процедура ЛентаТитулов_Сдвинуть(Форма, Вправо = Истина) Экспорт
	Если Вправо Тогда
		ЛентаТитулов_СдвинутьВправо(Форма.Лента);
	Иначе
		ЛентаТитулов_СдвинутьВлево(Форма.Лента);
	КонецЕсли;
	
	ЛентаТитулов_Обновить(Форма, Ложь);
КонецПроцедуры

