
Процедура ЛентаТитулов_ОбновитьДанные(Форма)
	Форма.Лента.Очистить();
	
	МодульESD_ОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	ФормаОбъект = МодульESD_ОбщегоНазначенияКлиентСервер.ФормаОбъект(Форма);
	
	ИмяМетаданных = МодульESD_ОбщегоНазначенияКлиентСервер.ИмяМетаданныхПоФорме(Форма);
	Если ПроверитьНаличиеПараметровПодключенияЭПД() <> Неопределено Тогда
		ТекущиеЭтапыДокумента = МодульКода("Документы." + ИмяМетаданных)
			.ТекущиеЭтапыДокумента(ФормаОбъект, Форма.ИндексКартинки);
	Иначе
		ТекущиеЭтапыДокумента = Новый Массив;
	КонецЕсли;

	ДанныеДляЛенты = МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ДанныеДляЛенты(
		ФормаОбъект, ИмяМетаданных, ТекущиеЭтапыДокумента);
	
	КоличествоВидимость = ЛентаТитулов_КоличествоОтображаемых();
	Для Каждого СтруктураДанных Из ДанныеДляЛенты Цикл	
		СтрокаЛенты = Форма.Лента.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЛенты, СтруктураДанных);
		
		ЛентаТитулов_ЗаполнитьПризнакТекущегоЭтапа(Форма, ТекущиеЭтапыДокумента, СтрокаЛенты);
		ЛентаТитулов_ЗаполнитьНаименованиеТитула(СтрокаЛенты, ИмяМетаданных);
		
		СтрокаЛенты.Видимость = КоличествоВидимость > 0;
		КоличествоВидимость   = КоличествоВидимость - 1;	
	КонецЦикла;	
КонецПроцедуры

Процедура ЛентаТитулов_ЗаполнитьНаименованиеТитула(СтрокаСобытия, ИмяМетаданных)
	ПредставленияТитула = РезультатФункцииТитулов(ИмяМетаданных, "ПредставленияТитула", СтрокаСобытия.ТипТитула);	
	СтрокаСобытия.НаименованиеТитула = ПредставленияТитула.Имя;
КонецПроцедуры

Процедура ЛентаТитулов_СдвинутьНаСтроку(Лента, СтрокаЛенты)
	КоличествоВидимость = ЛентаТитулов_КоличествоОтображаемых();
	ИндексСтроки = Лента.Индекс(СтрокаЛенты);
	
	Индекс = Лента.Количество() - 1;
	Пока Индекс >= 0 Цикл
		СтрокаЛенты = Лента[Индекс];
		Если Индекс <= ИндексСтроки Тогда
			СтрокаЛенты.Видимость = КоличествоВидимость > 0;
			КоличествоВидимость   = КоличествоВидимость - 1;
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
КонецПроцедуры

Процедура ЛентаТитулов_СдвинутьВправо(Лента)
	Если Лента.Количество() <= ЛентаТитулов_КоличествоОтображаемых() Или Лента[Лента.Количество() - 1].Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Для ИндексНачала = 0 По Лента.Количество() - 1 Цикл
		Если Лента[ИндексНачала].Видимость Тогда
			Лента[ИндексНачала].Видимость = Ложь;
			ИндексНачала = ИндексНачала + 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПоследнийИндекс = Мин(ИндексНачала + ЛентаТитулов_КоличествоОтображаемых() - 1, Лента.Количество() - 1);
	
	Для Индекс = ИндексНачала По ПоследнийИндекс Цикл
		Лента[Индекс].Видимость = Истина;
	КонецЦикла;
КонецПроцедуры

Процедура ЛентаТитулов_СдвинутьВлево(Лента)
	Если Лента.Количество() <= ЛентаТитулов_КоличествоОтображаемых() Или Лента[0].Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Для ИндексНачала = 0 По Лента.Количество() - 1 Цикл
		Если Лента[ИндексНачала].Видимость Тогда
			ИндексНачала = ИндексНачала - 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПоследнийИндекс = Мин(ИндексНачала + ЛентаТитулов_КоличествоОтображаемых() - 1, Лента.Количество() - 1);
	
	Для Индекс = ИндексНачала По Лента.Количество() - 1 Цикл
		Лента[Индекс].Видимость = Индекс <= ПоследнийИндекс;
	КонецЦикла;	
КонецПроцедуры

Функция ЛентаТитулов_КоличествоОтображаемых()
	Возврат 6;
КонецФункции

Процедура ЛентаТитулов_ЗаполнитьПризнакТекущегоЭтапа(Форма, ТекущиеЭтапы, СтрокаЛенты)
	ДокументооборотЗавершен = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер")
		.ДокументооборотЗавершен(Форма.ИндексКартинки);
	
	ЕстьТитулВТекущихЭтапах = Ложь;
	Если ТекущиеЭтапы.Количество() <> 0 Тогда
		ЕстьТитулВТекущихЭтапах = Не ЗначениеЗаполнено(СтрокаЛенты.ИдентификаторТитула)
			И ТекущиеЭтапы.Найти(СтрокаЛенты.ТипТитула) <> Неопределено;
	КонецЕсли;
	
	Если СтрокаЛенты.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ИзменениеСтоимости")
		Или СтрокаЛенты.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.СогласованиеСтоимости") Тогда
		СтрокаЛенты.ТекущийТитул = ЕстьТитулВТекущихЭтапах;
	Иначе
		СтрокаЛенты.ТекущийТитул = Не ДокументооборотЗавершен И ЕстьТитулВТекущихЭтапах;
	КонецЕсли;	
КонецПроцедуры

Процедура ЛентаТитулов_СоздатьТаблицуДанных(Форма)
	ИмяРеквизита_ = "Лента";
	Если МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(Форма, ИмяРеквизита_) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	// Добавим таблицу значений
	РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита_, Новый ОписаниеТипов("ТаблицаЗначений"));
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	
	// Добавим колонки
	РеквизитТЗ = Новый РеквизитФормы("Период"
		, Новый ОписаниеТипов("Дата"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("ТипТитула"
		, Новый ОписаниеТипов(Новый Массив), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("ИдентификаторТитула"
		, Новый ОписаниеТипов("Строка"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("НаименованиеТитула"
		, Новый ОписаниеТипов("Строка"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Основной"
		, Новый ОписаниеТипов("Булево"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Видимость"
		, Новый ОписаниеТипов("Булево"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("ТекущийТитул"
		, Новый ОписаниеТипов("Булево"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Описание"
		, Новый ОписаниеТипов("Строка"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
	РеквизитТЗ = Новый РеквизитФормы("Представление"
		, Новый ОписаниеТипов("Строка"), ИмяРеквизита_);
	ДобавляемыеРеквизиты.Добавить(РеквизитТЗ);
		
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
КонецПроцедуры

#Область ЛентаТитулов_Отрисовка

Процедура ЛентаТитулов_Очистить(Форма)
	Пока Форма.Элементы.ГруппаЛента.ПодчиненныеЭлементы.Количество() <> 0 Цикл
		Форма.Элементы.Удалить(Форма.Элементы.ГруппаЛента.ПодчиненныеЭлементы.Получить(0));
	КонецЦикла;	
КонецПроцедуры

Процедура ЛентаТитулов_ДобавитьКнопку(Форма, ИмяКоманды)
	Если Форма.Лента.Количество() = 0 Или Форма.Лента.Количество() <= ЛентаТитулов_КоличествоОтображаемых() Тогда
		Возврат;
	КонецЕсли;
		
	КнопкаФормы = Форма.Элементы.Добавить("Кнопка" + ИмяКоманды, Тип("КнопкаФормы"), Форма.Элементы.ГруппаЛента);
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормы.ИмяКоманды = ИмяКоманды;
	КнопкаФормы.Отображение = ОтображениеКнопки.Картинка;
	КнопкаФормы.ОтображениеФигуры = ОтображениеФигурыКнопки.ПриАктивности;
	КнопкаФормы.Высота = 4;
КонецПроцедуры

Процедура ЛентаТитулов_ДобавитьДекорациюЛинию(Форма, СтрокаЛенты = Неопределено, Ширина = 3, ИмяДекорации = "ДекорацияЛиния")
	Серая   = Истина;
	Красная = Ложь;
	
	ПолноеИмяДекорации = ИмяДекорации;
	ИдентификаторСтроки = "";
	Если СтрокаЛенты <> Неопределено Тогда
		ИдентификаторСтроки = Формат(СтрокаЛенты.ПолучитьИдентификатор(), "ЧДЦ=0; ЧГ=");
		ПолноеИмяДекорации = ПолноеИмяДекорации + ИдентификаторСтроки;
		Серая   = Не ЗначениеЗаполнено(СтрокаЛенты.Период) И Не СтрокаЛенты.ТекущийТитул;
		Красная = Форма.ТитулОтрицательноЗавершен(СтрокаЛенты);
	КонецЕсли;
	
	ГруппаЛинии = Форма.Элементы.Добавить("ГруппаЛинии_" + ИдентификаторСтроки,
		Тип("ГруппаФормы"), Форма.Элементы.ГруппаЛента);
		
	ГруппаЛинии.Вид                                = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЛинии.Отображение                        = ОтображениеОбычнойГруппы.Нет;
	ГруппаЛинии.ОтображатьЗаголовок                = Ложь;
	ГруппаЛинии.Группировка                        = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаЛинии.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	ГруппаЛинии.РастягиватьПоГоризонтали           = Ложь;
	ГруппаЛинии.Ширина                             = Ширина;
	
	ДекорацияФормы = Форма.Элементы.Добавить("Отступ" + ПолноеИмяДекорации, Тип("ДекорацияФормы"), ГруппаЛинии);
	ДекорацияФормы.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияФормы.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ДекорацияФормы.РастягиватьПоГоризонтали = Ложь;
	ДекорацияФормы.Ширина = Ширина;
	
	ДекорацияФормы = Форма.Элементы.Добавить(ПолноеИмяДекорации, Тип("ДекорацияФормы"), ГруппаЛинии);
	ДекорацияФормы.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияФормы.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ДекорацияФормы.РастягиватьПоГоризонтали = Ложь;
	ДекорацияФормы.Ширина = Ширина;
	ДекорацияФормы.Рамка = Форма.Элементы.Стили.Рамка;
	
	Если Красная Тогда
		ДекорацияФормы.ЦветРамки = ЦветаСтиля.ЦветОсобогоТекста;
	ИначеЕсли Серая Тогда
		ДекорацияФормы.ЦветРамки = ЦветаСтиля.ЦветРамкиКнопки;
	Иначе
		ДекорацияФормы.ЦветРамки = WebЦвета.ЖелтоЗеленый;
	КонецЕсли;	
КонецПроцедуры

Функция ЛентаТитулов_ДобавитьДекорациюТитула(Форма, СтрокаЛенты, Знач ПараметрыОтображения = Неопределено)
	Если ПараметрыОтображения = Неопределено Тогда
		ПараметрыОтображения = ЛентаТитулов_ПараметрыОтображения(СтрокаЛенты);
	КонецЕсли;

	ИдентификаторСтроки = Формат(СтрокаЛенты.ПолучитьИдентификатор(), "ЧДЦ=0; ЧН=0; ЧГ=");
	
	ГруппаТитул = Форма.Элементы.Добавить("Группа_" + ИдентификаторСтроки,
		Тип("ГруппаФормы"), Форма.Элементы.ГруппаЛента);	
	ГруппаТитул.Вид                                = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаТитул.Отображение                        = ОтображениеОбычнойГруппы.Нет;
	ГруппаТитул.ОтображатьЗаголовок                = Ложь;
	ГруппаТитул.Группировка                        = ПараметрыОтображения.ОбщаяГруппировкаПодчиненныхЭлементов;
	ГруппаТитул.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	ГруппаТитул.ВертикальныйИнтервал               = ИнтервалМеждуЭлементамиФормы.Нет;
	ГруппаТитул.РастягиватьПоВертикали             = Ложь;
	ГруппаТитул.Ширина                             = ПараметрыОтображения.ОбщаяШирина;
	ГруппаТитул.РастягиватьПоГоризонтали           = (ПараметрыОтображения.ОбщаяШирина = 0);
	
	ДекорацияФормы = Форма.Элементы.Добавить("Титул_" + ИдентификаторСтроки,
		Тип("ДекорацияФормы"), Форма.Элементы[ГруппаТитул.Имя]);	
	ДекорацияФормы.Вид                      = ВидДекорацииФормы.Картинка;
	ДекорацияФормы.Гиперссылка              = Истина;
	ДекорацияФормы.Высота                   = ПараметрыОтображения.КартинкаВысота;
	ДекорацияФормы.Ширина                   = ПараметрыОтображения.КартинкаШирина;
	ДекорацияФормы.РастягиватьПоГоризонтали = (ПараметрыОтображения.КартинкаШирина = 0);
    ДекорацияФормы.РазмерКартинки           = РазмерКартинки.АвтоРазмер;

	МассивДанныхПодсказки = Новый Массив;
	Если Форма.ТитулОтрицательноЗавершен(СтрокаЛенты) Тогда
		ЦветТитула = ЦветаСтиля.ЦветОсобогоТекста;
		МассивДанныхПодсказки.Добавить("Красный");
	Иначе
		ЦветТитула = WebЦвета.ТемноЗеленый;
		МассивДанныхПодсказки.Добавить("Зеленый");
	КонецЕсли;
	
	Если СтрокаЛенты.ТекущийТитул Тогда
		Картинка = КартинкаИнтерфейсаСервер(Форма, "ESD_ТекущийТитул");
		МассивДанныхПодсказки.Добавить("ESD_ТекущийТитул");
	ИначеЕсли ЗначениеЗаполнено(СтрокаЛенты.ИдентификаторТитула) Тогда
		Картинка = КартинкаИнтерфейсаСервер(Форма, "ESD_АктивныйТитул");
		МассивДанныхПодсказки.Добавить("ESD_АктивныйТитул");
	Иначе
		Картинка = КартинкаИнтерфейсаСервер(Форма, "ESD_НеактивныйТитул");
		ЦветТитула = ЦветаСтиля.ЦветРамкиКнопки;
		МассивДанныхПодсказки[0] = "Серый";
		МассивДанныхПодсказки.Добавить("ESD_НеактивныйТитул");
	КонецЕсли;
	
	ДекорацияФормы.Картинка = Картинка;
	
	Если ЗначениеЗаполнено(СтрокаЛенты.Период) Тогда
		ПериодСтрокой = Формат(СтрокаЛенты.Период, "ДФ='dd.MM.yyyy ЧЧ:мм'");
	Иначе
		ПериодСтрокой = "";
	КонецЕсли;
		
	МассивДанныхПодсказки.Добавить(СтрокаЛенты.Представление);
	Если ЗначениеЗаполнено(ПериодСтрокой) Тогда
		МассивДанныхПодсказки.Добавить(ПериодСтрокой);
	КонецЕсли;
		
	ДекорацияФормы.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	ДекорацияФормы.Подсказка            = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(
		МассивДанныхПодсказки, "/");
	ДекорацияФормы.УстановитьДействие("Нажатие", "ДекорацияТитулОбработкаНавигационнойСсылки");
	
	ФорматированнаяСтрока = Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока(СтрокаЛенты.Представление, ШрифтыСтиля.ОбычныйШрифтТекста, ЦветТитула),
		Символы.ПС,
		Новый ФорматированнаяСтрока(ПериодСтрокой, ШрифтыСтиля.МелкийШрифтТекста, WebЦвета.Серый));
	
	ДекорацияФормыТекст = Форма.Элементы.Добавить("НадписьТитула_" + ИдентификаторСтроки,
		Тип("ДекорацияФормы"), Форма.Элементы[ГруппаТитул.Имя]);	
	ДекорацияФормыТекст.Вид                      = ВидДекорацииФормы.Надпись;
	ДекорацияФормыТекст.Заголовок                = ФорматированнаяСтрока;
	ДекорацияФормыТекст.ГоризонтальноеПоложение  = ПараметрыОтображения.ТекстГоризонтальноеПоложение;
	ДекорацияФормыТекст.ВертикальноеПоложение    = ВертикальноеПоложениеЭлемента.Верх;
	ДекорацияФормыТекст.Высота                   = ПараметрыОтображения.ТекстВысота;
	ДекорацияФормыТекст.Ширина                   = ПараметрыОтображения.ТекстШирина;
	ДекорацияФормыТекст.РастягиватьПоГоризонтали = (ПараметрыОтображения.ТекстШирина = 0);
	
	Возврат ГруппаТитул;
КонецФункции

Функция ЛентаТитулов_ПараметрыОтображения(СтрокаЛенты = Неопределено, Знач ОбщаяГруппировкаПодчиненныхЭлементов = Неопределено)
	ОбщаяШирина                  = 0;
	ТекстШирина                  = 0;
	ТекстВысота                  = 0;
	ТекстГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	КартинкаВысота               = 0;
	КартинкаШирина               = 0;

	Если СтрокаЛенты <> Неопределено Тогда
		ОбщаяШирина    = ЛентаТитулов_ШиринаПоТитулу(СтрокаЛенты.ТипТитула);
		ТекстШирина    = ОбщаяШирина;
		ТекстВысота    = ЛентаТитулов_ВысотаПоТитулу(СтрокаЛенты.Представление);
		КартинкаВысота = 2;
		КартинкаШирина = 0;
	КонецЕсли;

	Если ОбщаяГруппировкаПодчиненныхЭлементов = Неопределено Тогда
		ОбщаяГруппировкаПодчиненныхЭлементов = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;	

	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ОбщаяШирина", ОбщаяШирина);
	РезультатФункции.Вставить("ТекстШирина", ТекстШирина);
	РезультатФункции.Вставить("ТекстВысота", ТекстВысота);
	РезультатФункции.Вставить("КартинкаШирина", КартинкаШирина);
	РезультатФункции.Вставить("КартинкаВысота", КартинкаВысота);
	РезультатФункции.Вставить("ОбщаяГруппировкаПодчиненныхЭлементов", 
		ОбщаяГруппировкаПодчиненныхЭлементов);
	РезультатФункции.Вставить("ТекстГоризонтальноеПоложение", ТекстГоризонтальноеПоложение);

	Возврат РезультатФункции;
КонецФункции

Функция ЛентаТитулов_ШиринаПоТитулу(ТипТитула)
	РезультатФункции = 10;
	Если ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.Переадресовка") Тогда		
		РезультатФункции = 12;		
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

Функция ЛентаТитулов_ВысотаПоТитулу(ПредставлениеТитула)
	Высота = 2;
	
	НесколькоСлов = Найти(ПредставлениеТитула, " ") > 0;
	Если НесколькоСлов Тогда
		Высота = Высота + 1;
	КонецЕсли;  
	
	Возврат Высота;
КонецФункции

Процедура ЛентаТитулов_ДобавитьПодсказку(Форма, Знач ВидОтображенияПодсказки = Неопределено)
	Если ВидОтображенияПодсказки = Неопределено Тогда
		ВидОтображенияПодсказки = ОтображениеПодсказки.Кнопка;
	КонецЕсли;
	
	ДекорацияФормы = Форма.Элементы.Добавить("ПодсказкаЛенты", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаЛента);
	ДекорацияФормы.ОтображениеПодсказки = ВидОтображенияПодсказки;
	ДекорацияФормы.Подсказка = "При нажатии на картинку происходит переход к данным выбранного титула";
КонецПроцедуры

#КонецОбласти // ЛентаТитулов_Отрисовка

