
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОграничениеТипов();
	
	УстановитьПодсказкуТипа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не Объект.ДанныеЮрЛиц.Количество() И ОбязатетельноеЗаполнениеСторон() Тогда 	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнены стороны документа!";
		Сообщение.Поле  = "Объект.ДанныеЮрЛиц";
		Сообщение.Сообщить();		
		Отказ = Истина;	
	КонецЕсли;      				
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначения(СтандартнаяОбработка)
	
	ЭтаФорма.ВыборДоступен = Истина;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УстановитьПодсказкуТипа();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеЮрЛиц

&НаКлиенте
Процедура ДанныеЮрЛицВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ОткрытьФормуЮрЛица(ВыбраннаяСтрока);
		
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЮрЛицПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Роль = ЗначениеМетаданныхКлиент("ESD_РолиКонтрагентов.СторонаДокумента");
		Элемент.ТекущиеДанные.КлючСтроки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(
			ЭтаФорма, "ДанныеЮрЛиц");
	КонецЕсли;
	
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		"НаименованиеОрганизации",
		"ДанныеЮрЛицНаименованиеОрганизации",
		Элементы.ДанныеЮрЛиц.ТекущаяСтрока);
			
	ПараметрыРеквизитаФормы.ИмяИсходнойТаблицы          = "ДанныеЮрЛиц";
	ПараметрыРеквизитаФормы.ИдентификаторИсходнойСтроки = Элементы.ДанныеЮрЛиц.ТекущаяСтрока;
			
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "СторонаДокумента", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыДанныеЮрЛиц

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДанныеЮрЛицПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Не Копирование Тогда
		Отказ = Истина;
		ДобавитьСтрокуСторон();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОграничениеТипов()
	
	Если Параметры.Свойство("ОтборТипов") Тогда
		ЗначениеОтбора = Параметры.ОтборТипов;
	ИначеЕсли Параметры.Свойство("ПараметрыВыбора") И Параметры.ПараметрыВыбора.Свойство("Тип") Тогда
		ЗначениеОтбора = Параметры.ПараметрыВыбора.Тип;
	Иначе
		ЗначениеОтбора = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") Тогда
		Для Каждого ЗначениеСписка Из ЗначениеОтбора Цикл
			Элементы.Тип.СписокВыбора.Добавить(ЗначениеСписка.Значение);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("Массив") Или ТипЗнч(ЗначениеОтбора) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Значение Из ЗначениеОтбора Цикл
			Элементы.Тип.СписокВыбора.Добавить(Значение);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("ПеречислениеСсылка." + ТипыДокумента()) Тогда
		Элементы.Тип.СписокВыбора.Добавить(ЗначениеОтбора);
	Иначе
		Элементы.Тип.СписокВыбора.Очистить();
	КонецЕсли;
		
	ОбновитьОтображениеВыбораТипа();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеВыбораТипа()
	
	Если Элементы.Тип.СписокВыбора.Количество() = 1 Тогда
		
		// установка значения по умолчанию 
		Объект.Тип = Элементы.Тип.СписокВыбора[0].Значение;		
		Элементы.Тип.ТолькоПросмотр = Истина;
		
	ИначеЕсли Элементы.Тип.СписокВыбора.Количество() > 1 Тогда
		Элементы.Тип.РежимВыбораИзСписка = Истина;
		Элементы.Тип.ВыбиратьТип         = Ложь;
	Иначе
		Элементы.Тип.РежимВыбораИзСписка = Ложь;
		Элементы.Тип.ВыбиратьТип         = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуТипа()
	
	ШаблонПодсказки = "- %1 - %2";
	
	МассивТипов = Новый Массив;
	Если Не Объект.Тип.Пустая() Тогда
		МассивТипов.Добавить(Объект.Тип);
	ИначеЕсли Элементы.Тип.СписокВыбора.Количество() <> 0 Тогда
		Для Каждого ЗначениеСписка Из Элементы.Тип.СписокВыбора Цикл
			МассивТипов.Добавить(ЗначениеСписка.Значение);
		КонецЦикла;
	Иначе
		МодульКода("Перечисления.ESD_ТипыДокумента").ЗаполнитьВсеТипыПоПорядку(МассивТипов);
	КонецЕсли;
	
	МассивПодсказок = Новый Массив;
	Для Каждого Тип Из МассивТипов Цикл
		Подсказка = МодульКода("Перечисления.ESD_ТипыДокумента").Подсказка(Тип);
		Если ЗначениеЗаполнено(Подсказка) Тогда
			ИмяТипа = Строка(Тип);
			СтрокаПодсказки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(ШаблонПодсказки, ИмяТипа, Подсказка);
			МассивПодсказок.Добавить(СтрокаПодсказки);
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Тип.Подсказка = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(МассивПодсказок, Символы.ПС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЮрЛица(ИндексСтроки)
	
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		"НаименованиеОрганизации",
		"ДанныеЮрЛицНаименованиеОрганизации",
		ИндексСтроки);
		
	ПараметрыРеквизитаФормы.ИмяИсходнойТаблицы          = "ДанныеЮрЛиц";
	ПараметрыРеквизитаФормы.ИдентификаторИсходнойСтроки = ИндексСтроки;
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "СторонаДокумента", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуСторон()
	
	НоваяСтрока = Объект.ДанныеЮрЛиц.Добавить();
	ИдентификаторСтроки = НоваяСтрока.НомерСтроки - 1;
	
	НоваяСтрока.Роль = ЗначениеМетаданныхКлиент("ESD_РолиКонтрагентов.СторонаДокумента");
	НоваяСтрока.КлючСтроки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(
			ЭтаФорма, "ДанныеЮрЛиц");
	
	ОткрытьФормуЮрЛица(ИдентификаторСтроки);
	
	Элементы.ДанныеЮрЛиц.ТекущаяСтрока = ИдентификаторСтроки;
	
КонецПроцедуры

&НаКлиенте
Функция ОбязатетельноеЗаполнениеСторон()
	Возврат Объект.Тип <> ЗначениеМетаданныхКлиент("ESD_ТипыДокумента.СтраховойПолис");
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область includr_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // includr_etrn_base_CommonModule_ЗначениеМетаданных

#Область includr_etrn_base_CommonModule_Метаданные
#КонецОбласти // includr_etrn_base_CommonModule_Метаданные
