
// Формирование структуры дополнительных параметров печати
//
// Параметры:
//  УникальныйИдентификатор 	- УникальныйИдентификатор	 	- уникальный идентификатор
//  Заголовок 					- Строка 						- заголовок печатной формы
//  ЭтоФормаСписка 				- Булево 						- если печать из формы списка
//  ВыборПечатнойФормы 			- Булево 						- если использовать выбор печатной формы
//
// Возвращаемое значение:
//   Структура - Параметры печати
//
Функция ПараметрыПечати(УникальныйИдентификатор, 
	Заголовок = "Печать документа Saby",
	ЭтоФормаСписка = Ложь,
	ВыборПечатнойФормы = Ложь
) Экспорт
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	РезультатФункции.Вставить("Заголовок",               Заголовок);
	РезультатФункции.Вставить("ЭтоФормаСписка",          ЭтоФормаСписка);
	РезультатФункции.Вставить("ВыборПечатнойФормы",      ВыборПечатнойФормы);
	
	Возврат РезультатФункции;
КонецФункции

