
#Область include_etrn_src_vo3_InformationRegister_ДанныеТитулов_ПолучениеДанныхТитулов //&НаСервере
#КонецОбласти // include_etrn_src_vo3_InformationRegister_ДанныеТитулов_ПолучениеДанныхТитулов //&НаСервере

&НаСервере
Процедура УстановкаТипаРасчетныхСчетов(Ссылка = Неопределено)
					
	Элементы.РасчетныйСчетПеревозчик.Видимость = Ложь;
	Элементы.РасчетныйСчет.Видимость           = Ложь;
		
КонецПроцедуры

&НаСервере
Функция РасчетныйСчетПоУмолчанию(Знач СтруктураЮрЛица)
		
	Возврат Неопределено;
	
КонецФункции

