
Функция ВыполнитьОперациюПереопределяемый(ПолноеИмя, Параметры, РезультатФункции = Неопределено)
	ОперацияВыполнена = Ложь;
	
	Если ПолноеИмя = "ESD_ОбщийФункционалСервер.События_ТабличныйДокументИзSaby" Тогда
		// BSLLS:FunctionOutParameter-off
		РезультатФункции = ESD_ОбщийФункционалСервер.События_ТабличныйДокументИзSaby(Параметры[0], Параметры[1], Параметры[1]);
		// BSLLS:FunctionOutParameter-on
		ОперацияВыполнена = Истина;
	ИначеЕсли ПолноеИмя = "ESD_НастройкиСопоставленийСервер.МассовоеСоздание_ДлительнаяОперация_Выполнить" Тогда
		// BSLLS:FunctionOutParameter-off
		РезультатФункции = ESD_НастройкиСопоставленийСервер.МассовоеСоздание_ДлительнаяОперация_Выполнить(Параметры[0], Параметры[1], Параметры[2]);
	    // BSLLS:FunctionOutParameter-on
		ОперацияВыполнена = Истина;
	КонецЕсли;
	
	Возврат ОперацияВыполнена;
КонецФункции

