
&НаКлиенте
Функция ЗаполнениеНаОснованииINI() Экспорт
	
	Если ЭтаФорма.ЭтоВО Тогда
		Результат = ЗаполнитьНаОснованииINI(ЭтаФорма, ДокументОснование, ТранспортнаяНакладнаяКлиент());
		ЭтаФорма.Ссылка = Результат.Ссылка;
	Иначе
		Результат = ЗаполнениеНаОснованииINIНаСервере();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаполнениеНаОснованииINIНаСервере()
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьНаОснованииINI(
		ОбъектДокумента, ДокументОснование, ТранспортнаяНакладная());
	
КонецФункции

