
&НаСервере
Процедура ЗаполнитьНаОсновании_НастроитьВидимостьДоступностьЭлементовФормы(ИсточникДанных)
	ОснованиеЗаполнено_ = ЗначениеЗаполнено(ИсточникДанных.ДокументОснование_Идентификатор);

	РедактированиеДоступно = Не (ЭтаФорма.ТолькоПросмотр Или Элементы.Страница_Основное.ТолькоПросмотр);
	Элементы.ГруппаКомандыДокументаОснования.Видимость = РедактированиеДоступно Или ОснованиеЗаполнено_;
	Элементы.ОчиститьДокументОснование.Видимость       = РедактированиеДоступно И ОснованиеЗаполнено_;
	Элементы.НастройкаДокументовОснований.Видимость    = Ложь;
КонецПроцедуры

&НаКлиенте
Функция ЗаполнениеНаОснованииINI() Экспорт
	
	Если ЭтаФорма.ЭтоВО Тогда
		Результат = ЗаполнитьНаОснованииINI(ЭтаФорма, ДокументОснование, ТранспортнаяНакладнаяКлиент());
		ЭтаФорма.Ссылка = Результат.Ссылка;
	Иначе
		Результат = ЗаполнениеНаОснованииINIНаСервере();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаполнениеНаОснованииINIНаСервере()
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьНаОснованииINI(
		ОбъектДокумента, ДокументОснование, ТранспортнаяНакладная());
	
КонецФункции

