
&НаКлиенте 
Процедура ПриОткрытииПереопределяемый()
	Если ЗначениеЗаполнено(ЭтаФорма.Идентификатор) Тогда
		ОбменДаннымиСБИС("ПрочитатьДокумент");
	Иначе	
		Если ЗначениеЗаполнено(ЭтаФорма.ДокументОснование) Тогда		
			ЭтаФорма.ТранспортИнтеграции = ЭтаФорма.ВладелецФормы.ТранспортИнтеграции;
			ЭтаФорма.BlocklyExecutor     = ЭтаФорма.ВладелецФормы.BlocklyExecutor;
			
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Форма", ЭтаФорма);
			МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ПослеВыбораЗначенияДокументаОснования(
				ЭтаФорма.ДокументОснование, ДопПараметры);	
		КонецЕсли;	
	КонецЕсли;
		
	ОграничитьДоступныеВидыУпаковок();
КонецПроцедуры

