
&НаКлиенте
Процедура ПутевыеЛистыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ПроверкаВозможностиВводаСтроки("Водители", Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПутевыеЛистыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не Копирование Тогда	
		МодульКлиент = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент");
		ИмяТаблицы = Элемент.Имя;
		ПараметрыСвязи = МодульКлиент.ПараметрыКлючаСвязиСтрок(ИмяТаблицы, "Водители", Элемент.ТекущаяСтрока, НоваяСтрока);	
		МодульКлиент.ДобавитьКлючСвязиСтроки(ЭтаФорма, ПараметрыСвязи);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутевыеЛистыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Страница_Основное.ТолькоПросмотр Тогда
		ПараметрыФормы = Новый Структура("Ключ,ТолькоПросмотр", Элемент.ТекущиеДанные.Документ, Истина);
		ОткрытьФорму("Справочник.ESD_ДокументыЭПД.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);	
	КонецЕсли;
КонецПроцедуры

