
Процедура ОбщиеНастройкиЭПД_Инициализация(Форма, ГруппаВладелец) Экспорт
	ГруппаКонтейнер = ОбщиеНастройкиЭПД_Контейнер_ДобавитьНаФорму(Форма, ГруппаВладелец);
	ОбщиеНастройкиЭПД_СоздатьЭлементы(Форма, ГруппаКонтейнер);
	ОбщиеНастройкиЭПД_Загрузить(Форма);
КонецПроцедуры

Процедура ОбщиеНастройкиЭПД_СоздатьЭлементы(Форма, ГруппаКонтейнер) Экспорт
	ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_СоздатьЭлементы(Форма, ГруппаКонтейнер);
	ОбщиеНастройкиЭПД_НастройкаПрефиксов_СоздатьЭлементы(Форма);
КонецПроцедуры

Процедура ОбщиеНастройкиЭПД_Загрузить(Форма) Экспорт
	ЗначенияНастроек = ESD_ТНОбщегоНазначенияСервер.СлужебныеНастройки_Загрузить();
	ЗаполнитьЗначенияСвойств(Форма, ЗначенияНастроек);  
КонецПроцедуры

Функция ОбщиеНастройкиЭПД_Контейнер_ДобавитьНаФорму(Форма, ГруппаВладелец) Экспорт
	ИмяГруппы = "ОбщиеНастройкиЭПД_Контейнер";
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если ГруппаФормы = Неопределено Тогда
		ГруппаФормы = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаВладелец);
		ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормы.Поведение = ПоведениеОбычнойГруппы.Обычное;
		ГруппаФормы.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		ГруппаФормы.РастягиватьПоВертикали = Ложь;
		ГруппаФормы.ОтображатьЗаголовок = Ложь;
	КонецЕсли;
	
	Возврат ГруппаФормы;
КонецФункции  

#Область НастройкаПрефиксов

Функция ОбщиеНастройкиЭПД_НастройкаПрефиксов_СоздатьЭлементы(Форма) Экспорт
	ОбщиеНастройкиЭПД_НастройкаПрефиксов_СоздатьРеквизиты(Форма);

	ИмяГруппы = "ГруппаОбщийФункционалЭПД_НастройкаПрефиксов";
	Если Форма.Элементы.Найти(ИмяГруппы) <> Неопределено Тогда
		Возврат Форма.Элементы[ИмяГруппы];
	КонецЕсли;

	ГруппаВладелец = Форма.Элементы.Найти("ГруппаОбщийФункционалЭПД");
	Если ГруппаВладелец = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ОбщиеНастройкиЭПД_НастройкаПрефиксов_ДобавитьКоманду(Форма);
	
	ТекстПодсказки = "Позволяет задать префикс, который автоматически подставляется"
		+ " для всех номеров ЭПД, созданных в конфигурации";
		
	ГруппаПрефиксов = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаВладелец);
	ГруппаПрефиксов.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПрефиксов.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПрефиксов.Отображение          = ОтображениеОбычнойГруппы.Нет;
	ГруппаПрефиксов.Подсказка 			 = ТекстПодсказки;
	ГруппаПрефиксов.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;  
	ГруппаПрефиксов.ОтображатьЗаголовок  = Ложь; 

	ГруппаПереключатели = Форма.Элементы.Найти("ГруппаОбщийФункционалЭПД_Переключатели");
	Если ГруппаПереключатели <> Неопределено Тогда
		Форма.Элементы.Переместить(ГруппаПрефиксов, ГруппаВладелец, ГруппаПереключатели);
	КонецЕсли;

	ГруппаПоля = Форма.Элементы.Добавить(
		"ГруппаОбщийФункционалЭПД_НастройкаПрефиксов_Поля", Тип("ГруппаФормы"), ГруппаПрефиксов);
	ГруппаПоля.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПоля.Отображение          = ОтображениеОбычнойГруппы.Нет;
	ГруппаПоля.ОтображатьЗаголовок  = Ложь;
	
	ОбщиеНастройкиЭПД_Префикс = ESD_ОбщийФункционалКлиентСервер.ОбщиеНастройкиЭПД_ОбщиеНастройкиЭПД_Префикс_ИмяРеквизита();
	ПолеПрефикса = Форма.Элементы.Добавить(ОбщиеНастройкиЭПД_Префикс, Тип("ПолеФормы"), ГруппаПоля);
	ПолеПрефикса.Вид          = ВидПоляФормы.ПолеВвода;
	ПолеПрефикса.ПутьКДанным  = ОбщиеНастройкиЭПД_Префикс;
	ПолеПрефикса.Заголовок    = "Префикс";
	ПолеПрефикса.УстановитьДействие(
		"ИзменениеТекстаРедактирования", "Подключаемый_ОбщиеНастройкиЭПД_ПрефиксИзменениеТекстаРедактирования");

	КнопкаПрименить = Форма.Элементы.Добавить("ОбщиеНастройкиЭПД_Префикс_Применить", Тип("КнопкаФормы"), ГруппаПоля);
	КнопкаПрименить.Вид         = ВидКнопкиФормы.Гиперссылка;
	КнопкаПрименить.ИмяКоманды  = "ОбщиеНастройкиЭПД_Префикс_Применить";
	КнопкаПрименить.Видимость   = Ложь;
	
	Возврат ГруппаПрефиксов;
КонецФункции

Функция ОбщиеНастройкиЭПД_НастройкаПрефиксов_СоздатьРеквизиты(Форма) Экспорт
	НовыеРеквизиты = Новый Массив;

	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер.ОбщиеНастройкиЭПД_ОбщиеНастройкиЭПД_Префикс_ИмяРеквизита();
	Если ESD_ТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(Форма, ИмяРеквизита_) Тогда
		Возврат НовыеРеквизиты;
	КонецЕсли;

	КвалификаторыСтроки = Новый КвалификаторыСтроки(5, ДопустимаяДлина.Переменная);
	ОписаниеТипов_      = Новый ОписаниеТипов("Строка", , КвалификаторыСтроки);
	РеквизитФормы       = Новый РеквизитФормы(ИмяРеквизита_, ОписаниеТипов_);
	НовыеРеквизиты.Добавить(РеквизитФормы);

	Форма.ИзменитьРеквизиты(НовыеРеквизиты);

	Возврат НовыеРеквизиты;
КонецФункции

Функция ОбщиеНастройкиЭПД_НастройкаПрефиксов_ДобавитьКоманду(Форма) Экспорт
	КомандаФормы_ = Форма.Команды.Найти("ОбщиеНастройкиЭПД_Префикс_Применить");
	Если КомандаФормы_ <> Неопределено Тогда
		Возврат КомандаФормы_;
	КонецЕсли;

	КомандаФормы_ = Форма.Команды.Добавить("ОбщиеНастройкиЭПД_Префикс_Применить");
	КомандаФормы_.Заголовок = "Применить";
	КомандаФормы_.Действие  = "Подключаемый_ОбщиеНастройкиЭПД_Префикс_Применить";

	Возврат КомандаФормы_;
КонецФункции

#КонецОбласти      

#Область ОбновлениеДанныхПриОткрытииФормыЭПД

Функция ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_СоздатьЭлементы(Форма, ГруппаВладелец) Экспорт
	ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_СоздатьРеквизиты(Форма);
	
	ИмяЭлемента = ESD_ОбщийФункционалКлиентСервер
		.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_ИмяРеквизита();
	ЭлементФормы = Форма.Элементы.Найти(ИмяЭлемента);
	Если ЭлементФормы = Неопределено Тогда
		ЭлементФормы = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаВладелец);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
		Попытка
			ЭлементФормы.ВидФлажка = Вычислить("ВидФлажка.Выключатель");
		// BSLLS:MissingCodeTryCatchEx-off
		Исключение
		КонецПопытки;
		// BSLLS:MissingCodeTryCatchEx-on
		ЭлементФормы.Заголовок = "Обновлять данные при открытии формы";
		ЭлементФормы.ПутьКДанным = ИмяЭлемента;
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		ЭлементФормы.Подсказка = "Активация поля запускает обновление (актуализацию) данных ЭПД из Saby при каждом открытии формы документа 1С";
		ЭлементФормы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		ЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ОбщиеНастройкиЭПД_ОбновлениеПриОткрытии_Изменить");
	КонецЕсли;
	
	Возврат ЭлементФормы;
КонецФункции

Функция ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_СоздатьРеквизиты(Форма) Экспорт
	НовыеРеквизиты = Новый Массив;
	
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер
		.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_ИмяРеквизита();
	Если ESD_ТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(Форма, ИмяРеквизита_) Тогда
		Возврат НовыеРеквизиты;		
	КонецЕсли;
	
	РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита_, Новый ОписаниеТипов("Булево"));
	НовыеРеквизиты.Добавить(РеквизитФормы);
	
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);
	
	Возврат НовыеРеквизиты;	
КонецФункции

#КонецОбласти   

