
Процедура ОбщиеНастройкиЭПД_Инициализация(Форма, ГруппаВладелец) Экспорт
	ГруппаКонтейнер = ОбщиеНастройкиЭПД_Контейнер_ДобавитьНаФорму(Форма, ГруппаВладелец);
	ОбщиеНастройкиЭПД_СоздатьЭлементы(Форма, ГруппаКонтейнер);
	ОбщиеНастройкиЭПД_Загрузить(Форма);
КонецПроцедуры

Процедура ОбщиеНастройкиЭПД_СоздатьЭлементы(Форма, ГруппаКонтейнер) Экспорт
	ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_СоздатьЭлементы(Форма, ГруппаКонтейнер);
КонецПроцедуры

Процедура ОбщиеНастройкиЭПД_Загрузить(Форма) Экспорт
	ЗначенияНастроек = ESD_ТНОбщегоНазначенияСервер.СлужебныеНастройки_Загрузить();
	ЗаполнитьЗначенияСвойств(Форма, ЗначенияНастроек, "ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД");
КонецПроцедуры

Функция ОбщиеНастройкиЭПД_Контейнер_ДобавитьНаФорму(Форма, ГруппаВладелец) Экспорт
	ИмяГруппы = "ОбщиеНастройкиЭПД_Контейнер";
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если ГруппаФормы = Неопределено Тогда
		ГруппаФормы = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаВладелец);
		ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормы.Поведение = ПоведениеОбычнойГруппы.Обычное;
		ГруппаФормы.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		ГруппаФормы.РастягиватьПоГоризонтали = Истина;
		ГруппаФормы.РастягиватьПоВертикали = Ложь;
		ГруппаФормы.ОтображатьЗаголовок = Ложь;
	КонецЕсли;
	
	Возврат ГруппаФормы;
КонецФункции

Функция ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_СоздатьЭлементы(Форма, ГруппаВладелец) Экспорт
	ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_СоздатьРеквизиты(Форма);
	
	ИмяЭлемента = ESD_ОбщийФункционалКлиентСервер
		.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_ИмяРеквизита();
	ЭлементФормы = Форма.Элементы.Найти(ИмяЭлемента);
	Если ЭлементФормы = Неопределено Тогда
		ЭлементФормы = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаВладелец);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
		ЭлементФормы.ВидФлажка = ВидФлажка.Выключатель;
		ЭлементФормы.Заголовок = "Обновлять данные при открытии формы ЭПД";
		ЭлементФормы.ПутьКДанным = ИмяЭлемента;
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		ЭлементФормы.Подсказка = "Активация поля запускает обновление (актуализацию) данных ЭПД из Saby при каждом открытии формы документа 1С";
		ЭлементФормы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		ЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ОбщиеНастройкиЭПД_ОбновлениеПриОткрытии_Изменить");
	КонецЕсли;
	
	Возврат ЭлементФормы;
КонецФункции

Функция ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_СоздатьРеквизиты(Форма) Экспорт
	НовыеРеквизиты = Новый Массив;
	
	ИмяРеквизита_ = ESD_ОбщийФункционалКлиентСервер
		.ОбщиеНастройкиЭПД_ОбновлениеДанныхПриОткрытииФормыЭПД_ИмяРеквизита();
	Если ESD_ТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(Форма, ИмяРеквизита_) Тогда
		Возврат НовыеРеквизиты;		
	КонецЕсли;
	
	РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита_, Новый ОписаниеТипов("Булево"));
	НовыеРеквизиты.Добавить(РеквизитФормы);
	
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);
	
	Возврат НовыеРеквизиты;	
КонецФункции

