                     
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ЭтотОбъект.ТранспортноеСредствоСтрокой = МодульКода("ESD_ТНОбщегоНазначенияСервер").ТранспортныеСредстваСтрокой(ЭтотОбъект);
	
	ЭтотОбъект.Заказчик = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Отправитель").НаименованиеОрганизации;
		
	ЭтотОбъект.Перевозчик = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Перевозчик").НаименованиеОрганизации;
		
	Если ЭтотОбъект.ПредставительЗаказчика Тогда
		ЭтотОбъект.ПредставительЗаказчикаНаименование = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
			ЭтотОбъект.ДанныеЮрЛиц, "Оформитель").НаименованиеОрганизации;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТитулыДляПривязки") Тогда
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ПривязатьТитулыКДокументу(
			Ссылка,
			ДополнительныеСвойства.ТитулыДляПривязки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	РеквизитыДляОчистки = Новый Массив;
	
	// Служебные 
	РеквизитыДляОчистки.Добавить("ДатаИзменения");
	РеквизитыДляОчистки.Добавить("НомерСбис");
	РеквизитыДляОчистки.Добавить("Комментарий");
	РеквизитыДляОчистки.Добавить("КомментарийУведомление");
	РеквизитыДляОчистки.Добавить("ТекущиеЭтапы");
	РеквизитыДляОчистки.Добавить("ДокументОснование_Идентификатор");
	РеквизитыДляОчистки.Добавить("ДокументОснование_ОбъектМетаданных");
	
	// Титул 2
	РеквизитыДляОчистки.Добавить("ТранспортныеСредства");
	РеквизитыДляОчистки.Добавить("ОтветственныеЛица");
	РеквизитыДляОчистки.Добавить("СпецРазрешения");
	РеквизитыДляОчистки.Добавить("СтавкаНДС");
    РеквизитыДляОчистки.Добавить("СуммаБезНДС");
    РеквизитыДляОчистки.Добавить("СуммаСНДС");
    РеквизитыДляОчистки.Добавить("МеханизмРасчета");
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОчисткаРеквизитовОбъекта(ЭтотОбъект, РеквизитыДляОчистки);
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УдалитьСтрокиПоРоли(ЭтотОбъект.ДанныеЮрЛиц, "УполномоченноеЛицоПеревозчика");
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = "00";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьНаОснованииИспользуяНастройкиСопоставления(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий 

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеНаОснованииИспользуяНастройкиСопоставления

Процедура ЗаполнитьНаОснованииРасчетаСопоставлений(РезультатРасчетаПолей) Экспорт
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	МассивЮрЛиц = Новый Массив;
	МассивЮрЛиц.Добавить("Отправитель");
	МассивЮрЛиц.Добавить("Перевозчик");
	МассивЮрЛиц.Добавить("Оформитель");
	МассивЮрЛиц.Добавить("УполномоченноеЛицоПеревозчика");
	МодульТНОбщегоНазначенияСервер.ЗаполнитьДанныеЮрЛиц(ЭтотОбъект, РезультатРасчетаПолей, МассивЮрЛиц);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьТранспортныеСредства(ЭтотОбъект, РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьВодителей(ЭтотОбъект, РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьГрузы(ЭтотОбъект, РезультатРасчетаПолей);
	
	ЗаполнитьУполномоченныеЛицаЗаказчика(РезультатРасчетаПолей);
	
КонецПроцедуры

Процедура ЗаполнитьУполномоченныеЛицаЗаказчика(РезультатРасчетаПолей)
	
	УполномоченныеЛицаЗаказчика = РезультатРасчетаПолей["УполномоченныеЛицаЗаказчика"];
	Если УполномоченныеЛицаЗаказчика = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивЮрЛиц = Новый Массив;
	МассивЮрЛиц.Добавить("УполномоченноеЛицо");
	
	Для Каждого УполномоченноеЛицоЗаказчика Из УполномоченныеЛицаЗаказчика Цикл
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьДанныеЮрЛиц(ЭтотОбъект, УполномоченноеЛицоЗаказчика, МассивЮрЛиц);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОснованииИспользуяНастройкиСопоставления

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_CommonModule_Метаданные
#КонецОбласти // include_etrn_base_CommonModule_Метаданные
