                     
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ЭтотОбъект.ТранспортноеСредствоСтрокой = МодульКода("ESD_ТНОбщегоНазначенияСервер").ТранспортныеСредстваСтрокой(ЭтотОбъект);
	
	ЭтотОбъект.Заказчик = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Отправитель").НаименованиеОрганизации;
		
	ЭтотОбъект.Перевозчик = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Перевозчик").НаименованиеОрганизации;
		
	Если ЭтотОбъект.ПредставительЗаказчика Тогда
		ЭтотОбъект.ПредставительЗаказчикаНаименование = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
			ЭтотОбъект.ДанныеЮрЛиц, "Оформитель").НаименованиеОрганизации;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Направление) Тогда
		ЭтотОбъект.Направление = Метаданные().Реквизиты.Направление.ЗначениеЗаполнения;
	КонецЕсли;
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").УстановитьНомерДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТитулыДляПривязки") Тогда
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ПривязатьТитулыКДокументу(
			Ссылка,
			ДополнительныеСвойства.ТитулыДляПривязки);
	КонецЕсли;
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ПривязатьДокументОснование(
		Ссылка,
		ДокументОснование_ОбъектМетаданных,
		ДокументОснование_Идентификатор);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	РеквизитыДляОчистки = Новый Массив;
	
	// Служебные 
	РеквизитыДляОчистки.Добавить("ДокументОснование_ОбъектМетаданных");
	РеквизитыДляОчистки.Добавить("ДатаИзменения");
	РеквизитыДляОчистки.Добавить("НомерСбис");
	РеквизитыДляОчистки.Добавить("Комментарий");
	РеквизитыДляОчистки.Добавить("КомментарийУведомление");
	РеквизитыДляОчистки.Добавить("ТекущиеЭтапы");
	РеквизитыДляОчистки.Добавить("ДокументОснование_Идентификатор");
	РеквизитыДляОчистки.Добавить("Направление");
	
	// Титул 2
	РеквизитыДляОчистки.Добавить("ТранспортныеСредства");
	РеквизитыДляОчистки.Добавить("ОтветственныеЛица");
	РеквизитыДляОчистки.Добавить("СпецРазрешения");
	РеквизитыДляОчистки.Добавить("СтавкаНДС");
    РеквизитыДляОчистки.Добавить("СуммаБезНДС");
    РеквизитыДляОчистки.Добавить("СуммаСНДС");
    РеквизитыДляОчистки.Добавить("МеханизмРасчета");
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОчисткаРеквизитовОбъекта(ЭтотОбъект, РеквизитыДляОчистки);
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УдалитьСтрокиПоРоли(ЭтотОбъект.ДанныеЮрЛиц, "УполномоченноеЛицоПеревозчика");
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = "00";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипЗначенияЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗначенияЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("НовыйРедактор") Тогда
			МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьНаОснованииИспользуяНастройкиСопоставления(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий 

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеНаОснованииИспользуяНастройкиСопоставления

Функция ДоступныеПоляПоЭтапу(ТипТитула) Экспорт
	
	// Для первого титула фильтр не выполняется, так как по умолчанию на первом этапе можем заполнить все реквизиты.
	РезультатФункции = Новый Соответствие;
	ДобавитьДоступныеПоляУтверждения(РезультатФункции, ТипТитула);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьДоступныеПоляУтверждения(ДоступныеПоля, ТипТитула)
	
	Если ТипТитула <> Перечисления.ESD_ТипТитулаЗнп.Утверждение Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеПоля.Вставить("ТранспортноеСредство",          Истина);
	ДоступныеПоля.Вставить("СуммаБезНДС",                   Истина);
	ДоступныеПоля.Вставить("СтавкаНДС",                     Истина);
	ДоступныеПоля.Вставить("Прицепы",                       Истина);
	ДоступныеПоля.Вставить("Водители",                      Истина);
	ДоступныеПоля.Вставить("СуммаСНДС",                     Истина);
	ДоступныеПоля.Вставить("СпецРазрешения",                Истина);
	ДоступныеПоля.Вставить("УполномоченноеЛицоПеревозчика", Истина);
	ДоступныеПоля.Вставить("МеханизмРасчета",               Истина);
	ДоступныеПоля.Вставить("Ответственный_Ответственный",   Истина);
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииРасчетаСопоставлений(РезультатРасчетаПолей, ТипТитула, ПервоеОснование) Экспорт
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьСсылкиНаОбъекты(РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, РезультатРасчетаПолей, ПервоеОснование);
	
	МассивЮрЛиц = Новый Массив;
	МассивЮрЛиц.Добавить("Отправитель");
	МассивЮрЛиц.Добавить("Перевозчик");
	МассивЮрЛиц.Добавить("Оформитель");
	МассивЮрЛиц.Добавить("УполномоченноеЛицоПеревозчика");
	МодульТНОбщегоНазначенияСервер.ЗаполнитьДанныеЮрЛиц(ЭтотОбъект, РезультатРасчетаПолей, МассивЮрЛиц);
	
	МассивОтветственных = Новый Массив;
	МассивОтветственных.Добавить("Ответственный_Ответственный");
	МодульТНОбщегоНазначенияСервер.ЗаполнитьОтветственных(ЭтотОбъект, РезультатРасчетаПолей, МассивОтветственных);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьТранспортныеСредства(ЭтотОбъект, РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьВодителей(ЭтотОбъект, РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьГрузы(ЭтотОбъект, РезультатРасчетаПолей);
	
	ЗаполнитьАдресаПунктовВыгрузки(РезультатРасчетаПолей);
	
	ЗаполнитьАдресаПромежуточныхПунктов(РезультатРасчетаПолей);
	
	ЗаполнитьСпецРазрешения(РезультатРасчетаПолей);
	
	ЗаполнитьУполномоченныеЛицаЗаказчика(РезультатРасчетаПолей);
	
	ЗаполнитьОснованиеПредставителяЗаказчика(РезультатРасчетаПолей);
	
КонецПроцедуры

Процедура ЗаполнитьАдресаПунктовВыгрузки(РезультатРасчетаПолей)
	
	МодульТНОбщегоНазначенияСервер       = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ДанныеАдресовПунктовВыгрузки = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "АдресаПунктовВыгрузки", Новый Массив);
	Для Каждого ДанныеАдресаПунктаВыгрузки Из ДанныеАдресовПунктовВыгрузки Цикл
		СтрокаАдреса = АдресаПунктовВыгрузки.Добавить();
		МодульТНОбщегоНазначенияСервер.ЗаполнитьЗначенияИзСоответствия(СтрокаАдреса, ДанныеАдресаПунктаВыгрузки);
		
		Путь = Новый Массив;
		Путь.Добавить("АдресаПунктовВыгрузки.Организация");
		Путь.Добавить("Наименование");
		СтрокаАдреса.ОрганизацияСтрока = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеАдресаПунктаВыгрузки, Путь, "");
		
		Путь.Удалить(Путь.ВГраница());
		Путь.Добавить("ИНН");
		СтрокаАдреса.ОрганизацияИНН = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеАдресаПунктаВыгрузки, Путь, "");
		
		СтрокаАдреса.КлючСтроки_ДанныеЮрЛиц = МодульТНОбщегоНазначенияСервер.ЗаполнитьДанныеЮрЛица(
			ЭтотОбъект, ДанныеАдресаПунктаВыгрузки["АдресаПунктовВыгрузки.Организация"], "Отгрузчик");
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьАдресаПромежуточныхПунктов(РезультатРасчетаПолей)
	
	ДанныеАдресовПромежуточныхПунктов = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "АдресаПромежуточныхПунктов", Новый Массив);
	Для Каждого ДанныеАдресаПромежуточногоПункта Из ДанныеАдресовПромежуточныхПунктов Цикл
		СтрокаАдреса = АдресаПромежуточныхПунктов.Добавить();
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьЗначенияИзСоответствия(СтрокаАдреса, ДанныеАдресаПромежуточногоПункта);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСпецРазрешения(РезультатРасчетаПолей)
	
	ДанныеСпецРазрешений = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "СпецРазрешения", Новый Массив);
		
	Если ДанныеСпецРазрешений.Количество() > 0 Тогда
		СпецРазрешения.Очистить();
	КонецЕсли;
		
	Для Каждого ДанныеСпецРазрешения Из ДанныеСпецРазрешений Цикл
		СтрокаСпецРазрешения = СпецРазрешения.Добавить();
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьЗначенияИзСоответствия(СтрокаСпецРазрешения, ДанныеСпецРазрешения);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУполномоченныеЛицаЗаказчика(РезультатРасчетаПолей)
	
	ДанныеУполномоченныхЛицЗаказчика = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "УполномоченныеЛицаЗаказчика", Новый Массив);
	Для Каждого ДанныеУполномоченногоЛицаЗаказчика Из ДанныеУполномоченныхЛицЗаказчика Цикл
		КлючСтроки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьДанныеЮрЛица(
			ЭтотОбъект, ДанныеУполномоченногоЛицаЗаказчика["УполномоченныеЛицаЗаказчика.УполномоченноеЛицо"], "УполномоченноеЛицо");
			
		Если КлючСтроки > 0 Тогда
			СтрокаЮрЛица = ДанныеЮрЛиц.Найти(КлючСтроки, "КлючСтроки");
			Если СтрокаЮрЛица <> Неопределено Тогда
				МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьЗначенияИзСоответствия(
					СтрокаЮрЛица, ДанныеУполномоченногоЛицаЗаказчика);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОснованиеПредставителяЗаказчика(РезультатРасчетаПолей)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	ОснованиеПредставителя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "ПредставительЗаказчика_Основание.ESD_Ссылка");
	Если ЗначениеЗаполнено(ОснованиеПредставителя) Тогда
		ОтборОформителя = Новый Структура("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.Оформитель"));
		СтрокиЮрЛиц = МодульТНОбщегоНазначенияКлиентСервер.НайтиСтрокиУниверсально(ДанныеЮрЛиц, ОтборОформителя);
		Для Каждого СтрокаЮрЛица Из СтрокиЮрЛиц Цикл
			СтрокаЮрЛица.Основание = ОснованиеПредставителя;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОснованииИспользуяНастройкиСопоставления

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_CommonModule_Метаданные
#КонецОбласти // include_etrn_base_CommonModule_Метаданные
