                     
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ЭтотОбъект.ТранспортноеСредствоСтрокой = МодульКода("ESD_ТНОбщегоНазначенияСервер").ТранспортныеСредстваСтрокой(ЭтотОбъект);
	
	ЭтотОбъект.Заказчик = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Отправитель").НаименованиеОрганизации;
		
	ЭтотОбъект.Перевозчик = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Перевозчик").НаименованиеОрганизации;
		
	Если ЭтотОбъект.ПредставительЗаказчика Тогда
		ЭтотОбъект.ПредставительЗаказчикаНаименование = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
			ЭтотОбъект.ДанныеЮрЛиц, "Оформитель").НаименованиеОрганизации;
	КонецЕсли;
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").УстановитьНомерДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТитулыДляПривязки") Тогда
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ПривязатьТитулыКДокументу(
			Ссылка,
			ДополнительныеСвойства.ТитулыДляПривязки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	РеквизитыДляОчистки = Новый Массив;
	
	// Служебные 
	РеквизитыДляОчистки.Добавить("ДокументОснование_ОбъектМетаданных");
	РеквизитыДляОчистки.Добавить("ДатаИзменения");
	РеквизитыДляОчистки.Добавить("НомерСбис");
	РеквизитыДляОчистки.Добавить("Комментарий");
	РеквизитыДляОчистки.Добавить("КомментарийУведомление");
	РеквизитыДляОчистки.Добавить("ТекущиеЭтапы");
	РеквизитыДляОчистки.Добавить("ДокументОснование_Идентификатор");
	
	// Титул 2
	РеквизитыДляОчистки.Добавить("ТранспортныеСредства");
	РеквизитыДляОчистки.Добавить("ОтветственныеЛица");
	РеквизитыДляОчистки.Добавить("СпецРазрешения");
	РеквизитыДляОчистки.Добавить("СтавкаНДС");
    РеквизитыДляОчистки.Добавить("СуммаБезНДС");
    РеквизитыДляОчистки.Добавить("СуммаСНДС");
    РеквизитыДляОчистки.Добавить("МеханизмРасчета");
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОчисткаРеквизитовОбъекта(ЭтотОбъект, РеквизитыДляОчистки);
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").УдалитьСтрокиПоРоли(ЭтотОбъект.ДанныеЮрЛиц, "УполномоченноеЛицоПеревозчика");
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = "00";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипЗначенияЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗначенияЗаполнения = Тип("Массив") Тогда
		
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьНаОснованииИспользуяНастройкиСопоставления(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий 

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеНаОснованииИспользуяНастройкиСопоставления

Процедура ЗаполнитьНаОснованииРасчетаСопоставлений(РезультатРасчетаПолей) Экспорт
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьСсылкиНаОбъекты(РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, РезультатРасчетаПолей);
	
	МассивЮрЛиц = Новый Массив;
	МассивЮрЛиц.Добавить("Отправитель");
	МассивЮрЛиц.Добавить("Перевозчик");
	МассивЮрЛиц.Добавить("Оформитель");
	МассивЮрЛиц.Добавить("УполномоченноеЛицоПеревозчика");
	МодульТНОбщегоНазначенияСервер.ЗаполнитьДанныеЮрЛиц(ЭтотОбъект, РезультатРасчетаПолей, МассивЮрЛиц);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьТранспортныеСредства(ЭтотОбъект, РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьВодителей(ЭтотОбъект, РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьГрузы(ЭтотОбъект, РезультатРасчетаПолей);
	
	ЗаполнитьАдресаПунктовВыгрузки(РезультатРасчетаПолей);
	
	ЗаполнитьАдресаПромежуточныхПунктов(РезультатРасчетаПолей);
	
	ЗаполнитьСпецРазрешения(РезультатРасчетаПолей);
	
	ЗаполнитьУполномоченныеЛицаЗаказчика(РезультатРасчетаПолей);
	
КонецПроцедуры

Процедура ЗаполнитьАдресаПунктовВыгрузки(РезультатРасчетаПолей)
	
	МодульТНОбщегоНазначенияСервер       = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ДанныеАдресовПунктовВыгрузки = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "АдресаПунктовВыгрузки", Новый Массив);
	Для Каждого ДанныеАдресаПунктаВыгрузки Из ДанныеАдресовПунктовВыгрузки Цикл
		СтрокаАдреса = АдресаПунктовВыгрузки.Добавить();
		МодульТНОбщегоНазначенияСервер.ЗаполнитьЗначенияИзСоответствия(СтрокаАдреса, ДанныеАдресаПунктаВыгрузки);
		
		Путь = Новый Массив;
		Путь.Добавить("АдресаПунктовВыгрузки.Организация");
		Путь.Добавить("Наименование");
		СтрокаАдреса.ОрганизацияСтрока = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеАдресаПунктаВыгрузки, Путь, "");
		
		Путь.Удалить(Путь.ВГраница());
		Путь.Добавить("ИНН");
		СтрокаАдреса.ОрганизацияИНН = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеАдресаПунктаВыгрузки, Путь, "");
		
		СтрокаАдреса.КлючСтроки_ДанныеЮрЛиц = МодульТНОбщегоНазначенияСервер.ЗаполнитьДанныеЮрЛица(
			ЭтотОбъект, ДанныеАдресаПунктаВыгрузки["АдресаПунктовВыгрузки.Организация"], "Отгрузчик");
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьАдресаПромежуточныхПунктов(РезультатРасчетаПолей)
	
	ДанныеАдресовПромежуточныхПунктов = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "АдресаПромежуточныхПунктов", Новый Массив);
	Для Каждого ДанныеАдресаПромежуточногоПункта Из ДанныеАдресовПромежуточныхПунктов Цикл
		СтрокаАдреса = АдресаПромежуточныхПунктов.Добавить();
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьЗначенияИзСоответствия(СтрокаАдреса, ДанныеАдресаПромежуточногоПункта);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСпецРазрешения(РезультатРасчетаПолей)
	
	ДанныеСпецРазрешений = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "СпецРазрешения", Новый Массив);
	Для Каждого ДанныеСпецРазрешения Из ДанныеСпецРазрешений Цикл
		СтрокаСпецРазрешения = СпецРазрешения.Добавить();
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьЗначенияИзСоответствия(СтрокаСпецРазрешения, ДанныеСпецРазрешения);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУполномоченныеЛицаЗаказчика(РезультатРасчетаПолей)
	
	ДанныеУполномоченныхЛицЗаказчика = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "УполномоченныеЛицаЗаказчика", Новый Массив);
	Для Каждого ДанныеУполномоченногоЛицаЗаказчика Из ДанныеУполномоченныхЛицЗаказчика Цикл
		КлючСтроки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьДанныеЮрЛица(
			ЭтотОбъект, ДанныеУполномоченногоЛицаЗаказчика["УполномоченныеЛицаЗаказчика.УполномоченноеЛицо"], "УполномоченноеЛицо");
			
		Если КлючСтроки > 0 Тогда
			СтрокаЮрЛица = ДанныеЮрЛиц.Найти(КлючСтроки, "КлючСтроки");
			Если СтрокаЮрЛица <> Неопределено Тогда
				МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьЗначенияИзСоответствия(
					СтрокаЮрЛица, ДанныеУполномоченногоЛицаЗаказчика);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОснованииИспользуяНастройкиСопоставления

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_CommonModule_Метаданные
#КонецОбласти // include_etrn_base_CommonModule_Метаданные
