
#Область ПрограммныйИнтерфейс

// Возвращает массив типов доступных для заполнения на основании.
//
// Параметры:
//  ЗначенияПоУмолчанию - Булево - признак получения типов по умолчанию
//
// Возвращаемое значение:
//   Массив - массив типов выбранных для заполнения на основании.
//
Функция ТипыДляЗаполненияНаОсновании(ЗначенияПоУмолчанию = Ложь) Экспорт
	
	Если Не ЗначенияПоУмолчанию Тогда
		РезультатФункции = ПользовательскиеТипыДляЗаполненияНаОсновании();
	Иначе
		РезультатФункции = Неопределено;
	КонецЕсли;
	
	Если РезультатФункции = Неопределено Тогда
		РезультатФункции = ТипыПоУмолчаниюДляЗаполненияНаОсновании();
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Сохраняет выбранные типы документов для заполнения на основании выбранные пользователем.
//
// Параметры:
//  МассивТипов - Массив - массив типов
//
Процедура СохранитьВыбранныеТипыДляЗаполненияНаОсновании(МассивТипов) Экспорт
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ХранилищеОбщихНастроек.Сохранить("Saby", "ТипыДляЗаполненияНаОснованииДокументаЗнП", МассивТипов);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Возвращает структуру реквизитов документа, относящиеся титулу
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка.ESD_ЗаказНаПеревозку - ссылка на документ
//  ТипТитула - ПеречислениеСсылка.ESD_ТипТитулаЗнП - ссылка на тип титула
//
// Возвращаемое значение:
//   Структура - структура полученных данных документа
//
Функция ДанныеДокумента(СсылкаНаДокумент, ТипТитула) Экспорт
	
	ЭтоПервыйТитул = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
		ЗаказНаПеревозку(), "ЭтоПервыйТитул", ТипТитула);
	
	Если ЭтоПервыйТитул Тогда
		
		РезультатФункции = ВыгрузкаДанныеОформление(СсылкаНаДокумент);
		
	ИначеЕсли ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЗнП.Утверждение") Тогда
		
		РезультатФункции = ВыгрузкаДанныеУтверждение(СсылкаНаДокумент);
		
	Иначе
		
		РезультатФункции = Новый Структура;
		
	КонецЕсли;
	
	РезультатФункции.Вставить("ТипТитула", ТипТитула);
	
	Возврат РезультатФункции;
	
КонецФункции

// Добавляет данные титулов для выгрузки на онлайн
//
// Параметры:
//  ТекущийЭтап - ПеречислениеСсылка.ESD_ТипДокументаЗнП - тип текущего титула
//  ДанныеТитула - Структура - структура реквизитов и таблиц документа для выгрузки
//
// Возвращаемое значение:
//   Структура - структура титула для отправки
//
Функция ВложениеНаВыгрузку(ТекущийЭтап, ДанныеТитула) Экспорт
	
	ЭтоПервыйТитул = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
		ЗаказНаПеревозку(), "ЭтоПервыйТитул", ТекущийЭтап);
	
	Если ЭтоПервыйТитул Тогда
		
		Возврат ТитулОформление(ДанныеТитула);
		
	ИначеЕсли ТекущийЭтап = ЗначениеМетаданных("ESD_ТипТитулаЗнП.Утверждение") Тогда
		
		СтруктураТитула = ТитулУтверждение(ДанныеТитула);
		
		СтруктураТитула.Вставить("СторонняяОрганизация", Истина);
		
		Возврат СтруктураТитула;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции
 
#КонецОбласти // ПрограммныйИнтерфейс

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДобавитьПоляПредставления(Поля);
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПредставлениеДокумента(Данные);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныйПрограммныйИнтерфейс

#Область Команды

// Заполняет список команд печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти // Команды

#Область ИнтерфейсФЛК

// Возвращает параметры для выполнения ФЛК
//
// Параметры:
//  ДанныеДокумента - Структура - структура реквизитов и табличных частей документа
//  ПараметрыВыгрузки - Структура - см. ESD_ТНОбщегоНазначенияКлиентСервер.ПараметрыВыгрузки
//
// Возвращаемое значение:
//   Структура - структура данных для дальнейшей проверки реквизитов
//
Функция ПараметрыПроверкиРеквизитов(ДанныеДокумента, ПараметрыВыгрузки) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ПроверяемыеРеквизиты", Новый Массив);
		
	ЭтоПервыйТитул = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
		ЗаказНаПеревозку(), "ЭтоПервыйТитул", ПараметрыВыгрузки.ТипТитула);
	
	Если ЭтоПервыйТитул Тогда
		
		ДополнитьПроверяемыеРеквизитыЭтапаОформление(ДанныеДокумента, РезультатФункции.ПроверяемыеРеквизиты);
		
	ИначеЕсли ПараметрыВыгрузки.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЗнП.Утверждение") Тогда
		
		ДополнитьПроверяемыеРеквизитыЭтапаУтверждение(ДанныеДокумента, РезультатФункции.ПроверяемыеРеквизиты);
		
	Иначе
		РезультатФункции.ПроверяемыеРеквизиты = Новый Массив;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Возвращает имя таблицы документа с учетом специфики
//
// Параметры:
//  ИмяТабличнойЧасти - Строка - наименование табличной части из конфигуратора
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти - строка табличной части документа
//  ДанныеДокумента - Структура - структура реквизитов и табличных частей документа
//
// Возвращаемое значение:
//   Строка - наименование таблицы на форме документа
//
Функция ИмяТЧДокумента(ИмяТабличнойЧасти, СтрокаТабличнойЧасти, ДанныеДокумента) Экспорт
	
	Если ИмяТабличнойЧасти = "ДанныеЮрЛиц" Тогда
		Если СтрокаТабличнойЧасти.Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицо") Тогда
			РезультатФункции = "УполномоченныеЛицаЗаказчика";
		ИначеЕсли СтрокаТабличнойЧасти.Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.Заказчик") Тогда
			РезультатФункции = "Грузы";
		Иначе
			РезультатФункции = ИмяТабличнойЧасти;
		КонецЕсли;
	ИначеЕсли ИмяТабличнойЧасти = "ОтветственныеЛица"
		И СтрокаТабличнойЧасти.Роль = ЗначениеМетаданных("ESD_РолиОтветственных.Водитель") Тогда
		РезультатФункции = "Водители";
	Иначе 
		РезультатФункции = ИмяТабличнойЧасти;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПроверятьРеквизитДокумента(ИмяРеквизита, ДанныеДокумента) Экспорт
	
	Если ИмяРеквизита = "ПредставительЗаказчикаНаименование" Или ИмяРеквизита = "ПредставительЗаказчика_Основание" Тогда
		Возврат ДанныеДокумента.ПредставительЗаказчика;
	ИначеЕсли ИмяРеквизита = "Договор" Тогда
		Возврат ДанныеДокумента.ТипДокумента = ЗначениеМетаданных("ESD_ТипДокументаЗнП.Заявка");
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Возвращает признак необходимости ФЛК реквизитов табличной части документа
//
// Параметры:
//  СтрокаТЧ - СтрокаТаблицыЗначений - строка табличной части документа
//  ИмяТЧ - Строка - имя табличной части документа
//  Реквизит - Структура - см. функцию ФЛК()
//  ДанныеДокумента - Структура - структура реквизитов и табличных частей документа
//
// Возвращаемое значение:
//   Булево - Истина, если проверять необходимо
//
Функция ПроверятьРеквизитТЧДокумента(СтрокаТЧ, ИмяТЧ, Реквизит, ДанныеДокумента) Экспорт
	
	Если ИмяТЧ = "ДанныеЮрЛиц" Тогда
		РезультатФункции = ПроверятьДанныеЮрЛица(СтрокаТЧ, ИмяТЧ, Реквизит, ДанныеДокумента);
	ИначеЕсли ИмяТЧ = "ОтветственныеЛица" Тогда
		РезультатФункции = ПроверятьРеквизитОтветственного(СтрокаТЧ, Реквизит.РеквизитОбъекта);
	ИначеЕсли ИмяТЧ = "УполномоченныеЛицаЗаказчика" Тогда
		РезультатФункции = ПроверятьДанныеУполномоченногоЛицаЗаказчика(СтрокаТЧ, Реквизит, ДанныеДокумента);		
	ИначеЕсли ИмяТЧ = "СпецРазрешения" Тогда
		РезультатФункции = ПроверятьРеквизитыСпецРазрешения(СтрокаТЧ, Реквизит.РеквизитОбъекта);
	ИначеЕсли ИмяТЧ = "АдресаПунктовВыгрузки" Тогда
		РезультатФункции = ПроверятьДанныеАдресовПунктовВыгрузки(СтрокаТЧ, ИмяТЧ, Реквизит, ДанныеДокумента);
	ИначеЕсли ИмяТЧ = "Грузы" Тогда
		РезультатФункции = ПроверятьРеквизитыГруза(СтрокаТЧ, Реквизит);
	Иначе
		РезультатФункции = Истина;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Изменяет параметры реквизита для отображения ошибки.
//
// Параметры:
//  СтрокаТЧ - СтрокаТаблицыЗначений - строка табличной части документа
//  ИмяТЧ - Строка - имя табличной части документа
//  Реквизит - Структура - см. функцию ФЛК()
//  ДанныеДокумента - Структура - структура реквизитов и табличных частей документа
//
// Возвращаемое значение:
//   Структура - см. функцию ФЛК
//
Функция ИзменитьРеквизитТЧ(СтрокаТЧ, ИмяТЧ, Реквизит, ДанныеДокумента) Экспорт
	
	Если ИмяТЧ = "Водители" Тогда
		НовыйРеквизит = РеквизитВодителя(Реквизит.РеквизитОбъекта);
	ИначеЕсли ИмяТЧ = "УполномоченныеЛицаЗаказчика" Тогда
		НовыйРеквизит = РеквизитУполномоченногоЛицаЗаказчика(СтрокаТЧ, Реквизит, ДанныеДокумента);
	ИначеЕсли ИмяТЧ = "ДанныеЮрЛиц" Или ИмяТЧ = "Грузы" Тогда
		НовыйРеквизит = НовыйРеквизитЮрЛица(СтрокаТЧ, Реквизит, ДанныеДокумента);
	Иначе
		НовыйРеквизит = Неопределено;
	КонецЕсли;
	
	Если НовыйРеквизит = Неопределено Тогда
		Возврат Реквизит;
	КонецЕсли;
	
	Возврат НовыйРеквизит;
	
КонецФункции

// Выполняет нестандартные проверки ФЛК с логикой сложнее, чем заполнен незаполнен.
//
// Параметры:
//  ДанныеДокумента - Структура - структура реквизитов и табличных частей документа
//  ПараметрыВыгрузки - Структура - см. ESD_ТНОбщегоНазначенияКлиентСервер.ПараметрыВыгрузки
//  Ошибки - Массив,Неопределено - массив для накопления ошибок
//
Процедура ВыполнитьДополнительныеПроверкиФЛК(ДанныеДокумента, ПараметрыВыгрузки, Ошибки) Экспорт
		
	ЭтоПервыйТитул = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
		ЗаказНаПеревозку(), "ЭтоПервыйТитул", ПараметрыВыгрузки.ТипТитула);
		
	Если ЭтоПервыйТитул Тогда
		
		ДопПроверкиФЛКОформление(ДанныеДокумента, ПараметрыВыгрузки, Ошибки);
		
	ИначеЕсли ПараметрыВыгрузки.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЗнП.Утверждение") Тогда
		
		ДопПроверкиФЛКУтверждение(ДанныеДокумента, ПараметрыВыгрузки, Ошибки);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти // ИнтерфейсФЛК

Функция ТекущиеЭтапыДокумента(Форма) Экспорт
	
	РезультатФункции = Новый Массив;
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	ДанныеСостояния = МодульТНОбщегоНазначенияСервер.ДанныеСостоянияОбъекта(Форма.Объект.Ссылка);
	Если ДанныеСостояния <> Неопределено Тогда
		ТекущийТитул = МодульТНОбщегоНазначенияСервер.РезультатФункцииТитулов(
			ЗаказНаПеревозку(), "ЗначениеПоПредставлению", ДанныеСостояния.АктивныйЭтап);
	Иначе
		ТекущийТитул = МодульТНОбщегоНазначенияСервер.РезультатФункцииТитулов(ЗаказНаПеревозку(), "ПервыйТитул");
	КонецЕсли;
	
	РезультатФункции.Добавить(ТекущийТитул);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ВложенияЗагружены(Вложения, Титул, ОбъектДок, ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Вложения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВложенияМассив = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеВМассив(Вложения);
	
	Если Титул = ЗначениеМетаданных("ESD_ТипТитулаЗнП.Оформление") Тогда
		
		ЗагрузкаТитулаОформление(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
		
	ИначеЕсли Титул = ЗначениеМетаданных("ESD_ТипТитулаЗнП.Утверждение") Тогда
		
		ЗагрузкаТитулаУтверждение(ОбъектДок, ВложенияМассив, Титул, ДопПараметры);
				
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ТитулыДляЗагрузки(ОбъектДок, ПараметрыЗагрузки) Экспорт
	
	ТекущиеЗначения = МодульКода("ESD_ТНЗагрузкаСервер").ТекущиеЗначенияДокумента(ОбъектДок, ПараметрыЗагрузки);
	
	Этап = ТекущиеЗначения.Титул;
	
	Если ЗначениеЗаполнено(ТекущиеЗначения.Состояние) Тогда
		КодСостояния = МодульКода("ESD_ТНОбщегоНазначенияСервер").КодСостояния(ТекущиеЗначения.Состояние);
	КонецЕсли;   
	
	ТипыТитулов = МодульКода("ESD_ТНОбщегоНазначенияСервер").ВсеЗначенияПеречисления(ТипТитулаЗнП());
	
    МассивТитуловДляЗагрузки = Новый Массив;
	
	ДОЗавершенУспешно      = 7;
	ДОЗавершенОтрицательно = 9;
	
	ИмяТитулаОформление = "Оформление";

	Если КодСостояния = ДОЗавершенУспешно Или КодСостояния = ДОЗавершенОтрицательно Тогда
		
		Если ПараметрыЗагрузки.ТолькоАктивныйЭтап Тогда
			МассивТитуловДляЗагрузки.Добавить(Этап);
		Иначе
			МассивТитуловДляЗагрузки.Добавить(ТипыТитулов[ИмяТитулаОформление]);
			МассивТитуловДляЗагрузки.Добавить(ТипыТитулов["Утверждение"]);
		КонецЕсли;
		
		Возврат МассивТитуловДляЗагрузки;	
		
	КонецЕсли;	
	
	Если ПараметрыЗагрузки.ТолькоАктивныйЭтап Тогда
		
		// В регистре состояния нет данных о текущем этапе, при этом документооборот не завершен.
		Если Не ЗначениеЗаполнено(Этап) Тогда
			МассивТитуловДляЗагрузки.Добавить(ТипыТитулов[ИмяТитулаОформление]);
		Иначе
			МассивТитуловДляЗагрузки.Добавить(Этап);
		КонецЕсли;
		
	Иначе
		
		МассивТитуловДляЗагрузки.Добавить(ТипыТитулов[ИмяТитулаОформление]);
		МассивТитуловДляЗагрузки.Добавить(ТипыТитулов["Утверждение"]);
		
	КонецЕсли;
	
	Возврат МассивТитуловДляЗагрузки;

КонецФункции

#Область ЗаполнениеНаОснованииИНИИнтерфейс

Процедура СформироватьНовыеОснования(СтруктураРезультата, ДанныеИзИНИ) Экспорт
	
	ГрузоотправительСсылка = ДанныеИзИНИ["ГрузоотправительСсылка"];
	
	Если ЗначениеЗаполнено(ГрузоотправительСсылка) Тогда
		
		СтруктураОснования = МодульКода("ESD_ТНОбщегоНазначенияСервер").СтруктураОснования(
			ГрузоотправительСсылка, "", "Отправитель");
		СтруктураРезультата.НовыеОснования.Добавить(СтруктураОснования);
		
	КонецЕсли;
	
	ГрузоперевозчикСсылка = ДанныеИзИНИ["ГрузоперевозчикСсылка"];
	Если ЗначениеЗаполнено(ГрузоперевозчикСсылка) Тогда
		СтруктураОснования = МодульКода("ESD_ТНОбщегоНазначенияСервер").СтруктураОснования(
			ГрузоперевозчикСсылка, "", "Перевозчик");
		СтруктураРезультата.НовыеОснования.Добавить(СтруктураОснования);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьПодстановки(ДанныеИзИНИ, ПараметрыЗаполнения) Экспорт
	
	Если ПараметрыЗаполнения.РольКонтрагента = "Отправитель" Тогда
		ДополнитьПодстановкиГрузоотправителя(ДанныеИзИНИ, ПараметрыЗаполнения);
	ИначеЕсли ПараметрыЗаполнения.РольКонтрагента = "Перевозчик" Тогда
		ДополнитьПодстановкиГрузоперевозчика(ДанныеИзИНИ, ПараметрыЗаполнения);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОснованииИНИИнтерфейс

Функция ДоступныеОрганизацииЭтапы(ОбъектДок, ПараметрыЗагрузки) Экспорт
	
	РезультатФункции = Новый Соответствие;
	
	ДанныеНашейОрганизации = МодульКода("ESD_ТНЗагрузкаСервер").ИННКППОрганизации(
		ПараметрыЗагрузки.ДанныеДокумента["НашаОрганизация"]);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.Отправитель"));
	СтруктураПоиска.Вставить("ИНН",  ДанныеНашейОрганизации.ИНН);
	СтруктураПоиска.Вставить("КПП",  ДанныеНашейОрганизации.КПП);
	НайденныеСтроки = ОбъектДок.ДанныеЮрЛиц.НайтиСтроки(СтруктураПоиска);
	
	ЭтоОрганизацияОтправитель = НайденныеСтроки.Количество() > 0
		И МодульКода("ESD_ТНОбщегоНазначенияСервер").ОрганизацияПрисутствуетВБазе(СтруктураПоиска.ИНН, СтруктураПоиска.КПП);
		
	СтруктураПоиска.Вставить("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.Перевозчик"));
	НайденныеСтроки = ОбъектДок.ДанныеЮрЛиц.НайтиСтроки(СтруктураПоиска);
	
	ЭтоОрганизацияПеревозчик = НайденныеСтроки.Количество() > 0
		И МодульКода("ESD_ТНОбщегоНазначенияСервер").ОрганизацияПрисутствуетВБазе(СтруктураПоиска.ИНН, СтруктураПоиска.КПП);
	
	Для Каждого ТекущийЭтап Из ПараметрыЗагрузки.ДанныеДокумента["ТекущиеЭтапы"] Цикл
		
		НаименованиеЭтапа = ТекущийЭтап["Наименование"];
		
		ЭтапДоступен = (НаименованиеЭтапа = "Оформление" И ЭтоОрганизацияОтправитель)
			Или (НаименованиеЭтапа = "Утверждение" И ЭтоОрганизацияПеревозчик);

		Если ЭтапДоступен Тогда
			РезультатФункции.Вставить(НаименованиеЭтапа, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьДополнительныеДанныеВЛенту(МенеджерВременныхТаблиц, СсылкаНаДокумент) Экспорт
	
	Возврат ;
	
КонецПроцедуры

#Область Печать

Функция ТекущаяПечатнаяФорма() Экспорт
	Возврат ЗагрузитьНастройки("ПечатнаяФорма");
КонецФункции

Функция ПечатнаяФормаПоУмолчанию() Экспорт
	Возврат Неопределено;
КонецФункции

#КонецОбласти // Печать

#Область РаботаСХранилищемНастроек

Процедура СохранитьНастройки(СтруктураНастроек) Экспорт
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ESD_СохранитьНастройкиОбъекта(КлючОбщихНастроек(), СтруктураНастроек); 	
КонецПроцедуры

Функция ЗагрузитьНастройки(Ключи) Экспорт
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").ESD_ЗагрузитьНастройкиОбъекта(КлючОбщихНастроек(), Ключи);	
КонецФункции
	
#КонецОбласти

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПользовательскиеТипыДляЗаполненияНаОсновании()
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	РезультатФункции = ХранилищеОбщихНастроек.Загрузить("Saby", "ТипыДляЗаполненияНаОснованииДокументаЗнП");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТипыПоУмолчаниюДляЗаполненияНаОсновании()
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	ДокументыОснования = Новый Массив;
	
	ДоступнаяКонфигурация = МодульТНОбщегоНазначенияСервер.ЭтоДоступнаяКонфигурация();			
	НашаКонфигурация       = ДоступнаяКонфигурация.Имя;
	
	Если Не ДоступнаяКонфигурация.Поддержана Или НашаКонфигурация = "УАТ" Тогда
		Возврат ДокументыОснования;
	КонецЕсли;
		
	ДокументыОснования.Добавить("Документы.РеализацияТоваровУслуг");
	Если НашаКонфигурация = "УТ10" Или НашаКонфигурация = "УПП" Тогда
		ДокументыОснования = МодульТНОбщегоНазначенияСервер.ДоступныеТипыМетаданных(ДокументыОснования);
		Возврат ДокументыОснования.Типы();
	КонецЕсли;
	
	ДокументыОснования.Добавить("Документы.ВозвратТоваровПоставщику");
	ДокументыОснования.Добавить("Документы.КорректировкаРеализации");
	ДокументыОснования.Добавить("Документы.ПеремещениеТоваров");
	
	Если НашаКонфигурация <> "Бух3" Тогда
		
		ДокументыОснования.Добавить("Документы.ТранспортнаяНакладная");
		ДокументыОснования.Добавить("Документы.ОтгрузкаТоваровСХранения");
		ДокументыОснования.Добавить("Документы.ПередачаТоваровХранителю");
		
	КонецЕсли;	
	
	Если НашаКонфигурация = "ERP" Тогда
		
		ДокументыОснования.Добавить("Документы.ВозвратСырьяДавальцу");
		ДокументыОснования.Добавить("Документы.ПередачаДавальцу");
		ДокументыОснования.Добавить("Документы.ПередачаСырьяПереработчику");
		
	КонецЕсли;
			
	Если НашаКонфигурация = "КА" Тогда
		ДокументыОснования.Добавить("Документы.ПередачаСырьяПереработчику");
	КонецЕсли;
	
	ДокументыОснования = МодульТНОбщегоНазначенияСервер.ДоступныеТипыМетаданных(ДокументыОснования);
	
	Возврат ДокументыОснования.Типы();
	
КонецФункции

#Область ФЛК

Функция ФЛК(РеквизитОбъектаЗнП, ЭлементФормыЗнП, ОшибкаЗнП)
	
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").СтруктураФЛК(РеквизитОбъектаЗнП, ЭлементФормыЗнП, ОшибкаЗнП);
	
КонецФункции

Процедура ДополнитьПроверяемыеРеквизитыЭтапаОформление(ДанныеДокумента, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("Заказчик", "ОтправительСтрокой", "Не заполнен заказчик"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ПредставительЗаказчикаНаименование", "ОформительСтрокой", "Не заполнено наименование представителя заказчика"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ПредставительЗаказчика_Основание", "Оформитель_Основание", "Не заполнено основание представителя заказчика"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Перевозчик", "ПеревозчикСтрокой", "Не заполнен перевозчик"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Договор", "Договор", "Не заполнен договор"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("СпецУсловия", "СпецУсловия", "Не заполнены указания для выполнения норм установленных законодательством РФ"));
		
	ФЛК = ФЛК("ТребованияКТС",
		"ТребованияКТС",
		"Не заполнены требования о необходимости предоставления ТС для перевозки пищевых продуктов");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("ПодачаАдрес", "ДекорацияЗаполнитьПодачаТС", "Не заполнен адрес пункта подачи ТС"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ПодачаДатаВремя", "ПодачаДата", "Не заполнена дата подачи ТС"));
	
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("АдресаПунктовВыгрузки", "АдресаПунктовВыгрузки", "В списке пунктов погрузки/выгрузки не введено ни одной строки"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("АдресаПунктовВыгрузки.Значение", "АдресаПунктовВыгрузкиЗначение", "Не заполнен адрес погрузки/выгрузки"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("АдресаПунктовВыгрузки.ДатаВремя", "АдресаПунктовВыгрузкиДатаВремя", "Не заполнена дата погрузки/выгрузки"));
	ФЛК = ФЛК("АдресаПунктовВыгрузки.ОрганизацияСтрока",
		"АдресаПунктовВыгрузкиОрганизацияСтрока",
		"Не заполнена организация пункта погрузки");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("Грузы", "Грузы", "В списке грузов не введено ни одной строки"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Грузы.Тип", "ГрузыТип", "Не заполнен тип груза"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Грузы.Наименование", "ГрузыНаименование", "Не заполнено наименование груза"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Грузы.Состояние", "ГрузыСостояние", "Не заполнено состояние груза"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Грузы.Количество", "ГрузыКоличество", "Не заполнено количество в грузе"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Грузы.МассаБрутто", "ГрузыМассаБрутто", "Не заполнена масса брутто груза"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Грузы.ВидТары", "ГрузыВидТары", "Не заполнен вид тары в грузе"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("Грузы.МетодОпределенияМассы", "ГрузыМетодОпределенияМассы", "Не заполнен метод определения массы грузовых мест"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Грузы.Объем", "ГрузыОбъем", "Не заполнен объем грузовых мест"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Грузы.Длина", "ГрузыДлина", "Не заполнена длина грузового места"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Грузы.Ширина", "ГрузыШирина", "Не заполнена ширина грузового места"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("Грузы.Высота", "ГрузыВысота", "Не заполнена высота грузового места"));
	ФЛК = ФЛК("Грузы.РаспределениеПоДлинеПлатформы",
		"ГрузыРаспределениеПоДлинеПлатформы",
		"Не указана возможность распределения груза по длине платформы");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ПроверяемыеРеквизиты.Добавить(ФЛК("Грузы.Делимость", "ГрузыДелимость", "Не заполнена делимость груза"));
	
	ГрузыОпасныйГруз = "ГрузыОпасныйГруз";
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("Грузы.ОпасныйГрузНаименование", ГрузыОпасныйГруз, "Не заполнено наименование опасного груза"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("Грузы.НомерООН", ГрузыОпасныйГруз, "Не заполнен номер ООН опасного груза"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("Грузы.Класс", ГрузыОпасныйГруз, "Не заполнен класс опасного груза"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("Грузы.КлассификационныйКод", ГрузыОпасныйГруз, "Не заполнен классификационный код опасного груза"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("Грузы.ГруппаУпаковкиЗначение", ГрузыОпасныйГруз, "Не заполнена группа упаковки опасного груза"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("Грузы.ЗнакОпасности", ГрузыОпасныйГруз, "Не заполнен знак опасности опасного груза"));
	ФЛКОграничениеПроездаЧерезТуннели = ФЛК(
		"Грузы.ОграничениеПроездаЧерезТуннели",
		ГрузыОпасныйГруз,
		"Не заполнено ограничение проезда через туннели опасного груза");
	ПроверяемыеРеквизиты.Добавить(ФЛКОграничениеПроездаЧерезТуннели);
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("ТипТС", "ТипТС", "Не заполнен тип ТС"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ГрузоподъемностьТС", "ГрузоподъемностьТС", "Не заполнена грузоподъемность ТС"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ВместимостьТС", "ВместимостьТС", "Не заполнена вместимость ТС"));
	
	ФЛК = ФЛК("ДанныеЮрЛиц.Полномочия",
		"УполномоченныеЛицаЗаказчикаПолномочия",
		"Не заполнены полномочия уполномоченного лица заказчика");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ФЛК = ФЛК("ДанныеЮрЛиц.Основание",
		"УполномоченныеЛицаЗаказчикаОснование",
		"Не заполнено основание уполномоченного лица заказчика");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ФЛК = ФЛК("ДанныеЮрЛиц.Телефон",
		"УполномоченноеЛицо_Телефон",
		"Не заполнен телефон уполномоченного лица заказчика");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ПроверяемыеРеквизиты.Добавить(ФЛК("ДанныеЮрЛиц.Адрес", "", "Не заполнен адрес юр. лица"));
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("ДанныеЮрЛиц.ИНН",     "", "Не заполнен ИНН юр. лица"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ДанныеЮрЛиц.Имя",     "", "Не заполнено Имя юр. лица"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ДанныеЮрЛиц.Фамилия", "", "Не заполнена Фамилия юр. лица"));
	
КонецПроцедуры

Процедура ДополнитьПроверяемыеРеквизитыЭтапаУтверждение(ДанныеДокумента, ПроверяемыеРеквизиты)
	
	ПрицепыРегистрационныйНомер = "ПрицепыРегистрационныйНомер";
	
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ТранспортныеСредства.РегистрационныйНомер", ПрицепыРегистрационныйНомер, "Не заполнен регистрационный номер"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ТранспортныеСредства.ТипВладения", ПрицепыРегистрационныйНомер, "Не заполнен тип владения"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ТранспортныеСредства.Тип", ПрицепыРегистрационныйНомер, "Не заполнен тип"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ТранспортныеСредства.Марка", "ПрицепыМарка", "Не заполнена марка"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ТранспортныеСредства.Грузоподъемность", ПрицепыРегистрационныйНомер, "Не заполнена грузоподъемность"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ТранспортныеСредства.Вместимость", ПрицепыРегистрационныйНомер, "Не заполнена вместимость"));
	
	ПолеОтветственныйЗаПеревозкуСтрокой = "ОтветственныйЗаПеревозкуСтрокой";
	
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныеЛица.Фамилия", ПолеОтветственныйЗаПеревозкуСтрокой, "Не заполнена фамилия ответственного"));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныеЛица.Имя", ПолеОтветственныйЗаПеревозкуСтрокой, "Не заполнено имя ответственного"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ОтветственныеЛица.ИНН", "", ""));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ОтветственныеЛица.Серия", "", ""));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ОтветственныеЛица.Номер", "", ""));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ОтветственныеЛица.ДатаВыдачи", "", ""));
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("ОтветственныеЛица.Телефоны", ПолеОтветственныйЗаПеревозкуСтрокой, "Не заполнен телефон ответственного"));
		
	ФЛК = ФЛК("ДанныеЮрЛиц.Полномочия",
		"УполномоченноеЛицоПеревозчика_Полномочия",
		"Не заполнены полномочия уполномоченного лица перевозчика");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ФЛК = ФЛК("ДанныеЮрЛиц.Основание",
		"УполномоченноеЛицоПеревозчика_Основание",
		"Не заполнено основание уполномоченного лица перевозчика");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ПроверяемыеРеквизиты.Добавить(ФЛК("ДанныеЮрЛиц.Адрес", "", "Не заполнен адрес юр. лица"));
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("СпецРазрешения.Вид", "СпецРазрешенияВид", "Не заполнен вид в списке спец разрешений"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("СпецРазрешения.Дата", "СпецРазрешенияДата", "Не заполнена дата в списке спец разрешений"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("СпецРазрешения.Номер", "СпецРазрешенияНомер", "Не заполнен номер в списке спец разрешений"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("СпецРазрешения.Срок", "СпецРазрешенияСрок", "Не заполнен срок в списке спец разрешений"));
	ФЛК = ФЛК("СпецРазрешения.НаименованиеОрганаВласти",
		"СпецРазрешенияНаименованиеОрганаВласти",
		"Не заполнено наименование органа власти в списке спец разрешений");
	ПроверяемыеРеквизиты.Добавить(ФЛК);
	ПроверяемыеРеквизиты.Добавить(
		ФЛК("СпецРазрешения.ИД", "СпецРазрешенияИД", "Не заполнен идентификатор в списке спец разрешений"));
	
	ПроверяемыеРеквизиты.Добавить(ФЛК("ДанныеЮрЛиц.ИНН",     "", "Не заполнен ИНН юр. лица"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ДанныеЮрЛиц.Имя",     "", "Не заполнено Имя юр. лица"));
	ПроверяемыеРеквизиты.Добавить(ФЛК("ДанныеЮрЛиц.Фамилия", "", "Не заполнена Фамилия юр. лица"));
	
КонецПроцедуры

Процедура ДопПроверкиФЛКОформление(ДанныеДокумента, ПараметрыВыгрузки, Ошибки)
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	ИмяТелефон = "Телефон";
	
	СтруктураОшибки = ФЛК("Отправитель_Телефон", "Отправитель_Телефон", "Не заполнен Телефон заказчика");
	МодульТНОбщегоНазначенияСервер.ПроверитьКонтактныеДанные(
		ДанныеДокумента, "Отправитель", ИмяТелефон, Ошибки, СтруктураОшибки);
	
	СтруктураОшибки = ФЛК("Перевозчик_Телефон", "Перевозчик_Телефон", "Не заполнен Телефон перевозчика");
	МодульТНОбщегоНазначенияСервер.ПроверитьКонтактныеДанные(
		ДанныеДокумента, "Перевозчик", ИмяТелефон, Ошибки, СтруктураОшибки);
		
	МодульТНОбщегоНазначенияСервер.ПроверитьЗаполнениеСторонДокументовЭПД(ДанныеДокумента, Ошибки);
	
КонецПроцедуры

Процедура ДопПроверкиФЛКУтверждение(ДанныеДокумента, ПараметрыВыгрузки, Ошибки)
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	СоответствиеОшибок = Новый Соответствие;
	СоответствиеОшибок.Вставить(
		"ТранспортноеСредствоДокумент",
		ФЛК("ТранспортноеСредствоДокумент", "ТранспортноеСредствоСтрокой", "Не заполнен документ владения у транспортного средства"));
	СоответствиеОшибок.Вставить(
		"Прицепы.ПрицепДокумент",
		ФЛК("Прицепы.ПрицепДокумент", "ПрицепыРегистрационныйНомер", "Не заполнен документ владения в списке прицепов"));
	МодульТНОбщегоНазначенияСервер.ПроверитьЗаполнениеТипаВладения(ДанныеДокумента, Ошибки, СоответствиеОшибок);
	
	ОтборЮрЛица = Новый Структура("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицоПеревозчика"));
	НайденныеСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(
		ДанныеДокумента.ДанныеЮрЛиц, ОтборЮрЛица);
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтруктураОшибки = ФЛК(
			"УполномоченноеЛицоПеревозчика_Телефон",
			"УполномоченноеЛицоПеревозчика_Телефон",
			"Не заполнен Телефон уполномоченного лица перевозчика");
		МодульТНОбщегоНазначенияСервер.ПроверитьКонтактныеДанные(
			ДанныеДокумента, "УполномоченноеЛицоПеревозчика", "Телефон", Ошибки, СтруктураОшибки);
	КонецЕсли;
	
	МодульТНОбщегоНазначенияСервер.ПроверитьЗаполнениеСторонДокументовЭПД(ДанныеДокумента, Ошибки);
	
КонецПроцедуры

Функция ПроверятьРеквизитОтветственного(СтрокаТЧ, ИмяРеквизита)
	
	Возврат СтрокаТЧ.Роль = ЗначениеМетаданных("ESD_РолиОтветственных.Ответственный")
		И (ИмяРеквизита = "Фамилия" Или ИмяРеквизита = "Имя" Или ИмяРеквизита = "Телефоны");
	
КонецФункции

// Возвращает признак необходимости проверки реквизитов спец разрешений
//
// Параметры:
//  СтрокаТЧ - СтрокаТаблицыЗначений - строка таблицы, в которой проверяются реквизиты
//  ИмяРеквизита - Строка - имя текущего проверяемого реквизита
//
// Возвращаемое значение:
//   Булево - Истина, если реквизит необходимо проверять
//
Функция ПроверятьРеквизитыСпецРазрешения(СтрокаТЧ, ИмяРеквизита)
		
	Если ИмяРеквизита = "ИД" Тогда
		
		Возврат
			Не ЗначениеЗаполнено(СтрокаТЧ.Номер) 
			Или Не ЗначениеЗаполнено(СтрокаТЧ.Дата)
			Или Не ЗначениеЗаполнено(СтрокаТЧ.Срок)
			Или Не ЗначениеЗаполнено(СтрокаТЧ.Вид)
			Или Не ЗначениеЗаполнено(СтрокаТЧ.НаименованиеОрганаВласти);
			
	Иначе
		Возврат Не ЗначениеЗаполнено(СтрокаТЧ.ИД);
	КонецЕсли;	
		
КонецФункции

Функция РеквизитВодителя(ИмяРеквизита)
	
	ВодителиВУ = "ВодителиВУ";
	
	Если ИмяРеквизита = "Фамилия" Тогда
		РезультатФункции = ФЛК("Фамилия", "ВодителиФИО", "Не заполнена фамилия водителя");
	ИначеЕсли ИмяРеквизита = "Имя" Тогда
		РезультатФункции = ФЛК("Имя", "ВодителиФИО", "Не заполнена имя водителя");
	ИначеЕсли ИмяРеквизита = "ИНН" Тогда
		РезультатФункции = ФЛК("ИНН", "ВодителиИНН", "Не заполнена ИНН водителя");
	ИначеЕсли ИмяРеквизита = "Серия" Тогда
		РезультатФункции = ФЛК("Серия", ВодителиВУ, "Не заполнена серия водительского удостоверения");
	ИначеЕсли ИмяРеквизита = "Номер" Тогда
		РезультатФункции = ФЛК("Номер", ВодителиВУ, "Не заполнен номер водительского удостоверения");
	ИначеЕсли ИмяРеквизита = "ДатаВыдачи" Тогда
		РезультатФункции = ФЛК("ДатаВыдачи", ВодителиВУ, "Не заполнена дата выдачи водительского удостоверения");
	ИначеЕсли ИмяРеквизита = "Телефоны" Тогда
		РезультатФункции = ФЛК("Телефоны", ВодителиВУ, "Не заполнен телефон водителя");
	Иначе
		РезультатФункции = Неопределено;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция РеквизитУполномоченногоЛицаЗаказчика(СтрокаТЧ, Реквизит, ДанныеДокумента)
	
	ЭтоРеквизитЮрЛица = Реквизит.РеквизитОбъекта = "Адрес" Или Реквизит.РеквизитОбъекта = "Имя"
		Или Реквизит.РеквизитОбъекта = "Фамилия" Или Реквизит.РеквизитОбъекта = "ИНН";
	
	Если Реквизит.РеквизитОбъекта = "Полномочия" Тогда
		РезультатФункции = ФЛК(
			"Полномочия", "УполномоченныеЛицаЗаказчикаПолномочия", "Не заполнены полномочия уполномоченного лица заказчика");
	ИначеЕсли Реквизит.РеквизитОбъекта = "Основание" Тогда
		РезультатФункции = ФЛК(
			"Основание", "УполномоченныеЛицаЗаказчикаОснование", "Не заполнено основание уполномоченного лица заказчика");
	ИначеЕсли ЭтоРеквизитЮрЛица Тогда
		РезультатФункции = ФЛК(
			Реквизит.РеквизитОбъекта,
			"УполномоченныеЛицаЗаказчикаНаименованиеОрганизации",
			"Не заполнен " + Реквизит.РеквизитОбъекта + " уполномоченного лица заказчика");
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ИсправитьТекстОшибкиФЛК(РезультатФункции);
	Иначе
		РезультатФункции = Неопределено;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция НовыйРеквизитЮрЛица(СтрокаТЧ, Реквизит, ДанныеДокумента)
	
	ЭтоНеРеквизитЮрЛица = Реквизит.РеквизитОбъекта <> "Адрес" И Реквизит.РеквизитОбъекта <> "Имя"
		И Реквизит.РеквизитОбъекта <> "Фамилия" И Реквизит.РеквизитОбъекта <> "ИНН"
		И Реквизит.РеквизитОбъекта <> "Телефон";
	
	Если ЭтоНеРеквизитЮрЛица Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЭтоОформление = ДанныеДокумента.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЗнП.Оформление");
	
	Если СтрокаТЧ.Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.Отправитель") И ЭтоОформление Тогда
		ЭлементФормы = "ОтправительСтрокой";
		РольСтрокой  = "заказчика";
	ИначеЕсли СтрокаТЧ.Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.Перевозчик") И ЭтоОформление Тогда
		ЭлементФормы = "ПеревозчикСтрокой";
		РольСтрокой  = "перевозчика";
	ИначеЕсли СтрокаТЧ.Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицоПеревозчика")
		И ДанныеДокумента.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЗнП.Утверждение") Тогда
		ЭлементФормы = "УполномоченноеЛицоПеревозчикаСтрокой";
		РольСтрокой  = "уполномоченного лица перевозчика";
	ИначеЕсли СтрокаТЧ.Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.Оформитель") И ЭтоОформление Тогда
		ЭлементФормы = "ОформительСтрокой";
		РольСтрокой  = "организации";
	ИначеЕсли СтрокаТЧ.Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.Заказчик") И ЭтоОформление Тогда
		ЭлементФормы = "ГрузыЗаказчикСтрока";
		РольСтрокой  = "заказчика";
	Иначе
		ЭлементФормы = Реквизит.ЭлементФормы;
		РольСтрокой  = "юр. лица";
	КонецЕсли;
	
	ФЛК = ФЛК(Реквизит.РеквизитОбъекта, ЭлементФормы, "Не заполнен " + Реквизит.РеквизитОбъекта + " " + РольСтрокой);
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ИсправитьТекстОшибкиФЛК(ФЛК);
	
	Возврат ФЛК;
	
КонецФункции

Функция ПроверятьДанныеЮрЛица(СтрокаТЧ, ИмяТЧ, Реквизит, ДанныеДокумента)
	
	РольУполномоченноеЛицоПеревозчика = ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицоПеревозчика");
	
	Если ДанныеДокумента.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЗнП.Оформление") Тогда
		ПроверятьРоль = СтрокаТЧ.Роль <> РольУполномоченноеЛицоПеревозчика;
	Иначе
		ПроверятьРоль = СтрокаТЧ.Роль = РольУполномоченноеЛицоПеревозчика;
	КонецЕсли;
	
	ПроверятьРеквизиты = Истина;
	
	Если Реквизит.РеквизитОбъекта = "Адрес" Тогда
		ПроверятьРеквизиты = ЗначениеЗаполнено(Реквизит.ЭлементФормы);
	КонецЕсли;
	
	Если Реквизит.РеквизитОбъекта = "Имя" Или Реквизит.РеквизитОбъекта = "Фамилия" Тогда
		ПроверятьРеквизиты = ПроверятьДанныеИП(СтрокаТЧ, Реквизит);
	КонецЕсли;
	
	Если Реквизит.РеквизитОбъекта = "Полномочия" Или Реквизит.РеквизитОбъекта = "Основание" Тогда
		ПроверятьРеквизиты = СтрокаТЧ.Роль = РольУполномоченноеЛицоПеревозчика
			Или СтрокаТЧ.Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицо");
	КонецЕсли;
		
	Если Реквизит.РеквизитОбъекта = "Телефон" Тогда
		ПроверятьРеквизиты = СтрокаТЧ.Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицо");
	КонецЕсли;
	
	Возврат ПроверятьРоль И ПроверятьРеквизиты;
	
КонецФункции

Функция ПроверятьДанныеИП(СтрокаТЧ, Реквизит)
	
	ПроверятьИмяФамилию = СтрокаТЧ.ЮрФизЛицо = ЗначениеМетаданных("ESD_ЮрФизЛицо.ИндивидуальныйПредприниматель")
		И (Реквизит.РеквизитОбъекта = "Имя" Или Реквизит.РеквизитОбъекта = "Фамилия");
		
	Возврат ПроверятьИмяФамилию;
		
КонецФункции

Функция ПроверятьДанныеАдресовПунктовВыгрузки(СтрокаТЧ, ИмяТЧ, Реквизит, ДанныеДокумента)
	
	Если Реквизит.РеквизитОбъекта = "ОрганизацияСтрока" Тогда
		РезультатФункции = СтрокаТЧ.ЭтоПогрузка;
	ИначеЕсли Реквизит.РеквизитОбъекта = "Адрес" Тогда
		РезультатФункции = Ложь;
	Иначе
		РезультатФункции = Реквизит.РеквизитОбъекта <> "Полномочия" И Реквизит.РеквизитОбъекта <> "Основание";
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПроверятьРеквизитыГруза(СтрокаТЧ, Реквизит)
	
	Если Реквизит.РеквизитОбъекта = "Полномочия" Или Реквизит.РеквизитОбъекта = "Основание" Тогда
		РезультатФункции = Ложь;
	ИначеЕсли Реквизит.РеквизитОбъекта = "Имя" Или Реквизит.РеквизитОбъекта = "Фамилия" Тогда
		РезультатФункции = ПроверятьДанныеИП(СтрокаТЧ, Реквизит);
	Иначе
		РеквизитыОпасногоГруза = Новый Соответствие;
		РеквизитыОпасногоГруза.Вставить("ОпасныйГрузНаименование",        Истина);
		РеквизитыОпасногоГруза.Вставить("НомерООН",                       Истина);
		РеквизитыОпасногоГруза.Вставить("Класс",                          Истина);
		РеквизитыОпасногоГруза.Вставить("КлассификационныйКод",           Истина);
		РеквизитыОпасногоГруза.Вставить("ГруппаУпаковкиЗначение",         Истина);
		РеквизитыОпасногоГруза.Вставить("ЗнакОпасности",                  Истина);
		РеквизитыОпасногоГруза.Вставить("ОграничениеПроездаЧерезТуннели", Истина);
		
		РезультатФункции = РеквизитыОпасногоГруза[Реквизит.РеквизитОбъекта] = Неопределено Или ЗначениеЗаполнено(СтрокаТЧ.ОпасныйГруз);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПроверятьДанныеУполномоченногоЛицаЗаказчика(СтрокаТЧ, Реквизит, ДанныеДокумента)
	
	РезультатФункции = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
		ЗаказНаПеревозку(), "ЭтоПервыйТитул", ДанныеДокумента.ТипТитула);
	
	Если Реквизит.РеквизитОбъекта = "Имя" Или Реквизит.РеквизитОбъекта = "Фамилия" Тогда
		РезультатФункции = РезультатФункции И ПроверятьДанныеИП(СтрокаТЧ, Реквизит);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // ФЛК

#Область ЗаполнениеНаОснованииINI

Процедура ДополнитьПодстановкиГрузоотправителя(ДанныеИзИНИ, ПараметрыЗаполнения)
	
	ДанныеИзИНИ.Вставить("Грузоотправитель", МодульКода("ESD_ТНОбщегоНазначенияСервер").ДанныеЮрЛицаИзИНИ(ДанныеИзИНИ));
	
КонецПроцедуры

Процедура ДополнитьПодстановкиГрузоперевозчика(ДанныеИзИНИ, ПараметрыЗаполнения)
	
	ДанныеИзИНИ.Вставить("Грузоперевозчик", МодульКода("ESD_ТНОбщегоНазначенияСервер").ДанныеЮрЛицаИзИНИ(ДанныеИзИНИ));
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОснованииINI

#Область ДанныеДокумента

Функция ВыгрузкаДанныеОформление(СсылкаНаДокумент)
	
	Реквизиты = Новый Массив;
	
	Реквизиты.Добавить("Номер");
	Реквизиты.Добавить("НомерСбис");
	Реквизиты.Добавить("Дата");
	Реквизиты.Добавить("ВместимостьТС");
	Реквизиты.Добавить("ГрузоподъемностьТС");
	Реквизиты.Добавить("ТипТС");
	Реквизиты.Добавить("КузовТС");
	Реквизиты.Добавить("ПогрузкаТС");
	Реквизиты.Добавить("Договор");
	Реквизиты.Добавить("ВлажностьОт");
	Реквизиты.Добавить("ВлажностьДо");
	Реквизиты.Добавить("ТемператураОт");
	Реквизиты.Добавить("ТемператураДо");
	Реквизиты.Добавить("ИныеУсловия");
	Реквизиты.Добавить("ПредельныйСрок");
	Реквизиты.Добавить("ПредставительЗаказчика");
	Реквизиты.Добавить("ПредставительЗаказчикаНаименование");
	Реквизиты.Добавить("ПредставительЗаказчика_Основание");
	Реквизиты.Добавить("ТребованияКТС");
	Реквизиты.Добавить("СпецУсловия");
	Реквизиты.Добавить("ПодачаАдрес");
	Реквизиты.Добавить("ПодачаДатаВремя");
	Реквизиты.Добавить("ПодачаПредельныйИнтервал");
	Реквизиты.Добавить("КонечнаяТочкаАдрес");
	Реквизиты.Добавить("Отправитель_Экспедитор");
	Реквизиты.Добавить("Заказчик");
	Реквизиты.Добавить("Перевозчик");
	Реквизиты.Добавить("ТипДокумента");
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("Грузы");
	Таблицы.Добавить("ДанныеЮрЛиц");
	Таблицы.Добавить("КонтактныеДанные");
	Таблицы.Добавить("АдресаПунктовВыгрузки");
	Таблицы.Добавить("АдресаПромежуточныхПунктов");
	Таблицы.Добавить("ДокументыЭПД");
	
	Возврат ДанныеИзБД(СсылкаНаДокумент, Реквизиты, Таблицы);
	
КонецФункции

Функция ВыгрузкаДанныеУтверждение(СсылкаНаДокумент)
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("ВалютаКод");
	Реквизиты.Добавить("ВалютаНаименование");
	Реквизиты.Добавить("СтавкаНДС");
    Реквизиты.Добавить("Сумма");
	Реквизиты.Добавить("СуммаБезНДС");
	Реквизиты.Добавить("СуммаСНДС");
	Реквизиты.Добавить("МеханизмРасчета");
		
	Таблицы = Новый Массив;
	Таблицы.Добавить("ДанныеЮрЛиц");
	Таблицы.Добавить("КонтактныеДанные");
	Таблицы.Добавить("ТранспортныеСредства");	
	Таблицы.Добавить("ОтветственныеЛица");
	Таблицы.Добавить("СпецРазрешения");
	Таблицы.Добавить("Водители");
	Таблицы.Добавить("ДокументыЭПД");
	
	Возврат ДанныеИзБД(СсылкаНаДокумент, Реквизиты, Таблицы);
	
КонецФункции

Функция ДанныеИзБД(СсылкаНаДокумент, Реквизиты, Таблицы)
	
	РезультатФункции = Новый Структура;
	
	РезультатФункции.Вставить("ИмяМетаданных", ЗаказНаПеревозку());
	
	// Ссылка всегда должна быть
	Реквизиты.Добавить("Ссылка");
	
	ТекстЗапросаРеквизитов = ТекстЗапросаРеквизитов();
	ШаблонЗапросаТаблиц    = ШаблонЗапросаТаблиц();
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДобавитьРеквизитыИзБД(
		РезультатФункции, СсылкаНаДокумент, Реквизиты, ТекстЗапросаРеквизитов);
	
	НестандартныеЗапросыТаблиц = НестандартныеЗапросыТаблиц(Таблицы);
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ДобавитьТаблицыИзБД(
		РезультатФункции, СсылкаНаДокумент, Таблицы, ШаблонЗапросаТаблиц, НестандартныеЗапросыТаблиц);
		
	РезультатФункции.Вставить("ЭтоВО", Ложь);
		
	Возврат РезультатФункции;
	
КонецФункции

Функция ТекстЗапросаРеквизитов()
	
	РезультатФункции =
	"ВЫБРАТЬ
    |	ESD_ЗаказНаПеревозку.Ссылка КАК Ссылка,
    |	ESD_ЗаказНаПеревозку.ВерсияДанных КАК ВерсияДанных,
    |	ESD_ЗаказНаПеревозку.ПометкаУдаления КАК ПометкаУдаления,
    |	ESD_ЗаказНаПеревозку.Номер КАК Номер,
    |	ESD_ЗаказНаПеревозку.Дата КАК Дата,
    |	ESD_ЗаказНаПеревозку.Проведен КАК Проведен,
    |	ESD_ЗаказНаПеревозку.ВалютаКод КАК ВалютаКод,
    |	ESD_ЗаказНаПеревозку.ВалютаНаименование КАК ВалютаНаименование,
    |	ESD_ЗаказНаПеревозку.ВлажностьДо КАК ВлажностьДо,
    |	ESD_ЗаказНаПеревозку.ВлажностьОт КАК ВлажностьОт,
    |	ESD_ЗаказНаПеревозку.ВместимостьТС КАК ВместимостьТС,
    |	ESD_ЗаказНаПеревозку.ГрузоподъемностьТС КАК ГрузоподъемностьТС,
    |	ESD_ЗаказНаПеревозку.ДатаИзменения КАК ДатаИзменения,
    |	ESD_ЗаказНаПеревозку.Договор КАК Договор,
    |	ESD_ЗаказНаПеревозку.ДокументОснование_Идентификатор КАК ДокументОснование_Идентификатор,
    |	ESD_ЗаказНаПеревозку.ДокументОснование_ОбъектМетаданных КАК ДокументОснование_ОбъектМетаданных,
    |	ESD_ЗаказНаПеревозку.Заказчик КАК Заказчик,
    |	ESD_ЗаказНаПеревозку.ИныеУсловия КАК ИныеУсловия,
    |	ESD_ЗаказНаПеревозку.Комментарий КАК Комментарий,
    |	ESD_ЗаказНаПеревозку.КонечнаяТочкаАдрес КАК КонечнаяТочкаАдрес,
    |	ESD_ЗаказНаПеревозку.КонечнаяТочкаАдресСтруктура КАК КонечнаяТочкаАдресСтруктура,
    |	ESD_ЗаказНаПеревозку.КузовТС КАК КузовТС,
    |	ESD_ЗаказНаПеревозку.МеханизмРасчета КАК МеханизмРасчета,
    |	ESD_ЗаказНаПеревозку.Направление КАК Направление,
    |	ESD_ЗаказНаПеревозку.НомерСбис КАК НомерСбис,
    |	ESD_ЗаказНаПеревозку.Перевозчик КАК Перевозчик,
    |	ESD_ЗаказНаПеревозку.ПогрузкаТС КАК ПогрузкаТС,
    |	ESD_ЗаказНаПеревозку.ПодачаАдрес КАК ПодачаАдрес,
    |	ESD_ЗаказНаПеревозку.ПодачаАдресСтруктура КАК ПодачаАдресСтруктура,
    |	ESD_ЗаказНаПеревозку.ПодачаДатаВремя КАК ПодачаДатаВремя,
	|	ESD_ЗаказНаПеревозку.ПодачаПредельныйИнтервал КАК ПодачаПредельныйИнтервал,
    |	ESD_ЗаказНаПеревозку.ПредельныйСрок КАК ПредельныйСрок,
    |	ESD_ЗаказНаПеревозку.ПредставительЗаказчика КАК ПредставительЗаказчика,
	|	ESD_ЗаказНаПеревозку.ПредставительЗаказчикаНаименование КАК ПредставительЗаказчикаНаименование,
    |	ESD_ЗаказНаПеревозку.ПредставительЗаказчика_Основание КАК ПредставительЗаказчика_Основание,
    |	ESD_ЗаказНаПеревозку.СпецУсловия КАК СпецУсловия,
    |	ESD_ЗаказНаПеревозку.СтавкаНДС КАК СтавкаНДС,
    |	ESD_ЗаказНаПеревозку.Сумма КАК Сумма,
    |	ESD_ЗаказНаПеревозку.СуммаБезНДС КАК СуммаБезНДС,
    |	ESD_ЗаказНаПеревозку.СуммаСНДС КАК СуммаСНДС,
    |	ESD_ЗаказНаПеревозку.ТемператураДо КАК ТемператураДо,
    |	ESD_ЗаказНаПеревозку.ТемператураОт КАК ТемператураОт,
    |	ESD_ЗаказНаПеревозку.ТипДокумента КАК ТипДокумента,
    |	ESD_ЗаказНаПеревозку.ТипТС КАК ТипТС,
    |	ESD_ЗаказНаПеревозку.ТранспортноеСредствоСтрокой КАК ТранспортноеСредствоСтрокой,
    |	ESD_ЗаказНаПеревозку.ТребованияКТС КАК ТребованияКТС,
    |	ESD_ЗаказНаПеревозку.Представление КАК Представление,
    |	ESD_ЗаказНаПеревозку.МоментВремени КАК МоментВремени,
	|	ЛОЖЬ КАК Отправитель_Экспедитор
    |ИЗ
    |	Документ.ESD_ЗаказНаПеревозку КАК ESD_ЗаказНаПеревозку
    |ГДЕ
    |	ESD_ЗаказНаПеревозку.Ссылка = &Ссылка";
	
	РезультатФункции = СтрЗаменить(РезультатФункции, "ESD_ЗаказНаПеревозку", ЗаказНаПеревозку());
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ШаблонЗапросаТаблиц()
	
	РезультатФункции =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	Документ.ESD_ЗаказНаПеревозку.%1 КАК ТЧЗаказаНаПеревозку
	|ГДЕ
	|	ТЧЗаказаНаПеревозку.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатФункции = СтрЗаменить(РезультатФункции, "ESD_ЗаказНаПеревозку", ЗаказНаПеревозку());
	
	Возврат РезультатФункции;
	
КонецФункции

Функция НестандартныеЗапросыТаблиц(Таблицы)
	
	РезультатФункции = Новый Соответствие;
	
	Для Каждого ИмяТаблицы Из Таблицы Цикл
		
		ДобавитьЗапросДокументовЭПД(ИмяТаблицы, РезультатФункции);
		
		ТекстЗапроса = Неопределено;
		
		Если ИмяТаблицы = "Грузы" Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ESD_ЗаказНаПеревозкуГрузы.Тип КАК Тип,
			|	ESD_ЗаказНаПеревозкуГрузы.МассаБрутто КАК МассаБрутто,
			|	ESD_ЗаказНаПеревозкуГрузы.МассаНетто КАК МассаНетто,
			|	ESD_ЗаказНаПеревозкуГрузы.Высота КАК Высота,
			|	ESD_ЗаказНаПеревозкуГрузы.Длина КАК Длина,
			|	ESD_ЗаказНаПеревозкуГрузы.Количество КАК КоличествоМест,
			|	ESD_ЗаказНаПеревозкуГрузы.КоличествоПаллет КАК КоличествоПаллет,
			|	ESD_ЗаказНаПеревозкуГрузы.Объем КАК Объем,
			|	ESD_ЗаказНаПеревозкуГрузы.Ширина КАК Ширина,
			|	ESD_ЗаказНаПеревозкуГрузы.Количество КАК Количество,
			|	ESD_ЗаказНаПеревозкуГрузы.Количество КАК КоличествоГрузовыхМест,
			|	ESD_ЗаказНаПеревозкуГрузы.Наименование КАК Наименование,
			|	ESD_ЗаказНаПеревозкуГрузы.Состояние КАК Состояние,
			|	ESD_ЗаказНаПеревозкуГрузы.ВидТары КАК ВидТары,
			|	ESD_ЗаказНаПеревозкуГрузы.ВидТары.Код КАК ТараКод,
			|	ESD_ЗаказНаПеревозкуГрузы.Договор КАК Договор,
			|	ESD_ЗаказНаПеревозкуГрузы.КлючСтроки_ДанныеЮрЛиц КАК КлючСтроки_ДанныеЮрЛиц,
			|	ESD_ЗаказНаПеревозкуГрузы.КлючСтроки КАК КлючСтроки,
			|	ESD_ЗаказНаПеревозкуГрузы.МетодОпределенияМассы КАК МетодОпределенияМассы,
			|	ESD_ЗаказНаПеревозкуГрузы.РаспределениеПоДлинеПлатформы КАК РаспределениеПоДлинеПлатформы,
			|	ESD_ЗаказНаПеревозкуГрузы.Делимость КАК Делимость,
			|	ESD_ЗаказНаПеревозкуГрузы.ПогрузкаВодителем КАК ПогрузкаВодителем,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз КАК ОпасныйГруз,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.Наименование КАК ОпасныйГрузНаименование,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.НомерООН КАК НомерООН,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.ТехническоеНаименование КАК ТехническоеНаименование,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.Комментарий КАК Комментарий,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.Класс КАК Класс,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.КлассификационныйКод КАК КлассификационныйКод,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.ГруппаУпаковкиЗначение КАК ГруппаУпаковкиЗначение,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.ЗнакОпасности КАК ЗнакОпасности,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.ОграничениеПроездаЧерезТуннели КАК ОграничениеПроездаЧерезТуннели,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.НазваниеРадионуклида КАК НазваниеРадионуклида,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.ФизИХимФорма КАК ФизХимФорма,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.МаксАктивность КАК РадиоактивныйМаксАктивность,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.КатегорияУпаковки КАК КатегорияУпаковки,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.ТранспортныйИндекс КАК ТранспортныйИндекс,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.ИндексБезопасности КАК ИндексБезопасности,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.ОпознавательныйЗнак КАК ОпознавательныйЗнак,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.ПолнаяАктивность КАК РадиоактивныйПолнаяАктивность,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.МассаНеттоВзрывчатый КАК МассаНеттоВзрывчатый,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.МассаНеттоВзрывчатыйВсего КАК МассаНеттоВзрывчатыйВсего,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.ПроцентСмеси КАК ПроцентСмеси,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.ДатаИстеченияУдержания КАК ДатаИстеченияУдержания,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.КонтрольнаяТемпература КАК ТемператураКонтрольная,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.АварийнаяТемпература КАК ТемператураАварийная,
			|	ESD_ЗаказНаПеревозкуГрузы.ОпасныйГруз.Представление КАК Представление
			|ИЗ
			|	Документ.ESD_ЗаказНаПеревозку.Грузы КАК ESD_ЗаказНаПеревозкуГрузы
			|ГДЕ
			|	ESD_ЗаказНаПеревозкуГрузы.Ссылка = &Ссылка";
			
		ИначеЕсли ИмяТаблицы = "Водители" Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.Ссылка КАК Ссылка,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.НомерСтроки КАК НомерСтроки,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.КлючСтроки КАК КлючСтроки,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.ИНН КАК ИНН,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.Серия КАК Серия,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.Номер КАК Номер,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.ДатаВыдачи КАК ДатаВыдачи,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.Фамилия КАК Фамилия,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.Имя КАК Имя,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.Отчество КАК Отчество,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.Телефоны КАК Телефоны,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.Роль КАК Роль,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.Должность КАК Должность,
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.ШтатныйСотрудник КАК ШтатныйСотрудник
			|ИЗ
			|	Документ.ESD_ЗаказНаПеревозку.ОтветственныеЛица КАК ESD_ЗаказНаПеревозкуОтветственныеЛица
			|ГДЕ
			|	ESD_ЗаказНаПеревозкуОтветственныеЛица.Ссылка = &Ссылка
			|	И ESD_ЗаказНаПеревозкуОтветственныеЛица.Роль = ЗНАЧЕНИЕ(Перечисление.ESD_РолиОтветственных.Водитель)";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ESD_РолиОтветственных", РолиОтветственных());
			
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ТекстЗапроса <> Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ESD_ЗаказНаПеревозку", ЗаказНаПеревозку());
			РезультатФункции.Вставить(ИмяТаблицы, ТекстЗапроса);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьЗапросДокументовЭПД(ИмяТаблицы, РезультатФункции)
	
	Если ИмяТаблицы <> "ДокументыЭПД" Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ESD_ЗаказНаПеревозку.Договор КАК Ссылка,
	|	""Договор"" КАК РеквизитОбъекта,
	|	""Договор"" КАК ЭлементФормы,
	|	"""" КАК ИмяТаблицы,
	|	0 КАК НомерСтроки,
	|	ЛОЖЬ КАК ЭтоОформитель
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	Документ.ESD_ЗаказНаПеревозку КАК ESD_ЗаказНаПеревозку
	|ГДЕ
	|	ESD_ЗаказНаПеревозку.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ESD_ЗаказНаПеревозку.ПредставительЗаказчика_Основание,
	|	""ПредставительЗаказчика_Основание"",
	|	""Оформитель_Основание"",
	|	"""",
	|	0,
	|	ИСТИНА
	|ИЗ
	|	Документ.ESD_ЗаказНаПеревозку КАК ESD_ЗаказНаПеревозку
	|ГДЕ
	|	ESD_ЗаказНаПеревозку.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ESD_ЗаказНаПеревозкуГрузы.Договор,
	|	""Грузы.Договор"",
	|	""ГрузыДоговор"",
	|	""Грузы"",
	|	ESD_ЗаказНаПеревозкуГрузы.НомерСтроки,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ESD_ЗаказНаПеревозку.Грузы КАК ESD_ЗаказНаПеревозкуГрузы
	|ГДЕ
	|	ESD_ЗаказНаПеревозкуГрузы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ESD_ЗаказНаПеревозкуДанныеЮрЛиц.Основание,
	|	""УполномоченныеЛицаЗаказчика.Основание"",
	|	""УполномоченныеЛицаЗаказчикаОснование"",
	|	""ДанныеЮрЛиц"",
	|	ESD_ЗаказНаПеревозкуДанныеЮрЛиц.НомерСтроки,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ESD_ЗаказНаПеревозку.ДанныеЮрЛиц КАК ESD_ЗаказНаПеревозкуДанныеЮрЛиц
	|ГДЕ
	|	ESD_ЗаказНаПеревозкуДанныеЮрЛиц.Ссылка = &Ссылка
	|	И ESD_ЗаказНаПеревозкуДанныеЮрЛиц.Роль = ЗНАЧЕНИЕ(Перечисление.ESD_РолиКонтрагентов.УполномоченноеЛицо)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ESD_ЗаказНаПеревозкуДанныеЮрЛиц.Основание,
	|	""ДанныеЮрЛиц.Основание"",
	|	""УполномоченноеЛицоПеревозчика_Основание"",
	|	"""",
	|	0,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ESD_ЗаказНаПеревозку.ДанныеЮрЛиц КАК ESD_ЗаказНаПеревозкуДанныеЮрЛиц
	|ГДЕ
	|	ESD_ЗаказНаПеревозкуДанныеЮрЛиц.Ссылка = &Ссылка
	|	И ESD_ЗаказНаПеревозкуДанныеЮрЛиц.Роль = ЗНАЧЕНИЕ(Перечисление.ESD_РолиКонтрагентов.УполномоченноеЛицоПеревозчика)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ESD_ДокументыЭПД.Ссылка КАК Ссылка,
	|	ESD_ДокументыЭПД.ДанныеЮрЛиц.(
	|		ИНН КАК ИНН
	|	) КАК ДанныеЮрЛиц,
	|	СсылкиНаДокументы.РеквизитОбъекта КАК РеквизитОбъекта,
	|	СсылкиНаДокументы.ЭлементФормы КАК ЭлементФормы,
	|	СсылкиНаДокументы.НомерСтроки КАК НомерСтроки,
	|	СсылкиНаДокументы.ИмяТаблицы КАК ИмяТаблицы,
	|	СсылкиНаДокументы.ЭтоОформитель КАК ЭтоОформитель
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ESD_ДокументыЭПД КАК ESD_ДокументыЭПД
	|		ПО СсылкиНаДокументы.Ссылка = ESD_ДокументыЭПД.Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ESD_ЗаказНаПеревозку", ЗаказНаПеревозку());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ESD_ДокументыЭПД",     ДокументыЭПД());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ESD_РолиКонтрагентов", РолиКонтрагентов());
	РезультатФункции.Вставить("ДокументыЭПД", ТекстЗапроса);
	
КонецПроцедуры

#КонецОбласти // ДанныеДокумента

#Область Выгрузка

#Область Выгрузка_Оформление

Функция ТитулОформление(ДанныеДокумента)
	
	СтруктураТитула = Новый Структура;
	
	Документ = Новый Структура;
	Документ.Вставить("Номер", ДанныеДокумента.НомерСбис);
	СтруктураТитула.Вставить("Документ", Документ);
	
	ПараметрыТС = Новый Структура;
	ПараметрыТС.Вставить("Вместимость",      ДанныеДокумента.ВместимостьТС);
	ПараметрыТС.Вставить("Грузоподъемность", ДанныеДокумента.ГрузоподъемностьТС);
	ПараметрыТС.Вставить("Тип",              ДанныеДокумента.ТипТС);
	ПараметрыТС.Вставить("ТипКузова",        ДанныеДокумента.КузовТС);
	ПараметрыТС.Вставить("ТипПогрузки",      ДанныеДокумента.ПогрузкаТС);
	
	СтруктураТитула.Вставить("ПараметрыТС", ПараметрыТС);
	
	МассивДокументов = Новый Массив();
	МассивДокументов.Добавить(ДанныеДокумента.Договор);
	МассивДокументов.Добавить(ДанныеДокумента.ПредставительЗаказчика_Основание);
	ДанныеДокументов = МодульКода("ESD_ТНОбщегоНазначенияСервер").РеквизитыДокументовСбис(МассивДокументов);
	
	ДанныеДоговора = ДанныеДокументов.Получить(ДанныеДокумента.Договор);
	Если ДанныеДоговора <> Неопределено Тогда
				
		ОбработатьСлужебныеСвойстваСтруктурыДокумента(ДанныеДоговора, ДанныеДоговора.ДатаВремя);	
		СтруктураТитула.Вставить("Договор", ДанныеДоговора);
		
	КонецЕсли;
	
	СтруктураТитула.Вставить("Маршрут", Маршрут(ДанныеДокумента));
	
	ЗаполнитьПредставителяЗаказчика(СтруктураТитула, ДанныеДокумента, ДанныеДокументов);
	
	СтруктураТитула.Вставить("УсловияПеревозки", УсловияПеревозки(ДанныеДокумента));
	
	СтруктураТитула.Вставить("Груз", Груз(ДанныеДокумента));
	
	СтруктураТитула.Вставить(
		"Грузоперевозчик", МодульКода("ESD_ТНВыгрузкаСервер").ДанныеЮрЛица("Перевозчик", ДанныеДокумента, Истина));
	
	СтруктураТитула.Вставить(
		"Грузоотправитель", МодульКода("ESD_ТНВыгрузкаСервер").ДанныеЮрЛица("Отправитель", ДанныеДокумента, Истина));
	
	ЗаполнитьУполномоченныхЛиц(СтруктураТитула.Грузоотправитель, ДанныеДокумента, "УполномоченноеЛицо");
	
	Возврат СтруктураТитула;
	
КонецФункции

Функция Маршрут(ДанныеДокумента)
	
	ИмяКлючаНазвание = "Название";
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("КонечныйПункт",      Новый Структура);
	РезультатФункции.Вставить("Отправление",        Новый Структура);
	РезультатФункции.Вставить("ПромежуточныйПункт", Новый Массив);
	РезультатФункции.Вставить("Пункт",              Новый Массив);
	
	РезультатФункции.КонечныйПункт.Вставить(ИмяКлючаНазвание, ДанныеДокумента.КонечнаяТочкаАдрес);
	
	Модуль_ТНВыгрузкаСервер = МодульКода("ESD_ТНВыгрузкаСервер");
	
	ПодачаДатаВремя = Модуль_ТНВыгрузкаСервер.СтруктураДатаВремя(ДанныеДокумента.ПодачаДатаВремя, , Истина);
	
	ПодачаПредельныйИнтервал = Дата(
		Год(ДанныеДокумента.ПодачаДатаВремя),
		Месяц(ДанныеДокумента.ПодачаДатаВремя),
		День(ДанныеДокумента.ПодачаДатаВремя),
		Час(ДанныеДокумента.ПодачаПредельныйИнтервал),
		Минута(ДанныеДокумента.ПодачаПредельныйИнтервал),
		Секунда(ДанныеДокумента.ПодачаПредельныйИнтервал));
		
	ПодачаПредельныйИнтервал = Модуль_ТНВыгрузкаСервер.СтруктураДатаВремя(ПодачаПредельныйИнтервал, , Истина);
	
	ПодачаТС = Новый Структура;
	ПодачаТС.Вставить("ДатаВремя",                           ПодачаДатаВремя.Значение);
	ПодачаТС.Вставить("ДатаВремяНаличиеUTC",                 ПодачаДатаВремя.ЕстьЧасовойПояс);
	ПодачаТС.Вставить("ПредельныйИнтервалВремени",           ТолькоВремя(ПодачаПредельныйИнтервал.Значение));
	ПодачаТС.Вставить("ПредельныйИнтервалВремениНаличиеUTC", ПодачаПредельныйИнтервал.ЕстьЧасовойПояс);
	РезультатФункции.Отправление.Вставить("ПодачаТС", ПодачаТС);
	РезультатФункции.Отправление.Вставить("АдресТекст", ДанныеДокумента.ПодачаАдрес);
	
	Для Каждого СтрокаПромежуточногоПункта Из ДанныеДокумента.АдресаПромежуточныхПунктов Цикл
		СтруктураПромежуточногоПункта = Новый Структура;
		СтруктураПромежуточногоПункта.Вставить(ИмяКлючаНазвание, СтрокаПромежуточногоПункта.Значение);
		РезультатФункции.ПромежуточныйПункт.Добавить(СтруктураПромежуточногоПункта);
	КонецЦикла;
	
	Для Каждого СтрокаПункта Из ДанныеДокумента.АдресаПунктовВыгрузки Цикл
		СтруктураПункта = Новый Структура;
		СтруктураПункта.Вставить("АдресТекст", СтрокаПункта.Значение);
		
		ДатаВремя       = Модуль_ТНВыгрузкаСервер.СтруктураДатаВремя(СтрокаПункта.ДатаВремя, , Истина);
		ДопустимоеВремя = Модуль_ТНВыгрузкаСервер.СтруктураДатаВремя(СтрокаПункта.ДопустимоеВремя, , Истина);
		
		ТипОперации = Формат(СтрокаПункта.ЭтоПогрузка, "БЛ=Выгрузка; БИ=Погрузка");
		
		Операция = Новый Структура;
		Операция.Вставить("ДатаВремя",                           ДатаВремя.Значение);
		Операция.Вставить("ДатаВремяНаличиеUTC",                 ДатаВремя.ЕстьЧасовойПояс);
		Операция.Вставить("ПредельныйИнтервалВремени",           ТолькоВремя(ДопустимоеВремя.Значение));
		Операция.Вставить("ПредельныйИнтервалВремениНаличиеUTC", ДопустимоеВремя.ЕстьЧасовойПояс);
		Операция.Вставить("Тип",                                 ТипОперации);
		
		СтруктураПункта.Вставить("Операция", Операция);
		
		СтрокаЮрЛица = ДанныеДокумента.ДанныеЮрЛиц.Найти(СтрокаПункта.КлючСтроки_ДанныеЮрЛиц, "КлючСтроки");
		Если СтрокаЮрЛица <> Неопределено Тогда
			СтруктураПункта.Вставить("Организация", Новый Структура);
			СтруктураПункта.Организация.Вставить("ИНН", СтрокаЮрЛица.ИНН);
			СтруктураПункта.Организация.Вставить(ИмяКлючаНазвание, СтрокаЮрЛица.НаименованиеОрганизации);
		КонецЕсли;
		
		РезультатФункции.Пункт.Добавить(СтруктураПункта);
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗаполнитьПредставителяЗаказчика(СтруктураТитула, ДанныеДокумента, ДанныеДокументов)
	
	Если Не ДанныеДокумента.ПредставительЗаказчика Тогда
		Возврат;
	КонецЕсли;
	
	Составитель = ДанныеДокумента.ПредставительЗаказчикаНаименование;
	
	Если Не ЗначениеЗаполнено(Составитель) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураТитула.Вставить("Файл", Новый Структура);		
	СтруктураТитула.Файл.Вставить("Составитель", Новый Структура);
	
	СтруктураТитула.Файл.Составитель.Вставить("Наименование", Составитель);
	
	Если ЗначениеЗаполнено(ДанныеДокумента.ПредставительЗаказчика_Основание) Тогда
		ДанныеОснования = ДанныеДокументов.Получить(ДанныеДокумента.ПредставительЗаказчика_Основание);
		Если ДанныеОснования <> Неопределено Тогда
							
			ОбработатьСлужебныеСвойстваСтруктурыДокумента(ДанныеОснования, ДанныеОснования.ДатаВремя);								
			Основание = Новый Структура;
			Основание.Вставить("Документ", ДанныеОснования);
			СтруктураТитула.Файл.Составитель.Вставить("Основание", Основание);
			
		КонецЕсли;
	КонецЕсли;
	
	СтруктураТитула.Документ.Вставить(
		"Оформитель",
		МодульКода("ESD_ТНВыгрузкаСервер").ДанныеЮрЛица("Оформитель", ДанныеДокумента, Истина));
	
КонецПроцедуры

Функция УсловияПеревозки(РеквизитыОбъекта)
	
	РезультатФункции = Новый Структура;
	
	ФорматЧисловогоЗначения = "ЧЦ=5; ЧДЦ=2; ЧРД=.";
	
	КлиматическийРежим = Новый Структура;
	КлиматическийРежим.Вставить("Влажность",   Новый Структура);
	КлиматическийРежим.Влажность.Вставить(
		"Минимальная",  Формат(РеквизитыОбъекта.ВлажностьОт, ФорматЧисловогоЗначения));
	КлиматическийРежим.Влажность.Вставить(
		"Максимальная", Формат(РеквизитыОбъекта.ВлажностьДо, ФорматЧисловогоЗначения));
	КлиматическийРежим.Вставить("Температура", Новый Структура);
	КлиматическийРежим.Температура.Вставить(
		"Минимальная",  Формат(РеквизитыОбъекта.ТемператураОт, ФорматЧисловогоЗначения));
	КлиматическийРежим.Температура.Вставить(
		"Максимальная", Формат(РеквизитыОбъекта.ТемператураДо, ФорматЧисловогоЗначения));
	
	РезультатФункции.Вставить("КлиматическийРежим",                    КлиматическийРежим);
	РезультатФункции.Вставить("Иные",                                  РеквизитыОбъекта.ИныеУсловия);
	РезультатФункции.Вставить("ПредельныйСрок",                        РеквизитыОбъекта.ПредельныйСрок);
	РезультатФункции.Вставить("ТребованияПоПеревозкеПищевыхПродуктов", РеквизитыОбъекта.ТребованияКТС);
	РезультатФункции.Вставить("УказанияНорм",                          РеквизитыОбъекта.СпецУсловия);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТолькоВремя(ДатаВремяСтрокой)
	
	РазделительВремени = "T";
	Если Найти(ДатаВремяСтрокой, РазделительВремени) = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	МассивЗначений = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ДатаВремяСтрокой, РазделительВремени);
	
	Возврат МассивЗначений[МассивЗначений.ВГраница()];
	
КонецФункции

#Область Груз

Функция Груз(ДанныеДокумента)
	
	МассивПозиций = Новый Массив;
	
	МассивДокументов = ДанныеДокумента.Грузы.ВыгрузитьКолонку("Договор");
	ДанныеДокументов = МодульКода("ESD_ТНОбщегоНазначенияСервер").РеквизитыДокументовСбис(МассивДокументов);
	
	Контейнер = ЗначениеМетаданных("ESD_ТипГруза.Контейнер");
	
	Для Каждого СтрокаГруза Из ДанныеДокумента.Грузы Цикл
		
		СтруктураГруза = ШаблонГруза();
		
		ЗаполнитьЗначенияСвойств(СтруктураГруза, СтрокаГруза, , "ОпасныйГруз");
		
		СтруктураГруза.Наименование = СтрокаГруза.Наименование;
		
		МетодОпределенияМассы = МодульКода("Перечисления.ESD_МетодОпределенияМассы").КодПоМетодуОпределенияМассы(
			СтрокаГруза.МетодОпределенияМассы, Истина);		
						
		РаспределениеПоДлинеПлатформы = Формат(СтрокаГруза.РаспределениеПоДлинеПлатформы, "БЛ=1; БИ=0");
		Делимость                     = Формат(СтрокаГруза.Делимость,                     "БЛ=0; БИ=1");
		ПогрузкаВодителем             = Формат(СтрокаГруза.ПогрузкаВодителем,             "БЛ=1; БИ=0");
		ГруженностьКонтейнера         = Формат(СтрокаГруза.Тип = Контейнер,               "БЛ=;  БИ=0");
		
		СтруктураГруза.МетодОпределенияМассы         = МетодОпределенияМассы;
		СтруктураГруза.РаспределениеПоДлинеПлатформы = РаспределениеПоДлинеПлатформы;
		СтруктураГруза.Делимость                     = Делимость;
		СтруктураГруза.ПогрузкаВодителем             = ПогрузкаВодителем;
		СтруктураГруза.ГруженностьКонтейнера         = ГруженностьКонтейнера;
		
		ДанныеДоговора = ДанныеДокументов.Получить(СтрокаГруза.Договор);
		Если ДанныеДоговора <> Неопределено Тогда
			Если ДанныеДоговора.Свойство("ДатаВремя") Тогда
				ОбработатьСлужебныеСвойстваСтруктурыДокумента(ДанныеДоговора, ДанныеДоговора.ДатаВремя);
			КонецЕсли;
			СтруктураГруза.Вставить("Договор", ДанныеДоговора);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаГруза.КлючСтроки_ДанныеЮрЛиц) Тогда
			
			ДанныеОрганизации = ДанныеОрганизации(ДанныеДокумента, СтрокаГруза.КлючСтроки_ДанныеЮрЛиц);			
			ДанныеОрганизации.Вставить("Ссылка", ДанныеДокумента.Ссылка);
			
			СтруктураГруза.Вставить(
				"Заказчик",
				МодульКода("ESD_ТНВыгрузкаСервер").ДанныеЮрЛица(ДанныеОрганизации.РольСтрокой, ДанныеОрганизации, Истина));
				
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаГруза.ОпасныйГруз) Тогда
			
			ОпасныеГрузыИзДокумента = Новый Массив;
			ОпасныйГруз             = Новый Массив;
			
			ОпасныеГрузыИзДокумента.Добавить(СтрокаГруза);
						
			МодульКода("ESD_ТНВыгрузкаСервер").ЗаполнитьОпасныйГрузДляВыгрузки(
				ОпасныеГрузыИзДокумента, ОпасныйГруз, ДанныеДокумента.ЭтоВО);
			СтруктураГруза.ОпасныйГруз = ОпасныйГруз[0];
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураГруза.Параметры, СтрокаГруза);
		СтруктураГруза.Параметры.Масса.Брутто = Формат(СтрокаГруза.МассаБрутто, "ЧДЦ=3; ЧРД=.; ЧГ=");
		СтруктураГруза.Параметры.Масса.Нетто  = Формат(СтрокаГруза.МассаНетто,  "ЧДЦ=3; ЧРД=.; ЧГ=");
		
		ЗаполнитьЗначенияСвойств(СтруктураГруза.ПунктыПогрузкиВыгрузки, СтрокаГруза);
		
		МассивПозиций.Добавить(СтруктураГруза);
		
	КонецЦикла;
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Позиция", МассивПозиций);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ШаблонГруза()
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Договор",                       "");
	РезультатФункции.Вставить("Заказчик",                      "");
	РезультатФункции.Вставить("ОпасныйГруз",                   Новый Структура);
	РезультатФункции.Вставить("Параметры",                     МодульКода("ESD_ТНВыгрузкаСервер").ШаблонПараметровГруза());
	РезультатФункции.Вставить("ПунктыПогрузкиВыгрузки",        Новый Структура);
	РезультатФункции.Вставить("ГруженностьКонтейнера",         "");
	РезультатФункции.Вставить("Делимость",                     "");
	РезультатФункции.Вставить("ДопИнформация",                 "");
	РезультатФункции.Вставить("МетодОпределенияМассы",         "");
	РезультатФункции.Вставить("Наименование",                  "");
	РезультатФункции.Вставить("ПогрузкаВодителем",             "");
	РезультатФункции.Вставить("РаспределениеПоДлинеПлатформы", "");
	РезультатФункции.Вставить("Состояние",                     "");
	РезультатФункции.Вставить("ТараКод",                       "");
	РезультатФункции.Вставить("ТараМасса",                     "");
	
	РезультатФункции.ПунктыПогрузкиВыгрузки.Вставить("КоличествоГрузовыхМест", "");
	
	РезультатФункции.Параметры.Вставить("Масса", Новый Структура);
	РезультатФункции.Параметры.Масса.Вставить("Брутто", 0);
	РезультатФункции.Параметры.Масса.Вставить("Нетто",  0);
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // Груз

Функция ДанныеОрганизации(ДанныеДокумента, КлючСтроки_ДанныеЮрЛиц)
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ДанныеЮрЛиц",      Новый Массив);
	РезультатФункции.Вставить("КонтактныеДанные", Новый Массив);
	РезультатФункции.Вставить("РольСтрокой",      "");
	РезультатФункции.Вставить("ИмяМетаданных",    ДанныеДокумента.ИмяМетаданных);
	
	ОтборЮрЛиц = Новый Структура();
	ОтборЮрЛиц.Вставить("КлючСтроки", КлючСтроки_ДанныеЮрЛиц);
	
	РезультатФункции.ДанныеЮрЛиц = ДанныеДокумента.ДанныеЮрЛиц.НайтиСтроки(ОтборЮрЛиц);
		
	Если РезультатФункции.ДанныеЮрЛиц.Количество() > 0 Тогда
		
		Роль = РезультатФункции.ДанныеЮрЛиц[0].Роль;
		МетаданныеПеречисления = Роль.Метаданные();
		ИменаПеречисления = МодульКода("ESD_ТНОбщегоНазначенияСервер").ВсеЗначенияПеречисленияПоСинониму(МетаданныеПеречисления.Имя);
			
		РезультатФункции.РольСтрокой = ИменаПеречисления[СокрЛП(Роль)];
		
	КонецЕсли;
	
	ОтборКИ = Новый Структура();
	ОтборКИ.Вставить("КлючСтроки_ДанныеЮрЛиц", КлючСтроки_ДанныеЮрЛиц);

	РезультатФункции.КонтактныеДанные = ДанныеДокумента.КонтактныеДанные.НайтиСтроки(ОтборКИ);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ОбработатьСлужебныеСвойстваСтруктурыДокумента(ДанныеДокумента, ДатаДокумента)
	
	ДанныеДокумента.Вставить("Дата", Формат(ДатаДокумента, "ДФ=dd.MM.yyyy"));
	
	УдаляемыеСвойства = Новый Массив;
	УдаляемыеСвойства.Добавить("ДатаВремя");
	УдаляемыеСвойства.Добавить("Тип");
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").УдалитьСвойстваИзСтруктуры(ДанныеДокумента, УдаляемыеСвойства);
				
 КонецПроцедуры
 
#КонецОбласти // Выгрузка_Оформление 
 
#Область Выгрузка_Утверждение 

Функция ТитулУтверждение(ДанныеДокумента)
	
	СтруктураТитула = Новый Структура;
	
	СтруктураТитула.Вставить("СтоимостьПеревозки", СтоимостьПеревозки(ДанныеДокумента));
	
	МодульТНВыгрузкаСервер = МодульКода("ESD_ТНВыгрузкаСервер");
	
	// ТС и прицеп
	СтруктураТитула.Вставить(
		"ТранспортноеСредство",
		МодульТНВыгрузкаСервер.ПодстановкиТранспортногоСредства(ДанныеДокумента));
	
	СтруктураТитула.ТранспортноеСредство.Вставить(
		"Прицеп", МодульТНВыгрузкаСервер.ПодстановкиПрицепов(ДанныеДокумента));
	
	СтруктураТитула.ТранспортноеСредство.Вставить(
		"СпецУсловия", МодульТНВыгрузкаСервер.СпецУсловия(ДанныеДокумента.СпецРазрешения));
	
	// Грузоперевозчик
	Грузоперевозчик = Новый Структура;
	
	// Уполномоченные лица
	ЗаполнитьУполномоченныхЛиц(Грузоперевозчик, ДанныеДокумента, "УполномоченноеЛицоПеревозчика");
	
	ДанныеОтветственного = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОтветственного(
		ДанныеДокумента.ОтветственныеЛица, "Ответственный");
		
	Грузоперевозчик.Вставить("Ответственный", ОтветственноеЛицо(ДанныеОтветственного));
	
	СтруктураТитула.Вставить("Грузоперевозчик", Грузоперевозчик);
	
	// Водители
	СтруктураТитула.Вставить("Водители", ВодителиДляВыгрузки(ДанныеДокумента));
	
	Возврат СтруктураТитула;
	
КонецФункции

Функция СтоимостьПеревозки(Реквизиты)
	
	СтоимостьПеревозки = Новый Структура;
	СтоимостьПеревозки.Вставить("Валюта", Новый Структура);
	СтоимостьПеревозки.Вставить("Налог",  Новый Структура);
	
	// Валюта
	Если ЗначениеЗаполнено(Реквизиты.ВалютаКод) Тогда
		КодВалюта          = Реквизиты.ВалютаКод;
		ВалютаНаименование = Реквизиты.ВалютаНаименование;
	Иначе
		КодВалюта          = "643";
		ВалютаНаименование = "Российский рубль";
	КонецЕсли;
	
	СтоимостьПеревозки.Валюта.Вставить("Код",          КодВалюта);
	СтоимостьПеревозки.Валюта.Вставить("Наименование", ВалютаНаименование);
	
	// Ставка НДС
	СтоимостьПеревозки.Налог.Вставить("Ставка", Реквизиты.СтавкаНДС);
	
	СтоимостьПеревозки.Вставить("БезНДС",     Реквизиты.СуммаБезНДС);
	СтоимостьПеревозки.Вставить("ВключаяНДС", Реквизиты.СуммаСНДС);
	СтоимостьПеревозки.Вставить("Расчет",     Реквизиты.МеханизмРасчета);
	
    Возврат СтоимостьПеревозки;
	
КонецФункции

Функция ОтветственноеЛицо(ДанныеОтветственного)
	
	Ответственный = Новый Структура;
	Ответственный.Вставить("Имя",      "");
	Ответственный.Вставить("Отчество", "");
	Ответственный.Вставить("Фамилия",  "");
	Ответственный.Вставить("Телефон",  "");
	
	ЗаполнитьЗначенияСвойств(Ответственный, ДанныеОтветственного);
	
	МодульКода("ESD_ТНВыгрузкаСервер").ЗаполнитьТелефоныОтветственного(ДанныеОтветственного, Ответственный);
	
	Возврат Ответственный;
	
КонецФункции

Функция ВодителиДляВыгрузки(ДанныеДокумента)
	
	Водители = Новый Массив;
	
	Отбор = Новый Структура("Роль", ЗначениеМетаданных("ESD_РолиОтветственных.Водитель"));
	СтрокиВодителей = ДанныеДокумента.ОтветственныеЛица.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаВодитель Из СтрокиВодителей Цикл
		
		ИндексСтроки = СтрокаВодитель.НомерСтроки - 1;
		
		Водитель = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОтветственного(
			ДанныеДокумента.ОтветственныеЛица, 
			"Водитель", 
			ИндексСтроки);		
		
		Водители.Добавить(Водитель);		
		
	КонецЦикла;
	
	Исключения = Новый Массив;
	Исключения.Добавить("СведенияПЭП");
	Исключения.Добавить("ПутевойЛист");
		
	ДанныеВодителей = МодульКода("ESD_ТНВыгрузкаСервер").ПодстановкиВодителя(Водители, Новый Массив, Исключения);
	
	Возврат ДанныеВодителей;
	
КонецФункции

#КонецОбласти // Выгрузка_Утверждение

Процедура ЗаполнитьУполномоченныхЛиц(СтруктураДляДобавленияЛиц, ДанныеДокумента, РольСтрокой)
	
	Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов." + РольСтрокой);
	
	ОтборУполномоченных = Новый Структура;
	ОтборУполномоченных.Вставить("Роль", Роль);
	
	НайденныеУполномоченные = ДанныеДокумента.ДанныеЮрЛиц.НайтиСтроки(ОтборУполномоченных);
	
	Если НайденныеУполномоченные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОрганизации = Новый Структура;
	ДанныеОрганизации.Вставить("Ссылка",           ДанныеДокумента.Ссылка);
	ДанныеОрганизации.Вставить("ИмяМетаданных",    ДанныеДокумента.ИмяМетаданных);
	ДанныеОрганизации.Вставить("ДанныеЮрЛиц",      Новый Массив);
	ДанныеОрганизации.Вставить("КонтактныеДанные", ДанныеДокумента.КонтактныеДанные);
	
	МассивДокументов = ДанныеДокумента.ДанныеЮрЛиц.ВыгрузитьКолонку("Основание");
	ДанныеДокументов = МодульКода("ESD_ТНОбщегоНазначенияСервер").РеквизитыДокументовСбис(МассивДокументов);
	
	МассивУполномоченныхЛиц = Новый Массив;
	
	Для Каждого СтрокаЮрЛица Из НайденныеУполномоченные Цикл
		
		ДанныеОрганизации.ДанныеЮрЛиц.Очистить();
		ДанныеОрганизации.ДанныеЮрЛиц.Добавить(СтрокаЮрЛица);
		
		СтруктураОрганизации = МодульКода("ESD_ТНВыгрузкаСервер").ДанныеЮрЛица(РольСтрокой, ДанныеОрганизации, Истина);
		
		ДанныеОснования = ДанныеДокументов.Получить(СтрокаЮрЛица.Основание);
		Если ДанныеОснования <> Неопределено Тогда
			ОбработатьСлужебныеСвойстваСтруктурыДокумента(ДанныеОснования, ДанныеОснования.Дата);	
			СтруктураОрганизации.Вставить("Документ",   ДанныеОснования);
			СтруктураОрганизации.Вставить("Полномочия", СтрокаЮрЛица.Полномочия);
		КонецЕсли;
		
		МассивУполномоченныхЛиц.Добавить(СтруктураОрганизации);
		
	КонецЦикла;
	
	Если Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицоПеревозчика") Тогда
		СтруктураДляДобавленияЛиц.Вставить("УполномоченноеЛицо", МассивУполномоченныхЛиц[0]);
	Иначе
		СтруктураДляДобавленияЛиц.Вставить("УполномоченныеЛица", МассивУполномоченныхЛиц);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // Выгрузка

#Область Загрузка

Процедура ЗагрузкаТитулаОформление(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	Если Не Вложения.Количество() Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеОформление = ДанныеОформление(ОбъектДок, Вложения, Титул, ДопПараметры);
	
	ДанныеТитула = ДанныеОформление[ДанныеОформление.ВГраница()];
	
	Если Не ДопПараметры.ТолькоАктивныйЭтап Тогда
		
		МодульТНЗагрузкаСервер = МодульКода("ESD_ТНЗагрузкаСервер");
		
		ЗаполнитьЗначенияСвойств(ОбъектДок, ДанныеТитула.ДляДокумента);
				
		МодульТНЗагрузкаСервер.ЗаполнитьДанныеТСИПрицеповДокумента(ОбъектДок, ДанныеТитула.ДляДокумента);
		
		ЗаполнитьСтрокиТаблицы(ОбъектДок, ДанныеТитула.ДляДокумента, "АдресаПромежуточныхПунктов");
		
		ЗаполнитьСтрокиТаблицы(ОбъектДок, ДанныеТитула.ДляДокумента, "АдресаПунктовВыгрузки");
		
		РолиДляЗаполнения = Новый Массив;
		РолиДляЗаполнения.Добавить(ЗначениеМетаданных("ESD_РолиКонтрагентов.Отправитель"));
		РолиДляЗаполнения.Добавить(ЗначениеМетаданных("ESD_РолиКонтрагентов.Перевозчик"));
		РолиДляЗаполнения.Добавить(ЗначениеМетаданных("ESD_РолиКонтрагентов.Отгрузчик"));
		РолиДляЗаполнения.Добавить(ЗначениеМетаданных("ESD_РолиКонтрагентов.Заказчик"));
		РолиДляЗаполнения.Добавить(ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицо"));
		РолиДляЗаполнения.Добавить(ЗначениеМетаданных("ESD_РолиКонтрагентов.Оформитель"));
		Для Каждого РольДляЗаполнения Из РолиДляЗаполнения Цикл
			Если НеобходимоЗаполнитьДанныеЮрЛиц(ДопПараметры, РольДляЗаполнения) Тогда
				МодульТНЗагрузкаСервер.ЗаполнитьДанныеЮрЛицИКонтактнуюИнформацию(
					ОбъектДок, ДанныеТитула.ДляДокумента, РольДляЗаполнения, ДопПараметры);
			КонецЕсли;
		КонецЦикла;
		
		МодульТНЗагрузкаСервер.ЗаполнитьДанныеПоГрузам(ОбъектДок, ДанныеТитула.ДляДокумента, ДопПараметры);
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(ОбъектДок, ДанныеТитула.ДляДокумента, "НомерСбис");
		
	КонецЕсли;
	
	Если ДопПараметры.ЗагрузкаСОнлайна Тогда
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ЗаписатьДанные(ДанныеОформление, ОбъектДок, ДопПараметры.ИмяМетаданных);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузкаТитулаУтверждение(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	Если Не Вложения.Количество() Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеУтверждение = ДанныеУтверждение(ОбъектДок, Вложения, Титул, ДопПараметры);
	
	ДанныеТитула = ДанныеУтверждение[ДанныеУтверждение.ВГраница()];
	ЗаполнитьЗначенияСвойств(ОбъектДок, ДанныеТитула.ДляДокумента);
	
	Если Не ДопПараметры.ТолькоАктивныйЭтап Тогда
		
		МодульТНЗагрузкаСервер = МодульКода("ESD_ТНЗагрузкаСервер");
		
		МодульТНЗагрузкаСервер.ЗаполнитьДанныеЮрЛицИКонтактнуюИнформацию(
			ОбъектДок,
			ДанныеТитула.ДляДокумента,
			ЗначениеМетаданных("ESD_РолиКонтрагентов.УполномоченноеЛицоПеревозчика"),
			ДопПараметры);
		
		МодульТНЗагрузкаСервер.ЗаполнитьОтветственныхЛиц(
			ОбъектДок,
			ДанныеТитула.ДляДокумента.ОтветственныеЗаПеревозку,
			ЗначениеМетаданных("ESD_РолиОтветственных.Ответственный"));
		
		МодульТНЗагрузкаСервер.ЗаполнитьДанныеТСИПрицеповДокумента(ОбъектДок, ДанныеТитула.ДляДокумента);
		
		МодульТНЗагрузкаСервер.ЗаполнитьОтветственныхЛиц(
			ОбъектДок,
			ДанныеТитула.ДляДокумента.ОтветственныеЛица,
			ЗначениеМетаданных("ESD_РолиОтветственных.Водитель"));
		
	КонецЕсли;
		
	МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ЗаписатьДанные(
		ДанныеУтверждение, ОбъектДок, ДопПараметры.ИмяМетаданных);
	
КонецПроцедуры

#Область ДанныеТитуловДляЗагрузки

Функция ДанныеОформление(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	РезультатФункции = Новый Массив;
	
	ВложенияДляЗагрузки = МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ВложенияДляЗагрузки(
		ОбъектДок, Титул, Вложения, ДопПараметры);
	
	Для Каждого Вложение Из ВложенияДляЗагрузки Цикл
		
		ДляДокумента = Новый Структура;
		ДляДокумента.Вставить("КлючСтроки",       ДопПараметры.КлючСтроки);
		ДляДокумента.Вставить("Валюта",           Неопределено);
		ДляДокумента.Вставить("ДанныеЮрЛиц",      Новый Массив);
		ДляДокумента.Вставить("КонтактныеДанные", Новый Массив);
		ДляДокумента.Вставить("ДокументыЭПД",     Новый Массив);
						
		// Документ
		ЗагрузитьДанныеДокумента(ДляДокумента, Вложение["Документ"], ДопПараметры);
		
		// Документы ЭПД
		ЗагрузитьДанныеДокументовЭПД(ДляДокумента, Вложение);
		
        // Маршрут
	    ЗагрузитьМаршрут(ДляДокумента, Вложение["Маршрут"]);
		
	    // Условия перевозки
	    ЗагрузитьУсловияПеревозки(ДляДокумента, Вложение["УсловияПеревозки"]);
		
		// Параметры ТС
		ЗагрузитьПараметрыТС(ДляДокумента, Вложение["ПараметрыТС"]);
		
		// Груз
		МодульКода("ESD_ТНЗагрузкаСервер").ЗагрузитьДанныеПоГрузам(
			ДляДокумента, Вложение["Груз"], ДопПараметры.ЗагрузкаСОнлайна, Ложь);
		
		// ЮрЛица
		ЗаполнитьДанныеЮрЛиц(ДляДокумента, Вложение);
				
		ДляРегистра = СтруктураДанныхДляРегистра(ОбъектДок, Вложение, Титул, ДопПараметры.ИмяМетаданных);
		
		РезультатФункции.Добавить(МодульКода("ESD_ТНЗагрузкаСервер").СтруктураТитула(Титул, ДляДокумента, ДляРегистра));
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДанныеУтверждение(ОбъектДок, Вложения, Титул, ДопПараметры)
	
	РезультатФункции = Новый Массив;
	
	ВложенияДляЗагрузки = МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ВложенияДляЗагрузки(
		ОбъектДок, Титул, Вложения, ДопПараметры);
		
	МодульТНЗагрузкаСервер = МодульКода("ESD_ТНЗагрузкаСервер");
		
	Для Каждого Вложение Из ВложенияДляЗагрузки Цикл
		
		ДляДокумента = Новый Структура;
		ДляДокумента.Вставить("КлючСтроки",       ДопПараметры.КлючСтроки);
		ДляДокумента.Вставить("ДанныеЮрЛиц",      Новый Массив);
		ДляДокумента.Вставить("КонтактныеДанные", Новый Массив);
		ДляДокумента.Вставить("ДокументыЭПД",     Новый Массив);
		
		ЗагрузитьДанныеПоСтоимости(ДляДокумента, Вложение["СтоимостьПеревозки"]);
		
		СтруктураОтветственного = Новый Структура;
		МодульТНЗагрузкаСервер.ЗагрузитьОтветственного(
			СтруктураОтветственного,
			МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(Вложение, "Грузоперевозчик.Ответственный"));
		СтруктураОтветственного.Вставить("Роль", ЗначениеМетаданных("ESD_РолиОтветственных.Ответственный"));
		
		ДляДокумента.Вставить("ОтветственныеЗаПеревозку", Новый Массив);
		ДляДокумента.ОтветственныеЗаПеревозку.Добавить(СтруктураОтветственного);
					
		УполномоченноеЛицо = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
			Вложение, "Грузоперевозчик.УполномоченноеЛицо");
		МодульТНЗагрузкаСервер.ЗагрузитьДанныеЮрЛиц(ДляДокумента, УполномоченноеЛицо, "УполномоченноеЛицоПеревозчика");
		
		МодульТНЗагрузкаСервер.ДанныеТСПрицеповСпецРазрешений(ОбъектДок, ДляДокумента, Вложение["ТранспортноеСредство"]);
		
		МодульТНЗагрузкаСервер.ДанныеВодителей(ОбъектДок, ДляДокумента, Вложение["Водители"], ДопПараметры);
		
		ЗагрузитьКомментарийОтрицательногоЗавершения(ДляДокумента, Вложение);
		
		ДляРегистра = СтруктураДанныхДляРегистра(ОбъектДок, Вложение, Титул, ДопПараметры.ИмяМетаданных);
		
		РезультатФункции.Добавить(МодульТНЗагрузкаСервер.СтруктураТитула(Титул, ДляДокумента, ДляРегистра));
		
	КонецЦикла;
			
	Возврат РезультатФункции;
	
КонецФункции

Функция СтруктураДанныхДляРегистра(ОбъектДок, Вложение, Титул, ИмяМетаданных, СохранитьДанные = Ложь)
	
	Основной = Не МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатФункцииТитулов(
		ЗаказНаПеревозку(), "ЭтоДинамическийТитул", Титул);
	
	СтруктураДанныхДляРегистра = МодульКода("ESD_ТНЗагрузкаСервер").ШаблонСтруктурыДанныхДляРегистра(
		ОбъектДок.Ссылка, Титул, Основной);
	СтруктураДанныхДляРегистра.Просмотрено     = Истина;
	СтруктураДанныхДляРегистра.СохранитьДанные = СохранитьДанные;
	
	Вложение.Вставить("ЗагруженВРегистр", Вложение["ЗагруженВРегистр"] Или Вложение["ИдентификаторВложенияТитула"] = "");
	
	Возврат МодульКода("ESD_ТНЗагрузкаСервер").ДанныеДляРегистраТитулов(Вложение, ИмяМетаданных, СтруктураДанныхДляРегистра);
		
КонецФункции

#КонецОбласти // ДанныеТитуловДляЗагрузки

Процедура ЗагрузитьДанныеДокумента(ДляДокумента, ДокументСОнлайна, ДопПараметры)
	
	Если Не ЗначениеЗаполнено(ДокументСОнлайна) Тогда
		Возврат;
	КонецЕсли;
		
	ДляДокумента.Вставить("НомерСБИС", ДокументСОнлайна["Номер"]);
	
	ТипДокумента = ДокументСОнлайна["Тип"];
	Если ДопПараметры.ЗагрузкаСОнлайна Или ЗначениеЗаполнено(ТипДокумента) Тогда
		ЗначениеТипа = МодульКода("Перечисления.ESD_ТипДокументаЗнП").ЗначениеПоКоду(ТипДокумента);
		ДляДокумента.Вставить("ТипДокумента", ЗначениеТипа);
	КонецЕсли;	
	
	Если Не ДопПараметры.ЗагрузкаСОнлайна Тогда
		ДляДокумента = МодульКода("ESD_ТНОбщегоНазначенияСервер").СтруктураБезПустыхЗначений(ДляДокумента);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьМаршрут(ДляДокумента, Маршрут)
	
	Если Не ЗначениеЗаполнено(Маршрут) Тогда
		Возврат;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	// Конечный пункт
	ДляДокумента.Вставить(
		"КонечнаяТочкаАдрес",
		МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Маршрут, "КонечныйПункт.Название"));
	
	// Отправление
	Отправление = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Маршрут, "Отправление");
	
	ДляДокумента.Вставить(
		"ПодачаАдрес",
		МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Отправление, "АдресТекст"));
	
	// Подача ТС
	ПодачаДата = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Отправление, "ПодачаТС.ДатаВремя");
	ПодачаДата = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(ПодачаДата);
	
	ДляДокумента.Вставить("ПодачаДатаВремя", ПодачаДата);
	
	Интервал = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		Отправление, "ПодачаТС.ПредельныйИнтервалВремени");
	Интервал = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВоВремя(Интервал);
	
	ДляДокумента.Вставить("ПодачаПредельныйИнтервал", Интервал);
	
	ЗагрузитьПромежуточныеПункты(ДляДокумента, Маршрут);
	
	ЗагрузитьПунктыВыгрузки(ДляДокумента, Маршрут);
	
КонецПроцедуры

Процедура ЗагрузитьПромежуточныеПункты(ДляДокумента, Маршрут)
	
	ПромежуточныеПункты = Маршрут["ПромежуточныйПункт"];
	
	Если Не ЗначениеЗаполнено(ПромежуточныеПункты) Тогда
		Возврат;
	КонецЕсли;
	
	АдресаПромежуточныхПунктов = Новый Массив;
	Для Каждого Пункт Из ПромежуточныеПункты Цикл
		
		НазваниеПункта = Пункт["Название"];
		
		Если Не ЗначениеЗаполнено(НазваниеПункта) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПункта = Новый Структура;
		СтруктураПункта.Вставить("Значение", НазваниеПункта);
		
		АдресаПромежуточныхПунктов.Добавить(СтруктураПункта);
		
	КонецЦикла;
	
	ДляДокумента.Вставить("АдресаПромежуточныхПунктов", АдресаПромежуточныхПунктов);
	
КонецПроцедуры

Процедура ЗагрузитьПунктыВыгрузки(ДляДокумента, Маршрут)
	
	Пункты = Маршрут["Пункт"];
	Если Не ЗначениеЗаполнено(Пункты) Тогда
		Возврат;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	АдресаПунктовВыгрузки = Новый Массив;	
	Для Каждого Пункт Из Пункты Цикл
		
		АдресТекст = Пункт["АдресТекст"];
		
		Если Не ЗначениеЗаполнено(АдресТекст) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПункта = Новый Структура;
		СтруктураПункта.Вставить("Значение", АдресТекст);
		
		// Операция
		ДатаВремяСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Пункт, "Операция.ДатаВремя");
		СтруктураПункта.Вставить(
			"ДатаВремя",
			МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВДатуЭПД(ДатаВремяСтрокой));
		
		ИнтервалСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			Пункт, "Операция.ПредельныйИнтервалВремени");
		СтруктураПункта.Вставить(
			"ДопустимоеВремя", 
			МодульКода("ESD_ТНОбщегоНазначенияСервер").ПреобразоватьСтрокуВоВремя(ИнтервалСтрокой));
		 			
		Тип = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Пункт, "Операция.Тип");
		СтруктураПункта.Вставить("ЭтоПогрузка", Тип = "Погрузка");
		
		Если СтруктураПункта.ЭтоПогрузка Тогда
			СтруктураПункта.Вставить(
				"ОрганизацияСтрока", 
				МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Пункт, "Организация.Название"));
			
			СтруктураПункта.Вставить(
				"ОрганизацияИНН",
				МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Пункт, "Организация.ИНН"));
				
			ДобавитьДанныеЮрЛицПункта(ДляДокумента, СтруктураПункта);
		КонецЕсли;
			
		АдресаПунктовВыгрузки.Добавить(СтруктураПункта);
		
	КонецЦикла;
	
	ДляДокумента.Вставить("АдресаПунктовВыгрузки", АдресаПунктовВыгрузки);
	
КонецПроцедуры

Процедура ДобавитьДанныеЮрЛицПункта(ДляДокумента, СтруктураПункта)
	
	Если Не ЗначениеЗаполнено(СтруктураПункта.ОрганизацияИНН) Тогда
		Возврат;
	КонецЕсли;
	
	КлючСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(ДляДокумента, "ДанныеЮрЛиц");
	
	СтруктураУполномоченногоЛица = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ШаблонДанныхЮрЛица();
	СтруктураУполномоченногоЛица.Роль                    = ЗначениеМетаданных("ESD_РолиКонтрагентов.Отгрузчик");
	СтруктураУполномоченногоЛица.ИНН                     = СтруктураПункта.ОрганизацияИНН;
	СтруктураУполномоченногоЛица.НаименованиеОрганизации = СтруктураПункта.ОрганизацияСтрока;
	СтруктураУполномоченногоЛица.КлючСтроки              = КлючСтроки;
	
	ДляДокумента.ДанныеЮрЛиц.Добавить(СтруктураУполномоченногоЛица);
	
	СтруктураПункта.Вставить("КлючСтроки_ДанныеЮрЛиц", КлючСтроки);
	
КонецПроцедуры

Процедура ЗагрузитьУсловияПеревозки(ДляДокумента, УсловияПеревозки)
	
	Если Не ЗначениеЗаполнено(УсловияПеревозки) Тогда
		Возврат;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	// УсловияПеревозки
	СпецУсловия    = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(УсловияПеревозки, "УказанияНорм");
	ПредельныйСрок = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(УсловияПеревозки, "ПредельныйСрок");
	ИныеУсловия    = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(УсловияПеревозки, "Иные");
	ТребованияКТС  = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		УсловияПеревозки, "ТребованияПоПеревозкеПищевыхПродуктов");
	
	ДляДокумента.Вставить("СпецУсловия",    СпецУсловия);		
	ДляДокумента.Вставить("ПредельныйСрок", ПредельныйСрок);		
	ДляДокумента.Вставить("ИныеУсловия",    ИныеУсловия);		
	ДляДокумента.Вставить("ТребованияКТС",  ТребованияКТС);
		
	// Климатический режим
	КлиматическийРежим = УсловияПеревозки["КлиматическийРежим"];
	
	ВлажностьОт   = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(КлиматическийРежим, "Влажность.Минимальная");
	ВлажностьДо   = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(КлиматическийРежим, "Влажность.Максимальная");
	ТемператураОт = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(КлиматическийРежим, "Температура.Минимальная");
	ТемператураДо = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(КлиматическийРежим, "Температура.Максимальная");
				
	ДляДокумента.Вставить("ВлажностьОт",   ВлажностьОт);		
	ДляДокумента.Вставить("ВлажностьДо",   ВлажностьДо);		
	ДляДокумента.Вставить("ТемператураОт", ТемператураОт);		
	ДляДокумента.Вставить("ТемператураДо", ТемператураДо);
	
КонецПроцедуры

Процедура ЗагрузитьПараметрыТС(ДляДокумента, ПараметрыТС)
	
	Если Не ЗначениеЗаполнено(ПараметрыТС) Тогда
		Возврат;
	КонецЕсли;                            
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ТипТС      = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ПараметрыТС, "Тип");
	КузовТС    = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ПараметрыТС, "ТипКузова");
	ПогрузкаТС = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ПараметрыТС, "ТипПогрузки");
	
	ДляДокумента.Вставить("ТипТС",      ТипТС);
	ДляДокумента.Вставить("КузовТС",    КузовТС);
	ДляДокумента.Вставить("ПогрузкаТС", ПогрузкаТС);
									
	ГрузоподъемностьТС = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ПараметрыТС, "Грузоподъемность");
	ВместимостьТС      = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ПараметрыТС, "Вместимость");
	
	ДляДокумента.Вставить("ГрузоподъемностьТС", ГрузоподъемностьТС);
	ДляДокумента.Вставить("ВместимостьТС",      ВместимостьТС);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеДокументовЭПД(ДляДокумента, ДанныеДокументов)
	
	Если Не ЗначениеЗаполнено(ДанныеДокументов) Тогда
		Возврат;
	КонецЕсли;
	
	МодульТНЗагрузкаСервер = МодульКода("ESD_ТНЗагрузкаСервер");
	
	НачальныйИндекс = ДляДокумента.ДокументыЭПД.Количество();
	
	Договор = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(ДанныеДокументов, "Договор");
	ЕстьДоговор = ДляДокумента.Свойство("ТипДокумента")
		И ДляДокумента.ТипДокумента = ЗначениеМетаданных("ESD_ТипДокументаЗнП.Заявка")
		И ЗначениеЗаполнено(Договор);
		
	Если ЕстьДоговор Тогда
		МодульТНЗагрузкаСервер.ЗагрузитьДокументыЭПД(ДляДокумента, Договор, ЗначениеМетаданных("ESD_ТипыДокумента.ДоговорПеревозки"));
	КонецЕсли;
	
	СоставительОснование = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		ДанныеДокументов, "Файл.Составитель.Основание");
		
	МодульТНЗагрузкаСервер.ЗагрузитьДокументыЭПД(
		ДляДокумента, СоставительОснование, ЗначениеМетаданных("ESD_ТипыДокумента.СоставительНаОсновании"));
	
	МодульТНЗагрузкаСервер.ЗаполнитьСсылкиНаДокументЭПД(ДляДокумента);
	
	Для ИндексДокументаЭПД = НачальныйИндекс По ДляДокумента.ДокументыЭПД.ВГраница() Цикл
		СтруктураДокументаЭПД = ДляДокумента.ДокументыЭПД[ИндексДокументаЭПД];
		Если СтруктураДокументаЭПД.Тип = ЗначениеМетаданных("ESD_ТипыДокумента.ДоговорПеревозки") Тогда
			ДляДокумента.Вставить("Договор", СтруктураДокументаЭПД.Ссылка);
		Иначе
			ДляДокумента.Вставить("Составитель_НаОснованииДокумент", СтруктураДокументаЭПД.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиТаблицы(ОбъектДок, ДляДокумента, НазваниеТаблицы)
	
	Если Не ДляДокумента.Свойство(НазваниеТаблицы) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектДок[НазваниеТаблицы].Очистить();
	
	Для Каждого СтрокаТаблицы Из ДляДокумента[НазваниеТаблицы] Цикл
		НоваяСтрока = ОбъектДок[НазваниеТаблицы].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеЮрЛиц(ДляДокумента, Вложение)
	
	Модуль_ТНЗагрузкаСервер = МодульКода("ESD_ТНЗагрузкаСервер");
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Модуль_ТНЗагрузкаСервер.ЗагрузитьДанныеЮрЛиц(ДляДокумента, Вложение["Грузоотправитель"], "Отправитель");
	Модуль_ТНЗагрузкаСервер.ЗагрузитьДанныеЮрЛиц(ДляДокумента, Вложение["Грузоперевозчик"], "Перевозчик");
	
	УполномоченныеЛица = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		Вложение, "Грузоотправитель.УполномоченныеЛица");
	Модуль_ТНЗагрузкаСервер.ЗагрузитьДанныеЮрЛиц(ДляДокумента, УполномоченныеЛица, "УполномоченноеЛицо");
	
	ГрузоотправительСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеЮрЛицаПоРоли(
		ДляДокумента.ДанныеЮрЛиц, "Отправитель");
	
	// Составитель
	Основание = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Вложение, "Файл.Составитель.Основание.Документ");
	Если ЗначениеЗаполнено(Основание) Тогда 
	
		Составитель = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Вложение, "Файл.Составитель.Наименование");
		ДляДокумента.Вставить("ПредставительЗаказчикаНаименование", Составитель);
		
		СтруктураДанныхЮрЛица = МодульТНОбщегоНазначенияКлиентСервер.ШаблонДанныхЮрЛица();
		СтруктураДанныхЮрЛица.Роль                    = ЗначениеМетаданных("ESD_РолиКонтрагентов.Оформитель");
		СтруктураДанныхЮрЛица.НаименованиеОрганизации = Составитель;
		СтруктураДанныхЮрЛица.КлючСтроки              = МодульТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(
			ДляДокумента, "ДанныеЮрЛиц");
		
		ДляДокумента.ДанныеЮрЛиц.Добавить(СтруктураДанныхЮрЛица);
		
		Тип = ЗначениеМетаданных("ESD_ТипыДокумента.СоставительНаОсновании");	
		ОснованиеСсылка = Модуль_ТНЗагрузкаСервер.СсылкаНаДокументЭПД(ДляДокумента, Основание, Тип);
		
		ДляДокумента.Вставить("ПредставительЗаказчика_Основание", ОснованиеСсылка);
		СтруктураДанныхЮрЛица.Основание = ОснованиеСсылка; 
		
	КонецЕсли;
	
	ЭтоПредставитель = (ЗначениеЗаполнено(Составитель) И ГрузоотправительСтрокой <> Составитель);
	ДляДокумента.Вставить("ПредставительЗаказчика", ЭтоПредставитель);
	
КонецПроцедуры

Процедура ДополнитьКонтактнуюИнформацию(КонтактныеДанные, МассивКИ, КлючСтроки_ДанныеЮрЛиц = 0)
	
	Если Не ЗначениеЗаполнено(МассивКИ) Тогда
		Возврат;
	КонецЕсли;
		
	Для Каждого ЭлементКИ Из МассивКИ Цикл
		ЭлементКИ.Вставить("КлючСтроки_ДанныеЮрЛиц", КлючСтроки_ДанныеЮрЛиц);
		КонтактныеДанные.Добавить(ЭлементКИ);	
	КонецЦикла;
		
КонецПроцедуры

Функция НеобходимоЗаполнитьДанныеЮрЛиц(ДопПараметры, Роль)
	
	Если Не ДопПараметры.ПараметрыОснования.Свойство("РольКонтрагента")
		Или Не ЗначениеЗаполнено(ДопПараметры.ПараметрыОснования.РольКонтрагента) Тогда
		Возврат Истина;
	Иначе
		Возврат ДопПараметры.ПараметрыОснования.РольКонтрагента = СокрЛП(Роль);
	КонецЕсли;
	
КонецФункции

Процедура ЗагрузитьДанныеПоСтоимости(ДляДокумента, СтоимостьПеревозки)
	
	Если СтоимостьПеревозки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ДляДокумента.Вставить("ВалютаКод", МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(СтоимостьПеревозки, "Валюта.Код"));
	ДляДокумента.Вставить(
		"ВалютаНаименование", МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(СтоимостьПеревозки, "Валюта.Наименование"));
	
	СтавкаНДС = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(СтоимостьПеревозки, "Налог.Ставка");
	Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
		СтавкаНДС = "без НДС";
	КонецЕсли;
	ДляДокумента.Вставить("СтавкаНДС",       СтавкаНДС);
	ДляДокумента.Вставить("СуммаБезНДС",     СтоимостьПеревозки["БезНДС"]);
	ДляДокумента.Вставить("СуммаСНДС",       СтоимостьПеревозки["ВключаяНДС"]);
	ДляДокумента.Вставить("Сумма",           СтоимостьПеревозки["ВключаяНДС"]);
	ДляДокумента.Вставить("МеханизмРасчета", СтоимостьПеревозки["Расчет"]);
	
КонецПроцедуры

Процедура ЗагрузитьКомментарийОтрицательногоЗавершения(ДляДокумента, Вложение)
	
	ОтветПеревозчика = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(Вложение, "Документ.Ответ.Значение");
	ОтказаноВПриемке = ОтветПеревозчика = "2";
	
	Если ОтказаноВПриемке Тогда
		ДляДокумента.Вставить(
			"КомментарийУведомление",
			МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(Вложение, "Документ.Ответ.Причина"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // Загрузка

#Область ХранилищеОбщихНастроек

Функция КлючОбщихНастроек()
	Возврат "ESD_ЗаказНаПеревозку";
КонецФункции

#КонецОбласти

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_CommonModule_Метаданные
#КонецОбласти // include_etrn_base_CommonModule_Метаданные

