
Процедура ДокументОснование_ПараметрыЗаполнения_Заполнить(Форма, ПараметрыЗаполнения) Экспорт
	Таблица_ = Форма[ДокументОснование_ПараметрыЗаполнения_ИмяРеквизитаФормы()];
	Таблица_.Очистить();
	Если Не ЗначениеЗаполнено(ПараметрыЗаполнения.Основание) Тогда
		Возврат;
	КонецЕсли;

	ОсновнойИсточник_ = Таблица_.Добавить();
	ЗаполнитьЗначенияСвойств(ОсновнойИсточник_, ПараметрыЗаполнения);
	ОсновнойИсточник_.Основной = Истина;

	Для Каждого ДополнительноеОснование Из ПараметрыЗаполнения.ДополнительныеОснования Цикл
		ЗаполнитьЗначенияСвойств(Таблица_.Добавить(), ДополнительноеОснование);
	КонецЦикла;
КонецПроцедуры

Функция ДокументОснование_ПараметрыЗаполнения_Выгрузить(Форма, Приемник) Экспорт
	РезультатФункции = ESD_НастройкиСопоставленийКлиентСервер.ПараметрыЗаполненияНаОсновании(Неопределено, Приемник);
	
	ТаблицаФормы = Форма[ДокументОснование_ПараметрыЗаполнения_ИмяРеквизитаФормы()];
	Для Каждого СтрокаИсточника_ Из ТаблицаФормы Цикл
		Если СтрокаИсточника_.Основной Или ТаблицаФормы.Количество() = 1 Тогда
			ЗаполнитьЗначенияСвойств(РезультатФункции, СтрокаИсточника_);
			Продолжить;
		КонецЕсли;

		ДополнительноеОснование_ = ESD_НастройкиСопоставленийКлиентСервер.ПараметрыЗаполненияНаОсновании(Неопределено, Приемник);
		ЗаполнитьЗначенияСвойств(ДополнительноеОснование_, СтрокаИсточника_);
		РезультатФункции.ДополнительныеОснования.Добавить(ДополнительноеОснование_);
	КонецЦикла;

	Возврат РезультатФункции;
КонецФункции

Функция ДокументОснование_ПараметрыЗаполнения_ИмяРеквизитаФормы() Экспорт
	Возврат "ДокументОснование_ПараметрыЗаполнения";
КонецФункции

