
// Получает данные ссылки в СБИС документа с онлайна.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на документ ЭТрН
//  ТипДокумента - Строка - имя метаданных документа
//
// Возвращаемое значение:
//   Структура - структура данных документа с онлайна (см. SabyОбщийРезультатЗагрузкиДанных)
//
Функция ДанныеДляОткрытияДокументаВСБИС(СсылкаНаДокумент, ТипДокумента = Неопределено) Экспорт
	РезультатФункции = SabyОбщийРезультатЗагрузкиДанных(СсылкаНаДокумент);
	РезультатФункции.Вставить("СсылкаНаДокументВСБИС", "");
	
	Если Не ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		РезультатФункции.ОписаниеОшибки = Нстр("ru = 'Документ еще не был записан. Открытие в SABY не доступно.'");
		Возврат РезультатФункции;
	КонецЕсли;
	
	МодульESD_ЗагрузкаСервер = МодульКода("ESD_ТНЗагрузкаСервер");
	
	ПараметрыЗагрузки = Новый Структура("СсылкаНаДокумент, УникальныйИдентификатор", 
		СсылкаНаДокумент, Новый УникальныйИдентификатор);
	// Сначала получим состояние объекта без выгрузки актуальных данных
	ПараметрыЗагрузкиФайловSaby = МодульESD_ЗагрузкаСервер.SabyСформироватьПараметрыЗагрузкиФайлов(
		ПараметрыЗагрузки, ТипДокумента, Ложь);
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузкиФайловSaby.ИдентификаторСБИС) Тогда
		// Если документ ранее не выгружался и является черновиком, тогда выполним первичную выгрузку данных 
		ПараметрыЗагрузкиФайловSaby = МодульESD_ЗагрузкаСервер.SabyСформироватьПараметрыЗагрузкиФайлов(
			ПараметрыЗагрузки, ТипДокумента, Истина);
	КонецЕсли;		

	Если Не ЗначениеЗаполнено(ПараметрыЗагрузкиФайловSaby.ИдентификаторСБИС) Тогда
		РезультатФункции.ОписаниеОшибки = Нстр("ru = 'Документ не выгружен в SABY. Открытие не доступно.'");
		РезультатФункции.СписокДокументов = ПараметрыЗагрузкиФайловSaby.СписокДокументов;
		Возврат РезультатФункции;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	URL_АдресСБИС    = МодульТНОбщегоНазначенияКлиентСервер.URL_АдресСБИС();
	АлиасДоменаСБИС  = МодульТНОбщегоНазначенияКлиентСервер.АлиасДоменаСБИС();
	URL_АдресСервиса = СтрЗаменить(ПараметрыЗагрузкиФайловSaby.context_params.ApiUrl, АлиасДоменаСБИС, URL_АдресСБИС);
	
	Идентификатор = КодироватьСтрокуВURL(ПараметрыЗагрузкиФайловSaby.ИдентификаторСБИС);
	СсылкаНаДокументВСБИС = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
		"%1/opendoc.html?guidv2=%2", URL_АдресСервиса, Идентификатор);
								
	РезультатФункции.СсылкаНаДокументВСБИС = СсылкаНаДокументВСБИС;
	Возврат РезультатФункции;
КонецФункции

