
// Получает данные ссылки в СБИС документа с онлайна.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на документ ЭТрН
//  ТребуетсяЗагрузка - Булево - признак проведения загрузки данных из Saby
//  ТипДокумента - Строка - имя метаданных документа
//
// Возвращаемое значение:
//   Структура - структура данных документа с онлайна.
//     * СсылкаНаДокументВСБИС - Строка - URL адрес документа на online.sbis.ru
//     * ОписаниеОшибки - Строка - описание ошибки получения ссылки на документ с онлайна.
//     * СписокДокументов - Массив - данные документов с ошибкой.
//
Функция ДанныеДляОткрытияДокументаВСБИС(СсылкаНаДокумент, ТребуетсяЗагрузка = Ложь, ТипДокумента = Неопределено) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("СсылкаНаДокументВСБИС", "");
	РезультатФункции.Вставить("ОписаниеОшибки" ,       "");
	РезультатФункции.Вставить("СписокДокументов",      Неопределено);
	
	Если Не ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		РезультатФункции.ОписаниеОшибки = Нстр("ru = 'Документ еще не был записан. Открытие в SABY не доступно.'");
		Возврат РезультатФункции;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("УникальныйИдентификаторФормы", Неопределено);
	ДополнительныеПараметры.Вставить("ЭтоПечатьQRКода",              Ложь);
	ДополнительныеПараметры.Вставить("ТипДокумента",                 ТипДокумента);
	
	ПараметрыЗагрузки = МодульКода("ESD_ТНЗагрузкаСервер").ПараметрыЗагрузкиИзСбис(
		СсылкаНаДокумент, ДополнительныеПараметры, , ТребуетсяЗагрузка);
	
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.ИдентификаторСБИС) Тогда
		РезультатФункции.ОписаниеОшибки = Нстр("ru = 'Документ не выгружен в SABY. Открытие не доступно.'");
		РезультатФункции.СписокДокументов = ПараметрыЗагрузки.СписокДокументов;
		Возврат РезультатФункции;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	URL_АдресСБИС    = МодульТНОбщегоНазначенияКлиентСервер.URL_АдресСБИС();
	АлиасДоменаСБИС  = МодульТНОбщегоНазначенияКлиентСервер.АлиасДоменаСБИС();
	URL_АдресСервиса = СтрЗаменить(ПараметрыЗагрузки.context_params.ApiUrl, АлиасДоменаСБИС, URL_АдресСБИС);
	
	Идентификатор = КодироватьСтрокуВURL(ПараметрыЗагрузки.ИдентификаторСБИС);
	
	СсылкаНаДокументВСБИС = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
		"%1/opendoc.html?guidv2=%2", URL_АдресСервиса, Идентификатор);
								
	РезультатФункции.СсылкаНаДокументВСБИС = СсылкаНаДокументВСБИС;
	
	Возврат РезультатФункции;
	
КонецФункции

