
// Возвращает двоичные данные архива вложений из Saby.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры загрузки
//  АдресФайлаSaby - Строка - адрес печатной формы pdf
//
// Возвращаемое значение:
//   Строка - адрес двоичных данных файла печатной формы.
//
//DynamicDirective
Функция АдресДвоичныхДанныхАрхиваВложений(ПараметрыЗагрузки, Знач АдресФайлаSaby = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(АдресФайлаSaby) Тогда
		// Если не получили адрес файла - попробуем повторно обратиться на онлайн
		РезультатSaby = SabyСсылкаНаАрхивВложений(ПараметрыЗагрузки);
		Если РезультатSaby.Ошибка Или Не ЗначениеЗаполнено(РезультатSaby.Данные) Тогда
			Возврат РезультатSaby;
		КонецЕсли;
		АдресФайлаSaby = РезультатSaby.Данные;
	КонецЕсли;
	
	ДвоичныеДанныеФайла = SabyЗагрузитьДанныеПоСсылке(ПараметрыЗагрузки, АдресФайлаSaby);
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, 
		ПараметрыЗагрузки.УникальныйИдентификатор);
	Возврат SabyРезультатВзаимодействияСОнлайном(, АдресВоВременномХранилище);
КонецФункции

// Возвращает ссылку на архив вложений из Saby
//
// Параметры:
//	ПараметрыЗагрузки - Структура - параметры загрузки данных из Saby
//
// Возвращаемое значение:
//	Строка, Неопределено - результат обращения в Saby
//
//DynamicDirective
Функция SabyСсылкаНаАрхивВложений(ПараметрыЗагрузки)
	РезультатФункции = SabyРезультатВзаимодействияСОнлайном();
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.ИдентификаторСБИС) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Идентификатор", ПараметрыЗагрузки.ИдентификаторСБИС);
	ПараметрыМетода.Вставить("ДопПоля", "Подстановки,Расширение");
	
	Попытка
		Результат = ВыполнитьМетодSaby_ПрочитатьДокумент(ПараметрыЗагрузки, ПараметрыМетода);
		РезультатФункции.Данные = Результат["СсылкаНаАрхив"];
		
		// Запишем статистику загрузки архива вложений
		ЗаписатьСтатистикуВызоваВОблако("СкачиваниеВложений", "Расширение 1С ESD");
	Исключение	
		ИнфоОшибки = ИнформацияОбОшибке();
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			ПараметрыЗагрузки.СсылкаНаДокумент,
			"Загрузка архива вложений", ИнфоОшибки.Описание);
	КонецПопытки;
	
	Возврат РезультатФункции;
КонецФункции

