
&НаКлиенте
Процедура ЗагрузитьАктуальныйСтатусВерсии()
	Если Не Элементы.ГруппаОбновление.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	// обновление статуса версии в фоне
	МодульТНОбщегоНазначенияКлиент = МодульКода("ESD_ТНОбщегоНазначенияКлиент");
	ПараметрыКоманды = МодульТНОбщегоНазначенияКлиент.ВыполнитьКомандуСбис_ПараметрыКоманды();
	ПараметрыКоманды.Вставить("Подключаемый", Истина);
	МодульТНОбщегоНазначенияКлиент.ВыполнитьКомандуСбис(ЭтаФорма, "АктуальныйСтатусВерсии", Неопределено, 
		ПараметрыКоманды,
		Новый УникальныйИдентификатор());
КонецПроцедуры
	
