
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	SabyКоманды_ДобавитьНаФормуНаСервере();
	Переопределяемый_ПриСозданииНаСервере();
	НастройкаВидимостиЭлементовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ESD_ТНОбщегоНазначенияКлиент.ОбработатьОповещенияДляФормы(ЭтаФорма, ИмяСобытия, Параметр, Источник);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// BSLLS:UnusedLocalVariable-off
	ТранспортИнтеграции = ESD_КомандыОбменаДляФормыКлиент.ТранспортИнтеграции();
	// BSLLS:UnusedLocalVariable-on
	
	ЗагрузитьАктуальныйСтатусВерсии();
КонецПроцедуры

