
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	ОчиститьНекопируемыеРеквизиты();
	УстановитьЗначенияПоУмолчанию();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСтроковыеПредставленияЮрЛиц();
	КонтактныеДанные_ПередЗаписью();
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Направление) Тогда
		ЭтотОбъект.Направление = Метаданные().Реквизиты.Направление.ЗначениеЗаполнения;
	КонецЕсли;
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ESD_УстановитьНомерДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТитулыДляПривязки") Тогда
		МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ПривязатьТитулыКДокументу(
			Ссылка,
			ДополнительныеСвойства.ТитулыДляПривязки);
	КонецЕсли;
				
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ПривязатьДокументОснование(
		Ссылка,
		ДокументОснование_ОбъектМетаданных,
		ДокументОснование_Идентификатор);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Отключаем проверяемые реквизиты,
	// так как все проверки делаются централизованно в функции ESD_ТранспортнаяНакладная.ОшибкиФЛК
	ПроверяемыеРеквизиты.Очистить();
	
	ПроверяемыеРеквизиты.Добавить("Дата");
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = "00";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТипЗначенияЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗначенияЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("НовыйРедактор") Тогда
			МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьНаОснованииИспользуяНастройкиСопоставления(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;
	ИначеЕсли ТипЗначенияЗаполнения = Тип("ДокументСсылка." + ЗаказНаПеревозку()) Тогда 
				
		// Проверка на возможность ввода на основании
		Состояние = МодульКода("ESD_ТНОбщегоНазначенияСервер").ТекущийТитулИИДДокумента(ДанныеЗаполнения);
		Если Не ЗначениеЗаполнено(Состояние) Тогда
			
			ВызватьИсключение "Ошибка! Не возможен ввод на основании данного документа!";
			
		ИначеЕсли Не Состояние.ДОЗавершенПоложительно Тогда
			
			ВызватьИсключение "Ошибка! Ввод на основании возможен только при завершенном положительно ДО!";
			
		Иначе 
			ЗаполнитьНаОснованииЗаказаНаПеревозку(ДанныеЗаполнения);			
		КонецЕсли;	
		
	Иначе
		ПредзаполнитьНовыйОбъект();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область include_etrn_base_Document_ДополнительныйФункционал_КонтактныеДанные
#КонецОбласти

Процедура ЗаполнитьСтроковыеПредставленияЮрЛиц()
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ЭтотОбъект.Отправитель_ТранспортноеСредствоСтрокой = 
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ТранспортныеСредстваСтрокой(ЭтотОбъект);	
	ЭтотОбъект.ОтправительСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Отправитель").НаименованиеОрганизации;	
	ЭтотОбъект.СоставительСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Оформитель").НаименованиеОрганизации;	
	ЭтотОбъект.ПолучательСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Получатель").НаименованиеОрганизации;	
	ЭтотОбъект.ПеревозчикСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Перевозчик").НаименованиеОрганизации;	
	ЭтотОбъект.ЗаказчикСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Заказчик").НаименованиеОрганизации;	
	ЭтотОбъект.ВладелецОбъектаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "ВладелецОбъекта").НаименованиеОрганизации;	
	ЭтотОбъект.ОтгрузчикСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(
		ЭтотОбъект.ДанныеЮрЛиц, "Отгрузчик").НаименованиеОрганизации;
		
	ОтборОтветственного = Новый Структура;
	ОтборОтветственного.Вставить("Роль", ЗначениеМетаданных("ESD_РолиОтветственных.Ответственный"));
	НайденныеСтроки = ОтветственныеЛица.НайтиСтроки(ОтборОтветственного);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ЭтотОбъект.Отгрузка_ОтветственныйСтрокой = МодульТНОбщегоНазначенияКлиентСервер.ПредставлениеФИО(НайденныеСтроки[0]);
	КонецЕсли;
КонецПроцедуры

Процедура ОчиститьНекопируемыеРеквизиты()
	РеквизитыДляОчистки = Новый Массив;
	
	// Служебные
	РеквизитыДляОчистки.Добавить("ДатаИзменения");
	РеквизитыДляОчистки.Добавить("НомерСбис");
	РеквизитыДляОчистки.Добавить("Комментарий");
	РеквизитыДляОчистки.Добавить("ДоступныеДействия");
	РеквизитыДляОчистки.Добавить("ТекущиеЭтапы");
	РеквизитыДляОчистки.Добавить("КомментарийУведомление");
	РеквизитыДляОчистки.Добавить("ДокументОснование_Идентификатор");
	РеквизитыДляОчистки.Добавить("ДокументОснование_ОбъектМетаданных");
	РеквизитыДляОчистки.Добавить("Направление");
	РеквизитыДляОчистки.Добавить("ГИС_УИД");
	
    // Общие таблицы
	РеквизитыДляОчистки.Добавить("Отметки");
	РеквизитыДляОчистки.Добавить("Штрафы");
	РеквизитыДляОчистки.Добавить("Акты");
	
	// Страница "Погрузка"	
	РеквизитыДляОчистки.Добавить("Перевозчик_ПриемкаДатаВремя");
	РеквизитыДляОчистки.Добавить("Перевозчик_ПриемкаДатаВремяПрибыл");
	РеквизитыДляОчистки.Добавить("Перевозчик_ПриемкаДатаВремяУбыл");
	РеквизитыДляОчистки.Добавить("Перевозчик_ПогрузкаЗамечанияПоСостояниюГруза");
	РеквизитыДляОчистки.Добавить("Перевозчик_ЗамечанияПоПогрузочнымРаботам");
	РеквизитыДляОчистки.Добавить("Перевозчик_ПогрузкаЗамечанияПоМассе");
	РеквизитыДляОчистки.Добавить("Перевозчик_ПогрузкаЗамечанияПоКоличеству");
			
	Если Не ЭтотОбъект.Отправитель_Экспедитор Тогда
			
		РеквизитыДляОчистки.Добавить("Заказчик");
		РеквизитыДляОчистки.Добавить("Заказчик_Договор");

	КонецЕсли;
	
	// Страница "Выгрузка"
	
	// Получатель 
	РеквизитыДляОчистки.Добавить("Выгрузка_ДатаВремя");
	РеквизитыДляОчистки.Добавить("Выгрузка_ДатаВремяПрибыл");
	РеквизитыДляОчистки.Добавить("Выгрузка_ДатаВремяУбыл");	
	РеквизитыДляОчистки.Добавить("Выгрузка_МассаМетодРасчета");
	РеквизитыДляОчистки.Добавить("Выгрузка_КоличествоМест");
	РеквизитыДляОчистки.Добавить("Выгрузка_Объем");
	РеквизитыДляОчистки.Добавить("Выгрузка_МассаБрутто");
	РеквизитыДляОчистки.Добавить("Выгрузка_МассаНетто");
	РеквизитыДляОчистки.Добавить("Выгрузка_Состояние");
	
	// Перевозчик 	
	РеквизитыДляОчистки.Добавить("Перевозчик_ВыгрузкаДатаВремя");
	РеквизитыДляОчистки.Добавить("Перевозчик_ВыгрузкаДатаВремяПрибыл");
	РеквизитыДляОчистки.Добавить("Перевозчик_ВыгрузкаДатаВремяУбыл");	
	РеквизитыДляОчистки.Добавить("Перевозчик_ВыгрузкаЗамечанияПоСостояниюГруза");
	РеквизитыДляОчистки.Добавить("Перевозчик_ЗамечанияПоРазгрузочнымРаботам");
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОчисткаРеквизитовОбъекта(ЭтотОбъект, РеквизитыДляОчистки);
КонецПроцедуры

Процедура ПредзаполнитьНовыйОбъект()
	ЭтотОбъект.Отправитель_ПерегрузкаЗапрещена = -1;
	УстановитьЗначенияПоУмолчанию();
КонецПроцедуры

Процедура УстановитьЗначенияПоУмолчанию()
	ЭтотОбъект.Направление = ЗначениеМетаданных("ESD_Направление.Исходящий");
КонецПроцедуры

Функция ПрефиксОрганизацииДокумента()
	
	РезультатФункции = "00";
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВложенныйЗапрос.Префикс КАК Префикс,
	|	ВложенныйЗапрос.Порядок КАК Порядок
	|ИЗ
	|	(ВЫБРАТЬ
	|		Организации.Префикс КАК Префикс,
	|		1 КАК Порядок
	|	ИЗ
	|		Справочник.Организации КАК Организации
	|	ГДЕ
	|		Организации.Ссылка = &Ссылка1
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Организации.Префикс,
	|		2
	|	ИЗ
	|		Справочник.Организации КАК Организации
	|	ГДЕ
	|		Организации.Ссылка = &Ссылка2
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Организации.Префикс,
	|		3
	|	ИЗ
	|		Справочник.Организации КАК Организации
	|	ГДЕ
	|		Организации.Ссылка = &Ссылка3) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";

	ЗапросДанных.УстановитьПараметр("Ссылка1", Отправитель);
	ЗапросДанных.УстановитьПараметр("Ссылка2", Получатель);
	ЗапросДанных.УстановитьПараметр("Ссылка3", Перевозчик);
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока ВыборкаДанных.Следующий() Цикл
		РезультатФункции = ВыборкаДанных.Префикс;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

#Область ЗаполнениеНаОсновании

Процедура ЗаполнитьНаОснованииЗаказаНаПеревозку(ДанныеЗаполнения)
	
	// Заполним по первому титулу
	ДанныеПервогоТитула = МодульКода("Документы.ESD_ЗаказНаПеревозку").ДанныеДокумента(
		ДанныеЗаполнения, ЗначениеМетаданных("ESD_ТипТитулаЗнП.Оформление"));
		
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ИмяРолиОтгрузчик = "Отгрузчик";

	// Очистим данные отгрузчика	
	МодульТНОбщегоНазначенияКлиентСервер.УдалитьСтрокиПоРоли(ДанныеПервогоТитула.ДанныеЮрЛиц,      ИмяРолиОтгрузчик);
	МодульТНОбщегоНазначенияКлиентСервер.УдалитьСтрокиПоРоли(ДанныеПервогоТитула.КонтактныеДанные, ИмяРолиОтгрузчик);
	
	ИмяРолиОформитель = "Оформитель";

	// Основание отправителя 
	СтрокаЮрЛиц = МодульТНОбщегоНазначенияКлиентСервер.ДанныеЮрЛицаПоРоли(ДанныеПервогоТитула.ДанныеЮрЛиц, ИмяРолиОформитель);
	Если СтрокаЮрЛиц <> Неопределено 
		И ЗначениеЗаполнено(СтрокаЮрЛиц.Основание) Тогда		
		
		ЭтотОбъект.Составитель_НаОснованииДокумент = СтрокаЮрЛиц.Основание;
		РольКопирования = ИмяРолиОформитель;

	Иначе
		
		РольКопирования = "Отправитель";
		
		// зачистим оформителя
		МодульТНОбщегоНазначенияКлиентСервер.УдалитьСтрокиПоРоли(ДанныеПервогоТитула.ДанныеЮрЛиц,      ИмяРолиОформитель);
	    МодульТНОбщегоНазначенияКлиентСервер.УдалитьСтрокиПоРоли(ДанныеПервогоТитула.КонтактныеДанные, ИмяРолиОформитель);
		
	КонецЕсли;
	
	 // скопируем данные отправителя. Отгрузчик = Отправитель
	МодульТНОбщегоНазначенияКлиентСервер.СкопироватьДанныеЮрЛица(ДанныеПервогоТитула, ИмяРолиОтгрузчик, РольКопирования);
	
	Исключения = Новый Соответствие;
	Исключения.Вставить("Ссылка",                             Истина);
	Исключения.Вставить("Номер",                              Истина);
	Исключения.Вставить("Направление",                        Истина);
	Исключения.Вставить("ДокументОснование_ОбъектМетаданных", Истина);
	Исключения.Вставить("ДокументОснование_Идентификатор",    Истина);
	Исключения.Вставить("АдресаПунктовВыгрузки",              Истина);
	Исключения.Вставить("АдресаПромежуточныхПунктов",         Истина);
	Исключения.Вставить("Груз_АдресаПунктов",                 Истина);
	Исключения.Вставить("ДокументыЭПД",                       Истина);
	
	СоответствияРеквизитов = Новый Соответствие;
	СоответствияРеквизитов.Вставить("ВлажностьОт",   "Отправитель_ВлажностьОт");	
	СоответствияРеквизитов.Вставить("ВлажностьДо",   "Отправитель_ВлажностьДо");
	СоответствияРеквизитов.Вставить("ТемператураОт", "Отправитель_ТемператураОт");
	СоответствияРеквизитов.Вставить("ТемператураДо", "Отправитель_ТемператураДо");
	СоответствияРеквизитов.Вставить("СпецУсловия",   "Отправитель_НормыПеревозки");
	СоответствияРеквизитов.Вставить("НомерСбис",     "Отправитель_ЗаявкаНомер");
	СоответствияРеквизитов.Вставить("Дата",          "Отправитель_ЗаявкаДата");
	
	// Подача и конечная точка
	СоответствияРеквизитов.Вставить("ПодачаАдрес",                 "Погрузка_Адрес");
	СоответствияРеквизитов.Вставить("ПодачаАдресСтруктура",        "АдресПогрузкиЗначение");
	СоответствияРеквизитов.Вставить("ПодачаДатаВремя",             "Погрузка_ДатаВремя");	
	СоответствияРеквизитов.Вставить("КонечнаяТочкаАдрес",          "Отправитель_АдресДоставки");
	СоответствияРеквизитов.Вставить("КонечнаяТочкаАдресСтруктура", "АдресДоставкиЗначение");
	
	СоответствияТаблиц = Новый Соответствие;
	
	ЗаполнитьПоДаннымТитула(ДанныеПервогоТитула, Исключения, СоответствияРеквизитов, СоответствияТаблиц);
		
	ДанныеВторогоТитула = МодульКода("Документы.ESD_ЗаказНаПеревозку").ДанныеДокумента(
		ДанныеЗаполнения, ЗначениеМетаданных("ESD_ТипТитулаЗнП.Утверждение"));
		
	Исключения.Вставить("Водители",         Истина);	
	Исключения.Вставить("КонтактныеДанные", Истина);
	Исключения.Вставить("ДанныеЮрЛиц",      Истина);
	
	ЗаполнитьПоДаннымТитула(ДанныеВторогоТитула, Исключения, СоответствияРеквизитов, СоответствияТаблиц);
	
	ЭтотОбъект.ДокументОснование_Идентификатор    = ДанныеЗаполнения.УникальныйИдентификатор();
	ЭтотОбъект.ДокументОснование_ОбъектМетаданных = МодульКода("ESD_ТНОбщегоНазначенияСервер").ИмяМетаданныхДокумента(
		ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымТитула(ДанныеТитула, Исключения, СоответствияРеквизитов, СоответствияТаблиц)
	
	Для Каждого КлючЗначение Из ДанныеТитула Цикл
		
		Если Исключения[КлючЗначение.Ключ] <> Неопределено
			Или ТипЗнч(КлючЗначение.Значение) = Тип("ТаблицаЗначений") Тогда
			Продолжить;
			
		ИначеЕсли СоответствияРеквизитов[КлючЗначение.Ключ] <> Неопределено Тогда
			Ключ = СоответствияРеквизитов[КлючЗначение.Ключ];
		Иначе 
			Ключ = КлючЗначение.Ключ;
		КонецЕсли;	
				
		Если Не МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ЭтотОбъект, Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтотОбъект[Ключ] = КлючЗначение.Значение;
		
	КонецЦикла;
	
	ЗаполнениеТабличныхЧастей(ДанныеТитула, Исключения, СоответствияТаблиц);
	
КонецПроцедуры

Процедура ЗаполнениеТабличныхЧастей(ДанныеТитула, Исключения, СоответствияТаблиц)
	
	Для Каждого КлючЗначение Из ДанныеТитула Цикл
		
		Если Исключения[КлючЗначение.Ключ] <> Неопределено 
			Или ТипЗнч(КлючЗначение.Значение) <> Тип("ТаблицаЗначений") Тогда
			Продолжить;
		КонецЕсли;
				
		ИмяТаблицыОбъекта = СоответствияТаблиц[КлючЗначение.Ключ];
		Если ИмяТаблицыОбъекта = Неопределено Тогда
			ИмяТаблицыОбъекта = КлючЗначение.Ключ;
		КонецЕсли;
		
		ОбходТаблицПоУсловиям(ИмяТаблицыОбъекта, КлючЗначение);
		
	КонецЦикла;

КонецПроцедуры	

Процедура ОбходТаблицПоУсловиям(ИмяТаблицыОбъекта, КлючЗначение)
	
	Для Каждого СтрокаИсходнойТаблицы Из КлючЗначение.Значение Цикл
		
		Если ИмяТаблицыОбъекта = "ОтветственныеЛица" 
			И СтрокаИсходнойТаблицы.Роль <> ЗначениеМетаданных("ESD_РолиОтветственных.Водитель") Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаТаблицыОбъекта = ЭтотОбъект[ИмяТаблицыОбъекта].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыОбъекта, СтрокаИсходнойТаблицы);
		
		// Опасный груз хранится в отдельной таблице
		Если ИмяТаблицыОбъекта = "Грузы"
			И ЗначениеЗаполнено(СтрокаИсходнойТаблицы.ОпасныйГруз) Тогда
			
			СтрокаОпасныйГруз = ОпасныеГрузы.Добавить();
			СтрокаОпасныйГруз.КлючСтроки_Грузы = СтрокаИсходнойТаблицы.КлючСтроки;
			СтрокаОпасныйГруз.ОпасныйГруз      = СтрокаИсходнойТаблицы.ОпасныйГруз;
			
		КонецЕсли;	
		
	КонецЦикла;		
		
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОсновании

#Область ЗаполнениеНаОснованииИспользуяНастройкиСопоставления

Функция ДоступныеПоляПоЭтапу(ТипТитула) Экспорт
	
	// Для первого титула фильтр не выполняется, так как по умолчанию на первом этапе можем заполнить все реквизиты.
	РезультатФункции = Новый Соответствие;
	ДобавитьДоступныеПоляПолученияГруза(РезультатФункции, ТипТитула);
	ДобавитьДоступныеПоляПриемкиГруза(РезультатФункции, ТипТитула);
	ДобавитьДоступныеПоляВыдачиГруза(РезультатФункции, ТипТитула);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьДоступныеПоляПолученияГруза(ДоступныеПоля, ТипТитула)
	
	Если ТипТитула <> Перечисления.ESD_ТипТитулаЭтрН.ПолучениеГруза Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеПоля.Вставить("Перевозчик_ПриемкаДатаВремяУбыл",              Истина);
	ДоступныеПоля.Вставить("Перевозчик_ПриемкаДатаВремяПрибыл",            Истина);
	ДоступныеПоля.Вставить("Перевозчик_ПогрузкаЗамечанияПоСостояниюГруза", Истина);
	ДоступныеПоля.Вставить("Перевозчик_ПогрузкаЗамечанияПоКоличеству",     Истина);
	ДоступныеПоля.Вставить("Перевозчик_ПриемкаДатаВремя",                  Истина);
	ДоступныеПоля.Вставить("Перевозчик_ЗамечанияПоПогрузочнымРаботам",     Истина);
	ДоступныеПоля.Вставить("Перевозчик_ПогрузкаЗамечанияПоМассе",          Истина);
	ДоступныеПоля.Вставить("Отметки",                                      Истина);
	
КонецПроцедуры

Процедура ДобавитьДоступныеПоляПриемкиГруза(ДоступныеПоля, ТипТитула)
	
	Если ТипТитула <> Перечисления.ESD_ТипТитулаЭтрН.ПриемкаГруза Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеПоля.Вставить("Выгрузка_МассаМетодРасчета", Истина);
	ДоступныеПоля.Вставить("Выгрузка_КоличествоМест", Истина);
	ДоступныеПоля.Вставить("Выгрузка_ДатаВремяУбыл", Истина);
	ДоступныеПоля.Вставить("Выгрузка_ДатаВремяПрибыл", Истина);
	ДоступныеПоля.Вставить("Выгрузка_ДатаВремя", Истина);
	ДоступныеПоля.Вставить("Выгрузка_МассаНетто", Истина);
	ДоступныеПоля.Вставить("Выгрузка_МассаБрутто", Истина);
	ДоступныеПоля.Вставить("Выгрузка_Объем", Истина);
	ДоступныеПоля.Вставить("Выгрузка_Состояние", Истина);
	ДоступныеПоля.Вставить("Отметки", Истина);
	
КонецПроцедуры

Процедура ДобавитьДоступныеПоляВыдачиГруза(ДоступныеПоля, ТипТитула)
	
	Если ТипТитула <> Перечисления.ESD_ТипТитулаЭтрН.ВыдачаГруза Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеПоля.Вставить("Перевозчик_ВыгрузкаЗамечанияПоСостояниюГруза", Истина);
	ДоступныеПоля.Вставить("Перевозчик_ВыгрузкаДатаВремяПрибыл",           Истина);
	ДоступныеПоля.Вставить("Перевозчик_ВыгрузкаДатаВремя",                 Истина);
	ДоступныеПоля.Вставить("Перевозчик_ЗамечанияПоРазгрузочнымРаботам",    Истина);
	ДоступныеПоля.Вставить("Перевозчик_ВыгрузкаДатаВремяУбыл",             Истина);
	ДоступныеПоля.Вставить("Отметки",                                      Истина);
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииРасчетаСопоставлений(РезультатРасчетаПолей, ТипТитула, ПервоеОснование) Экспорт
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьСсылкиНаОбъекты(РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, РезультатРасчетаПолей, ПервоеОснование);
	
	МассивЮрЛиц = Новый Массив;
	МассивЮрЛиц.Добавить("ВладелецОбъекта");
	МассивЮрЛиц.Добавить("Заказчик");
	МассивЮрЛиц.Добавить("Отгрузчик");
	МассивЮрЛиц.Добавить("Отправитель");
	МассивЮрЛиц.Добавить("Перевозчик");
	МассивЮрЛиц.Добавить("Получатель");
	МассивЮрЛиц.Добавить("Составитель");
	МодульТНОбщегоНазначенияСервер.ЗаполнитьДанныеЮрЛиц(ЭтотОбъект, РезультатРасчетаПолей, МассивЮрЛиц);
	
	МассивОтветственных = Новый Массив;
	МассивОтветственных.Добавить("Отгрузка_Ответственный");
	МодульТНОбщегоНазначенияСервер.ЗаполнитьОтветственных(ЭтотОбъект, РезультатРасчетаПолей, МассивОтветственных);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьТранспортныеСредства(ЭтотОбъект, РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьВодителей(ЭтотОбъект, РезультатРасчетаПолей);
	
	МодульТНОбщегоНазначенияСервер.ЗаполнитьГрузы(ЭтотОбъект, РезультатРасчетаПолей);
	
	ЗаполнитьОтметки(РезультатРасчетаПолей);
	
	ЗаполнитьСопроводительныеДокументы(РезультатРасчетаПолей, ПервоеОснование);
	
	ЗаполнитьИныхПолучателей(РезультатРасчетаПолей);
	
	ЗаполнитьСпецРазрешения(РезультатРасчетаПолей);
	
	ОтветственныйНаОснованииДолжностныхОбязанностей = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "Отгрузка_ОтветственныйНаОснованииДолжностныхОбязанностей", Ложь);
	Если ОтветственныйНаОснованииДолжностныхОбязанностей Тогда
		ЭтотОбъект.Отгрузка_ОтветственныйНаОсновании = "Должностные обязанности";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОтметки(РезультатРасчетаПолей)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	МодульТНОбщегоНазначенияСервер       = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	ДанныеОтметок = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(РезультатРасчетаПолей, "Отметки", Новый Массив);
	
	Для Каждого ДанныеОтметки Из ДанныеОтметок Цикл
		
		ОчиститьОтметки(ДанныеОтметки);
		
		СтрокаОтметки = Отметки.Добавить();
		МодульТНОбщегоНазначенияСервер.ЗаполнитьЗначенияИзСоответствия(СтрокаОтметки, ДанныеОтметки);
		СтрокаОтметки.КлючСтроки = МодульТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(ЭтотОбъект, "Отметки");
		
		Путь = Новый Массив;
		Путь.Добавить("Отметки.Штрафы");
		ДанныеШтрафов = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(РезультатРасчетаПолей, Путь, Новый Массив);
		Для Каждого ДанныеШтрафа Из ДанныеШтрафов Цикл
			СтрокаШтрафа = Штрафы.Добавить();
			МодульТНОбщегоНазначенияСервер.ЗаполнитьЗначенияИзСоответствия(СтрокаШтрафа, ДанныеШтрафа);
			СтрокаШтрафа.КлючСтроки_Отметки = СтрокаОтметки.КлючСтроки;
		КонецЦикла;
		
		Путь.Очистить();
		Путь.Добавить("Отметки.Акты");
		ДанныеАктов = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(РезультатРасчетаПолей, Путь, Новый Массив);
		Для Каждого ДанныеАкта Из ДанныеАктов Цикл
			СтрокаАкта = Акты.Добавить();
			СтрокаАкта.КлючСтроки_Отметки = СтрокаОтметки.КлючСтроки;
			Путь.Очистить();
			Путь.Добавить("Отметки.Акты.Документ");
			Путь.Добавить("Ссылка");
			СтрокаАкта.Документ = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеАкта, Путь);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьОтметки(ДанныеОтметки)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Путь = Новый Массив;
	Путь.Добавить("Отметки.Этап");
	Этап = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеОтметки, Путь);
	
	Путь.Очистить();
	Путь.Добавить("Отметки.Роль");
	Роль = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеОтметки, Путь);
	
	ОтборОтметок = Новый Структура;
	ОтборОтметок.Вставить("Этап", Этап);
	ОтборОтметок.Вставить("Роль", Роль);
	
	ОтборАктовШтрафов = Новый Структура;
	ОтборАктовШтрафов.Вставить("КлючСтроки_Отметки", "");
	
	СтрокиОтметок = ЭтотОбъект.Отметки.НайтиСтроки(ОтборОтметок);
	Для Каждого СтрокаОтметки Из СтрокиОтметок Цикл
		
		ОтборАктовШтрафов.КлючСтроки_Отметки = СтрокаОтметки.КлючСтроки;
		СтрокиАктов = ЭтотОбъект.Акты.НайтиСтроки(ОтборАктовШтрафов);
		Для Каждого СтрокаАкта Из СтрокиАктов Цикл
			ЭтотОбъект.Акты.Удалить(СтрокаАкта);
		КонецЦикла;
		
		СтрокиШтрафов = ЭтотОбъект.Штрафы.НайтиСтроки(ОтборАктовШтрафов);
		Для Каждого СтрокаШтрафа Из СтрокиШтрафов Цикл
			ЭтотОбъект.Штрафы.Удалить(СтрокаШтрафа);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСопроводительныеДокументы(РезультатРасчетаПолей, ПервоеОснование)
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ДанныеСопроводительныхДокументов = РезультатРасчетаПолей["СопроводительныеДокументы"];
	Если Не ЗначениеЗаполнено(ДанныеСопроводительныхДокументов) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеСопроводительногоДокумента Из ДанныеСопроводительныхДокументов Цикл
		Путь = Новый Массив;
		Путь.Добавить("СопроводительныеДокументы.СопроводительныйДокумент");
		Путь.Добавить("Ссылка");
		СсылкаНаДокумент = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеСопроводительногоДокумента, Путь);
		Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
			СтрокаСопроводительногоДокумента = СопроводительныеДокументы.Добавить();
			СтрокаСопроводительногоДокумента.СопроводительныйДокумент = СсылкаНаДокумент;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИныхПолучателей(РезультатРасчетаПолей)
	
	ДанныеИныхПолучателей = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "ИныеПолучатели", Новый Массив);
		
	Если ДанныеИныхПолучателей.Количество() > 0 Тогда
	
		ОтборИныхПолучателей = Новый Структура();
		ОтборИныхПолучателей.Вставить("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.ИнойПолучатель"));
		ИныеПолучатели = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(ЭтотОбъект.ДанныеЮрЛиц, ОтборИныхПолучателей);
		Для Каждого СтрокаДляУдаления Из ИныеПолучатели Цикл
			ЭтотОбъект.ДанныеЮрЛиц.Удалить(СтрокаДляУдаления);
		КонецЦикла;
		
		Для Каждого ДанныеИногоПолучателя Из ДанныеИныхПолучателей Цикл
			МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьДанныеЮрЛица(
				ЭтотОбъект, ДанныеИногоПолучателя["ИныеПолучатели.ИнойПолучатель"], "ИнойПолучатель");
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСпецРазрешения(РезультатРасчетаПолей)
	
	ДанныеСпецРазрешений = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "СпецРазрешения", Новый Массив);
	Для Каждого ДанныеСпецРазрешения Из ДанныеСпецРазрешений Цикл
		СтрокаСпецРазрешения = СпецРазрешения.Добавить();
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗаполнитьЗначенияИзСоответствия(СтрокаСпецРазрешения, ДанныеСпецРазрешения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОснованииИспользуяНастройкиСопоставления

#КонецОбласти

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_CommonModule_Метаданные
#КонецОбласти // include_etrn_base_CommonModule_Метаданные
