
Функция СформироватьДатуИзТитулаПодстановки(ДанныеТитула, КодТитула) Экспорт
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Если КодТитула = "1110339" Тогда	
		СтрДата = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110339.Файл.Документ.ДатИнфГО", "");
		СтрВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110339.Файл.Документ.ВрИнфГО", "");	
	ИначеЕсли КодТитула = "1110340" Тогда	
		СтрДата = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110340.Файл.Документ.ДатИнфПрвПрием", "");
		СтрВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110340.Файл.Документ.ВрИнфПрвПрием", "");	
	ИначеЕсли КодТитула = "1110341" Тогда	
		СтрДата = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110341.Файл.Документ.ДатИнфГП", "");
		СтрВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110341.Файл.Документ.ВрИнфГП", "");	
	ИначеЕсли КодТитула = "1110342" Тогда	
		СтрДата = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110342.Файл.Документ.ДатИнфПрвВыд", "");
		СтрВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110342.Файл.Документ.ВрИнфПрвВыд", "");	
	ИначеЕсли КодТитула = "1110343" Тогда	
		СтрДата = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110343.Файл.Документ.ДатаИнфПА", "");
		СтрВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110343.Файл.Документ.ВрИнфПА", "");	
	ИначеЕсли КодТитула = "1167009" Тогда	
		СтрДата = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1167009.Файл.Документ.ДатаУвПА", "");
		СтрВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1167009.Файл.Документ.ВрУвПА", "");	
	ИначеЕсли КодТитула = "1110344" Тогда	
		СтрДата = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110344.Файл.Документ.ДатИнфЗамен", "");
		СтрВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110344.Файл.Документ.ВрИнфЗамен", "");	
	ИначеЕсли КодТитула = "1110346" Тогда	
		СтрДата = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110346.Файл.Документ.ДатПУДИнфГО", "");
		СтрВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110346.Файл.Документ.ВрПУДИнфГО", "");	
	ИначеЕсли КодТитула = "1110345" Тогда	
		СтрДата = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110345.Файл.Документ.ДатПУДИнфПрв", "");
		СтрВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "1110345.Файл.Документ.ВрПУДИнфПрв", "");	
	ИначеЕсли КодТитула = "1115113" Тогда	
		СтрДата = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "Документ.Данные.ДатаПол", "");
		СтрВремя = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТитула, "Документ.Данные.ВремяПол", "");	
	Иначе	
		Возврат Неопределено;	
	КонецЕсли;
	
	Возврат Формат(СтрДата, "ДФ=dd.MM.yyyy") + " " + СтрВремя;
КонецФункции

