
Функция РеквизитыПогрузка()
	
	Реквизиты = Новый Массив;
	
	Реквизиты.Добавить("Номер");
	Реквизиты.Добавить("Дата");
	Реквизиты.Добавить("Отправитель_СопроводительнаяВедомость");
	Реквизиты.Добавить("Заказчик_Договор");
	Реквизиты.Добавить("Отгрузка_НаОснованииДокумент");
	Реквизиты.Добавить("Отгрузка_ОтветственныйНаОсновании");
	Реквизиты.Добавить("ИнициаторПереадресацииПодтверждение");
	Реквизиты.Добавить("ОтправительСтрокой");
	Реквизиты.Добавить("ПолучательСтрокой");
	Реквизиты.Добавить("ПеревозчикСтрокой");
	Реквизиты.Добавить("СоставительСтрокой");
	Реквизиты.Добавить("ЗаказчикСтрокой");
	Реквизиты.Добавить("РасчетПеревозки");
	Реквизиты.Добавить("Отправитель_ДоставитьДо");
	Реквизиты.Добавить("АдресДоставкиЗначение");
	Реквизиты.Добавить("Отправитель_АдресДоставки");
	Реквизиты.Добавить("Погрузка_ДатаВремя");
	Реквизиты.Добавить("Погрузка_Адрес");
	Реквизиты.Добавить("АдресПогрузкиЗначение");
	Реквизиты.Добавить("Отправитель_ТемператураОт");
	Реквизиты.Добавить("Отправитель_ТемператураДо");
	Реквизиты.Добавить("Отправитель_ВлажностьОт");
	Реквизиты.Добавить("Отправитель_ВлажностьДо");
	Реквизиты.Добавить("ИнициаторПереадресации");
	Реквизиты.Добавить("Отправитель_НормыПеревозки");
	Реквизиты.Добавить("Отправитель_ОграничениеСкорости");
	Реквизиты.Добавить("Отправитель_Пломба");
	Реквизиты.Добавить("Отправитель_ДоставитьСрок");
	Реквизиты.Добавить("Отправитель_ПерегрузкаЗапрещена");
	Реквизиты.Добавить("Владелец_Тип");
	Реквизиты.Добавить("ОтгрузчикСтрокой");
	Реквизиты.Добавить("ВладелецОбъектаСтрокой");
	Реквизиты.Добавить("Владелец_НеизвестенПричина");
	Реквизиты.Добавить("Погрузка_КоличествоМест");
	Реквизиты.Добавить("Погрузка_Масса");
	Реквизиты.Добавить("Погрузка_МассаМетодРасчета");
	Реквизиты.Добавить("Погрузка_Состояние");
	Реквизиты.Добавить("Погрузка_ДатаВремяПрибыл");
	Реквизиты.Добавить("Погрузка_ДатаВремяУбыл");
	Реквизиты.Добавить("Отгрузка_ОтветственныйДолжность");
	Реквизиты.Добавить("Отгрузка_ОтветственныйСтрокой");
	Реквизиты.Добавить("Отправитель_ЗаявкаДата");
	Реквизиты.Добавить("Отправитель_ЗаявкаНомер");
	Реквизиты.Добавить("Отправитель_Экспедитор");
	Реквизиты.Добавить("Составитель_НаОснованииДокумент");
	Реквизиты.Добавить("Направление");
	Реквизиты.Добавить("ТипВладенияТС");
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("СопроводительныеДокументы");
	Таблицы.Добавить("ДанныеЮрЛиц");
	Таблицы.Добавить("КонтактныеДанные");
	Таблицы.Добавить("ТранспортныеСредства");
	Таблицы.Добавить("СпецРазрешения");
	Таблицы.Добавить("Водители");
	Таблицы.Добавить("ПутевыеЛисты");
	Таблицы.Добавить("Отметки");
	Таблицы.Добавить("Акты");
	Таблицы.Добавить("Штрафы");
	Таблицы.Добавить("Грузы");
	Таблицы.Добавить("Контейнеры");
	Таблицы.Добавить("Маркировки");
	Таблицы.Добавить("СведенияГосСистем");
	Таблицы.Добавить("ОпасныеГрузы");
	Таблицы.Добавить("ОтветственныеЛица");
	
	Результат = Новый Структура;
	Результат.Вставить("Реквизиты", Реквизиты);
	Результат.Вставить("Таблицы",   Таблицы);
	
	Возврат Результат;
		
КонецФункции

Функция РеквизитыПолучениеГруза()
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("Перевозчик_ПриемкаДатаВремя");
	Реквизиты.Добавить("Перевозчик_ПриемкаДатаВремяПрибыл");
	Реквизиты.Добавить("Перевозчик_ПриемкаДатаВремяУбыл");
	Реквизиты.Добавить("Перевозчик_ЗамечанияПоПогрузочнымРаботам");
	Реквизиты.Добавить("Перевозчик_ПогрузкаЗамечанияПоКоличеству");
	Реквизиты.Добавить("Перевозчик_ПогрузкаЗамечанияПоМассе");
	Реквизиты.Добавить("Перевозчик_ПогрузкаЗамечанияПоСостояниюГруза");
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("Отметки");
	Таблицы.Добавить("Акты");
	Таблицы.Добавить("Штрафы");
	
	Результат = Новый Структура;
	Результат.Вставить("Реквизиты", Реквизиты);
	Результат.Вставить("Таблицы",   Таблицы);
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыПриемкаГруза()
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("Выгрузка_ДатаВремя");
	Реквизиты.Добавить("Выгрузка_ДатаВремяПрибыл");
	Реквизиты.Добавить("Выгрузка_ДатаВремяУбыл");
	Реквизиты.Добавить("Выгрузка_МассаБрутто");
	Реквизиты.Добавить("Выгрузка_МассаНетто");
	Реквизиты.Добавить("Выгрузка_МассаМетодРасчета");
	Реквизиты.Добавить("Выгрузка_КоличествоМест");
	Реквизиты.Добавить("Выгрузка_Объем");
	Реквизиты.Добавить("Выгрузка_Состояние");
	Реквизиты.Добавить("Отправитель_ДоставитьДо");
	Реквизиты.Добавить("АдресДоставкиЗначение");
	Реквизиты.Добавить("Отправитель_АдресДоставки");
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("Отметки");
	Таблицы.Добавить("Акты");
	Таблицы.Добавить("Штрафы");
	
	Результат = Новый Структура;
	Результат.Вставить("Реквизиты", Реквизиты);
	Результат.Вставить("Таблицы",   Таблицы);
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыВыдачаГруза()
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("Перевозчик_ВыгрузкаДатаВремя");
	Реквизиты.Добавить("Перевозчик_ВыгрузкаДатаВремяПрибыл");
	Реквизиты.Добавить("Перевозчик_ВыгрузкаДатаВремяУбыл");
	Реквизиты.Добавить("Перевозчик_ЗамечанияПоРазгрузочнымРаботам");
	Реквизиты.Добавить("Перевозчик_ВыгрузкаЗамечанияПоСостояниюГруза");
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("Отметки");
	Таблицы.Добавить("Акты");
	Таблицы.Добавить("Штрафы");
	
	Результат = Новый Структура;
	Результат.Вставить("Реквизиты", Реквизиты);
	Результат.Вставить("Таблицы",   Таблицы);
	
	Возврат Результат;
	
КонецФункции

