
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Проверим заполнение обязательного параметра формы
	Если Не ОснованиеЗаполненоКорректно(Параметры.Основание) Тогда
		ВызватьИсключение "Не заполнено основание настройки действия
			|Доступные основания:
			|	Документ ""ESD. Транспортная накладная""";
	КонецЕсли;
	
	// Пересем значения параметров в реквизиты формы
	ЭтаФорма.ОбъектESD = Параметры.Основание;
	
	// Заполним служебные реквизиты формы
	ОтправкаЧерновикаСЛ_ЗаполнитьСлужебныеРеквизиты();
	
	// Заполним служебные списки выбора
	ОтправкаЧерновикаСЛ_ЗаполнитьСпискиВыбора();
	
	// Заполним текущие параметры действия при наличии
	Если Параметры.Свойство("ПараметрыДействия") Тогда
		ОтправкаЧерновикаСЛ_ЗаполнитьПараметрыДействияНаСервере(Параметры.ПараметрыДействия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучательВидПриИзменении_НастроитьВидимостьДоступностьПолей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолучательВидПриИзменении(Элемент)
	ПолучательВидПриИзменении_ОчиститьЗначенияПолей();
	ПолучательВидПриИзменении_НастроитьВидимостьДоступностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура ПолучательЛицо_ПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПроцедураПослеВыбора = Новый ОписаниеОповещения("ПолучательЛицо_ПослеВыбора", ЭтаФорма);
	ПараметрыРеквизитаФормы = ESD_ТНОбщегоНазначенияКлиентСервер.ПараметрыРеквизитаФормы(
		Элемент.Имя, Элемент.Имя);
	ПараметрыРеквизитаФормы.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
	ESD_ТНОбщегоНазначенияКлиент.ЮрЛицоНажатие(ЭтаФорма, "Составитель", 
		ПараметрыРеквизитаФормы, ПроцедураПослеВыбора);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Сохранить(Команда)
	ПараметрыДействия_ = ОтправкаЧерновикаСЛ_СформироватьПараметрыДействия();
	Закрыть(ПараметрыДействия_);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ПолучательЛицо_ПослеВыбора(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтправкаЧерновикаСЛ_ЗаполнитьСлужебныеРеквизиты()
	ЭтаФорма.РолиКонтрагентов_Составитель = Перечисления.ESD_РолиКонтрагентов.Составитель;
КонецПроцедуры

&НаСервере
Процедура ОтправкаЧерновикаСЛ_ЗаполнитьСпискиВыбора()
	ОтправкаЧерновикаСЛ_ПолучательВид_ЗаполнитьСписокВыбора();
	ОтправкаЧерновикаСЛ_ПолучательРоль_ЗаполнитьСписокВыбора();
КонецПроцедуры

&НаСервере
Процедура ОтправкаЧерновикаСЛ_ПолучательВид_ЗаполнитьСписокВыбора()
	Элементы.ПолучательВид.СписокВыбора.Очистить();
	Для Каждого ЭлементВыбора Из ОтправкаЧерновикаСЛ_ПолучательВид_СписокВыбора() Цикл
		Элементы.ПолучательВид.СписокВыбора.Добавить(
			ЭлементВыбора.Значение, ЭлементВыбора.Представление);	
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОтправкаЧерновикаСЛ_ПолучательВид_СписокВыбора()
	РезультатФункции = Новый СписокЗначений;
	РезультатФункции.Добавить("Роль", "Выбрать из ЭПД по роли юр. лица");
	РезультатФункции.Добавить("Лицо", "Установить фиксированное юр. лицо");
	
	Возврат РезультатФункции;
КонецФункции

&НаСервере
Процедура ОтправкаЧерновикаСЛ_ПолучательРоль_ЗаполнитьСписокВыбора()
	Элементы.ПолучательРоль.СписокВыбора.Очистить();
	Для Каждого ЭлементВыбора Из ОтправкаЧерновикаСЛ_ПолучательРоль_СписокВыбора(ЭтаФорма.ОбъектESD) Цикл
		Элементы.ПолучательРоль.СписокВыбора.Добавить(
			ЭлементВыбора.Значение, ЭлементВыбора.Представление);	
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтправкаЧерновикаСЛ_ПолучательРоль_СписокВыбора(ОбъектESD)
	РезультатФункции = Новый СписокЗначений;
	Если ОбъектESD = "Документ.ESD_ТранспортнаяНакладная" Тогда
		РезультатФункции.Добавить(Перечисления.ESD_РолиКонтрагентов.Отправитель);
		РезультатФункции.Добавить(Перечисления.ESD_РолиКонтрагентов.Перевозчик);
		РезультатФункции.Добавить(Перечисления.ESD_РолиКонтрагентов.Получатель);
		РезультатФункции.Добавить(Перечисления.ESD_РолиКонтрагентов.Отгрузчик, "Отгрузчик (ЛОП)");
		РезультатФункции.Добавить(Перечисления.ESD_РолиКонтрагентов.Оформитель, "Оформитель (СОХ)");
		РезультатФункции.Добавить(Перечисления.ESD_РолиКонтрагентов.Заказчик);
	Иначе
		Возврат РезультатФункции;
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

&НаКлиенте
Процедура ПолучательВидПриИзменении_ОчиститьЗначенияПолей()
	// Очищение полей "Роли"
	ЭтаФорма.ПолучательРоль = Неопределено;
	
	// Очищение полей "Лица"
	ЭтаФорма.ДанныеЮрЛиц.Очистить();
	ЭтаФорма.КонтактныеДанные.Очистить();
	ЭтаФорма.ПолучательЛицо_Представление = "";
КонецПроцедуры

&НаКлиенте
Процедура ПолучательВидПриИзменении_НастроитьВидимостьДоступностьПолей()
	Если ЭтаФорма.ПолучательВид = "Роль" Тогда
		Элементы.ПолучательЛицо_Представление.Видимость = Ложь;
		Элементы.ПолучательРоль.Видимость = Истина;
	ИначеЕсли ЭтаФорма.ПолучательВид = "Лицо" Тогда
		Элементы.ПолучательЛицо_Представление.Видимость = Истина;
		Элементы.ПолучательРоль.Видимость = Ложь;
	Иначе
		Элементы.ПолучательЛицо_Представление.Видимость = Ложь;
		Элементы.ПолучательРоль.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ОтправкаЧерновикаСЛ_СформироватьПараметрыДействия()
	РезультатФункции = Новый Структура("ПередВыполнением, ПриВыполнении, ПослеВыполнения");
	РезультатФункции.ПередВыполнением = ОтправкаЧерновикаСЛ_СформироватьПараметрыДействия_ПередВыполнением();
	РезультатФункции.ПриВыполнении = ОтправкаЧерновикаСЛ_СформироватьПараметрыДействия_ПриВыполнении();
	РезультатФункции.ПослеВыполнения = ОтправкаЧерновикаСЛ_СформироватьПараметрыДействия_ПослеВыполнения();
	
	Возврат РезультатФункции;
КонецФункции

&НаКлиенте
Функция ОтправкаЧерновикаСЛ_СформироватьПараметрыДействия_ПередВыполнением()
	Возврат Новый Структура;
КонецФункции

&НаКлиенте
Функция ОтправкаЧерновикаСЛ_СформироватьПараметрыДействия_ПриВыполнении()
	РезультатФункции = Новый Соответствие;
	РезультатФункции.Вставить("ПолучательВид", ЭтаФорма.ПолучательВид);
	РезультатФункции.Вставить("ПолучательРоль", ЭтаФорма.ПолучательРоль);
	
	ПараметрыОтбора_ = Новый Структура("Роль", ЭтаФорма.РолиКонтрагентов_Составитель);
	ПолучательЛицо_ = ESD_КомпонентыКлиентСервер	
		.ЮрЛицо_СвязанныеДанные_Найти(ЭтаФорма.ДанныеЮрЛиц, ЭтаФорма.КонтактныеДанные, ПараметрыОтбора_, Истина);
	РезультатФункции.Вставить("ПолучательЛицо", ПолучательЛицо_);
	
	Возврат РезультатФункции;
КонецФункции

&НаКлиенте
Функция ОтправкаЧерновикаСЛ_СформироватьПараметрыДействия_ПослеВыполнения()
	Возврат Новый Структура;
КонецФункции

&НаСервере
Процедура ОтправкаЧерновикаСЛ_ЗаполнитьПараметрыДействияНаСервере(ПараметрыДействия)
	Если Не ЗначениеЗаполнено(ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ПолучательВид = ПараметрыДействия["ПриВыполнении"]["ПолучательВид"];
	ЭтаФорма.ПолучательРоль = ПараметрыДействия["ПриВыполнении"]["ПолучательРоль"];
	
	ПолучательЛицо_ = ПараметрыДействия["ПриВыполнении"]["ПолучательЛицо"];
	ПараметрыЗаполнения_ = ESD_КомпонентыКлиентСервер.ЮрЛицо_ПараметрыЗаполненияПоКлючу(
		ЭтаФорма.РолиКонтрагентов_Составитель, "Составитель");
	ESD_КомпонентыКлиентСервер.ЮрЛицо_СвязанныеДанные_Обновить(ЭтаФорма.ДанныеЮрЛиц, ЭтаФорма.КонтактныеДанные, 
		ПолучательЛицо_, ПараметрыЗаполнения_);
	ЭтаФорма.ПолучательЛицо_Представление = ESD_КомпонентыКлиентСервер.ЮрЛицо_Представление(ЭтаФорма.ДанныеЮрЛиц, 
		ПараметрыЗаполнения_, "");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОснованиеЗаполненоКорректно(СтрОснование)
	РезультатФункции = Истина;
	Если СтрОснование <> "Документ.ESD_ТранспортнаяНакладная" Тогда
		РезультатФункции = Ложь;
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

#КонецОбласти
