
&НаКлиенте
Процедура Подключаемый_ДлительныеОперации_ПроверитьВыполнение() Экспорт
	// Небольшой переход на сервер для обработки завершенных длительных операций
	ЗавершенныеДлительныеОперации = Подключаемый_ДлительныеОперации_ОбработатьЗавершенныеНаСервере();
	// Обработаем завершенные на клиенте
	МодульКодаКлиент("ESD_ДлительныеОперацииКлиент").Подключаемый_ОбработатьЗавершенные(ЭтаФорма, ЗавершенныеДлительныеОперации);	
КонецПроцедуры

&НаСервере
Функция Подключаемый_ДлительныеОперации_ОбработатьЗавершенныеНаСервере()
	Возврат МодульКода("ESD_ДлительныеОперации").Подключаемый_ОбработатьЗавершенные(ЭтаФорма);	
КонецФункции

