
Процедура ДокументОснование_Выбрать(Форма, Знач Приемник = "") Экспорт
	Если Приемник = "" Тогда
		Приемник = Форма.ПолноеИмяМетаданных();
	КонецЕсли;
	
	ESD_ТНОбщегоНазначенияКлиент.ДокументОснованиеНажатие(Форма, Приемник);
КонецПроцедуры

Процедура ДокументОснование_Очистить(Форма) Экспорт
	ESD_ТНОбщегоНазначенияКлиент.ОчиститьДокументОснованиеНаФорме(Форма);
КонецПроцедуры

Процедура ДокументОснование_Настройка(Форма, Ссылка) Экспорт
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка",        Ссылка);
	ПараметрыФормы.Вставить("ТипМетаданных", "Документы");
	ОткрытьФорму("ОбщаяФорма.ESD_ВыборТиповЭПД", ПараметрыФормы, Форма);
КонецПроцедуры  
                                                                               
Процедура ДокументОснование_ОткрытьФормуЗаполнения(Форма, Знач Приемник = "") Экспорт 
	Если Приемник = "" Тогда
		Приемник = Форма.ПолноеИмяМетаданных();
	КонецЕсли; 
	
	ПараметрыЗаполнения_ = ESD_ОбщийФункционалКлиентСервер.ДокументОснование_ПараметрыЗаполнения_Выгрузить(
		Форма, Приемник);
		
	ДополнительныеПараметры_ = ESD_НастройкиСопоставленийКлиент.ФормаЗаполнения_ДополнительныеПараметры();
	ДополнительныеПараметры_.ТолькоПросмотр = Истина;
	ESD_НастройкиСопоставленийКлиент.ФормаЗаполнения_Открыть(ПараметрыЗаполнения_, Форма, ДополнительныеПараметры_);
КонецПроцедуры

