
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НачальноеЗаполнение(Параметры);
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеЮрЛиц

&НаКлиенте
Процедура ДанныеЮрЛицВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		"НаименованиеОрганизации",
		"ДанныеЮрЛицНаименованиеОрганизации",
		ВыбраннаяСтрока);
		
	ПараметрыРеквизитаФормы.ИмяИсходнойТаблицы          = "ДанныеЮрЛиц";
	ПараметрыРеквизитаФормы.ИдентификаторИсходнойСтроки = ВыбраннаяСтрока;
	ПараметрыРеквизитаФормы.ЭтоВО                       = ЭтаФорма.ЭтоВО;
	ПараметрыРеквизитаФормы.ТолькоПросмотр              = ЭтаФорма.ТолькоПросмотр;
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "ИнойПолучатель", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЮрЛицПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Роль = ЗначениеМетаданных("ESD_РолиКонтрагентов.ИнойПолучатель");
		Элемент.ТекущиеДанные.КлючСтроки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(
			ЭтаФорма, "ДанныеЮрЛиц");
	КонецЕсли;
	
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		"НаименованиеОрганизации",
		"ДанныеЮрЛицНаименованиеОрганизации",
		Элементы.ДанныеЮрЛиц.ТекущаяСтрока);
			
	ПараметрыРеквизитаФормы.ИмяИсходнойТаблицы          = "ДанныеЮрЛиц";
	ПараметрыРеквизитаФормы.ИдентификаторИсходнойСтроки = Элементы.ДанныеЮрЛиц.ТекущаяСтрока;
	ПараметрыРеквизитаФормы.ЭтоВО                       = ЭтаФорма.ЭтоВО;
	ПараметрыРеквизитаФормы.ТолькоПросмотр              = ЭтаФорма.ТолькоПросмотр;
			
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "ИнойПолучатель", ПараметрыРеквизитаФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИныхПолучателей(Команда)
	СписокИныхПолучателей = Новый Массив;
	Для Каждого СтрокаЮрЛица Из ЭтаФорма.ДанныеЮрЛиц Цикл
		СтруктураЮрЛица = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ШаблонДанныхЮрЛица();
		ЗаполнитьЗначенияСвойств(СтруктураЮрЛица, СтрокаЮрЛица);
		СписокИныхПолучателей.Добавить(СтруктураЮрЛица);
	КонецЦикла;
	
	Переопределяемый_СохранитьИныхПолучателей(СписокИныхПолучателей);
	
	Результат = Новый Структура("ИныеПолучатели", СписокИныхПолучателей);
	ЭтаФорма.Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИногоПолучателя(Команда)
	
	НоваяСтрока = ЭтаФорма.ДанныеЮрЛиц.Добавить();
	ИдентификаторСтроки = ЭтаФорма.ДанныеЮрЛиц.Количество() - 1;
	
	НоваяСтрока.Роль = ЗначениеМетаданныхКлиент("ESD_РолиКонтрагентов.ИнойПолучатель");
	НоваяСтрока.КлючСтроки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(
			ЭтаФорма, "ДанныеЮрЛиц");
	
	ОткрытьФормуЮрЛица(ИдентификаторСтроки);
	
	Элементы.ДанныеЮрЛиц.ТекущаяСтрока = ИдентификаторСтроки;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НачальноеЗаполнение(ПараметрыФормы)
	ЭтаФорма.ЭтоВО = ПараметрыФормы.ЭтоВО;
	ЭтаФорма.ДанныеЮрЛиц.Очистить();
	
	Если ЗначениеЗаполнено(ПараметрыФормы.ИныеПолучатели) Тогда
        ЗаполнитьИныхПолучателейИзКоллекцииНаСервере(ПараметрыФормы.ИныеПолучатели);
	КонецЕсли;

	Переопределяемый_НачальноеЗаполнение(ПараметрыФормы);
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьИныхПолучателейИзКоллекцииНаСервере(Коллекция)
	ЭтаФорма.ДанныеЮрЛиц.Очистить();
	Для Каждого СтруктураЮрЛица Из Коллекция Цикл
		СтрокаЮрЛица = ЭтаФорма.ДанныеЮрЛиц.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЮрЛица, СтруктураЮрЛица);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	ТолькоПросмотрФормы = ЭтаФорма.ТолькоПросмотр;
	
	Элементы.ДанныеЮрЛиц.ТолькоПросмотр = ТолькоПросмотрФормы;
	Элементы.ФормаСохранитьИныхПолучателей.Доступность      = Не ТолькоПросмотрФормы;
	Элементы.ДанныеЮрЛицДобавитьИногоПолучателя.Доступность = Не ТолькоПросмотрФормы;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЮрЛица(ИндексСтроки)
	ПараметрыРеквизитаФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыРеквизитаФормы(
		"НаименованиеОрганизации",
		"ДанныеЮрЛицНаименованиеОрганизации",
		ИндексСтроки);
		
	ПараметрыРеквизитаФормы.ИмяИсходнойТаблицы          = "ДанныеЮрЛиц";
	ПараметрыРеквизитаФормы.ИдентификаторИсходнойСтроки = ИндексСтроки;
	ПараметрыРеквизитаФормы.ЭтоВО                       = ЭтаФорма.ЭтоВО;
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ЮрЛицоНажатие(ЭтаФорма, "ИнойПолучатель", ПараметрыРеквизитаФормы);
КонецПроцедуры

#Область include_etrn_base_CommonForm_ИныеПолучателиДокументаЭПД_ПереопределяемыеПроцедурыИФункции
#КонецОбласти // include_etrn_base_CommonForm_ИныеПолучателиДокументаЭПД_ПереопределяемыеПроцедурыИФункции

#Область include_etrn_base_CommonForm_ИныеПолучателиДокументаЭПД_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_CommonForm_ИныеПолучателиДокументаЭПД_СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

