
&НаКлиенте
Процедура Переопределяемый_СохранитьИныхПолучателей(СписокИныхПолучателей)
    Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
        Возврат;
    КонецЕсли;

    Переопределяемый_СохранитьИныхПолучателейНаСервере(СписокИныхПолучателей);  
КонецПроцедуры

&НаСервере
Процедура Переопределяемый_СохранитьИныхПолучателейНаСервере(Знач СписокИныхПолучателей)
    ДокОбъект = ДокументОснование.ПолучитьОбъект(); 
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПерезаполнитьИныхПолучателей(ДокОбъект, СписокИныхПолучателей);
	ДокОбъект.Записать();
КонецПроцедуры

&НаСервере
Процедура Переопределяемый_НачальноеЗаполнение(ПараметрыФормы)
    ПараметрыФормы.Свойство("ДокументОснование", ДокументОснование);
    Если ЗначениеЗаполнено(ДокументОснование) И Не ЭтаФорма.ЭтоВО Тогда	
        Переопределяемый_ЗаполнитьИныхПолучателейИзДокументаОснования();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Переопределяемый_ЗаполнитьИныхПолучателейИзДокументаОснования()
	ОбъектОснования = ДокументОснование.ПолучитьОбъект();
	ЗаполнитьИныхПолучателейИзКоллекцииНаСервере(
		МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиИныхПолучателей(ОбъектОснования));
КонецПроцедуры

