#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  КодОрганизации - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ESD_МедицинскиеОрганизации - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция ЗначениеПоИдентификатору(Знач КодОрганизации) Экспорт
	
	Если КодОрганизации = "3ddc4dd3-b79e-4dc9-aca0-213df91cadff" Тогда
		Возврат ЭСМО;
	ИначеЕсли КодОрганизации = "249bf502-50e8-43b9-8250-34564751afa3" Тогда
		Возврат Медпойнт24;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции 

// Возвращает соответствующий идентификатор перечисления переданному значению.
//
// Параметры:
//  Значение - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   Строка - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая строка.
//
Функция ИдентификаторПоЗначению(Знач Значение) Экспорт
	
	Если Значение = ЭСМО Тогда
		Возврат "3ddc4dd3-b79e-4dc9-aca0-213df91cadff";
	ИначеЕсли Значение = Медпойнт24 Тогда
		Возврат "249bf502-50e8-43b9-8250-34564751afa3";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции 

// Возвращает соответствующее представление медицинской организации переданному значению.
//
// Параметры:
//  Значение - ПеречислениеСсылка.ESD_МедицинскиеОрганизации - Медицинская организация из перечисления.
//
// Возвращаемое значение:
//   Строка - Представление медицинской организаци.
//
Функция ПредставлениеПоЗначению(Знач Значение) Экспорт
	
	Если Значение = ЭСМО Тогда
		Возврат "Арциус, ООО";
	ИначеЕсли Значение = Медпойнт24 Тогда
		Возврат "Квазар, ООО";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
