#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  КодОрганизации - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ESD_МедицинскиеОрганизации - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция ЗначениеПоИдентификатору(Знач КодОрганизации) Экспорт
	
	Если КодОрганизации = "3ddc4dd3-b79e-4dc9-aca0-213df91cadff" Тогда
		Возврат ЭСМО;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции 

// Возвращает соответствующий идентификатор перечисления переданному значению.
//
// Параметры:
//  Значение - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   Строка - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая строка.
//
Функция ИдентификаторПоЗначению(Знач Значение) Экспорт
	
	Если Значение = ЭСМО Тогда
		Возврат "3ddc4dd3-b79e-4dc9-aca0-213df91cadff";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
