
// Получение из СБИС текущего варианта печатной формы документа
//
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры загрузки печатной формы.
//  ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки 
//
// Возвращаемое значение:
//   Строка - Id печатной формы
//
Функция ТекущийВариантПечатнойФормы(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	Результат = "";
	
	ДополнительныеПараметры = Новый Структура("ДопПоля", "Подстановки,Расширение");
	Результат = ЗагрузитьДанныеДокументаИзSaby(ПараметрыЗагрузки, ДополнительныеПараметры, ОбщиеПараметрыЗагрузки);
	Если Не Результат.Успешно Тогда
		Возврат Результат;
	КонецЕсли;
	
	МодульESD_ТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	ДанныеТитула_ = МодульESD_ТНОбщегоНазначенияКлиентСервер
		.ЗначениеИзКоллекции(Результат.Данные, "Подстановки.ОтветственныйЗаВыпуск");
	Если ЗначениеЗаполнено(ДанныеТитула_) Тогда
		ОбъектДокумента = Новый Соответствие;	
		Подключаемый_ДополнительныеПоля_ОбработкаДанныхТитула_Сформировать(ОбъектДокумента, "Титул", ДанныеТитула_);
		Результат = МодульESD_ТНОбщегоНазначенияКлиентСервер
			.ЗначениеИзКоллекции(ОбъектДокумента, "ДополнительныеПоля.Титул.Текст.VisualForm", "");	 
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

// Получение из СБИС вариантов печатной формы документа
//
// Параметры:
//  ИмяМетаданных - Строка - вид документа
//	ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
// Возвращаемое значение:
//   Соответствие - представление объекта Record, содержащий доступные печатные формы документа
//
Функция ВариантыПечатнойФормы(ИмяМетаданных, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	Результат = Новый Структура("Ошибка,Данные", Ложь, Неопределено);
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("ДопПоля", Новый Массив);
	ПараметрыМетода.Вставить("Навигация", Неопределено);
	ПараметрыМетода.Вставить("Сортировка", Неопределено);
	ПараметрыМетода.Вставить("Фильтр", Неопределено);
	
	ПараметрыДокументаДляАПИ = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыДокументаДляАПИ(ИмяМетаданных);
	Метод = ПараметрыДокументаДляАПИ.Тип + ".GetVisualVariants";
	
	РезультатSaby = ВыполнитьМетодSaby(Метод, ПараметрыМетода);
	Если РезультатSaby.Ошибка Тогда
		Результат.Ошибка = Истина;
		Результат.Данные = РезультатSaby.ОписаниеОшибки;
	Иначе
		МодульRecord = МодульКода("ESD_Record");
		Результат.Данные = МодульRecord.Decrease(РезультатSaby.Результат["result"]);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура Подключаемый_ОбработкаДанныхТитула(ДанныеДокумента, ТипТитула, ДанныеТитула)
	Если Не ЗначениеЗаполнено(ТипТитула) Тогда
		Возврат;
	КонецЕсли;
	
	Подключаемый_ДополнительныеПоля_ОбработкаДанныхТитула_Сформировать(ДанныеДокумента, ТипТитула, ДанныеТитула);	
КонецПроцедуры

Процедура Подключаемый_ПослеСохраненияДокумента(ОбъектДокумента, ПараметрыЗагрузки, ДополнительныеПараметры)
	Подключаемый_ПослеСохраненияДокумента_ЗавершенДокументооборот(ОбъектДокумента, ПараметрыЗагрузки, ДополнительныеПараметры);
	Подключаемый_ДополнительныеПоля_ПослеСохраненияДокумента_Записать(ОбъектДокумента, ПараметрыЗагрузки);
	Подключаемый_События_ПослеСохраненияДокумента_Записать(ОбъектДокумента, ПараметрыЗагрузки);
КонецПроцедуры

#Область include_etrn_base_CommonModule_ТНЗагрузкаСервер_ПодключаемыйФункционал_ДополнительныеПоля
#КонецОбласти // include_etrn_base_CommonModule_ТНЗагрузкаСервер_ПодключаемыйФункционал_ДополнительныеПоля

#Область include_etrn_base_CommonModule_ТНЗагрузкаСервер_ПодключаемыйФункционал_ПослеСохраненияДокумента
#КонецОбласти // include_etrn_base_CommonModule_ТНЗагрузкаСервер_ПодключаемыйФункционал_ПослеСохраненияДокумента

