
Процедура Подключаемый_ДополнительныеПоля_ОбработкаДанныхТитула_Сформировать(ДанныеДокумента, ТипТитула, ДанныеТитула)
	ДополнительныеПоля_ = ДанныеДокумента["ДополнительныеПоля"];
	Если ДополнительныеПоля_ = Неопределено Тогда
		ДополнительныеПоля_ = Новый Соответствие;
		ДанныеДокумента.Вставить("ДополнительныеПоля", ДополнительныеПоля_);
	КонецЕсли;
	
	ДополнительныеПоляТитула_ = ДополнительныеПоля_[ТипТитула];
	Если ДополнительныеПоляТитула_ = Неопределено Тогда
		ДополнительныеПоляТитула_ = Новый Соответствие;
		ДополнительныеПоля_.Вставить(ТипТитула, ДополнительныеПоляТитула_);
	КонецЕсли;
	
	Подключаемый_ДополнительныеПоля_ОбработкаДанныхТитула_Добавить(ДополнительныеПоляТитула_, ДанныеТитула);	
КонецПроцедуры

Процедура Подключаемый_ДополнительныеПоля_ОбработкаДанныхТитула_Добавить(ДополнительныеПоляТитула, ДанныеТитула)
	СписокИнформационныхПолей = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер")
		.ЗначениеИзКоллекции(ДанныеТитула, "Документ.ИнформационноеПоле");	
	Если ТипЗнч(СписокИнформационныхПолей) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого КоллекцияТипов Из СписокИнформационныхПолей Цикл
		Для Каждого ОписаниеТипа Из КоллекцияТипов Цикл
			ДополнительныеПоляПоТипу_ = ДополнительныеПоляТитула[ОписаниеТипа.Ключ];
			Если ДополнительныеПоляПоТипу_ = Неопределено Тогда
				ДополнительныеПоляПоТипу_ = Новый Соответствие;
				ДополнительныеПоляТитула.Вставить(ОписаниеТипа.Ключ, ДополнительныеПоляПоТипу_);
			КонецЕсли;
			
			КоллекцияДополнительныхПолей_ = ОписаниеТипа.Значение;
			Для Каждого ОписаниеДопПоля Из КоллекцияДополнительныхПолей_ Цикл
				Идентификатор_ = ОписаниеДопПоля["Ид"];
				Значение_ = ОписаниеДопПоля["Значение"];
				Если Не (ЗначениеЗаполнено(Идентификатор_) И ЗначениеЗаполнено(Значение_)) Тогда
					Продолжить;
				КонецЕсли;
				
				ДополнительныеПоляПоТипу_.Вставить(Идентификатор_, Значение_);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура Подключаемый_ДополнительныеПоля_ПослеСохраненияДокумента_Записать(ОбъектДокумента, ПараметрыЗагрузки)
	СписокДополнительныхПолей_ = ПараметрыЗагрузки.ДанныеДокумента["ДополнительныеПоля"];
	Если Не ЗначениеЗаполнено(СписокДополнительныхПолей_) Тогда
		РегистрыСведений.ESD_ЗначенияДополнительныхПолей.Очистить(ОбъектДокумента.Ссылка,
			Перечисления.ESD_Направление.Входящий);	
		Возврат;
	КонецЕсли;
	
	Попытка
		КоллекцияСлужебныхИдентификаторов = Документы[ОбъектДокумента.Метаданные().Имя]
			.Подключаемый_ДополнительныеПоля_Служебные();
	Исключение
		КоллекцияСлужебныхИдентификаторов = Новый Массив;
	КонецПопытки;
	
	СписокНаЗапись_ = Новый Массив;
	Для Каждого ДопПоляПоТитулам_ Из СписокДополнительныхПолей_ Цикл
		ТипТитула_ = ДопПоляПоТитулам_.Ключ;
		ДопПоляПоТипам_ = ДопПоляПоТитулам_.Значение;
		Для Каждого ОписаниеДопПолей_ Из ДопПоляПоТипам_ Цикл
			Для Каждого ОписаниеДопПоля_ Из ОписаниеДопПолей_.Значение Цикл
				СтруктураОбъекта_ = РегистрыСведений.ESD_ЗначенияДополнительныхПолей.СтруктураОбъекта();
				СтруктураОбъекта_.Идентификатор = ОписаниеДопПоля_.Ключ;
				СтруктураОбъекта_.Значение = ОписаниеДопПоля_.Значение;
				СтруктураОбъекта_.ТипТитула = ТипТитула_;
				СтруктураОбъекта_.Служебное = 
					(КоллекцияСлужебныхИдентификаторов[СтруктураОбъекта_.Идентификатор] <> Неопределено);
					
				СписокНаЗапись_.Добавить(СтруктураОбъекта_);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	РегистрыСведений.ESD_ЗначенияДополнительныхПолей.ЗаписатьЗначения(ОбъектДокумента.Ссылка, 
		СписокНаЗапись_, 
		Перечисления.ESD_Направление.Входящий);	
КонецПроцедуры	

