
Процедура Подключаемый_ПослеСохраненияДокумента_ЗавершенДокументооборот(ОбъектДокумента, ПараметрыЗагрузки, ДополнительныеПараметры)
	ДОЗавершен = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер")
        .ДокументооборотЗавершен(ДополнительныеПараметры.Состояние.ИндексКартинки);
    // Выполнение действий после завершения ДО
    Если ДОЗавершен Тогда
        // Запись архива в справочник "присоединенных файлов"  
        ЗагрузитьАрхивВложенийПослеЗавершенияДО(ОбъектДокумента.Ссылка, ПараметрыЗагрузки.ДанныеДокумента["СсылкаНаАрхив"]);
    КонецЕсли;
КонецПроцедуры

Процедура Подключаемый_События_ПослеСохраненияДокумента_Записать(ОбъектДокумента, ПараметрыЗагрузки)
	МодульКода("РегистрыСведений.ESD_ДанныеСобытий").ДобавитьНабор(
        ОбъектДокумента.Ссылка, ПараметрыЗагрузки.ДанныеДокумента["Событие"], Истина);		
КонецПроцедуры

