
Процедура Подключаемый_ПослеСохраненияДокумента_ЗаписатьДополнительныеСведения(ОбъектДокумента, ПараметрыЗагрузки, ПараметрыСтатус)
	Если Не ЗначениеЗаполнено(ОбъектДокумента.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// запись РС "ДополнительныеСведения"
    ДанныеОснования = Новый Структура;
    Если ПараметрыЗагрузки.ИзРасширения Тогда
        ДанныеОснования.Вставить("Метаданные",    ОбъектДокумента.ДокументОснование_ОбъектМетаданных);
        ДанныеОснования.Вставить("Идентификатор", ОбъектДокумента.ДокументОснование_Идентификатор);
    Иначе
		Основание = ESD_НастройкиСопоставленийСервер.НайтиОснование(ОбъектДокумента.Ссылка);
        ДанныеОснования.Вставить("Метаданные",    Основание.ОбъектМетаданных);
        ДанныеОснования.Вставить("Идентификатор", Основание.Идентификатор);
    КонецЕсли;
	
	ПараметрыСтатус.Вставить("ДанныеДокумента", ПараметрыЗагрузки.ДанныеДокумента);
	
    МодульКода("ESD_ТНВыгрузкаСервер").ЗаписатьДополнительныеСведенияОснования(
        ДанныеОснования, ПараметрыСтатус);
КонецПроцедуры

Процедура Подключаемый_ПослеСохраненияДокумента_ЗавершенДокументооборот(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, ДополнительныеПараметры)
	ДОЗавершен = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер")
        .ДокументооборотЗавершен(ДополнительныеПараметры.Состояние.ИндексКартинки);
		
	// Выполнение действий после завершения ДО
    Если ДОЗавершен Тогда
        // Запись архива в справочник "присоединенных файлов"  
        Подключаемый_ПослеСохраненияДокумента_ЗагрузитьАрхивВложенийПослеЗавершенияДО(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки,
			ПараметрыЗагрузки.ДанныеДокумента["СсылкаНаАрхив"]);
    КонецЕсли;
КонецПроцедуры

Процедура Подключаемый_События_ПослеСохраненияДокумента_Записать(ОбъектДокумента, ПараметрыЗагрузки)
	МодульКода("РегистрыСведений.ESD_ДанныеСобытий").ДобавитьНабор(
        ОбъектДокумента.Ссылка, ПараметрыЗагрузки.ДанныеДокумента["Событие"], Истина);		
КонецПроцедуры

Процедура Подключаемый_ПослеСохраненияДокумента_ЗагрузитьАрхивВложенийПослеЗавершенияДО(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки, СсылкаНаАрхив)
	МодульESD_ОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	// Проверим общую настройку загрузки архива после завершения ДО
    ВыгружатьАрхивВложений = МодульESD_ОбщегоНазначенияСервер.ESD_ЗагрузитьНастройкиОбъекта("ВыгружатьАрхивВложений");
    Если ВыгружатьАрхивВложений <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Сформируем структуру параметров загрузки файлов из Saby
	SabyПараметрыЗагрузки_ = SabyПараметрыЗагрузкиФайлов(ПараметрыЗагрузки["Ссылка"]);
	SabyПараметрыЗагрузки_.Вставить("ОбъектОбработки", ОбщиеПараметрыЗагрузки.ОбъектОбработки);
	SabyПараметрыЗагрузки_.Вставить("context_params", ОбщиеПараметрыЗагрузки.context_params);
	
	// Загрузим двоичные данные архива
	РезультатSaby = АдресДвоичныхДанныхАрхиваВложений(SabyПараметрыЗагрузки_, СсылкаНаАрхив);
	Если Не ЗначениеЗаполнено(РезультатSaby.Данные) Или РезультатSaby.Ошибка Тогда
		Возврат;
	КонецЕсли;
	
    // Загрузим архив
    МодульESD_ОбщегоНазначенияСервер
		.СохранитьАрхивВложенийВПрисоединенныеФайлы(РезультатSaby.Данные, SabyПараметрыЗагрузки_);
КонецПроцедуры

