
Функция Подключаемый_ЗаполнитьПараметрыЗагрузки(Параметры, ДополнительныеПараметры, РезультатВыгрузки = Неопределено) 
    ИспользуетсяПодключаемыйФункционал = Ложь;
    Если ДополнительныеПараметры.Свойство("УстановитьПечатнуюФорму") Тогда
		// BSLLS:FunctionOutParameter-off
        РезультатВыгрузки = Подключаемый_УстановитьПечатнуюФорму(Параметры, ДополнительныеПараметры);
        // BSLLS:FunctionOutParameter-on
        ИспользуетсяПодключаемыйФункционал = Истина;
    КонецЕсли;

    Возврат ИспользуетсяПодключаемыйФункционал;
КонецФункции

Функция Подключаемый_УстановитьПечатнуюФорму(Параметры, ДополнительныеПараметры)
	ПараметрыВыгрузки = ПараметрыВыгрузкиДокумента(Параметры, ДополнительныеПараметры);
	РезультатВыгрузки = МодульКода("ESD_ТНВыгрузкаСервер").Подключаемый_ВыгрузитьПечатнуюФорму(
		ПараметрыВыгрузки, Параметры.context_params);
	Возврат РезультатВыгрузки;
КонецФункции

