
&НаКлиенте
Функция ОбновитьДанныеОтветственногоЭПД()
	ПараметрыРасчета = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыЗаполненияНаОснованииINI();
	ПараметрыРасчета.Вставить("ini_name",  ЭтаФорма.ИмяИНИ);
	ПараметрыРасчета.Вставить("Основание", Новый Структура);
	ПараметрыРасчета.Основание.Вставить("Ссылка", ЭтаФорма.ФизЛицо);
	ПараметрыРасчета.Основание.Вставить("ИНН",    ЭтаФорма.ИННОрганизации);
	ПараметрыРасчета.Основание.Вставить("КПП",    ЭтаФорма.КППОрганизации);
	
	РезультатРасчета = Неопределено;
	ТранспортВО = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТранспортВО(ЭтаФорма);
	РезультатРасчета = РезультатРасчетаINI(ПараметрыРасчета, ТранспортВО.ТранспортБлокли);
	
	Результат = ЗаполнитьДанныеОтветственногоЭПД_НаОснованииINI(ПараметрыРасчета, РезультатРасчета);
	Если Результат.Свойство("ДанныеОтветственногоЭПД") Тогда
		Результат.ДанныеОтветственногоЭПД.Вставить("ЗаполнениеПоСсылке", Истина);
		ЗаполнениеРеквизитовФормы(Результат.ДанныеОтветственногоЭПД);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеОтветственногоЭПД_НаОснованииINI(Знач ПараметрыРасчета, Знач РезультатРасчета = Неопределено)
	Если РезультатРасчета = Неопределено Тогда
		ОбъектОбработки = ОбъектОбработки();
		РезультатРасчета = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатРасчетаINI(ПараметрыРасчета, ОбъектОбработки);
	КонецЕсли;
	
	Если РезультатРасчета.Результат.Ошибка Тогда	
		Возврат РезультатРасчета.Результат;	
	ИначеЕсли НЕ ЗначениеЗаполнено(РезультатРасчета.ДанныеИзИНИ) Тогда	
		РезультатРасчета.Результат.Ошибка          = Истина;
		РезультатРасчета.Результат.ТекстСообщения  = Нстр("ru = 'Не удалось получить данные с сервера.
			|Обратитесь к администратору системы'");	
	Иначе	
		ДанныеИНИ = РезультатРасчета.ДанныеИзИНИ;
		
		ДляДокумента = Новый Структура;
		ДляДокумента.Вставить("ОтветственныеЛица", Новый Массив);
		ДляДокумента.Вставить("ДокументыЭПД",      Новый Массив);
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ЗагрузкаСОнлайна", Ложь);
		
		МодульКода("ESD_ТНЗагрузкаСервер").ДанныеВодителей(ЭтаФорма, ДляДокумента, ДанныеИНИ["Водители"], ДопПараметры);
		
		Структура = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОтветственногоЛица();
		Если ЗначениеЗаполнено(ДляДокумента.ОтветственныеЛица) Тогда		
			ДанныеОтветственногоЭПД      = ДляДокумента.ОтветственныеЛица[0];
			ДанныеОтветственногоЭПД.Роль = Роль;
			ЗаполнитьЗначенияСвойств(Структура, ДанныеОтветственногоЭПД);
			
			РезультатРасчета.Результат.Вставить("ДанныеОтветственногоЭПД", Структура);		
		КонецЕсли;	
	КонецЕсли;
	
	Возврат РезультатРасчета.Результат;
КонецФункции

