
#Область ПрограммныйИнтерфейс

#Область Универсальные_методы

// Возвращает синоним метаданных
//
// Возвращаемое значение:
//   Строка - синоним метаданных
//
Функция ИмяКонфигурации() Экспорт
	Возврат Метаданные.Синоним;
КонецФункции

// Возвращает структуру версии продукта
//
// Параметры:
//  ПереданнаяВерсия - Строка - версия полученная не из кофигурации для разбора.
//
// Возвращаемое значение:
//   Структура - все составные части версии
//
Функция ВерсияПродукта(ПереданнаяВерсия = "") Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Наименование",   "");
	РезультатФункции.Вставить("ГодВыпуска",     "");
	РезультатФункции.Вставить("ВерсияПродукта", "");
	РезультатФункции.Вставить("ВерсияСборки",   "");
	РезультатФункции.Вставить("Релиз",          "");
	
	Если ЗначениеЗаполнено(ПереданнаяВерсия) Тогда
		Версия = ПереданнаяВерсия;
	Иначе
		ОбъектОбработки = ОбъектОбработки();
		ОбщиеНастройки = ОбъектОбработки.ОбщиеНастройкиПрочитать();
		Версия = ОбщиеНастройки["VersionInfo"];
	КонецЕсли;
	
	ПозицияРазделителя = СтрДлина(Версия);
	ТекущийСимвол = Сред(Версия, ПозицияРазделителя, 1);
	Пока ПозицияРазделителя > 0 И ТекущийСимвол <> "_" Цикл
		ПозицияРазделителя = ПозицияРазделителя - 1;
		ТекущийСимвол = Сред(Версия, ПозицияРазделителя, 1);
	КонецЦикла;
	
	Если ПозицияРазделителя <> 0 Тогда
		РезультатФункции.Наименование = Лев(Версия, ПозицияРазделителя - 1);
	КонецЕсли;
	
	ЦифроваяВерсия = Сред(Версия, ПозицияРазделителя + 1);
	СоставляющиеВерсии = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ЦифроваяВерсия, ".");
	
	ИндексГода           = 0;
	ИндексВерсииПродукта = 1;
	ИндексВерсииСборки   = 2;
	РезультатФункции.ГодВыпуска     = СоставляющиеВерсии[ИндексГода];
	РезультатФункции.ВерсияПродукта = СоставляющиеВерсии[ИндексВерсииПродукта];
	РезультатФункции.ВерсияСборки   = СоставляющиеВерсии[ИндексВерсииСборки];
	
	РезультатФункции.Релиз = РезультатФункции.ГодВыпуска + "." + РезультатФункции.ВерсияПродукта;
	
	Возврат РезультатФункции;
	
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДлительныеОперации
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДлительныеОперации

// Получает значение перечисления ЮрФизЛицо универсально для всех конфигураций
//
// Параметры:
//  ИмяЗначения - Строка - имя значения в перечислении
//
// Возвращаемое значение:
//   ПеречислениеСсылка - значение перечисления
//
Функция ЗначениеЮрФизЛицаКонфигурации(ИмяЗначения) Экспорт
	
	КлючЗначения = ИмяЗначения;
	
	НетЮрФизЛица = Метаданные.Перечисления.Найти("ЮрФизЛицо") = Неопределено;
	Если НетЮрФизЛица Тогда
		
		// "Бухгалтерия предприятия, редакция 3.0"
		ИмяПеречисления = "ЮридическоеФизическоеЛицо";
		Если КлючЗначения = "ЮрЛицо" Тогда 
			КлючЗначения = "ЮридическоеЛицо";
		Иначе
			КлючЗначения = "ФизическоеЛицо";
		КонецЕсли;
			
	Иначе
		ИмяПеречисления = "ЮрФизЛицо";
	КонецЕсли;
	
	Значение = Неопределено;
	Если Перечисления[ИмяПеречисления].ПустаяСсылка().Метаданные().ЗначенияПеречисления.Найти(КлючЗначения) <> Неопределено Тогда
		Значение = Перечисления[ИмяПеречисления][КлючЗначения];
	КонецЕсли;
	
	Возврат Значение;

КонецФункции

#Область Метаданные

// Получает имя метаданных документа в конфигурации
//
// Параметры:
//  ДокументСсылка  - ДокументСсылка - ссылка на любой документ конфигурации
//
// Возвращаемое значение:
//   Строка - имя метаданных документа в конфигурации
//
Функция ИмяМетаданныхДокумента(ДокументСсылка) Экспорт
	
	ТипЗначения = ТипЗнч(ДокументСсылка);
	Если ТипЗначения = Тип("Структура") Тогда
		ИмяДокумента = ДокументСсылка.ИмяМетаданных;
	Иначе
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
		Если ОбъектМетаданных <> Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
			ИмяДокумента = ДокументСсылка.Метаданные().Имя;
		Иначе
			ИмяДокумента = "";
		КонецЕсли;
	КонецЕсли;

	Возврат ИмяДокумента;
	
КонецФункции

// Поиск метаданных доступных в конфигурации
// Параметры:
//  МассивПроверяемыхТипов - Массив - проверяемые типы
// Возвращаемое значение:
//  ОписаниеТипов - только доступные типы метаднных в текущей конфигурации
//
Функция ДоступныеТипыМетаданных(МассивПроверяемыхТипов) Экспорт
	
	МассивТипов = Новый Массив; 
	
	Для Каждого ТипМетаданных Из МассивПроверяемыхТипов Цикл 
		
		Если ТипМетаданных = "Строка" Тогда
			МассивТипов.Добавить(Тип("Строка"));
			Продолжить;
		КонецЕсли;	
		
		МассивИмен = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ТипМетаданных, ".");
		
		Тип = МассивИмен[0];
		Имя = МассивИмен[1];
		
		ЕстьВКонфигурации = МетаданныеЕстьВКонфигурации(Тип, Имя);
		Если ЕстьВКонфигурации Тогда
			
			ИмяТипаМетаданных = СформироватьИмяМетаданных(Тип, Имя);			
			МассивТипов.Добавить(Тип(ИмяТипаМетаданных));
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Типы = Новый ОписаниеТипов(МассивТипов);
	
	Возврат Типы;	
		
КонецФункции

// Проверка наличия метаданных в конфигурации
// Параметры:
//  Тип - Строка - тип метаданных (Документ, Справочник...)
//  Имя - Строка - имя метаданных
// Возвращаемое значение:
//  Булево - если метаданные есть то вернется истина 
//
Функция МетаданныеЕстьВКонфигурации(Тип, Имя) Экспорт
	
	МетаданныеЕсть = Метаданные[Тип].Найти(Имя) <> Неопределено;
	
	Возврат МетаданныеЕсть;
	
КонецФункции

// Получение признака, что режим совместимости интерфейса относится к "Такси"
//
// Возвращаемое значение:
//	Булево - признак, что режим совместимости относится к "Такси"
Функция ИспользуетсяИнтерфейсТакси() Экспорт
	Если ЭтоОбычноеПриложение() Тогда
		Возврат Ложь;
	КонецЕсли;

	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ТекущийИнтерфейс = Метаданные.РежимСовместимостиИнтерфейса;
	СтрТекущийИнтерфейс = НРег(Строка(ТекущийИнтерфейс));

	Возврат СтрТекущийИнтерфейс = "такси"
		Или СтрТекущийИнтерфейс = "таксиразрешитьверсия8_2";
КонецФункции

// Получение признака, что используется "обычное приложение"
//
// Возвращаемое значение:
//	Булево - признак, что используется "обычное приложение"
Функция ЭтоОбычноеПриложение() Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Возврат Метаданные.ОсновнойРежимЗапуска = РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение;
КонецФункции

#КонецОбласти // 

// Преобразует строку таблицы значений в структуру.
// Свойства структуры и их значения совпадают с колонками переданной строки.
//
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений - строка для преобразования
//  МассивКолонокИсключений - Массив - колонки для исключения
//
// Возвращаемое значение:
//  Структура - преобразованная строка таблицы значений.
//
Функция СтрокаТаблицыЗначенийВСтруктуруЭПД(СтрокаТаблицыЗначений, МассивКолонокИсключений = Неопределено) Экспорт
	
	Структура = Новый Структура;
	Для Каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл 
		
		Если МассивКолонокИсключений <> Неопределено Тогда
			
			Если МассивКолонокИсключений.Найти(Колонка.Имя) = Неопределено Тогда 
				Структура.Вставить(Колонка.Имя, СтрокаТаблицыЗначений[Колонка.Имя]);
			КонецЕсли;
				
		Иначе 	
			Структура.Вставить(Колонка.Имя, СтрокаТаблицыЗначений[Колонка.Имя]);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

// Записывает информацию в журнал регистрации с уровнем Ошибка
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка к которой будет привязано сообщение
//  Описание - Строка - имя события журнала регистрации
//  Текст - Строка - комментарий журнала регистрации
//
Процедура ЗаписатьОшибкуВЖурналРегистрации(Ссылка, Описание, Текст) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации(
		МодульКода("ESD_Core").ЛокализацияНазваниеПродукта() + "." + Описание,
		УровеньЖурналаРегистрации.Ошибка,
		, // ОбъектМетаданных - ссылка на элемент справичника или документ
		Ссылка,
		Текст,
    	РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
	
КонецПроцедуры

// Десериализация значений из строки в значение
// Параметры:
//	Строка - Строка - сереиализованное значение
//
// Возвращаемое значение:
//	Значение - значение любого типа, полученное после десериализации
//
Функция ДесериализоватьЗначение(Знач Строка) Экспорт
	
	Если Не ЗначениеЗаполнено(Строка) Тогда 
		Значение = Новый Структура;
	Иначе 	
	    Значение = ЗначениеИзСтрокиВнутр(Строка);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Сериализация произвольных значений
// Параметры:
//	Значение - ЛюбойТип - значение для сериализации
//
// Возвращаемое значение:
//	Строка - сериализованное значение
// 
Функция СериализоватьЗначение(Знач Значение) Экспорт
	
	Если Не ЗначениеЗаполнено(Значение) Тогда 
		СтрокаЗначения = "";
	Иначе 
		СтрокаЗначения = ЗначениеВСтрокуВнутр(Значение);
	КонецЕсли;
			
	Возврат СтрокаЗначения;
		
КонецФункции

// Заполнение реквизитов формы из источника
// Параметры: 
//	Форма - ФормаКлиентскогоПриложения - форма для заполнения реквизитов
//  ДанныеЗаполнения - Структура - данные для заполнения реквизитов
//  Исключения - Массив - реквизиты исключения
//
Процедура ESD_ЗаполнитьРеквизитыФормы(Форма, ДанныеЗаполнения, Исключения = Неопределено) Экспорт	
	
	Если Исключения = Неопределено Тогда
		Исключения = Новый Массив;
	КонецЕсли;	
	
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	ТипТаблицаЗначений = Новый ОписаниеТипов("ТаблицаЗначений");	
		
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл 		
			
		Если ДанныеЗаполнения.Свойство(РеквизитФормы.Имя) Тогда
			
			Если Исключения.Найти(РеквизитФормы.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеИсточник = ДанныеЗаполнения[РеквизитФормы.Имя];	
			Если РеквизитФормы.ТипЗначения = ТипТаблицаЗначений Тогда 
				ЗаполнитьТаблицуЗначений(Форма, ДанныеЗаполнения, РеквизитФормы, ЗначениеИсточник);								
			Иначе
				Форма[РеквизитФормы.Имя] = ЗначениеИсточник;
			КонецЕсли;
			
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

// Чтение реквизитов формы в структуру
// Параметры: 
//	Форма - ФормаКлиентскогоПриложения - форма источник для чтения данных
//  Исключения - Массив - реквизиты исключения
//
// Возвращаемое значение:
//   Структура - реквизиты формы в структуре
//
Функция РеквизитыФормыВСтруктуру(Форма, Исключения = Неопределено) Экспорт	
	
	Если Исключения = Неопределено Тогда
		РеквизитыИсключения = Новый Массив;
	Иначе 
		РеквизитыИсключения = Исключения; 
	КонецЕсли;		
	
	Результат = Новый Структура;
	
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	ТипТаблицаЗначений = Новый ОписаниеТипов("ТаблицаЗначений");	
		
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл 		
				
		Если РеквизитыИсключения.Найти(РеквизитФормы.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если РеквизитФормы.ТипЗначения = ТипТаблицаЗначений Тогда 
			// нет обработки таблиц значений
			Продолжить;
		Иначе
			
			Результат.Вставить(РеквизитФормы.Имя, Форма[РеквизитФормы.Имя]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Очистка значений всех реквизитов формы
// Параметры: 
//	Форма - ФормаКлиентскогоПриложения - форма для очистки реквизитов
//  РеквизитыИсключения - Массив - реквизиты для исключения очистки
//
Процедура ОчиститьРеквизитыФормы(Форма, РеквизитыИсключения = Неопределено) Экспорт
	
	Если РеквизитыИсключения = Неопределено Тогда 
		РеквизитыИсключения = Новый Массив;
	КонецЕсли;
	
	Для Каждого РеквизитФормы Из Форма.ПолучитьРеквизиты() Цикл
		Если РеквизитыИсключения.Найти(РеквизитФормы.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Форма[РеквизитФормы.Имя]) = Тип("ДанныеФормыКоллекция") Тогда
			Форма[РеквизитФормы.Имя].Очистить();
		Иначе
			Форма[РеквизитФормы.Имя] = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Очистка указанных реквизитов объекта
// Параметры:
// 	ОбъектОчистки - Объект - объект для очистки, может быть документ или справочник  
//	РеквизитыДляОчистки - Массив - реквизиты объекта для очистки 
//
Процедура ОчисткаРеквизитовОбъекта(ОбъектОчистки, РеквизитыДляОчистки) Экспорт
		
	Если Не ЗначениеЗаполнено(РеквизитыДляОчистки) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИмяРеквизита Из РеквизитыДляОчистки Цикл
		
		ЭтоТаблица = Ложь;
		
		ТипЗначенияСтрокой = НРег(ТипЗнч(ОбъектОчистки[ИмяРеквизита]));
		Фрагменты = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ТипЗначенияСтрокой, ":", Ложь);
		
		Если Фрагменты.Количество() > 1 Тогда
			
			ОсновнаяЧасть = Фрагменты[0]; 			
			Если Найти(ОсновнаяЧасть, "табличная часть") 
				Или Найти(ОсновнаяЧасть, "tabular section") Тогда
				ЭтоТаблица = Истина;
			КонецЕсли;
			
		КонецЕсли;
	
		Если ЭтоТаблица Тогда
			ОбъектОчистки[ИмяРеквизита].Очистить();
		Иначе
			ОбъектОчистки[ИмяРеквизита] = "";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Создает новую структуру, где присутствуют только заполненные значения
//
// Параметры:
//  ИсходнаяСтруктура - Структура - структура для исключения пустых значений
//  Исключения - Массив - исключения для корректной итоговой структуры
//
// Возвращаемое значение:
//   Структура - новая структура без пустых вложений
//
Функция СтруктураБезПустыхЗначений(ИсходнаяСтруктура, Исключения = Неопределено) Экспорт
	
	РезультатФункции = Новый Структура;
	Если Исключения = Неопределено Тогда
		СписокИсключений = Новый Массив;
	Иначе
	    СписокИсключений = Исключения;
	КонецЕсли;
		
	Для Каждого КлючЗначение Из ИсходнаяСтруктура Цикл		
		
		НужноДобавить = СписокИсключений.Найти(КлючЗначение.Ключ) <> Неопределено
			           		Или ЗначениеЗаполнено(КлючЗначение.Значение)
							Или ТипЗнч(КлючЗначение.Значение) = Тип("Массив");
		
		Если НужноДобавить Тогда
			РезультатФункции.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

// Создает новую структуру, полностью копирующую входящую
//
// Параметры:
//  ИсходнаяСтруктура - Структура - структура для копирования
//
// Возвращаемое значение:
//   Структура - новая структура, копирующая входящую 
//
Функция СкопироватьСтруктуру(ИсходнаяСтруктура) Экспорт
	
	НоваяСтруктура = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ИсходнаяСтруктура));
	Возврат НоваяСтруктура;
	
КонецФункции

// Удаление свойств из структуры
// 
// Параметры:
//  Структура - Структура - структура из которой требуется удалить свойства 
//  Элементы - Массив - элементы для удаления
//
Процедура УдалитьСвойстваИзСтруктуры(Структура, Элементы) Экспорт
	
	Для Каждого ЭлементМассива Из Элементы Цикл
		Если Структура.Свойство(ЭлементМассива) Тогда
			Структура.Удалить(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

// Устанавливает указанные типы элемента формы, если они есть в конфигурации
//
// Параметры:
//  ЭлементФормы - ПолеФормы - поле, в которое устанавливается ограничение типа
//  МассивПроверяемыхТипов - Массив - массив строк типов
//  ТипПоУмолчанию - ОписаниеТипов - тип для подстановки, если типы не доступны в конфигурации
//
Процедура УстановитьОграниченияТипов(ЭлементФормы, МассивПроверяемыхТипов, ТипПоУмолчанию = Неопределено) Экспорт
	
	ТипыОграничений = ДоступныеТипыМетаданных(МассивПроверяемыхТипов);
	
	Если ЗначениеЗаполнено(ТипыОграничений) Тогда 
		ЭлементФормы.ОграничениеТипа = ТипыОграничений;
	ИначеЕсли ТипПоУмолчанию <> Неопределено Тогда
		ЭлементФормы.ОграничениеТипа = ТипПоУмолчанию;
	Иначе 
		ЭлементФормы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает указанные параметры выбора для поля формы
//
// Параметры:
//  ЭлементФормы - ПолеФормы - поле, в которое устанавливается ограничение типа
//  МассивПараметровВыбора - Массив - массив параметров выбора для установки
//
Процедура УстановитьПараметрыВыбора(ЭлементФормы, МассивПараметровВыбора) Экспорт
	
	Если ЭлементФормы.ОграничениеТипа.Типы().Количество() = 0
		Или ЭлементФормы.ОграничениеТипа.СодержитТип(Тип("Строка")) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементФормы.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
КонецПроцедуры

// Функция для установки значения констант
// 
// Параметры:
// 	Имя - Строка - название константы 
// 	Значение - Произвольный - значение, которое трубется установить
//
Процедура УстановитьЗначениеКонстанты(Имя, Значение) Экспорт
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Константы[Имя].Установить(Значение);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Функция для получения значения констант
// 
// Параметры:
// 	Имя - Строка - название константы
//  ЗначениеПоУмолчанию - Произвольный - значение, которое установится при отсутсвии константы.
//
// Возвращаемое значение:
//   Произвольный - значение константы
//
Функция ЗначениеКонстанты(Имя, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Попытка
		РезультатФункции = Константы[Имя].Получить();
	Исключение
		РезультатФункции = ЗначениеПоУмолчанию;
	КонецПопытки;
	
	Возврат РезультатФункции;
	
КонецФункции

// Проверка того, что переданный тип является ссылочным типом данных.
// Для типа Неопределено возвращается Ложь.
//
// Параметры:
//  ПроверяемыйТип - Тип - для проверки на ссылочный тип данных.
//
// Возвращаемое значение:
//  Булево - Истина, если это ссылка.
//
Функция ЭтоСсылка(ПроверяемыйТип) Экспорт
	
	ОписаниеТипаВсеСсылки = МодульКода("ESD_ОбщегоНазначенияПовтИсп").ОписаниеТипаВсеСсылки();
	
	Возврат ПроверяемыйТип <> Тип("Неопределено") 
		И ОписаниеТипаВсеСсылки.СодержитТип(ТипЗнч(ПроверяемыйТип));

КонецФункции

// Получение описания для ссылочных типов
//
// Возвращаемое значение:
//	ОписаниеТипов - описание ссылочных типов справочников, документов, перечислений 
//
Функция ОписаниеТипаВсеСсылки() Экспорт
	
	РезультатФункции = Новый ОписаниеТипов(Справочники.ТипВсеСсылки(), Документы.ТипВсеСсылки().Типы());
	РезультатФункции = Новый ОписаниеТипов(РезультатФункции, Перечисления.ТипВсеСсылки().Типы());

	Возврат РезультатФункции;
				
КонецФункции

// Получение полного имени метаданных по типу объекта
//
// Параметры:
//	ТипОбъекта - Тип - тип данных объекта
//
// Возвращаемое значение:
//	Строка - полное имя метаданных
//
Функция ПолноеИмяМетаданныхПоТипуОбъекта(ТипОбъекта) Экспорт
	Попытка
		МетаданныеОбъекта_ = Метаданные.НайтиПоТипу(ТипОбъекта);
		РезультатФункции = МетаданныеОбъекта_.ПолноеИмя();
	Исключение
		РезультатФункции = "";
	КонецПопытки;

	Возврат РезультатФункции;
КонецФункции

#КонецОбласти // Универсальные_методы

#Область КонтактнаяИнформация

// Переопределяемая процедура под свою конфигурацию
// 
// Параметры:
// 	СсылкаИлиОбъект - ДокументОбъект - ссылка или объект-владелец контактной информации
// 	ВидИлиТипКИ - СправочникСсылка.ВидыКонтактнойИнформации - отбор по виду контактной информации.
//              - ПеречислениеСсылка.ТипыКонтактнойИнформации - отбор по типу контактной информации.
//  Дата - Дата - дата среза КИ
//  ТолькоПредставление - Булево - получение только представления, без значения полей
//
// Возвращаемое значение:
//  Структура - данные КИ объекта, в зависимости от типа/вида
//
Функция КонтактнаяИнформацияОбъекта(СсылкаИлиОбъект, ВидИлиТипКИ = Неопределено,
		Дата = Неопределено, ТолькоПредставление = Ложь) Экспорт
		
	ДатаСреза = Дата;
	Если ДатаСреза = Неопределено Тогда
		ДатаСреза = ТекущаяДатаСеанса();
	КонецЕсли;
	
	КонтрактнаяИнформация = МодульКода("УправлениеКонтактнойИнформацией").КонтактнаяИнформацияОбъекта(
		СсылкаИлиОбъект, 
		ВидИлиТипКИ, 
		ДатаСреза, 
		ТолькоПредставление);
	
	// Обработка возвращаем одиночное значение
	СтруктураАдреса = Новый Структура;
	СтруктураАдреса.Вставить("Значение",  "");
	СтруктураАдреса.Вставить("Структура", "");
	
	Если НЕ ТолькоПредставление И АдресКонтрагентаИлиОрганизации(ВидИлиТипКИ) Тогда
		
		Если КонтрактнаяИнформация.Количество() Тогда
			
			СтрокаКИ = КонтрактнаяИнформация[0];
			СтруктураАдреса.Значение  = СтрокаКИ.Представление;
			СтруктураАдреса.Структура = СтрокаКИ.Значение;
			
		КонецЕсли;
		
		Возврат СтруктураАдреса;
		
	Иначе
		Возврат КонтрактнаяИнформация;
	КонецЕсли;
	
КонецФункции

#Область ДанныеЮрЛиц

// Возвращает выборку данных юрлиц
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которой выводятся данные юр. лиц
//  Роли - Строка - роли юр. лиц, разделенных запятыми, по которым осуществляется обновление.
//    Каждая рольв строке должна соответсвовать имени из перечисления Saby_РолиКонтрагентов.
//  ТаблицаЮрЛицПереданная - ТаблицаЗначений - данные по юрлицам
//
// Возвращаемое значение:
//   ВыборкаИзРезультатаЗапроса - выборка данных юрлиц
//
Функция ВыборкаДанныхЮрЛиц(Форма, Роли, ТаблицаЮрЛицПереданная = Неопределено) Экспорт
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ТаблицаЮрЛиц = ТаблицаЮрЛицПереданная;
	Если ТаблицаЮрЛиц = Неопределено Тогда
		ФормаОбъект = МодульТНОбщегоНазначенияКлиентСервер.ФормаОбъект(Форма);
		ТаблицаЮрЛиц = МодульТНОбщегоНазначенияКлиентСервер.ТаблицаЮрЛиц(Форма, Роли, ФормаОбъект);
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	МассивЮрЛиц = МодульТНОбщегоНазначенияКлиентСервер.ВыгрузитьКолонкуЮрЛиц(ТаблицаЮрЛиц, "Ссылка");
	
	МассивТиповСсылок = Новый Массив;
	МассивТиповСсылок.Добавить(Тип("СправочникСсылка.Организации"));
	МассивТиповСсылок.Добавить(Тип("СправочникСсылка.Контрагенты"));
	
	ОписаниеТипаРоли = Новый ОписаниеТипов("ПеречислениеСсылка." + РолиКонтрагентов());
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Ссылка", Новый ОписаниеТипов(МассивТиповСсылок));
	ТаблицаДанных.Колонки.Добавить("Роль",   ОписаниеТипаРоли);
	
	Для Каждого СтруктураДанных Из ТаблицаЮрЛиц Цикл
		СтрокаДанных = ТаблицаДанных.Добавить();
		СтрокаДанных.Ссылка = СтруктураДанных.Ссылка;
		СтрокаДанных.Роль   = СтруктураДанных.Роль;
	КонецЦикла;
	
	ПолучитьДанныеЮрЛицИзБазы(МассивЮрЛиц, МенеджерВременныхТаблиц);
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЮрЛиц.Ссылка КАК Ссылка,
	|	ТаблицаЮрЛиц.Роль КАК Роль
	|ПОМЕСТИТЬ ДанныеТаблицыЮрЛиц
	|ИЗ
	|	&ТаблицаЮрЛиц КАК ТаблицаЮрЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТаблицыЮрЛиц.Ссылка КАК Ссылка,
	|	ДанныеТаблицыЮрЛиц.Роль КАК Роль,
	|	ДанныеЮрЛицИзБазы.ИНН КАК ИНН,
	|	ДанныеЮрЛицИзБазы.КПП КАК КПП,
	|	ДанныеЮрЛицИзБазы.СтранаРегистрации КАК СтранаРегистрации,
	|	ДанныеЮрЛицИзБазы.ОГРН КАК ОГРН,
	|	ДанныеЮрЛицИзБазы.ЮрФизЛицо КАК ЮрФизЛицо,
	|	ДанныеЮрЛицИзБазы.Наименование КАК Наименование,
	|	ДанныеЮрЛицИзБазы.Наименование КАК НаименованиеОрганизации,
	|	ДанныеЮрЛицИзБазы.КодФилиала КАК КодФилиала
	|ИЗ
	|	ДанныеТаблицыЮрЛиц КАК ДанныеТаблицыЮрЛиц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеЮрЛицИзБазы КАК ДанныеЮрЛицИзБазы
	|		ПО ДанныеТаблицыЮрЛиц.Ссылка = ДанныеЮрЛицИзБазы.Ссылка";

	ЗапросДанных.УстановитьПараметр("ТаблицаЮрЛиц", ТаблицаДанных);

	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	
	МенеджерВременныхТаблиц.Закрыть();
	
	Возврат ВыборкаДанных;
	
КонецФункции

// Читает строковое значение JSON в структуру на сервере, так как чтение JSON не доступно в вэб клиенте.
//
// Параметры:
//  СтрокаJSON - Строка - строка с валидным JSON для чтения
//
// Возвращаемое значение:
//   Структура - прочитанные данные JSON
//
Функция ПрочитатьJSONДляВебКлиента(СтрокаJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	РезультатФункции = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат РезультатФункции;
	
КонецФункции

// Возвращает признак наличия организации в справочнике организаций по ИНН и КПП.
//
// Параметры:
//  ИНН - Строка - ИНН организации
//  КПП - Строка - КПП организации
//
// Возвращаемое значение:
//   Булево - признак наличия организации в базе
//
Функция ОрганизацияПрисутствуетВБазе(ИНН, КПП) Экспорт
	
	Результат = ОрганизацияКонтрагент(ИНН, КПП);
	
	Возврат Результат.Ссылка <> Неопределено И Результат.ЭтоОрганизация;
	
КонецФункции

// Возвращает ссылку на организацию или контрагента из базы
//
// Параметры:
//  ИНН - Строка - ИНН строкой
//  КПП - Строка - КПП строкой
//  Наименование - Строка - наименование организации
//
// Возвращаемое значение:
//   Структура - структура найденного юр лица
//
Функция ОрганизацияКонтрагент(ИНН, КПП, Наименование = Неопределено) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Ссылка",         Неопределено);
	РезультатФункции.Вставить("ЭтоОрганизация", Ложь);
	
	МассивЗапросов = Новый Массив;
	ЗапросПоОрганизации(МассивЗапросов, КПП, Наименование);
	ЗапросПоКонтрагенту(МассивЗапросов, КПП, Наименование);
		
	Если МассивЗапросов.Количество() = 0 Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	РазделительОбъединение = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.УстановитьПараметр("ИНН",          ИНН);
	ЗапросДанных.УстановитьПараметр("КПП",          КПП);
	ЗапросДанных.УстановитьПараметр("Наименование", Наименование);
	ЗапросДанных.Текст = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(МассивЗапросов, РазделительОбъединение);
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ЗапросДанных.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗапросДанных.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НайденныеЮрЛица.Ссылка КАК Ссылка,
	|	НайденныеЮрЛица.ЭтоОрганизация КАК ЭтоОрганизация
	|ИЗ
	|	НайденныеЮрЛица КАК НайденныеЮрЛица
	|
	|УПОРЯДОЧИТЬ ПО
	|	НайденныеЮрЛица.Порядок";
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	Если ВыборкаДанных.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РезультатФункции, ВыборкаДанных);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // ДанныеЮрЛиц

// см. УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации
//
// Параметры:
//    ТипКонтактнойИнформации - ПеречислениеСсылка.ТипыКонтактнойИнформации
//                            - Строка - тип контактной информации,
//                            - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации для
//                              заполнения свойства НастройкиПроверки.
//
// Возвращаемое значение:
//   Структура - см. УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации
//
Функция ПараметрыВидаКонтактнойИнформации(Знач ТипКонтактнойИнформации) Экспорт
	
	РезультатФункции = Неопределено;
	
	МодульУправлениеКонтактнойИнформацией = МодульКода("УправлениеКонтактнойИнформацией");
	Если МодульУправлениеКонтактнойИнформацией <> Неопределено Тогда
		
		ВсеТипы = "Перечисление.ТипыКонтактнойИнформации.";
		ТипИнформации = ПредопределенноеЗначение(ВсеТипы + СокрЛП(ТипКонтактнойИнформации));
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			РезультатФункции = Неопределено;
		#Иначе
			Попытка
				РезультатФункции = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ТипИнформации);
			Исключение
				РезультатФункции = Неопределено;
			КонецПопытки;
		#КонецЕсли
		
	Иначе
		РезультатФункции = Неопределено;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Преобразует представление контактной информации во внутренний формат JSON.
//
// Для адресов, введенных в свободной форме, корректное преобразование не гарантируется.
//
//  Параметры:
//      Значение - Строка  - контактная информация в формате JSON 
//      ТипКонтактнойИнформации - ПеречислениеСсылка.ТипыКонтактнойИнформации
//
// Возвращаемое значение:
//      Строка - контактная информация в виде JSON.
//
Функция КонтактнаяИнформацияПоПредставлению(Значение, ТипКонтактнойИнформации) Экспорт
	
	// ToDo: Убрать в Универсальном расширении 
	// в ВО для типовых модулей нужно перечисление... 
	Если ТипЗнч(ТипКонтактнойИнформации) = Тип("Строка") Тогда
		Тип = ПредопределенноеЗначение("Перечисление." + ТипыКонтактнойИнформации() + "." + ТипКонтактнойИнформации);
	Иначе
		Тип = ТипКонтактнойИнформации;
	КонецЕсли;	
	
	МодульУправлениеКонтактнойИнформацией = МодульКода("УправлениеКонтактнойИнформацией");
	Если МодульУправлениеКонтактнойИнформацией <> Неопределено Тогда
	    Попытка
			Результат = МодульУправлениеКонтактнойИнформацией
				.КонтактнаяИнформацияПоПредставлению(Значение, Тип);
		Исключение
			Результат = Значение;
		КонецПопытки;
	Иначе
		Результат = Значение;
	КонецЕсли;

	Возврат Результат;
КонецФункции

// Установим значения в списках выбора типов КИ в колонке таблицы формы
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - источник вызова 
//  МассивЭлементов - Массив - элементы для заполнения списка выбора 
//
Процедура УстановкаСпискаДоступныхТиповКИ(Форма, МассивЭлементов) Экспорт
	
	// Типы КИ
	СписокЗначенийКИ = Новый СписокЗначений;
	СписокЗначенийКИ.Добавить(
		ЗначениеМетаданных(ТипыКонтактнойИнформации() + ".Телефон"), "Телефон");
	СписокЗначенийКИ.Добавить(
		ЗначениеМетаданных(ТипыКонтактнойИнформации() + ".АдресЭлектроннойПочты"), "Адрес электронной почты");
			
	Для Каждого ЭлементФормы Из МассивЭлементов Цикл
		
		Форма.Элементы[ЭлементФормы].РежимВыбораИзСписка = Истина;
		
		Форма.Элементы[ЭлементФормы].СписокВыбора.Очистить();
		
		Для Каждого ЭлементСписка Из СписокЗначенийКИ Цикл  
		   Форма.Элементы[ЭлементФормы].СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	   КонецЦикла;		
	КонецЦикла;
	   
КонецПроцедуры

// Возвращает структуру параметров вида контактной информации для определенного типа.
// 
// Параметры:
//    ТипИлиВидКонтактнойИнформации - ПеречислениеСсылка.ТипыКонтактнойИнформации
//                                  - Строка - тип контактной информации,
//                                  - СправочникСсылка.ВидыКонтактнойИнформации- вид контактной информации для
//                                  заполнения свойства НастройкиПроверки.
//
// Возвращаемое значение:
//  Структура:
//   * Имя          - Строка - уникальное имя вида контактной информации.
//   * Наименование - Строка - наименование вида контактной информации.
//   * Вид - СправочникСсылка.ВидыКонтактнойИнформации
//         - Строка - ссылка на вид контактной информации или
//                    идентификатор предопределенного элемента.
//   * Группа - СправочникСсылка.ВидыКонтактнойИнформации - ссылка на группу(родителя) элемента справочника.
//   * Тип - ПеречислениеСсылка.ТипыКонтактнойИнформации - тип контактной информации или его идентификатор.
//   * Порядок - Число
//             - Неопределено - порядок вида контактной информации, положение в списке относительно других элементов.
//                              Неопределено - не переназначать;
//                              0            - назначить автоматически;
//                              Число > 0    - назначить указанный порядок.
//                              Примечание. При использовании параметра Порядок следует внимательно следить
//                              за уникальностью назначаемого значения. Если после выполнения обновления
//                              значения порядка окажутся неуникальными в пределах группы, то настройка
//                              порядка пользователем будет невозможна. В общем случае рекомендуется не
//                              использовать этот параметр (порядок не изменится), либо заполнять его
//                              значением 0 (порядок будет назначен автоматически в подсистеме "Настройка
//                              порядка элементов" при выполнении процедуры). Для размещения видов КИ в
//                              определенной последовательности относительно друг друга без явного
//                              размещения в начале списка достаточно вызывать данную процедуру в нужной
//                              последовательности для каждого вида КИ с указанием порядка 0. Если
//                              добавляется предопределенный вид КИ к уже существующим в ИБ, не
//                              рекомендуется назначать порядок в явном виде.
//     * МожноИзменятьСпособРедактирования - Булево -признак возможности изменения свойств вида контактной
//                                                    информации пользователем.
//                                                    Если Ложь, то в форме вида контактной информации свойства доступны
//                                                    только для просмотра. Значение по умолчанию - Ложь.
//     * ВидРедактирования - Строка - вид редактирования.
//     * ВидРедактирования - Строка - определят вид редактирования значения. Варианты: "ПолеВводаИДиалог", "ПолеВвода", "Диалог".
//                                    Если "Диалог", то форме выводится гиперссылка с представлением контактной
//                                    информации, по нажатию на которую, открывается форма соответствующего типа КИ.
//                                    Свойство применимо только для контактной информации с типом: Адрес, Телефон, Факс.
//                                    Если "ПолеВвода", то на форме выводится поле ввода.
//                                    Если "ПолеВводаИДиалог", то доступен ввод в поле и в форме соответствующего типа КИ.
//     * ХранитьИсториюИзменений     - Булево - признак возможности хранения истории контактной информации.
//                                              Хранение истории допускается, если признак ВидРедактирования = "Диалог"
//                                              равен Истина. Свойство применимо если табличная часть КонтактнаяИнформация
//                                              содержит реквизит ДействуетС. Значение по умолчанию - Ложь.
//     * ОбязательноеЗаполнение       - Булево - если Истина, то требуется обязательный ввод значения в поле 
//                                               контактной информации. Значение по умолчанию - Ложь.
//     * РазрешитьВводНесколькихЗначений - Булево       - признак возможности ввода нескольких значений для данного вида.
//                                                        Значение по умолчанию - Ложь.
//     * ЗапретитьРедактированиеПользователем - Булево - признак недоступности редактирования пользователем 
//                                                       вида контактной информации. Значение по умолчанию - Ложь.
//     * Используется - Булево - если Ложь, то вид контактной информации недоступен для использования пользователем.
//                               Такой вид не выводится в формах и списке видов контактной информации.
//                               Значение по умолчанию - Истина.
//     * МеждународныйФорматАдреса          - Булево - признак международного формата адреса. 
//                                                     Если Истина, то ввода всех адресов только в международном формате.
//                                                     Значение по умолчанию - Ложь.
//     * ВидПоляДругое                        - Строка - определяет внешний вид поля с типом Другое на форме.
//                                            Варианты: МногострочноеШирокое, ОднострочноеШирокое, ОднострочноеУзкое.
//                                            Свойство применимо только для контактной информации с типом: Другое.
//                                            Для вида КИ с типом Другое значение по умолчанию - "ОднострочноеШирокое",
//                                            иначе пустая строка.
//     * РедактированиеТолькоВДиалоге - Булево - устарело. Следует использовать ВидРедактирования.
//                                               Если Истина, то форме выводится гиперссылка с представлением контактной
//                                               информации по нажатию на которую, открывается форма соответствующего
//                                               типа КИ. Свойство применимо только для контактной информации с типом -
//                                               Адрес, Телефон, Факс, ВебСтраница. Значение по умолчанию - Ложь.
//     * НастройкиПроверки  - Неопределено - для типов Другое, ВебСтраница, Skype.
//                          - Структура - настройки проверки вида контактной информации: 
//       ** ТолькоНациональныйАдрес - Булево - для типа Адрес. Если Истина, то разрешается ввод только национальных адресов.
//                                               Изменение страны у адреса не допускается.
//       ** ПроверятьКорректность - Булево - для типа Адрес. Если Истина, то для национальных адресов доступен ввод
//                                           только адресов с разбивкой по полям проходящих проверку по адресному классификатору.
//                                           Допускается ввод адресов других стран в свободной форме,
//                                           если свойство ТолькоНациональныйАдрес = Ложь.
//                                           Значение по умолчанию - Ложь.
//       ** ВключатьСтрануВПредставление - Булево - для типа Адрес. если Истина, то Наименование страны всегда
//                                                  добавляется в представление адреса, даже когда другие поля адреса пустые.
//                                                  Значение по умолчанию - Ложь.
//       ** УказыватьОКТМО - Булево - для типа Адрес. признак возможности ручного ввода кода ОКМТО в форме ввода адреса.
//       ** ПроверятьКорректность - Булево - для типа АдресЭлектроннойПочты. Если Истина, то запрещается пользователю ввод 
//                                          некорректный адрес электронной почты. Значение по умолчанию - Ложь.
//       ** ТелефонСДобавочнымНомером - Булево - для типа Телефон и Факс. Если Истина, то в форме ввода телефона
//                                               доступен ввод добавочного номера. Значение по умолчанию - Истина.
//
Функция ПараметрыВидаКонтактнойИнформацииСовместимость(ТипИлиВидКонтактнойИнформации = Неопределено) Экспорт
	
	ПараметрыВида = Новый Структура;
	ПараметрыВида.Вставить("Имя",          "");
	ПараметрыВида.Вставить("Группа",       Неопределено);
	ПараметрыВида.Вставить("Наименование", "");
	ПараметрыВида.Вставить("Используется", Истина);
	ПараметрыВида.Вставить("Тип",          ТипИлиВидКонтактнойИнформации);
	ПараметрыВида.Вставить("Вид",          "");
	
	Возврат ПараметрыВида;
	
КонецФункции

#КонецОбласти // КонтактнаяИнформация

#Область ОбщиеСбис

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ИнтерфейсРегистраСостояний
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ИнтерфейсРегистраСостояний

// Возвращает число - код состояния ДО.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - Ссылка на документ основной конфигурации или документа расширения
//  ТипДокумента - Строка - тип документа расширения
//
// Возвращаемое значение:
//   Число - Код состояния документа расширения, если нет, то 0
//
Функция КодСостоянияДокументаРасширения(СсылкаНаДокумент, ТипДокумента = Неопределено) Экспорт
	ДанныеСостояния = ДанныеСостоянияОбъекта(СсылкаНаДокумент, ТипДокумента, Ложь);
	Если ДанныеСостояния = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	КодСостоянияДокументРасширение = 0;
	
	КодСостоянияДокументРасширение = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(ДанныеСостояния, "Состояние.ИдентификаторСБИС");
	Если ТипЗнч(КодСостоянияДокументРасширение) <> Тип("Число") Тогда
		КодСостоянияДокументРасширение = 0;
	КонецЕсли;
	
	Возврат КодСостоянияДокументРасширение;
КонецФункции

// Получение из регистра состояний активного этапа
//
// Параметры:
// 	СсылкаНаДокумент - ДокументСсылка - ссылка на документ для поиска
//
// Возвращаемое значение:
//  Строка - активный этап строкой
//
Функция АктивныйЭтапСтрокой(Знач СсылкаНаДокумент) Экспорт
	
	РезультатФункции = "";
	
	ДанныеСостояния = ДанныеСостоянияОбъекта(СсылкаНаДокумент);
	Если ДанныеСостояния <> Неопределено Тогда
		РезультатФункции = ДанныеСостояния.АктивныйЭтап;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Очищает отметки и связанные с ними таблицы документа.
//
// Параметры:
//  ОбъектДок - ДокументОбъект.Saby_ТранспортнаяНакладная - объект документа для зачистки отметок.
//  Титул - ПеречислениеСсылка.Saby_ТипТитулаЭтрН - тип титула для зачистки отметок.
//  ЗначениеРоли - ПеречислениеСсылка.Saby_РолиКонтрагентов - роль контрагента для зачистки отметок.
//
Процедура ЗачисткаОтметокШтрафовАктов(ОбъектДок, Титул, ЗначениеРоли) Экспорт
	
	Если ТипЗнч(ОбъектДок) <> Тип("Структура")
		И МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ОбъектДок, "Ссылка")
		И Не ЗначениеЗаполнено(ОбъектДок.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	КлючиОтметокДляУдаления = Новый Соответствие;
	
	ИндексСтроки = 0;
	Пока ИндексСтроки < ОбъектДок.Отметки.Количество() Цикл
		СтрокаОтметки = ОбъектДок.Отметки[ИндексСтроки];
		
		Если СтрокаОтметки.Этап = Титул И СтрокаОтметки.Роль = ЗначениеРоли Тогда
			КлючиОтметокДляУдаления.Вставить(СтрокаОтметки.КлючСтроки, Истина);
			ОбъектДок.Отметки.Удалить(ИндексСтроки);
		Иначе
			ИндексСтроки = ИндексСтроки + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗачиститьШтрафы(ОбъектДок, КлючиОтметокДляУдаления);
	
	ЗачиститьАкты(ОбъектДок, КлючиОтметокДляУдаления);
	
КонецПроцедуры

#Область ДатаВремя

// Преобразовывает дату, полученную с онлайна, в тип дата.
//
// Параметры:
//  ДатаВходящая - Строка - дата в виде строки, полученная с онлайна.
//
// Возвращаемое значение:
//   Дата - значение даты
//
Функция ПреобразоватьСтрокуВДатуЭПД(ДатаВходящая) Экспорт
	
	Если ТипЗнч(ДатаВходящая) = Тип("Дата") Тогда
		Возврат ДатаВходящая;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаВходящая) Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
	// ранее 24.01.2023 12.00.00
	// 15.03.2022T00:00:00+01:00
	// 15.03.2022T00:00:00-01:00
	// 2023-02-02 07:33:30
	// 2023-02-02
	// 2023.01.03
	ФорматБезСмещения = Ложь;
		
	ЕстьВремя = (Найти(ДатаВходящая, "T") > 0);
	
	ЧислоДвоеточийВДате = 2;
	
	// часть дат может приходить в старом формате
	Если Не ЕстьВремя Тогда
		
		ЧислоТочекВДате = 4;
		
		Если СтрЧислоВхождений(ДатаВходящая, ".") = ЧислоТочекВДате
			Или СтрЧислоВхождений(ДатаВходящая, ":") = ЧислоДвоеточийВДате Тогда
			ЕстьВремя = Истина;
			ФорматБезСмещения = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Если ЕстьВремя Тогда
		
		Если ФорматБезСмещения Тогда 
			Разделитель = " ";
		Иначе 
			Разделитель = "T";			
		КонецЕсли;
		
		МассивЧастейДаты = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(ДатаВходящая, Разделитель);
		ЧастьДата  = МассивЧастейДаты[0];
		ЧастьВремя = МассивЧастейДаты[1];
		
	Иначе
		
		ЧастьДата = ДатаБезВремениВСтандартномФормате(ДатаВходящая);		
		
	КонецЕсли;
				
	МассивДат = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(ЧастьДата, ".", Ложь);
	
	МассивИтог = Новый Массив;
	МассивИтог.Добавить(МассивДат[2]); 
	МассивИтог.Добавить(МассивДат[1]);
	МассивИтог.Добавить(МассивДат[0]); 		
	
	СмещениеВСекундах = Неопределено;
	
	ДобавитьВремяВМассивДаты(МассивИтог, ЧастьВремя, ЕстьВремя, ФорматБезСмещения, СмещениеВСекундах);
	
	ДатаСтрокой = МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(МассивИтог, "");
	
	Возврат ?(ЗначениеЗаполнено(СмещениеВСекундах), Дата(ДатаСтрокой) - СмещениеВСекундах, Дата(ДатаСтрокой)); 
	
КонецФункции	

// Преобразовывает дату, полученную с онлайна, в тип дата.
//
// Параметры:
//  ВремяВходящее - Строка - дата в виде строки, полученная с онлайна.
//
// Возвращаемое значение:
//   Время - значение времени
//
Функция ПреобразоватьСтрокуВоВремя(ВремяВходящее) Экспорт
	
	Если ТипЗнч(ВремяВходящее) = Тип("Дата") Тогда
		Возврат ВремяВходящее;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВремяВходящее) Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
	// 00:00:00+01:00
	// 00:00:00-01:00
	// может быть +/-
	Если Найти(ВремяВходящее, "+") > 0 Тогда
		РазделительСмещение = "+";
	Иначе
		РазделительСмещение = "-";
	КонецЕсли;
	
	МассивВремени = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ВремяВходящее, РазделительСмещение);
	Время         = МассивВремени[0];
	
	ПервыйМесяц = "01";
	ПервоеЧисло = "01";
	
	МассивИтог = Новый Массив;
	МассивИтог.Добавить("0001");
	МассивИтог.Добавить(ПервыйМесяц);
	МассивИтог.Добавить(ПервоеЧисло);
		
	ДобавитьВремяВМассивДаты(МассивИтог, Время, Истина, Истина, 0);
	
	ДатаСтрокой = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(МассивИтог, "");
	
	Возврат Дата(ДатаСтрокой); 

КонецФункции
	
#КонецОбласти // ДатаВремя

// Возвращает структуру адреса в формате обмена со СБИС
// Параметры:
//  Выгрузка - Белево - признак того что адрес будет использован для выгрузки в онлайн
//
// Возвращаемое значение:
//   Структура - структура адреса в формате обмена
//
Функция ОбщийШаблонАдреса(Выгрузка = Ложь) Экспорт
	
	Структура = Новый Структура;
	
	// из-за различий формата
	Структура.Вставить("Текст",      "");
	Структура.Вставить("АдресТекст", "");	
	Структура.Вставить("GLN",        "");
	Структура.Вставить("КодГАР",     "");
	Структура.Вставить("КодСтраны",  "643");
	
	Координаты = Новый Структура;
	Координаты.Вставить("Широта",  "");
	Координаты.Вставить("Долгота", "");
	
	Структура.Вставить("Координаты", Координаты);
	
	Если Не Выгрузка Тогда 
		
		СтруктураАдрес = Новый Структура;
		
		СтруктураАдрес.Вставить("Индекс",          "");
		СтруктураАдрес.Вставить("КодРегиона",      "");
		СтруктураАдрес.Вставить("Район",           "");
		СтруктураАдрес.Вставить("Город",           "");
		СтруктураАдрес.Вставить("НаселенныйПункт", "");
		СтруктураАдрес.Вставить("Улица",           "");
		СтруктураАдрес.Вставить("Дом",             "");
		СтруктураАдрес.Вставить("Корпус",          "");
		СтруктураАдрес.Вставить("Квартира",        "");
		
		Структура.Вставить("Структура", СтруктураАдрес);
		
		Структура.Вставить("Типовой",   "");
		
	КонецЕсли;
	 
	Возврат Структура;
		
КонецФункции

// Получает ставку НДС либо в виде представления, либо в виде кода.
//
// Параметры:
//  Значение - Строка - или код с онлайна или представление ставки НДС
//  Загрузка - Булево - назначение использования функции. Истина - для загрузки, ложь - для выгрузки.
//
// Возвращаемое значение:
//   Строка - если Загрузка = Истина, то возвращает представление ставки НДС
//            если Загрузка = Ложь, то возвращает код ставки НДС, который используется на онлайне.
//
Функция ЗначениеСтавкиНДС(Значение, Загрузка = Ложь) Экспорт
	СтавкиНДС_ = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтавкиНДС_Соответствие(Загрузка);
	Ставка = СтавкиНДС_.Получить(Значение);
	
	Если Загрузка И Ставка = Неопределено Тогда
		Ставка = СтавкиНДС_.Получить("без НДС");
	КонецЕсли;
	
	Возврат Ставка;
КонецФункции

// Обновляем надпись строки ответственного
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма для обновления реквизитов
//	Реквизит - Строка - имя реквизита обновления
//	Значение - Строка - сериализорванное значение, для получения структуры
//	         - Структура - готовая структура
//
Процедура ОбновитьОтветственногоНаФорме(Форма, Реквизит, Значение) Экспорт
	
	Форма[Реквизит] = "";
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Если ТипЗнч(Значение) <> Тип("Структура") Тогда
			Структура = ДесериализоватьЗначение(Значение);
		Иначе 
			Структура = Значение;
		КонецЕсли;
			
		ФИО = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПредставлениеФИО(Структура);
		Форма[Реквизит] = ФИО;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма[Реквизит]) Тогда
		Форма[Реквизит] = "Заполнить";
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает отбор по роли в таблице ответственных лиц для визуального отображения необходимых ответственных
//
// Параметры:
//  ТаблицаОтветственных - ТаблицаФормы - таблица формы для установки отбора по роли
//  Роль - Строка,Перечисление.Saby_РолиОтветственных - роль, по которой необходимо установить отбор
//
Процедура УстановитьОтборТаблицыОтветственных(ТаблицаОтветственных, Роль) Экспорт
	
	Если ТипЗнч(Роль) = Тип("Строка") Тогда
		РольСсылка = ЗначениеМетаданных("ESD_РолиОтветственных." + Роль);
	Иначе
		РольСсылка = Роль;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Роль", РольСсылка);
	
	ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
	ТаблицаОтветственных.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

// Дозаполняет дополнительные параметры выгрузки на основании уже заполненных данных в параметрах выгрузки
//
// Параметры:
//  ПараметрыВыгрузки - Структура - см. Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыВыгрузки
//  Результат - Структура - см. Saby_ТНОбщегоНазначенияКлиентСервер.РезультатВзаимодействияСоСБИС
//
Процедура ЗаполнитьПараметрыВыгрузки(ПараметрыВыгрузки, Результат = Неопределено) Экспорт
	Если ТипЗнч(ПараметрыВыгрузки.Ссылка) = Тип("Структура") Тогда
		ПараметрыВыгрузки.ИмяМетаданных = ПараметрыВыгрузки.Ссылка.ИмяМетаданных;
	Иначе
		Если Не ЗначениеЗаполнено(ПараметрыВыгрузки.ИмяМетаданных) Тогда
			ПараметрыВыгрузки.ИмяМетаданных = ПараметрыВыгрузки.Ссылка.Метаданные().Имя;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПараметрыВыгрузкиИзСостоянияОбъекта(ПараметрыВыгрузки);
	
	Если Не ЗначениеЗаполнено(ПараметрыВыгрузки.ТипТитула) Тогда
		ТипТитула = РезультатФункцииТитулов(ПараметрыВыгрузки.ИмяМетаданных, "ЗначениеПоПредставлению", ПараметрыВыгрузки.Этап);
		Если Не ЗначениеЗаполнено(ТипТитула) Тогда
			ТипТитула = РезультатФункцииТитулов(ПараметрыВыгрузки.ИмяМетаданных, "ПервыйТитул");
		КонецЕсли;
		ПараметрыВыгрузки.ТипТитула = ТипТитула;
	КонецЕсли;
	
	ПредставленияТитула = РезультатФункцииТитулов(ПараметрыВыгрузки.ИмяМетаданных, "ПредставленияТитула", ПараметрыВыгрузки.ТипТитула);
	ПараметрыВыгрузки.Этап              = ПредставленияТитула.Представление;
	ПараметрыВыгрузки.КодТитула         = ПредставленияТитула.КодТитула;
	
	ЗаполнитьДокументРасширения(ПараметрыВыгрузки, Результат);
	
	Если ТипЗнч(ПараметрыВыгрузки.Ссылка) = Тип("Структура") Тогда
		ЭтапДТ = ПараметрыВыгрузки.Этап;
	Иначе
		ЭтапДТ = ПараметрыВыгрузки.ТипТитула;
	КонецЕсли;
	
	ПараметрыВыгрузки.ДинамическийТитул = РезультатФункцииТитулов(
		ПараметрыВыгрузки.ИмяМетаданных, "ЭтоДинамическийТитул", ЭтапДТ);
		
	ПараметрыВыгрузки.ПараметрыДляАПИ = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыДокументаДляАПИ(
		ПараметрыВыгрузки.ИмяМетаданных);
	
КонецПроцедуры

// Заполнение свойств структуры параметров выгрузки на основании данных РС "ESD_СостоянияОбъектовИнтеграции"
//
// Параметры:
//	ПараметрыВыгрузки - Структура - параметры выгрузки документа
//
Процедура ЗаполнитьПараметрыВыгрузкиИзСостоянияОбъекта(ПараметрыВыгрузки) Экспорт
	ДанныеСостояния = ДанныеСостоянияОбъекта(ПараметрыВыгрузки.Ссылка);
	Если ДанныеСостояния <> Неопределено Тогда
		Если МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ДанныеСостояния, "UID") Тогда 
			ПараметрыВыгрузки.ИдентификаторСБИС = ДанныеСостояния.UID;
		Иначе 
			ПараметрыВыгрузки.ИдентификаторСБИС = ДанныеСостояния.ИД;
		КонецЕсли;	
			
		Если Не ЗначениеЗаполнено(ПараметрыВыгрузки.Этап) Тогда
			ПараметрыВыгрузки.Этап = ДанныеСостояния.АктивныйЭтап;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Создает новый документ ЭПД 
//
// Параметры:
//  ПараметрыВыгрузки - Структура - см. функцию ESD_ТНОбщегоНазначенияКлиентСервер.ПараметрыВыгрузки()
//  Результат - Структура - см. Saby_ТНОбщегоНазначенияКлиентСервер.РезультатВзаимодействияСоСБИС
//
Процедура ЗаполнитьДокументРасширения(ПараметрыВыгрузки, Результат = Неопределено) Экспорт
	Если ПараметрыВыгрузки.ВыгрузкаНаКлиенте Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыгрузки.ТипИсточника           = ПараметрыВыгрузки.Ссылка.Метаданные().ПолноеИмя();
	ПараметрыВыгрузки.ИдентификаторИсточника = Строка(ПараметрыВыгрузки.Ссылка.УникальныйИдентификатор());
	
	Если ПараметрыВыгрузки.Ссылка.Метаданные().Имя = ПараметрыВыгрузки.ИмяМетаданных Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектДокумента = ОбъектДокумента(ПараметрыВыгрузки);
	СсылкаНаДокументЭПД = НовыйЗаполненныйДокументЭПД(ПараметрыВыгрузки, ОбъектДокумента, Результат);
	ПараметрыВыгрузки.Ссылка = СсылкаНаДокументЭПД;
	
	// Заполняем "состояние объекта" только в том случае, если ранее он не был выгружен => отсуствует "ИдентификаторСБИС"
	Если ПустаяСтрока(ПараметрыВыгрузки.ИдентификаторСБИС) Тогда
		ПараметрыСостояния = ПараметрыЗаписиРегистраСостояний();
		ПараметрыСостояния.ТипИсточника           = ПараметрыВыгрузки.ТипИсточника;
		ПараметрыСостояния.ИдентификаторИсточника = ПараметрыВыгрузки.ИдентификаторИсточника;
		ПараметрыСостояния.Ссылка                 = СсылкаНаДокументЭПД;
		ПараметрыСостояния.ИД                     = "";
		ПараметрыСостояния.АктивныйЭтап           = ПараметрыВыгрузки.Этап;
		ПараметрыСостояния.СбисИД                 = "";
		ОбновитьДанныеСостояния(ПараметрыСостояния);	
	КонецЕсли;
КонецПроцедуры

// Сброс статуса "не просмотрен" у документа
// Параметры:
//  СписокДокументов - Массив - документы для обработки
//
Процедура СбросСтатусаНеПросмотрено(Знач СписокДокументов) Экспорт
	
	Для Каждого Документ Из СписокДокументов Цикл
		УбратьПризнакНеПросмотрен(Документ);		
	КонецЦикла;
	
	МодульКода("РегистрыСведений.ESD_ДанныеТитулов").Просмотреть(СписокДокументов);
	
КонецПроцедуры

// Возвращает дату последней успешной загрузки.
//
// Параметры:
//  ИмяМетаданных - Строка - имя метаданных документа
//
// Возвращаемое значение:
//   Дата - дата последней успешной загрузки.
//
Функция ПоследнееУспешноЗагруженноеИзменение(ИмяМетаданных) Экспорт
	
	ДатаЗагрузки = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ESD_ТранспортнаяНакладная.ДатаИзменения) КАК ДатаИзменения
	|ИЗ
	|	Документ.ESD_ТранспортнаяНакладная КАК ESD_ТранспортнаяНакладная";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ESD_ТранспортнаяНакладная", ИмяМетаданных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ДатаИзменения) Тогда
			ДатаЗагрузки = Выборка.ДатаИзменения;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДатаЗагрузки;
	
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ЗаполнениеНаОснованииИНИ
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ЗаполнениеНаОснованииИНИ

// Возвращат структуру основания для заполнения из INI
//
// Параметры:
//  Основание - Ссылка - ссылка на основание заполнения
//  ИмяИНИ - Строка - наименование ини файла
//  РольКонтрагента - ПеречислениСсылка.Saby_РолиКонтрагентов - роль контрагента для заполнения
//
// Возвращаемое значение:
//   Структура - структура с данными основания
//
Функция СтруктураОснования(Основание, ИмяИНИ, РольКонтрагента = "") Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Основание",       Основание);
	РезультатФункции.Вставить("ini_name",        ИмяИНИ);
	РезультатФункции.Вставить("РольКонтрагента", РольКонтрагента);
	
	Возврат РезультатФункции;
	
КонецФункции

// Возвращает соответстивие данных юр лица из ИНИ
//
// Параметры:
//  ДанныеИзИНИ - Соответствие - данные загруженные из документа основания через ИНИ
//
// Возвращаемое значение:
//   Соответствие - структура данных юрлица
//
Функция ДанныеЮрЛицаИзИНИ(ДанныеИзИНИ) Экспорт
	
	РезультатФункции = Новый Соответствие;
	РезультатФункции.Вставить("Контакты",  ДанныеИзИНИ["Контакты"]);
	РезультатФункции.Вставить("Адрес",     ДанныеИзИНИ["Адрес"]);
	РезультатФункции.Вставить("Реквизиты", ДанныеИзИНИ["Реквизиты"]);
	РезультатФункции.Вставить("Название",  ДанныеИзИНИ["Название"]);
	РезультатФункции.Вставить("ИдентификаторЭДО",  ДанныеИзИНИ["ИдентификаторЭДО"]);
	
	Возврат РезультатФункции;
	
КонецФункции

// Получает актуальный статус версии расширения
//
// Возвращаемое значение:
//   Структура - данные о актуальности установленной версии расширения
//
Функция СтатусВерсииРасширения() Экспорт
	
	context_params = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПроверитьНаличиеПараметровПодключенияЭПД();
	Если Не ЗначениеЗаполнено(context_params) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// context_params.service - может быть стоит проверять только боевой сервер
	
	ОбъектОбработки = ОбъектОбработки();
	СтатусВерсии    = ОбъектОбработки.ПолучитьСтатусВерсии(Ложь);
	
	Возврат СтатусВерсии;
	
КонецФункции

// Определяет доступность титула по данным текщих этапов документа
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма для которой определяется доступность
//  ТекущиеЭтапы - ДанныеФормыКоллекция - таблица с данными о текущих этапах
//  ТипТитула - ПеречислениеСсылка.Saby_ТипТитула - тип титула документа
//  ДОЗавершен - Булево - Истина - если документооборот завершен.
//
// Возвращаемое значение:
//   Булево - этап доступен
//
Функция ТипТитулаДоступенУчастнику(Форма, ТекущиеЭтапы, ТипТитула, ДОЗавершен) Экспорт
	
	Если ТекущиеЭтапы.Количество() = 0 Тогда
		ИмяМетаданных = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИмяМетаданныхПоФорме(Форма);
		Возврат РезультатФункцииТитулов(ИмяМетаданных, "ЭтоПервыйТитул", ТипТитула) И Не ДОЗавершен;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипТитула", ТипТитула);
	Отбор.Вставить("Доступен",  Истина);
	
	НайденныеСтроки = ТекущиеЭтапы.НайтиСтроки(Отбор);
	
	Возврат НайденныеСтроки.Количество() > 0;
	
КонецФункции

#Область Роли

// Проверка наличия ролей у пользователя информационной базы
//
// Параметры:
//	Роли - Строка - перечисление ролей через ","
//	ПользовательИБ - ПользовательИнформационнойБазы - пользователь ИБ
//	УчитыватьПривилегированныйРежим - Булево - если задано Истина, тогда для текущего пользователя
//                 функция возвращает Истина, когда установлен привилегированный режим 
//
// Возвращаемое значение:
//	Булево - Истина, если хотя бы одна из указанных ролей доступна возвращает Истина
//
Функция ESD_РолиДоступны(Знач Роли, Знач ПользовательИБ = Неопределено, УчитыватьПривилегированныйРежим = Истина) Экспорт
	
	Если УчитыватьПривилегированныйРежим И ПривилегированныйРежим() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Роли = "АдминистраторСистемы,ПолныеПрава," + Роли;
    Результат = ESD_РолиДоступныБСП(Роли);
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Если ПользовательИБ = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();	
	КонецЕсли;
	
	СписокРолей = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(Роли, ",");
	
	Для Каждого ИмяРоли Из СписокРолей Цикл
		Попытка
			Если ESD_РольДоступна(ИмяРоли, ПользовательИБ, УчитыватьПривилегированныйРежим) Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Проверка наличия ролей у пользователя информационной базы
//
// Параметры:
//	ИмяРоли - Строка - имя метаданных роли
//	ПользовательИБ - ПользовательИнформационнойБазы - пользователь ИБ
//	УчитыватьПривилегированныйРежим - Булево - если задано Истина, тогда для текущего пользователя
//                 функция возвращает Истина, когда установлен привилегированный режим 
//
// Возвращаемое значение:
//	Булево - Истина, роль доступна
//
Функция ESD_РольДоступна(ИмяРоли, Знач ПользовательИБ = Неопределено, УчитыватьПривилегированныйРежим = Истина) Экспорт
	Если УчитыватьПривилегированныйРежим И ПривилегированныйРежим() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Роль = Метаданные.Роли.Найти(СокрЛП(ИмяРоли));
	Если Роль = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПользовательИБ = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	КонецЕсли;
	
	Возврат ПользовательИБ.Роли.Содержит(Роль);	
КонецФункции 

#КонецОбласти

#КонецОбласти // ОбщиеСбис

#Область ОбработкаОшибок

// Обновляет данные по ошибкам ФЛК в форме.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма на которой необходимо обновить реквизиты и элементы ошибок.
//  ДополнительныеПараметры - Структура - дополнительные параметры необходимы
//    для указания доп параметров получения ошибок ФЛК.
//  Ошибки - Структура - состав структуры см. Saby_ТранспортнаяНакладная.ДобавитьОшибкуПользователю
//
Процедура ОбновитьОшибки(Форма, ДополнительныеПараметры, Ошибки = Неопределено) Экспорт
	
	Если Ошибки = Неопределено Тогда
		
		ПараметрыВыгрузки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыВыгрузки(ДополнительныеПараметры.Ссылка);
		ЗаполнитьЗначенияСвойств(ПараметрыВыгрузки, ДополнительныеПараметры);
		ПараметрыВыгрузки.ВыгрузкаНаКлиенте = Форма.ЭтоВО;
		ЗаполнитьПараметрыВыгрузки(ПараметрыВыгрузки);
		
		Если ТипЗнч(ПараметрыВыгрузки.Ссылка) = Тип("Структура") И Не ЗначениеЗаполнено(ПараметрыВыгрузки.ДанныеДокумента) Тогда
			ПараметрыВыгрузки.ДанныеДокумента = ПараметрыВыгрузки.Ссылка;
		КонецЕсли;
		
		Результат = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").РезультатВзаимодействияСоСБИС(0);
		МодульВыгрузкаСервер = МодульКода("ESD_ТНВыгрузкаСервер");
		СтруктураДанныхДокумента = МодульВыгрузкаСервер.СформироватьСтруктуруДанныхДокумента(ПараметрыВыгрузки, Результат);
		Ошибки = МодульВыгрузкаСервер.ВыполнитьПроверкуФЛК(СтруктураДанныхДокумента, ПараметрыВыгрузки, Результат);
	КонецЕсли;
	
	Если Ошибки = Неопределено Тогда
		Форма.КоличествоОшибок = 0;
		Форма.ТаблицаОшибок.Очистить();
	Иначе
		Форма.КоличествоОшибок = Ошибки.СписокОшибок.Количество();
		
		Форма.ТаблицаОшибок.Очистить();
		Для Каждого СтруктураОшибки Из Ошибки.СписокОшибок Цикл
			СтрокаТаблицыОшибок = Форма.ТаблицаОшибок.Добавить();
			СтрокаТаблицыОшибок.Ошибка          = СтруктураОшибки.ТекстДляОднойОшибки;
			Если СтруктураОшибки.Свойство("РеквизитОбъекта") Тогда
				СтрокаТаблицыОшибок.РеквизитОбъекта = СтруктураОшибки.РеквизитОбъекта;
				СтрокаТаблицыОшибок.ЭлементФормы    = СтруктураОшибки.ЭлементФормы;
				СтрокаТаблицыОшибок.ИндексСтроки    = СтруктураОшибки.ИндексСтроки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры.Ссылка) = Тип("Структура") Тогда
		ДополнительныеПараметры.Ссылка.КоличествоОшибок = Форма.КоличествоОшибок;
		МассивТаблицыОшибок = ТаблицаЗначенийВМассивЭПД(Форма.ТаблицаОшибок.Выгрузить());
		ДополнительныеПараметры.Ссылка.ТаблицаОшибок = МассивТаблицыОшибок;
	КонецЕсли;
	
	ОбновитьВнешнийВидЭлементовОшибок(Форма);
	
КонецПроцедуры

// Обновляет реквизиты формы, связанные с отображением ошибок.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, реквизиты которой необходимо обновить.
//
Процедура ОбновитьВнешнийВидЭлементовОшибок(Форма) Экспорт
	
	ЕстьОшибки = Форма.КоличествоОшибок <> 0;
	
	Форма.Элементы.ФормаПоказатьСкрытьОшибки.Видимость = ЕстьОшибки;
	Форма.Элементы.ГруппаОшибки.Видимость              = ЕстьОшибки И Форма.Элементы.ФормаПоказатьСкрытьОшибки.Пометка;
	
	КоличествоОшибокСтрокой = Формат(Форма.КоличествоОшибок, "ЧДЦ=0; ЧГ=");
	
	Если ЕстьОшибки Тогда
		ШаблонЗаголовкаКнопкиПоказа = "Ошибки (%1)";
		Форма.Элементы.ФормаПоказатьСкрытьОшибки.Заголовок = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
			ШаблонЗаголовкаКнопкиПоказа,
			КоличествоОшибокСтрокой);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработкаОшибок

#Область ПроверкаФЛК

// Структура описания реквизитов и ошибки
// 
// Параметры:
//  РеквизитОбъекта - Строка - имя проверяемого реквизита.
//  ЭлементФормы - Строка - имя элемента формы для перехода.
//  Ошибка - Строка - описание ошибки для вывода пользователю.
// 
// Возвращаемое значение:
//   Структура - см. в функции
//
Функция СтруктураФЛК(РеквизитОбъекта, ЭлементФормы, Ошибка) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("РеквизитОбъекта", РеквизитОбъекта);
	РезультатФункции.Вставить("ЭлементФормы",    ЭлементФормы);
	РезультатФункции.Вставить("Ошибка",          Ошибка);
	
	Возврат РезультатФункции;
	
КонецФункции

// Возвращает результат выполнения форматно-логического контроля
//
// Параметры:
//  ДанныеДокумента - Структура - структура данных документа
//  ПараметрыВыгрузки - Структура - см. Saby_ТНОбщегоНазначенияКлиентСервер.ПараметрыВыгрузки
//
// Возвращаемое значение:
//   Структура,Неопределено - структура ошибок
//
Функция РезультатФЛК(ДанныеДокумента, ПараметрыВыгрузки) Экспорт
	
	РезультатФункции = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОшибок(ПараметрыВыгрузки.ИмяМетаданных);
	
	Если Не ПараметрыВыгрузки.ВыполнитьФЛК Или ДанныеДокумента = Неопределено Или ПараметрыВыгрузки.ЭтоВыгрузкаЧерновика Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ДокументМенеджер = МодульКода("Документы." + ПараметрыВыгрузки.ИмяМетаданных);
	
	ПараметрыПроверкиРеквизитов = ДокументМенеджер.ПараметрыПроверкиРеквизитов(ДанныеДокумента, ПараметрыВыгрузки);
	ПараметрыПроверкиРеквизитов.Вставить("ДокументМенеджер", ДокументМенеджер);
	
	ПроверитьЗаполненНеЗаполнен(ДанныеДокумента, ПараметрыПроверкиРеквизитов, РезультатФункции);
	
	ДокументМенеджер.ВыполнитьДополнительныеПроверкиФЛК(ДанныеДокумента, ПараметрыВыгрузки, РезультатФункции);
	
	Возврат РезультатФункции;
	
КонецФункции

// Добавляет новую ошибку в структуру ошибок
//
// Параметры:
//  Ошибки - Структура - структура для добаления ошибки см. ESD_ТНОбщегоНазначенияКлиентСервер.СтруктураОшибок()
//  ПолеОшибки - Строка - полное наименование поля реквизита на форме
//  ТекстДляОднойОшибки - Строка - описание ошибки
//  РеквизитОбъекта - Строка - наименование реквизита объект
//  ЭлементФормы - Строка - наименование реквизита формы для его выделения
//  ИндексСтроки - Число - индекс строки таблицы, в которой найдена ошибка.
//
// Возвращаемое значение:
//   Структура - структура ошибок
//
Функция ДобавитьОшибкуПользователю(Ошибки, ПолеОшибки, ТекстДляОднойОшибки, РеквизитОбъекта = "",
		ЭлементФормы = "", ИндексСтроки = 0) Экспорт
		
	Ошибка = Новый Структура;
	Ошибка.Вставить("ПолеОшибки",          ПолеОшибки);
	Ошибка.Вставить("ТекстДляОднойОшибки", ТекстДляОднойОшибки);
	Ошибка.Вставить("РеквизитОбъекта",     РеквизитОбъекта);
	Ошибка.Вставить("ЭлементФормы",        ЭлементФормы);
	Ошибка.Вставить("ИндексСтроки",        ИндексСтроки);
	
	Ошибки.СписокОшибок.Добавить(Ошибка);
	
	Возврат Ошибки;
	
КонецФункции

// Проверяет заполнение реквизита автомобиля
//
// Параметры:
//  ДанныеДокумента - Структура - структура данных документа
//  Ошибки - Массив - массив для накопления ошибок
//  СтруктураДанныхОшибки - Структура - соответствие реквизитов формы и объекта.
//
Процедура ПроверитьЗаполнениеТранспортногоСредства(ДанныеДокумента, Ошибки, СтруктураДанныхОшибки) Экспорт
	
	ОтборАвтомобилей = Новый Структура;
	ОтборАвтомобилей.Вставить("Вид", ЗначениеМетаданных("ESD_ВидыТС.Автомобиль"));
	
	НайденныеСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(
		ДанныеДокумента.ТранспортныеСредства, ОтборАвтомобилей);
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		ДобавитьОшибкуПользователю(
			Ошибки,
			"ТранспортноеСредствоСтрокой",
			СтруктураДанныхОшибки.Ошибка,
			СтруктураДанныхОшибки.РеквизитОбъекта,
			"ТранспортноеСредствоСтрокой");
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет заполнение документов подтверждающих владение транспортным средством
//
// Параметры:
//  ДанныеДокумента - Структура - структура данных документа
//  Ошибки - Массив - массив для накопления ошибок
//  СоответствиеРеквизитовОшибок - Соответствие - соответствие реквизитов формы и объекта.
//
Процедура ПроверитьЗаполнениеТипаВладения(ДанныеДокумента, Ошибки, СоответствиеРеквизитовОшибок) Экспорт
	
	Для Каждого СтрокаТС Из ДанныеДокумента.ТранспортныеСредства Цикл
		
		Если Не МодульКода("Перечисления.ESD_ТипыВладенияТС").ТребуетПодтвержденияВладения(СтрокаТС.ТипВладения) Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибки = Ложь;
		
		Если Не ЗначениеЗаполнено(СтрокаТС.ОснованияВладения) Тогда
			ЕстьОшибки = Истина;			
		КонецЕсли;
		
		Если Не ЕстьОшибки Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьОшибкуТипаВладения(СтрокаТС, Ошибки, СоответствиеРеквизитовОшибок);
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет наличие контактных данных по указанным параметрам
//
// Параметры:
//  ДанныеДокумента - Структура - структура данных документа
//  Роль - Строка - роль контрагента строкой
//  Тип - Строка - тип контактной информации строкой
//  Ошибки - Массив - массив ошибок
//  СтруктураДанныхОшибки - Структура - соответствие реквизитов формы и объекта.
//
Процедура ПроверитьКонтактныеДанные(ДанныеДокумента, Роль, Тип, Ошибки, СтруктураДанныхОшибки) Экспорт
	
	Если Не ЗначениеЗаполнено(Роль) Тогда
		РольСсылка = ЗначениеМетаданных("ESD_РолиКонтрагентов.ПустаяСсылка");
	Иначе
		РольСсылка = ЗначениеМетаданных("ESD_РолиКонтрагентов." + Роль);
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Роль", РольСсылка);
	Отбор.Вставить("Тип",  ЗначениеМетаданных(ТипыКонтактнойИнформации() + "." + Тип));
	
	ИмяРеквизита = Роль + "_" + Тип;
	
	НайденныеСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(
		ДанныеДокумента.КонтактныеДанные, Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МодульКода("ESD_ТНОбщегоНазначенияСервер").ДобавитьОшибкуПользователю(
			Ошибки, 
			ИмяРеквизита, 
			СтруктураДанныхОшибки.Ошибка,
			СтруктураДанныхОшибки.РеквизитОбъекта,
			СтруктураДанныхОшибки.ЭлементФормы);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак необходимости проверки реквизитов водителя
//
// Параметры:
//  СтрокаТЧ - СтрокаТаблицыЗначений - строка таблицы, в которой проверяются реквизиты
//  ИмяРеквизита - Строка - имя текущего проверяемого реквизита
//
// Возвращаемое значение:
//   Булево - Истина, если реквизит необходимо проверять
//
Функция ПроверятьРеквизитВодителя(СтрокаТЧ, ИмяРеквизита) Экспорт
	
	Если ИмяРеквизита = "Серия" Или ИмяРеквизита = "Номер" Или ИмяРеквизита = "ДатаВыдачи" Тогда
		Возврат Не ЗначениеЗаполнено(СтрокаТЧ.ИНН);
	ИначеЕсли ИмяРеквизита = "ИНН" Тогда
		Возврат Не ЗначениеЗаполнено(СтрокаТЧ.Серия)
			Или Не ЗначениеЗаполнено(СтрокаТЧ.Номер)
			Или Не ЗначениеЗаполнено(СтрокаТЧ.ДатаВыдачи);
	Иначе
		Возврат ИмяРеквизита = "Фамилия" Или ИмяРеквизита = "Имя" Или ИмяРеквизита = "Телефоны";
	КонецЕсли;
	
КонецФункции

// Проверяет стороны документов ЭПД на соответствие формату
//
// Параметры:
//  ДанныеДокумента - Структура - структура данных документа для проверки
//  Ошибки - Массив - массив найденных ошибок
//
Процедура ПроверитьЗаполнениеСторонДокументовЭПД(ДанныеДокумента, Ошибки) Экспорт
	
	Для Каждого СтрокаДокументаЭПД Из ДанныеДокумента.ДокументыЭПД Цикл
		
		СтороныЗаполнены = СтрокаДокументаЭПД.ДанныеЮрЛиц.Количество() > 0;
		
		РеквизитыСтороныЗаполнены = Истина;
		Для Каждого СтрокаСтороны Из СтрокаДокументаЭПД.ДанныеЮрЛиц Цикл
			РеквизитыСтороныЗаполнены = РеквизитыСтороныЗаполнены И ЗначениеЗаполнено(СтрокаСтороны.ИНН);
		КонецЦикла;
		
		ПроверитьСОХ(СтрокаДокументаЭПД, ДанныеДокумента, Ошибки);
		
		Если СтороныЗаполнены И РеквизитыСтороныЗаполнены Тогда
			Продолжить;
		КонецЕсли;
		
		Ошибка = "";
		Если Не СтороныЗаполнены Тогда
			Ошибка = "Не заполнены стороны документа.";
		КонецЕсли;
		Если Не РеквизитыСтороныЗаполнены Тогда
			Ошибка = "Не заполнены обязательные реквизиты сторон документа";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДокументаЭПД.ИмяТаблицы) Тогда
			СтрокаДанных = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
				"Объект.%1[%2]", СтрокаДокументаЭПД.ИмяТаблицы, СтрокаДокументаЭПД.НомерСтроки);
			
			ДобавитьОшибкуПользователю(
				Ошибки,
				СтрокаДанных,
				Ошибка,
				СтрокаДокументаЭПД.РеквизитОбъекта,
				СтрокаДокументаЭПД.ЭлементФормы,
				СтрокаДокументаЭПД.НомерСтроки - 1);
		Иначе
			ДобавитьОшибкуПользователю(
				Ошибки,
				СтрокаДокументаЭПД.ЭлементФормы,
				Ошибка,
				СтрокаДокументаЭПД.РеквизитОбъекта,
				СтрокаДокументаЭПД.ЭлементФормы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Устраняет ошибки склонения в описании ошибки
//
// Параметры:
//  ФЛК - Структура - см. СтруктураФЛК()
//
Процедура ИсправитьТекстОшибкиФЛК(ФЛК) Экспорт
	
	СоответствиеИзменений = Новый Соответствие;
	СоответствиеИзменений.Вставить("Фамилия", " заполнена ");
	СоответствиеИзменений.Вставить("Имя",     " заполнено ");
	
	ТекстЗаполнен = СоответствиеИзменений[ФЛК.РеквизитОбъекта];
	Если ТекстЗаполнен <> Неопределено Тогда
		ФЛК.Ошибка = СтрЗаменить(ФЛК.Ошибка, " заполнен ", ТекстЗаполнен);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПроверкаФЛК

#Область ЛентаИнтерфейс

// Перерисовывает визуализацию ленты сверху документа
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для отрисовки ленты
//  ОбновитьДанные - Булево - признак необходимости перечитать данные из регистра ДанныеТитулов
//
Процедура ОбновитьЛенту(Форма, ОбновитьДанные = Истина) Экспорт
	
	Если ОбновитьДанные Тогда
		ОбновитьДанныеЛенты(Форма);
	КонецЕсли;
	
	ОчиститьЛенту(Форма);
	
	ДобавитьКнопку(Форма, "ЛентаВлево");
	
	ВыведеноТитулов = 0;
	Для Каждого СтрокаЛенты Из Форма.Лента Цикл
		
		Если ВыведеноТитулов = РазмерЛентыВТитулах() Тогда
			Прервать;
		КонецЕсли;
		
		Если Не СтрокаЛенты.Видимость Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыведеноТитулов = 0 И Форма.Лента[0] <> СтрокаЛенты Тогда
			ДобавитьДекорациюЛинию(Форма, СтрокаЛенты, 2, "НачальнаяЛиния");
		Иначе
			Если ВыведеноТитулов > 0 Тогда
				ДобавитьДекорациюЛинию(Форма, СтрокаЛенты);
			КонецЕсли;
		КонецЕсли;
		ДобавитьДекорациюТитул(Форма, СтрокаЛенты);
		ВыведеноТитулов = ВыведеноТитулов + 1;
		
	КонецЦикла;
	
	Если Форма.Лента.Количество() > 0 И Не Форма.Лента[Форма.Лента.Количество() - 1].Видимость Тогда
		ДобавитьДекорациюЛинию(Форма, СтрокаЛенты, 2, "КонечнаяЛиния");
	КонецЕсли;
	
	ДобавитьКнопку(Форма, "ЛентаВправо");
	
	ДобавитьПодсказку(Форма);
	
КонецПроцедуры

// Сдвигает отображаемые титулы, когда их больше чем РазмерЛентыВТитулах()
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма с лентой
//  Вправо - Булево - признак направления сдвига
//
Процедура СдвинутьЛенту(Форма, Вправо = Истина) Экспорт
	
	Если Вправо Тогда
		СдвинутьЛентуВправо(Форма.Лента);
	Иначе
		СдвинутьЛентуВлево(Форма.Лента);
	КонецЕсли;
	
	ОбновитьЛенту(Форма, Ложь);
	
КонецПроцедуры

#КонецОбласти // ЛентаИнтерфейс

// Ограничение документов оснований в зависимости от типа заполняемого документа
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма на которой необходимо ограничение
//
Процедура ОграничитьТипыДокументовОснований(Форма) Экспорт
	
	ИмяДокумента = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИмяМетаданныхПоФорме(Форма);
	
	МодульСправочникаСопоставлений = МодульКода("Справочники.ESD_НастройкиСопоставлений");
	Если МодульСправочникаСопоставлений <> Неопределено И Не Форма.ЭтоВО Тогда
		Сопоставления = МодульСправочникаСопоставлений.Сопоставления("Документ." + ИмяДокумента);
		МассивТипов = Новый Массив;
		Для Каждого Сопоставление Из Сопоставления Цикл
			
			ИмяТипа = Сопоставление.Источник;
			ИмяТипа = СтрЗаменить(ИмяТипа, "Документ.", "ДокументСсылка.");
			ИмяТипа = СтрЗаменить(ИмяТипа, "Справочник.", "СправочникСсылка.");
			
			Попытка
				// тип может быть не известен. если криво загрузились
				МассивТипов.Добавить(Тип(ИмяТипа));
			Исключение
				Продолжить;
			КонецПопытки;
							
		КонецЦикла;
	Иначе
		МассивТипов = МодульКода("Документы." + ИмяДокумента).ТипыДляЗаполненияНаОсновании();
	КонецЕсли;
	
	// для форм документов дозаполняем основание
	Если Форма.Элементы.Найти("Список") = Неопределено Тогда
		
		ТипДокументаОснования = ТипЗнч(Форма.ДокументОснование);
		
		Если ЗначениеЗаполнено(Форма.ДокументОснование) И МассивТипов.Найти(ТипДокументаОснования) = Неопределено Тогда
			МассивТипов.Добавить(ТипДокументаОснования);
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.ТипыОснований.ЗагрузитьЗначения(МассивТипов);
	
КонецПроцедуры

// Формируем строковое представление автомобилей документа
// Параметры:
// 	ОбъектДок - ДокуметОбъект - источник таблицы с транспортными средствами     
// Возвращаемое значение:
//  Строка - представление транспортного средства
//
Функция ТранспортныеСредстваСтрокой(ОбъектДок) Экспорт
		
    СтрокиАвто = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрокиТС(
		ОбъектДок.ТранспортныеСредства,
		ЗначениеМетаданных("ESD_ВидыТС.Автомобиль"));
	
	МассивНаименований = Новый Массив;
	Для Каждого СтрокаАвто Из СтрокиАвто Цикл
		МассивНаименований.Добавить(СтрокаАвто.РегистрационныйНомер);
	КонецЦикла;
	
	АвтоСтрокой = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(МассивНаименований, ", ");
	
	Возврат АвтоСтрокой;
	
КонецФункции

#Область ДатаВремяНаФорме

// Дополнение массива реквизитов объекта и его составных частей на форме
// реквизитов формы, отдельно хранящее время и дату
// Параметры:
//  Массив - Массив - исходный массив для дополнения новыми записями 
//  РевизитОбъекта - Строка - ревизит объекта  
//	РеквизитДата - Строка - реквизит формы с датой
//	РеквизитВремя - Строка - реквизит формы с временем
//
Процедура ДобавитьРеквизитВМассивДатаВремя(Массив, РевизитОбъекта, РеквизитДата = "", РеквизитВремя = "") Экспорт
	
	Если Не ЗначениеЗаполнено(РеквизитДата) Тогда
		РеквизитДата = СтрЗаменить(РевизитОбъекта, "ДатаВремя", "Дата");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитВремя) Тогда 
		РеквизитВремя = СтрЗаменить(РевизитОбъекта, "ДатаВремя", "Время");
	КонецЕсли;
		
	Структура = Новый Структура;
	Структура.Вставить("РеквизитОбъекта", РевизитОбъекта);
	Структура.Вставить("РеквизитДата",    РеквизитДата);
	Структура.Вставить("РеквизитВремя",   РеквизитВремя);
	
	Массив.Добавить(Структура);
	
КонецПроцедуры

// Разбор реквизита объекта на составные части в реквизиты формы (дата и время отдельно)
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма источник вызова  
//	МассивРеквизитов - Массив - реквизиты объекта и формы для разбора
//
Процедура РазложитьДатуВремяПоРеквизитам(Форма, МассивРеквизитов) Экспорт
	
	Объект = Форма.Объект;
	
	Для Каждого ЭлементМассива Из МассивРеквизитов Цикл
		
		РеквизитОбъекта = Объект[ЭлементМассива.РеквизитОбъекта];
		
		Форма[ЭлементМассива.РеквизитДата]  = РеквизитОбъекта;
		Форма[ЭлементМассива.РеквизитВремя] = РеквизитОбъекта;
		
	КонецЦикла;
	
КонецПроцедуры

// Сборка даты реквизита объекта из составных частей в реквизитов формы (дата и время отдельно)
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма источник вызова  
//	МассивРеквизитов - Массив - реквизиты объекта и формы для сборки
//  ТекущийОбъект - ДокументОбъект - объект документа
//
Процедура СобратьДатуВремяПоРеквизитам(Форма, МассивРеквизитов, ТекущийОбъект = Неопределено) Экспорт
	
	Если ТекущийОбъект <> Неопределено Тогда
		Объект = ТекущийОбъект;
	Иначе
		Объект = Форма.Объект;
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивРеквизитов Цикл
		
		РеквизитОбъекта = ЭлементМассива.РеквизитОбъекта;
		
		Если Не ЗначениеЗаполнено(Форма[ЭлементМассива.РеквизитДата]) Тогда
			Объект[РеквизитОбъекта] = "";
			Продолжить;
		КонецЕсли;
		
		ДатаСтрока  = Формат(Форма[ЭлементМассива.РеквизитДата],  "ДФ=yyyyMMdd");
		ВремяСтрока = Формат(Форма[ЭлементМассива.РеквизитВремя], "ДФ=HHmmss");
		
		ДатаИВремя = Дата(ДатаСтрока + ВремяСтрока);
 
		Объект[РеквизитОбъекта] = ДатаИВремя;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ДатаВремяНаФорме

#Область АктивныйЭтапНаФорме

// Отображение на форме данных по активному этапу документа и состоянию
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма на которой необходимо показать данные
//
Процедура ОтобразитьНаФормеСбисЭтапИСостояние(Форма) Экспорт
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ФормаОбъект = МодульТНОбщегоНазначенияКлиентСервер.ФормаОбъект(Форма);
	
	ДанныеЭтапа = АктивныйЭтапДокумента(ФормаОбъект.Ссылка);
	
	Форма.АктивныйЭтапСтрокой               = ДанныеЭтапа.АктивныйЭтап;
	Форма.Элементы.КартинкаСтатус.Подсказка = ДанныеЭтапа.Состояние;
	Форма.ИндексКартинки                    = ДанныеЭтапа.ИндексКартинки;
	Форма.Состояние                         = ДанныеЭтапа.Состояние;
	Если ТипЗнч(ДанныеЭтапа.Состояние) = Тип("Структура") Тогда
		Форма.Элементы.КартинкаСтатус.Подсказка = ДанныеЭтапа.Состояние.Наименование;
	КонецЕсли;
	
	ДОЗавершенОтрицательно = МодульТНОбщегоНазначенияКлиентСервер.ИндексКартинки_ДОЗавершенОтрицательно();
	ДОЗавершенПоложительно = МодульТНОбщегоНазначенияКлиентСервер.ИндексКартинки_ДОЗавершенПоложительно();
	ДОСОшибкой             = МодульТНОбщегоНазначенияКлиентСервер.ИндексКартинки_ДОЗавершенСОшибкой();
	ДОПриостановлен        = МодульТНОбщегоНазначенияКлиентСервер.ИндексКартинки_ДООжидает();
	
	Форма.Элементы.АктивныйЭтап.Видимость = ЗначениеЗаполнено(ДанныеЭтапа.АктивныйЭтап);
	
	Если Форма.Элементы.Найти("КомментарийУведомление") <> Неопределено Тогда 
		Если МодульТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(ФормаОбъект, "КомментарийУведомление") Тогда
			КомментарийУведомление = ФормаОбъект.КомментарийУведомление;
		Иначе
			КомментарийУведомление = Форма.КомментарийУведомление;
		КонецЕсли;
		Форма.Элементы.КомментарийУведомление.Видимость = (Форма.ИндексКартинки = ДОЗавершенОтрицательно)
			Или ЗначениеЗаполнено(КомментарийУведомление);
	КонецЕсли;
	
	ИмяМетаданных = МодульТНОбщегоНазначенияКлиентСервер.ИмяМетаданныхПоФорме(Форма);
	
	ТекущийТитул = РезультатФункцииТитулов(ИмяМетаданных, "ЗначениеПоПредставлению", ДанныеЭтапа.АктивныйЭтап);
	
	// проверка на динамический это титул или нет
	ЭтоДТ = РезультатФункцииТитулов(ИмяМетаданных, "ЭтоДинамическийТитул", ТекущийТитул);
	
	Видимость   = Истина;
	Доступность = Ложь;
	Если Форма.ИндексКартинки = ДОСОшибкой Тогда  	
		Доступность = Истина;
		Картинка    = КартинкаИнтерфейсаСервер(Форма, "ESD_СостояниеОшибка");	
	// ДО завершен положительно
	ИначеЕсли Форма.ИндексКартинки = ДОЗавершенПоложительно Тогда
		Картинка = КартинкаИнтерфейсаСервер(Форма, "ESD_СостояниеЗавершеноПоложительно");
	ИначеЕсли Форма.ИндексКартинки = ДОПриостановлен Тогда 
		Доступность = Ложь;
		Картинка = Новый Картинка();
	// ДО завершен отрицательно
	ИначеЕсли Форма.ИндексКартинки = ДОЗавершенОтрицательно Тогда
		Картинка = КартинкаИнтерфейсаСервер(Форма, "ESD_СостояниеЗавершеноОтрицательно");	
	Иначе	
		Картинка     = Новый Картинка();
		Видимость    = Ложь;
		Доступность  = Не ЭтоДТ; // выгрузка в сбис на ДТ не доступна	
	КонецЕсли;
	
	Форма.Элементы.КартинкаСтатус.Картинка         = Картинка;
	Форма.Элементы.ФормаВыгрузитьВСбис.Доступность = Доступность;
	Форма.Элементы.КартинкаСтатус.Видимость        = Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

// Добавление регламентных заданий подсистемы ЭПД
//
// Параметры:
//   МассивЗаданий - Массив - данные по регламентным заданиям, которые нужно дополнить новыми значениями
//
Процедура ДобавитьРегламентныеЗаданияЭПД(МассивЗаданий) Экспорт
КонецПроцедуры

#КонецОбласти // РегламентныеЗадания

#Область include_etrn_base_CommonModule_ЗначениеПеречисления
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеПеречисления

#Область ДинамическийСписокДокументов

// Устанавливает настройки формы списка документов.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма со списком.
//
Процедура ДинСписокДокументов_УстановитьНастройки(Форма) Экспорт 
	УстановитьПараметрАккаунтаВСписке(Форма.Список);
	УстановитьПараметрКодЗавершенПоложительно(Форма.Список);
	УстановитьУсловноеОформлениеПоляДата(Форма);
	
	// для старых форм
	УстановитьУсловноеОформлениеСписка(Форма); 
КонецПроцедуры

// Общий обработчик события "ПриПолученииДанныхНаСервере" дин. списка формы документов
//
// Параметры:
//	ИмяЭлемента - Строка - см. описание "ПриПолученииДанныхНаСервере"
//  Настройки - НастройкиКомпоновкиДанных - см. описание "ПриПолученииДанныхНаСервере"
//  Строки - СтрокиДинамическогоСписка - см. описание "ПриПолученииДанныхНаСервере"
Процедура ДинСписокДокументов_ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки) Экспорт
	Если Не Строки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	СписокДокументов = Строки.ПолучитьКлючи();
	ДополнительныеПараметры = ДинСписокДокументов_ДополнительныеПараметрыЗаполнения(СписокДокументов);
	
	Для Каждого Строка Из Строки Цикл
		Ссылка = Строка.Ключ;
		ДанныеСтроки = Строка.Значение.Данные;
		ДинСписокДокументов_ЗаполнитьТекущийЭтапСтроки(ДанныеСтроки, Ссылка, ДополнительныеПараметры);
	КонецЦикла;	
КонецПроцедуры

// Заполнение дополненного текущего этапа строки дин. списка документов
//
// Параметры:
//	ДанныеСтроки - СтрокаДинамическогоСписка - данные строки дин. списка
//	Ссылка - ДокументСсылка - ссылка на документ/ключ строки дин. списка
//	ДополнительныеПараметры - Структура - структура дополнительных параметров, которая используется для заполнения строк
Процедура ДинСписокДокументов_ЗаполнитьТекущийЭтапСтроки(ДанныеСтроки, Ссылка, ДополнительныеПараметры) Экспорт
	Если ДанныеСтроки.Состояние = ДополнительныеПараметры.КодЗавершенПоложительно Тогда
		КомментарийУведомление = "";
	ИначеЕсли ДанныеСтроки.Состояние = ДополнительныеПараметры.КодЗавершенОтрицательно Тогда
		КомментарийУведомление = ДинСписокДокументов_СформироватьПредставлениеТекущегоЭтапа(ДанныеСтроки, Ссылка, ДополнительныеПараметры);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КомментарийУведомление) Тогда
		ДанныеСтроки.ТекущийЭтап = КомментарийУведомление;
	Иначе
		ОписаниеСостояния = ДополнительныеПараметры.СоответствиеСостояний.Получить(ДанныеСтроки.Состояние);
		ДанныеСтроки.ТекущийЭтап = ОписаниеСостояния.Наименование;
	КонецЕсли;
КонецПроцедуры

// Формирование представления текущего этапа строки дин. списка документов
//
// Параметры:
//	ДанныеСтроки - СтрокаДинамическогоСписка - данные строки дин. списка
//	Ссылка - ДокументСсылка - ссылка на документ/ключ строки дин. списка
//	ДополнительныеПараметры - Структура - структура дополнительных параметров, которая используется для заполнения строк
//
// Возвращаемое значение:
//	Строка - представление текущего этапа дин. списка
Функция ДинСписокДокументов_СформироватьПредставлениеТекущегоЭтапа(ДанныеСтроки, Ссылка, ДополнительныеПараметры) Экспорт
	КомментарийУведомление = ДанныеСтроки.КомментарийУведомление;
		
	Если Не ЗначениеЗаполнено(КомментарийУведомление) Тогда
		Возврат ДанныеСтроки.ТекущийЭтап;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ТекущийЭтап) Тогда
		ДанныеТитула = ДополнительныеПараметры.ДанныеПоследнихТитулов.Найти(Ссылка, "СсылкаНаДокумент");
		Если ДанныеТитула <> Неопределено Тогда
			КомментарийУведомление = Строка(ДанныеТитула.ТипТитула) + ": " + КомментарийУведомление;
		Иначе
			КомментарийУведомление = "Комментарий: " + КомментарийУведомление;	
		КонецЕсли;
	
		КомментарийУведомление = ДанныеСтроки.ТекущийЭтап + " (" + КомментарийУведомление + ")";
	Иначе
		КомментарийУведомление = "Комментарий: " + КомментарийУведомление;	
	КонецЕсли;
	
	Возврат КомментарийУведомление;
КонецФункции

// Создание и заполнение структуры дополнительных параметров заполнения строк дин. списка документов
//
// Параметры:
//	СписокДокументов - Массив - массив ключей/ссылок строк дин. списка
//
// Возвращаемое значение:
//	Структура - структура дополнительных параметров заполнения строк дин. списка документов
Функция ДинСписокДокументов_ДополнительныеПараметрыЗаполнения(СписокДокументов) Экспорт
	ДополнительныеПараметры = Новый Структура;
	
	МодульКодаСостояния = МодульКода("РегистрыСведений.ESD_Состояние");
	ДополнительныеПараметры.Вставить("СоответствиеСостояний", МодульКодаСостояния.СоответствиеСостояний());
	ДополнительныеПараметры.Вставить("КодЗавершенПоложительно", МодульКодаСостояния.КодЗавершенПоложительно());
	ДополнительныеПараметры.Вставить("КодЗавершенОтрицательно", МодульКодаСостояния.КодЗавершенОтрицательно());
	
	МодульКодаДанныеТитулов = МодульКода("РегистрыСведений.ESD_ДанныеТитулов");
	ДополнительныеПараметры.Вставить("ДанныеПоследнихТитулов", МодульКодаДанныеТитулов.ДанныеПоследнихТитулов(СписокДокументов));
	
	Возврат ДополнительныеПараметры;
КонецФункции

#КонецОбласти

// Формирует и выводит сообщение, которое может быть связано с элементом управления формы.
//
// Параметры:
//  ТекстСообщенияПользователю - Строка - текст сообщения.
//  КлючДанных - Произвольный - объект, ссылка или ключ записи информационной базы, к которому это сообщение относится.
//  Поле - Строка - наименование реквизита формы.
//  ПутьКДанным - Строка - путь к данным (путь к реквизиту формы).
//
Процедура СообщитьПользователюСервер(Знач ТекстСообщенияПользователю, Знач КлючДанных = Неопределено,	Знач Поле = "",
	Знач ПутьКДанным = "") Экспорт
	
	ЭтоОбъект = Ложь;
	
	Если КлючДанных <> Неопределено
		И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
		
		ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
		ЭтоОбъект = Найти(ТипЗначенияСтрокой, "Object.") > 0;
		
	КонецЕсли;
	
	Сообщение = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СообщениеПользователю(
					ТекстСообщенияПользователю, КлючДанных, Поле, ПутьКДанным, ЭтоОбъект);
	
	Сообщение.Сообщить();
	
КонецПроцедуры

// Создает прямую связь между объектом ESD и объектом основанием для заполнения
// Параметры:
// 	ОбъектESD - ДокументСсылка - заполняемый объект ESD 
// 	ИмяМетаданных - Строка - тип объекта метаданных основания
// 	Идентификатор - Строка - идентификатор объекта основания
//
Процедура ПривязатьДокументОснование(ОбъектESD, ИмяМетаданных, Идентификатор) Экспорт
	
	ИмяРегистраСвязи = "ESD_ОснованияЗаполнения";
	Если Метаданные.РегистрыСведений.Найти(ИмяРегистраСвязи) = Неопределено
		Или Не ЗначениеЗаполнено(ИмяМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОснование = СсылкаНаОбъектОснование(ИмяМетаданных, Идентификатор);
	
	МенеджерЗаписи = РегистрыСведений[ИмяРегистраСвязи].СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектESD = ОбъектESD;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.ОбъектESD = ОбъектESD;
	МенеджерЗаписи.Основание = ДокументОснование;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_НастройкаФункционала_СлужебныйПрограммныйИнтерфейс
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_НастройкаФункционала_СлужебныйПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_НастройкаФункционала_СлужебныйПрограммныйИнтерфейсПереопределяемый
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_НастройкаФункционала_СлужебныйПрограммныйИнтерфейсПереопределяемый

Функция ПроверитьНаличиеПараметровПодключенияЭПД(ВызыватьИсключение = Ложь) Экспорт
	Результат = Неопределено;
	
	ПараметрыПодключения = ESD_ПараметрыАвторизацииПользователя();
	Если ESD_АвторизацияПройдена(ПараметрыПодключения.Сессия) Тогда
		Результат = ПараметрыПодключения.Подключение;
	Иначе
		Если ВызыватьИсключение = Истина Тогда
			ВызватьИсключение МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СообщениеОшибки_ОтсутствуетПодключение();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

// Получает данные указанного водителя, включая водительское удостоверение.
//
// Параметры:
//  Водитель - СправочникСсылка.ФизическиеЛица - ссылка на водителя для получения данных.
//
// Возвращаемое значение:
//   Структура - см. ФиоИВУФизЛиц + "ВУ"
//
Функция ДанныеВодителяПоСсылке(Водитель) Экспорт

	Массив = Новый Массив;
	Массив.Добавить(Водитель);
	
	Водители = ФиоИВУФизЛиц(Массив);	
	ВодительДанные = Водители[Водитель];
	
	ВодительскоеУдостоверение = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПредставлениеВУ(ВодительДанные);
	ВодительДанные.Вставить("ВУ", ВодительскоеУдостоверение);
	
	Возврат ВодительДанные;
	
КонецФункции

// Записывает строку JSON в указанный файл.
// Напрямую нигде не вызывается, а используется при отладке, когда онлайн возвращает большой JSON,
// который не помещается в табло.
//
// Параметры:
//  ИмяФайла - Строка - полный путь к файлу для записи.
//  СтрокаJSON - Строка - строка в формате JSON
//
// Возвращаемое значение:
//   Булево - всегда Истина.
//
Функция ЗаписатьJSONВФайл(ИмяФайла, СтрокаJSON) Экспорт
	
	Запись = Новый ЗаписьJSON();
	Запись.ОткрытьФайл(ИмяФайла);
	Запись.ЗаписатьБезОбработки(СтрокаJSON);
	Запись.Закрыть();
	
	Возврат Истина;
	
КонецФункции

// Получает таблицу значений из менеджера временных таблиц.
// Напрямую не вызывается, но используется для отладки запросов с менеджером временных таблиц.
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц
//  ИмяТаблицы - Строка - имя таблицы из менеджера временных таблиц
//
// Возвращаемое значение:
//   ТаблицаЗначений - талица данных из менеджера временных таблиц
//
Функция ПолучитьТаблицуМенеджераВременныхТаблиц(МенеджерВременныхТаблиц, ИмяТаблицы) Экспорт
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст = СтрЗаменить("ВЫБРАТЬ * ИЗ &ИмяТаблицы", "&ИмяТаблицы", ИмяТаблицы);
	
	Возврат ЗапросДанных.Выполнить().Выгрузить();
	
КонецФункции

// Получает ссылку на объект информационной базы по навигационной ссылке.
//
// Параметры:
//  НавигационнаяСсылка - Строка - навигационная ссылка на объект информационной базы.
//
// Возвращаемое значение:
//   ЛюбаяСсылка - ссылка на объект информационной базы
//
Функция СсылкаПоНавигационнойСсылке(НавигационнаяСсылка) Экспорт
	
	РезультатФункции = Неопределено;
	
	ПрефиксМетаданных = "e1cib/data/";
	ПрефиксСсылки     = "?ref=";
	
	ПозицияМетаданных     = Найти(НавигационнаяСсылка, ПрефиксМетаданных) + СтрДлина(ПрефиксМетаданных);
    ПозицияПрефиксаСсылки = Найти(НавигационнаяСсылка, ПрефиксСсылки);
	
	Если ПозицияПрефиксаСсылки <> 0 Тогда
		ПозицияСсылки         = ПозицияПрефиксаСсылки + СтрДлина(ПрефиксСсылки);
		
		ИдентификаторСсылки   = Сред(НавигационнаяСсылка, ПозицияСсылки);
		
		ПредставлениеТипа     = Сред(НавигационнаяСсылка, ПозицияМетаданных, ПозицияПрефиксаСсылки - ПозицияМетаданных);
		ПустаяСсылка          = ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка");
		
	    ШаблонЗначения = ЗначениеВСтрокуВнутр(ПустаяСсылка);
	    ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", ИдентификаторСсылки);
	    РезультатФункции = ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
		
		Если Не СсылкаСуществует(РезультатФункции) Тогда
			РезультатФункции = ПустаяСсылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Проверяет физическое наличие записи в информационной базе данных о переданном значении ссылки.
//
// Параметры:
//  ПроверяемаяСсылка - ЛюбаяСсылка - значение любой ссылки информационной базы данных.
// 
// Возвращаемое значение:
//  Булево - Истина, если существует.
//
Функция СсылкаСуществует(ПроверяемаяСсылка) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	&ИмяТаблицы КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицы", ПроверяемаяСсылка.Метаданные().ПолноеИмя());
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ПроверяемаяСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Получает данные печатной формы документа с онлайна.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка.Saby_ТранспортнаяНакладная - ссылка на документ ЭТрН
//  ЗагрузкаТребуется - Структура - результат выгрузки на клиенте
//  ДополнительныеПараметры - Структура - дополнительные параметры печати
//
// Возвращаемое значение:
//   Структура - структура данных печатной формы полученной с онлайна.
//     * АдресДвоичныхДанных - Строка - адрес двоичных данных печатной формы
//     * СсылкаНаПрисоединенныйФайл - СправочникСсылка.Saby_ТранспортнаяНакладнаяПрисоединенныеФайлы - ссылка на
//       справочник с присоединенным файлом печатной формы.
//     * ОписаниеОшибки - Строка - описание ошибки получения печтаной формы с онлайна.
//     * СписокДокументов - Массив - данные документов с ошибкой.
//
Функция ДанныеПечатнойФормыДляОткрытия(СсылкаНаДокумент, ЗагрузкаТребуется, ДополнительныеПараметры) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("АдресДвоичныхДанных",        Неопределено);
	РезультатФункции.Вставить("СсылкаНаПрисоединенныйФайл", Неопределено);
	РезультатФункции.Вставить("ОписаниеОшибки",             "");
	РезультатФункции.Вставить("СписокДокументов",           Неопределено);
	РезультатФункции.Вставить("СсылкаНаДокумент",           СсылкаНаДокумент);
	РезультатФункции.Вставить("ПечатнаяФормаQR",            Неопределено);
	РезультатФункции.Вставить("ОшибкиОбщие", 				"");
	
	Если Не ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Если ДополнительныеПараметры.ВыгрузкаАрхива Тогда
			РезультатФункции.ОписаниеОшибки = "Документ еще ни разу не сохранен. Архив документа недоступен.";
		Иначе
			РезультатФункции.ОписаниеОшибки = "Документ еще ни разу не сохранен. Печатная форма недоступна.";
		КонецЕсли;
		Возврат РезультатФункции;
	КонецЕсли;
	
	Подключаемый_ФормированиеПечатнойФормы_ЗаполнитьДополнительныеПараметрыПечати(ДополнительныеПараметры, СсылкаНаДокумент);
	
	МодульТНЗагрузкаСервер = МодульКода("ESD_ТНЗагрузкаСервер");
	ПараметрыЗагрузки = МодульТНЗагрузкаСервер.ПараметрыЗагрузкиИзСбис(
		СсылкаНаДокумент, ДополнительныеПараметры, , ЗагрузкаТребуется);
	
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.ИдентификаторСБИС) Тогда
		Если ДополнительныеПараметры.ВыгрузкаАрхива Тогда
			РезультатФункции.ОписаниеОшибки = "Документ не выгружен в SABY. Архив документа недоступен.";
		Иначе	
			РезультатФункции.ОписаниеОшибки = "Документ не выгружен в SABY. Печатная форма недоступна.";
		КонецЕсли;
		РезультатФункции.СписокДокументов 	= ПараметрыЗагрузки.СписокДокументов;
		РезультатФункции.ОшибкиОбщие		= ПараметрыЗагрузки.ОшибкиОбщие;
		Возврат РезультатФункции;
	КонецЕсли;
	
	Если ТипЗнч(СсылкаНаДокумент) <> Тип("Структура") Тогда
		// Вручную установим признак загрузки данных из Saby/СБИС
		ПараметрыЗагрузки.ЗагрузкаТребуется = Истина;
		ЗагруженныеДанныеПечатнойФормыДляОткрытия(ПараметрыЗагрузки, РезультатФункции, ДополнительныеПараметры);
	Иначе
		Если Не ДополнительныеПараметры.ВыгрузкаАрхива Тогда
			ПараметрыЗагрузки.ОбъектОбработки = Неопределено;
			РезультатФункции.Вставить("ПараметрыЗагрузки", ПараметрыЗагрузки);
		КонецЕсли;		
	КонецЕсли;
	
	Если ДополнительныеПараметры.ЭтоПечатьQRКода Тогда
		СформироватьПечатнуюФормуQR(РезультатФункции, ДополнительныеПараметры);
		Если ДополнительныеПараметры.Свойство("ЭтоТолстыйКлиент") Тогда
			// Табличный документ в толстом клиенте не передается с сервера на клиент, поэтому заворачиваем в строку внутр.
			РезультатФункции.ПечатнаяФормаQR = ЗначениеВСтрокуВнутр(РезультатФункции.ПечатнаяФормаQR);
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Получает все необходимые данные физ лиц для обмена с онлайном.
//
// Параметры:
//  МассивФизлиц - Массив - массив из ссылок СправочникСсылка.ФизическиеЛица
//
// Возвращаемое значение:
//   Соответствие - ключами соответствия являются ссылки на ФизЛицо, а значениями - структура данных физлица.
//     Структура данных физлица содержит:
//       * Фамилия - Строка
//       * Имя - Строка
//       * Отчество - Строка
//       * ИНН - Строка
//       * Номер - Строка - номер водительского удостоверения
//       * Серия - Строка - серия водительского удостоверения
//       * ДатаВыдачи - Дата - дата выдачи водительского удостоверения
//       * Телефоны - Строка
//
Функция ФиоИВУФизЛиц(МассивФизлиц) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПолучитьДанныеФизлиц(МассивФизлиц, МенеджерВременныхТаблиц);
	ПолучитьВУФизлиц(МассивФизлиц, МенеджерВременныхТаблиц);
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	РеквизитыФизлиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РеквизитыФизлиц.Наименование КАК Наименование,
	|	РеквизитыФизлиц.ИНН КАК ИНН,
	|	РеквизитыФизлиц.Фамилия КАК Фамилия,
	|	РеквизитыФизлиц.Имя КАК Имя,
	|	РеквизитыФизлиц.Отчество КАК Отчество,
	|	ЕСТЬNULL(ВУФизлиц.Номер, """") КАК Номер,
	|	ЕСТЬNULL(ВУФизлиц.Серия, """") КАК Серия,
	|	ЕСТЬNULL(ВУФизлиц.ДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаВыдачи
	|ИЗ
	|	РеквизитыФизлиц КАК РеквизитыФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВУФизлиц КАК ВУФизлиц
	|		ПО РеквизитыФизлиц.ФизическоеЛицо = ВУФизлиц.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТелефоныЭлектроннаяПочтаФизлиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТелефоныЭлектроннаяПочтаФизлиц.Представление КАК Представление
	|ИЗ
	|	ТелефоныЭлектроннаяПочтаФизлиц КАК ТелефоныЭлектроннаяПочтаФизлиц
	|ГДЕ
	|	ТелефоныЭлектроннаяПочтаФизлиц.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТелефоныЭлектроннаяПочтаФизлиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТелефоныЭлектроннаяПочтаФизлиц.Представление КАК Представление
	|ИЗ
	|	ТелефоныЭлектроннаяПочтаФизлиц КАК ТелефоныЭлектроннаяПочтаФизлиц
	|ГДЕ
	|	ТелефоныЭлектроннаяПочтаФизлиц.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	
	РезультатЗапроса        = ЗапросДанных.ВыполнитьПакет();
	Выборка                 = РезультатЗапроса[0].Выбрать();
	ВыборкаТелефоны         = РезультатЗапроса[1].Выбрать();
	ВыборкаЭлектроннаяПочта = РезультатЗапроса[2].Выбрать();
	
	МенеджерВременныхТаблиц.Закрыть();
	
	Соответствие = Новый Соответствие;
	Пока Выборка.Следующий() Цикл 
		
		ВыборкаТелефоны.Сбросить();
		ВыборкаЭлектроннаяПочта.Сбросить();
		
		Если ПустаяСтрока(Выборка.Фамилия) Тогда
			ИсточникФИО = ФИОИзСтроки(СокрЛП(Выборка.Наименование));
		Иначе
			ИсточникФИО = Выборка;
		КонецЕсли;
		
		Структура = Новый Структура;
		Структура.Вставить("Фамилия",    ИсточникФИО.Фамилия);
		Структура.Вставить("Имя",        ИсточникФИО.Имя);
		Структура.Вставить("Отчество",   ИсточникФИО.Отчество);
		Структура.Вставить("ИНН",        Выборка.ИНН);
		Структура.Вставить("Номер",      Выборка.Номер);
		Структура.Вставить("Серия",      Выборка.Серия);
		Структура.Вставить("ДатаВыдачи", Выборка.ДатаВыдачи);
		
	    Отбор = Новый Структура;
		Отбор.Вставить("ФизическоеЛицо", Выборка.ФизическоеЛицо);
		
		МассивТелефонов = Новый Массив;
		Пока ВыборкаТелефоны.НайтиСледующий(Отбор) Цикл
			МассивТелефонов.Добавить(ВыборкаТелефоны.Представление);
		КонецЦикла;
				
		МассивЭлектроннаяПочта = Новый Массив;
		Пока ВыборкаЭлектроннаяПочта.НайтиСледующий(Отбор) Цикл
			МассивЭлектроннаяПочта.Добавить(ВыборкаЭлектроннаяПочта.Представление);
		КонецЦикла;
		
		Структура.Вставить("Телефоны",         ЗначениеВСтрокуВнутр(МассивТелефонов));
		Структура.Вставить("ЭлектроннаяПочта", ЗначениеВСтрокуВнутр(МассивЭлектроннаяПочта));
		
		Соответствие.Вставить(Выборка.ФизическоеЛицо, Структура);
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

// Преобразует ФИО из строки в структуру
// Параметры:
//  СтрокаФИО - Строка - ФИО строкой
// Возвращаемое значение:
//  Структура - Фамилия, Имя, Отчество полученные из строки
//
Функция ФИОИзСтроки(СтрокаФИО) Экспорт
	
	// Убираем ИП
	ФИОБезИП = СтрЗаменить(СтрокаФИО, "ИП", "");
	ФИОБезИП = СтрЗаменить(ФИОБезИП,  ",",  "");
	ФИОБезИП = СтрЗаменить(ФИОБезИП,  "Индивидуальный предприниматель", "");
	
	ЧастиФИО = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ФИОБезИП, " ", Ложь);
	
	ПозицияИмя      = 1;
	ПозицияОтчество = 2;
	
	Фамилия  = ?(ЧастиФИО.Количество(),                   ЧастиФИО[0], "");
	Имя      = ?(ЧастиФИО.Количество() > ПозицияИмя,      ЧастиФИО[1], "");
	Отчество = ?(ЧастиФИО.Количество() > ПозицияОтчество, ЧастиФИО[2], "");

	Структура = Новый Структура;
	Структура.Вставить("Фамилия",  Фамилия);
	Структура.Вставить("Имя",      Имя);
	Структура.Вставить("Отчество", Отчество);
	
	Возврат Структура;
	
КонецФункции

// Возвращает структуру синонимов доступных баз
//
// Возвращаемое значение:
//   Структура - значениями являются синонимы конфигураций
//
Функция ПоддержанныеКонфигурации() Экспорт
	
	РезультатФункции = Новый Структура;
		
	// важен порядок элементов для проверки. чем выше - тем приоритетней поиск 
	РезультатФункции.Вставить("Бух3", ОписаниеКонфигурации("Бух3", "3.0"));
	РезультатФункции.Вставить("ERP",  ОписаниеКонфигурации("ERP",  "2.4"));
	РезультатФункции.Вставить("КА",   ОписаниеКонфигурации("КА",   "2.4")); 
	РезультатФункции.Вставить("УАТ",  ОписаниеКонфигурации("УАТ",  "2.2")); 	
	РезультатФункции.Вставить("УТ11", ОписаниеКонфигурации("УТ11", "11.0"));	
	РезультатФункции.Вставить("УТ10", ОписаниеКонфигурации("УТ10", "10.0"));	
	РезультатФункции.Вставить("УПП",  ОписаниеКонфигурации("УПП",  "1.3"));
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ЭтоДоступнаяКонфигурация() Экспорт
	
	ИмяОсновнойКонфигурации = Метаданные.Имя;
	ВерсияКонфигурации      = Метаданные.Версия;
	ВсеКонфигурации         = ПоддержанныеКонфигурации();
	
	Поддержана      = Ложь;	
	ИмяКонфигурации = "";
	Представление   = "";
	
	Для Каждого КлючЗначение Из ВсеКонфигурации Цикл
		
		Значение = КлючЗначение.Значение;
		
		Имя = Значение.Имя;
		
		ПодходящаяКонфигурация = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрНачинаетсяСЭПД(ИмяОсновнойКонфигурации, Имя);
		Если Не ПодходящаяКонфигурация Тогда
			Продолжить;
		КонецЕсли;	
				
		ИмяКонфигурации = КлючЗначение.Ключ;
		Представление   = Значение.Представление;
		Поддержана      = ВерсияПоддержана(Значение.Версия, ВерсияКонфигурации);		
		Если Поддержана Тогда
			Прервать;
		КонецЕсли;	
					
	КонецЦикла;
	
	Ответ = Новый Структура;
	Ответ.Вставить("Поддержана",    Поддержана);
	Ответ.Вставить("Имя",           ИмяКонфигурации);
	Ответ.Вставить("Представление", Представление);
	Ответ.Вставить("Версия",        ВерсияКонфигурации);
	
	Возврат Ответ;
	
КонецФункции

// Возвращает с структуру данных ответственного лица
//
// Возвращаемое значение:
//   Структура - см. в самой функции
//
Функция СтруктураДанныхОтветственногоЛица() Экспорт

	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Роль",                  ЗначениеМетаданных("ESD_РолиОтветственных.ПустаяСсылка"));
	РезультатФункции.Вставить("Фамилия",               "");
	РезультатФункции.Вставить("Имя",                   "");
	РезультатФункции.Вставить("Отчество",              "");
	РезультатФункции.Вставить("ИНН",                   "");
	РезультатФункции.Вставить("Серия",                 "");
	РезультатФункции.Вставить("Номер",                 "");
	РезультатФункции.Вставить("ДатаВыдачи",            "");
	РезультатФункции.Вставить("ДатаОкончанияДействия", "");
	РезультатФункции.Вставить("Телефоны",              "");
	РезультатФункции.Вставить("ЭлектроннаяПочта",      "");
	РезультатФункции.Вставить("Должность",             "");
	РезультатФункции.Вставить("ТабельныйНомер",        "");

	Возврат РезультатФункции;
	
КонецФункции

// Обновляет декорацию с ошибкой
// Параметры:
//  Форма - Форма - источник вызова
//  ПараметрыВыделенияДекорации - Структура - параметры выделения
//
Процедура ОбновитьДекорацию(Форма, Знач ПараметрыВыделенияДекорации) Экспорт
	
	Для Каждого ИмяДекорации Из ПараметрыВыделенияДекорации.Выделить Цикл
		Форма.Элементы[ИмяДекорации].ЦветРамки = ЦветаСтиля.ЦветАктивности;
		Форма.Элементы[ИмяДекорации].Подсказка = "Необходимо заполнить";
	КонецЦикла;
	
	Для Каждого ИмяДекорации Из ПараметрыВыделенияДекорации.ОтменитьВыделение Цикл
		Форма.Элементы[ИмяДекорации].ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
		Форма.Элементы[ИмяДекорации].Подсказка = "";
	КонецЦикла;
	
КонецПроцедуры

#Область ПолучениеДанныхПоСсылке

// Возвращает все необходимые реквизиты транспортных средств из базы
//
// Параметры:
//  МассивСсылокТС - Массив - массив ссылок на транспортные средства
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц с таблицей ТаблицаТранспортныхСредств
//
// Возвращаемое значение:
//   Соответствие - соответствие структур реквизитов по ссылкам на транспортные средства.
//     * Ключ - СправочникСсылка - ссылка на транспортное средство
//     * Значение - Структура - см. функцию Saby_ТНОбщегоНазначенияКлиентСервер.СтруктураТранспортногоСредства()
//
Функция РеквизитыТранспортныхСредств(МассивСсылокТС, МенеджерВременныхТаблиц = Неопределено) Экспорт
	
	Если МассивСсылокТС = Неопределено И МенеджерВременныхТаблиц = Неопределено Тогда		
		Результат = Новый Соответствие;		
	ИначеЕсли ЭтоДоступнаяКонфигурация().Имя = "УАТ" Тогда
		Результат = ДанныеТранспортныхСредствИзКонфигурацииУАТ(МассивСсылокТС, МенеджерВременныхТаблиц);	
	Иначе
		Результат = ДанныеТранспортныхСредствИзДругихКонфигураций(МассивСсылокТС, МенеджерВременныхТаблиц);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // ПолучениеДанныхПоСсылке

#Область Заполнение_С_Контролем

Функция ПараметрыСвойстваСКонтролем(Приемник, Источник) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Приемник",  Приемник);
	Параметры.Вставить("Источник",  Источник);
	
	Возврат Параметры;
	
КонецФункции

Процедура ЗаполнитьСвойствоСКонтролем(Параметры, ИмяРеквизита, ИмяСвойства = "", ВЧисло = Ложь) Экспорт
	
	Приемник = Параметры.Приемник; 
	Источник = Параметры.Источник;  
	
	Если ПустаяСтрока(ИмяСвойства) Тогда 
		ИмяСвойства = ИмяРеквизита;
	КонецЕсли;
		
	// Проверка На значениение заполнено не совсем корректно, так как данные могут затираться
	Если Источник[ИмяСвойства] <> Неопределено Тогда
		Если ВЧисло Тогда
			Приемник[ИмяРеквизита] = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЧислоИзСтроки(Источник[ИмяСвойства]);
		Иначе                                             		
			Приемник[ИмяРеквизита] = Источник[ИмяСвойства]; 		
		КонецЕсли;	                                      
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // Заполнение_С_Контролем

// Возвращает общие параметры для загрузки и выгрузки
//
// Параметры:
//  context_params - Структура - параметры подключения к СБИС
//
// Возвращаемое значение:
//   Структура - основные параметры используемые для выгрузки и загрузки
//
Функция ОбщиеПараметрыВыгрузкиЗагрузки(context_params = Неопределено) Экспорт
	
	Контекст = context_params;
	Если Контекст = Неопределено Тогда
		Контекст = МодульКода("ESD_ТНОбщегоНазначенияСервер").ПроверитьНаличиеПараметровПодключенияЭПД();
	КонецЕсли;
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("context_params",  Контекст);
	РезультатФункции.Вставить("ОбъектОбработки", ОбъектОбработки());
	РезультатФункции.Вставить("ТранспортБлокли", ОбъектОбработки());
		
	Возврат РезультатФункции;
	
КонецФункции

// Извлекает текстовое представление ошибки из json-структуры ошибки полученной от СБИС
//
// Параметры:
//  Описание - Строка - json с описанием ошибки, полученной от СБИС
//
// Возвращаемое значение:
//   Строка - описание ошибки
//
Функция ПричинаОшибкиИзЯдра(Описание) Экспорт
	
	Попытка
		Структура = ЗначениеИзСтрокиВнутр(Описание);
	Исключение
		// может прийти не десеарилизуемая строка
		Возврат Описание;
	КонецПопытки;
    	
	Если ТипЗнч(Структура.detail) = Тип("Строка") Тогда
		ПодробноеОписание = Структура.detail;
	ИначеЕсли ЗначениеЗаполнено(Структура.detail) Тогда
		ПодробноеОписание = Структура.detail["error"]["details"];
	Иначе
		ПодробноеОписание = "";
	КонецЕсли;
	
	ТекстОшибки = Структура.message + ?(ПустаяСтрока(ПодробноеОписание), "", " - " + ПодробноеОписание);
	
	Возврат ТекстОшибки;
	
КонецФункции

// Записывает ошибки загрузки документов в журнал регистрации.
//
// Параметры:
//  СписокДокументов - Соответствие - ошибки по документам
//	Событие - Строка - имя события журнала регистрации
//
Процедура ЗаписьОшибокВЖурналРегистрации(СписокДокументов, Событие = "Обмен с Saby") Экспорт
	Если ТипЗнч(СписокДокументов) <> Тип("Соответствие") Тогда
		Возврат; 
	КонецЕсли;
		
	Если СписокДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ОшибкиДокумента Из СписокДокументов Цикл	
		МассивОшибок = ОписанияОшибок(ОшибкиДокумента.Значение.СписокОшибок);
		Текст = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(МассивОшибок, Символы.ПС);
		ЗаписатьОшибкуВЖурналРегистрации(ОшибкиДокумента.Ключ, Событие, Текст);
	КонецЦикла;
КонецПроцедуры

// Возвращает наименование события загрузки данных из Saby для журнала регистрациии 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
Функция ИмяСобытияЖурналаРегистрации_ЗагрузкаИзSaby() Экспорт
	Возврат "Загрузка данных из Saby";
КонецФункции

// Возвращает наименование события выгрузке данных в Saby для журнала регистрациии 1С
//
// Возвращаемое значение:
//	Строка - имя события
//
Функция ИмяСобытияЖурналаРегистрации_ВыгрузкаВSaby() Экспорт
	Возврат "Выгрузка данных в Saby"
КонецФункции

Процедура ДобавитьРеквизитыИзБД(СтруктураДанных, СсылкаНаДокумент, ПсевдонимыРеквизитов, ТекстЗапросаРеквизитов) Экспорт
		
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапросаРеквизитов);
	
	НужныеКолонки = Новый Соответствие;
	Для Каждого ПсевдонимРеквизита Из ПсевдонимыРеквизитов Цикл
		НужныеКолонки.Вставить(ПсевдонимРеквизита, Истина);
	КонецЦикла;
	
	Колонки = СхемаЗапроса.ПакетЗапросов[0].Колонки;
	
	ИндексКолонки = 0;
	Пока ИндексКолонки < Колонки.Количество() Цикл
		
		Псевдоним = Колонки[ИндексКолонки].Псевдоним;
		
		Если НужныеКолонки[Псевдоним] = Неопределено Тогда
			Колонки.Удалить(ИндексКолонки);
		Иначе
			ИндексКолонки = ИндексКолонки + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	ЗапросДанных.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	МассивДанных = МодульКода("ESD_ТНОбщегоНазначенияСервер").ТаблицаЗначенийВМассивЭПД(ЗапросДанных.Выполнить().Выгрузить());
	
	Для Каждого КлючЗначение Из МассивДанных[0] Цикл
		СтруктураДанных.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьТаблицыИзБД(СтруктураДанных, СсылкаНаДокумент, Таблицы,
		ШаблонЗапросаТаблиц, НестандартныеЗапросыТаблиц
) Экспорт
    МодульESD_ОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

    УникальныеТаблицы_ = Новый Массив;
	МодульESD_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УникальныеТаблицы_, Таблицы, Истина);

	МассивЗапросов = Новый Массив;
	ЗапросДанных = Новый Запрос;
	
	СоответствиеПакетныхЗапросов = Новый Соответствие;
	Для Каждого ИмяТаблицы Из УникальныеТаблицы_ Цикл
		ТекстЗапроса = НестандартныеЗапросыТаблиц.Получить(ИмяТаблицы);
		Если ТекстЗапроса = Неопределено Тогда
			ТекстЗапроса = МодульESD_ОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(ШаблонЗапросаТаблиц, ИмяТаблицы);
		КонецЕсли;
		
		Пакеты = СтрЧислоВхождений(ТекстЗапроса, ";");
		Если Пакеты > 0 Тогда
			СоответствиеПакетныхЗапросов.Вставить(ИмяТаблицы, Пакеты);
		КонецЕсли;	
			
		МассивЗапросов.Добавить(ТекстЗапроса);
	КонецЦикла;
	
	РазделительЗапросов = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ЗапросДанных.Текст = МодульESD_ОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(МассивЗапросов, РазделительЗапросов);
	ЗапросДанных.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	Результат = ЗапросДанных.ВыполнитьПакет();
	
	Индекс = 0;
	Для Каждого ИмяТаблицы Из УникальныеТаблицы_ Цикл
				
		ПакетыЗапроса = СоответствиеПакетныхЗапросов[ИмяТаблицы];
		Сдвиг = ?(ЗначениеЗаполнено(ПакетыЗапроса), ПакетыЗапроса, 0);
		
		НомерТаблицыВЗапросе = Индекс + Сдвиг;
		
		СтруктураДанных.Вставить(ИмяТаблицы, Результат[НомерТаблицыВЗапросе].Выгрузить());
		Индекс = НомерТаблицыВЗапросе + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РеквизитыДокументовСбис(МассивДокументов) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок", МассивДокументов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыЭПД.Наименование КАК Наименование,
	|	ДокументыЭПД.Номер КАК Номер,
	|	ДокументыЭПД.Дата КАК Дата,
	|	ДокументыЭПД.Дата КАК ДатаВремя,
	|	ДокументыЭПД.ДопСведения КАК ДополнительныеСведения,
	|	ДокументыЭПД.Ссылка КАК Ссылка,
	|	ДокументыЭПД.Тип КАК Тип
	|ИЗ
	|	Справочник.ESD_ДокументыЭПД КАК ДокументыЭПД
	|ГДЕ
	|	ДокументыЭПД.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыЭПДДанныеЮрЛиц.Ссылка КАК Ссылка,
	|	ДокументыЭПДДанныеЮрЛиц.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	ДокументыЭПДДанныеЮрЛиц.ИНН КАК ИНН,
	|	ДокументыЭПДДанныеЮрЛиц.КПП КАК КПП,
	|	ДокументыЭПДДанныеЮрЛиц.СтранаРегистрации КАК СтранаРегистрации,
	|	ДокументыЭПДДанныеЮрЛиц.ОГРН КАК ОГРН,
	|	ДокументыЭПДДанныеЮрЛиц.ЮрФизЛицо КАК ЮрФизЛицо
	|ИЗ
	|	Справочник.ESD_ДокументыЭПД.ДанныеЮрЛиц КАК ДокументыЭПДДанныеЮрЛиц
	|ГДЕ
	|	ДокументыЭПДДанныеЮрЛиц.Ссылка В(&МассивСсылок)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ESD_ДокументыЭПД", ДокументыЭПД());
	
	Если ЭтоДоступнаяКонфигурация().Имя = "УАТ" Тогда
		
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"ДокументыЭПДСтороны.Сторона.РегистрационныйНомер",
			"&ПустаяСтрока");
			
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДокументов = РезультатЗапроса[0].Выбрать();
	РеквизитыСторон   = РезультатЗапроса[1].Выгрузить();
	
	Соответствие = Новый Соответствие;
	
	КолонкиИсключения = Новый Массив;
	КолонкиИсключения.Добавить("Ссылка");
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ПараметрыСтроки = СтрокаТаблицыЗначенийВСтруктуруЭПД(
			ВыборкаДокументов, КолонкиИсключения);
		ПараметрыСтроки.Дата = МодульКода("ESD_ТНВыгрузкаСервер").ЗначениеДатыВремяДляВыгрузки(ПараметрыСтроки.Дата, Истина);
		
		// добавим стороны документа
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", ВыборкаДокументов.Ссылка);
		НайденныеСтроки = РеквизитыСторон.НайтиСтроки(Отбор);
		
		МассивСторон = ПараметрыСторонДокумента(НайденныеСтроки);
		
		ПараметрыСтроки.Вставить("Стороны", МассивСторон);
		
		Соответствие.Вставить(ВыборкаДокументов.Ссылка, ПараметрыСтроки);
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция РеквизитыДокументаСбисИзСтрокиТаблицы(СтрокаДокумента) Экспорт
	
	КолонкиИсключения = Новый Массив;
	КолонкиИсключения.Добавить("Путь");
	
	ПараметрыСтроки = СтрокаТаблицыЗначенийВСтруктуруЭПД(СтрокаДокумента, КолонкиИсключения);
	
	ПараметрыСтроки.Дата = МодульКода("ESD_ТНВыгрузкаСервер").ЗначениеДатыВремяДляВыгрузки(ПараметрыСтроки.Дата, Истина);
		
	МассивСторон = ПараметрыСторонДокумента(СтрокаДокумента.ДанныеЮрЛиц);
		
	ПараметрыСтроки.Вставить("Стороны", МассивСторон);
	
	Возврат ПараметрыСтроки;
	
КонецФункции

Процедура ДозаполнитьНовыеЭлементыДаннымиСОнлайна(ТекстЗапроса, МенеджерСправочника) Экспорт
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = ТекстЗапроса;
	
	ЗапросДанных.УстановитьПараметр("Идентификатор", МенеджерСправочника.ИдентификаторДозаполнения());
	
	МассивНаименований = Новый Массив;
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	Пока ВыборкаДанных.Следующий() Цикл
		Наименование = МенеджерСправочника.ПреобразоватьНаименование(ВыборкаДанных.Наименование);
		МассивНаименований.Добавить(Наименование);
	КонецЦикла;
	
	Если МассивНаименований.Количество() > 0 Тогда
		
		МенеджерСправочника.ЗагрузитьСОнлайна(МассивНаименований);
		
		ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
		Пока ВыборкаДанных.Следующий() Цикл
			ОбъектСправочника = ВыборкаДанных.Ссылка.ПолучитьОбъект();
			ОбъектСправочника.Идентификатор = "";
			ОбъектСправочника.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СтруктураПредставленияТитула(ТипТитула, КодТитула, ИмяПодстановки = "") Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("КодТитула",      КодТитула);
	РезультатФункции.Вставить("ИмяПодстановки", ИмяПодстановки);
	РезультатФункции.Вставить("ТипТитула",      ТипТитула);
	
	Имя           = "";
	Представление = "";
	Если Не ТипТитула.Пустая() Тогда
		МетаданныеПеречисления = ТипТитула.Метаданные();
		ИндексТипа = Перечисления[МетаданныеПеречисления.Имя].Индекс(ТипТитула);
		МетаданныеПеречисления = МетаданныеПеречисления.ЗначенияПеречисления[ИндексТипа];
		Имя           = МетаданныеПеречисления.Имя;
		Представление = МетаданныеПеречисления.Синоним;
	КонецЕсли;
	
	РезультатФункции.Вставить("Имя",           Имя);
	РезультатФункции.Вставить("Представление", Представление);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция АвторизованныйАккаунтСтрокой() Экспорт
	Аккаунт = "";
	
	ПараметрыСессии = ESD_ПараметрыАвторизацииПользователя().Сессия;
	Если Не ESD_АвторизацияПройдена(ПараметрыСессии) Тогда
		Возврат Аккаунт;
	КонецЕсли;
	
	Возврат ПараметрыСессии["AccountId"];
КонецФункции

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//                       требований к свойствам структуры.
//                       Например, "Код, Наименование, Родитель".
//            - Структура
//            - ФиксированнаяСтруктура - в качестве ключа передается
//                       псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                       значения (опционально) фактическое имя поля в таблице.
//                       Если ключ задан, а значение не определено, то имя поля берется из ключа.
//                       Допускается указание имени поля через точку, но при этом параметр КодЯзыка для такого поля
//                       учитываться не будет.
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то все реквизиты вернутся со 
//                                значением Неопределено; если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу 
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//              Если в параметр Ссылка передана пустая ссылка, то возвращается структура, 
//              соответствующая именам реквизитов со значениями Неопределено.
//              Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//              то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено) Экспорт
	
	Попытка
		ПолноеИмяОбъектаМетаданных = Ссылка.Метаданные().ПолноеИмя(); 
	Исключение
		ВызватьИсключение МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
			НСтр("ru = 'Неверный первый параметр %1 в функции %2: 
				|Значение должно быть ссылкой или именем предопределенного элемента.';
				|en = 'Invalid value of the %1 parameter, function %2:
				|The value must contain predefined item name or reference.'"),
			"Ссылка", "ESD_ТНОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта");
	КонецПопытки;
	
	СтруктураПолей = Новый Структура;
	МультиязычныеРеквизиты = Новый Соответствие;
	СуффиксЯзыка = "";
	
	СформироватьСтруктуруРеквизитов(Реквизиты, СтруктураПолей);
	
	// Подготовка результата (после выполнения запроса переопределится).
	Результат = Новый Структура;
	
	// Формирование текста запроса к выбираемым полям.
	ТекстЗапросаПолей = "";
	Для каждого КлючИЗначение Из СтруктураПолей Цикл
		
		ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
						КлючИЗначение.Значение,
						КлючИЗначение.Ключ);
		ПсевдонимПоля = КлючИЗначение.Ключ;
		
		Если МультиязычныеРеквизиты[ИмяПоля] <> Неопределено Тогда
			ИмяПоля = ИмяПоля + СуффиксЯзыка;
		КонецЕсли;
		
		ТекстЗапросаПолей = 
			ТекстЗапросаПолей + ?(ПустаяСтрока(ТекстЗапросаПолей), "", ",") + "
			|	" + ИмяПоля + " КАК " + ПсевдонимПоля;
		
		// Предварительное добавление поля по псевдониму в возвращаемый результат.
		Результат.Вставить(ПсевдонимПоля);
		
	КонецЦикла;
	
	// Если предопределенного нет в ИБ.
	// - приведение результата к отсутствию объекта в ИБ или передаче пустой ссылки.
	Если Ссылка = Неопределено Тогда 
		Возврат Результат;
	КонецЕсли;
	
	РеквизитыВМассив(Реквизиты, СтруктураПолей);
	
	РеквизитыЧерезТочку = Новый Массив;
	Для Индекс = -Реквизиты.ВГраница() По 0 Цикл
		ИмяПоля = Реквизиты[ -Индекс];
		Если Найти(ИмяПоля, ".") Тогда
			РеквизитыЧерезТочку.Добавить(ИмяПоля);
			Реквизиты.Удалить(-Индекс);
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьРезультат(Ссылка, Реквизиты, ВыбратьРазрешенные, КодЯзыка, Результат, СтруктураПолей);
	
	Если Не ЗначениеЗаполнено(РеквизитыЧерезТочку) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Реквизиты = РеквизитыЧерезТочку;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|&ТекстЗапросаПолей КАК ТекстЗапросаПолей
		|ИЗ
		|	&ПолноеИмяОбъектаМетаданных КАК ПсевдонимЗаданнойТаблицы
		|ГДЕ
		|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка";
	
	Если Не ВыбратьРазрешенные Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаПолей КАК ТекстЗапросаПолей", ТекстЗапросаПолей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	
	// Выполнение запроса.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Заполнение реквизитов.
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  ИмяРеквизита       - Строка - имя получаемого реквизита.
//                                Допускается указание имени реквизита через точку, но при этом параметр КодЯзыка для
//                                такого реквизита учитываться не будет.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то возвращается Неопределено;
//                                если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Произвольный - если в параметр Ссылка передана пустая ссылка, то возвращается Неопределено.
//                 Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//                 то возвращается Неопределено.
//
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено) Экспорт
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда 
		ВызватьИсключение МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
			НСтр("ru = 'Неверный второй параметр %1 в функции %2: 
				|Имя реквизита должно быть заполнено.';
				|en = 'Invalid value of the %1 parameter, function %2:
				|The attribute name cannot be empty.'"), "ИмяРеквизита", "ESD_ТНОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта");
	КонецЕсли;
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные, КодЯзыка);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];
	
КонецФункции 

// Возвращает значения реквизитов, прочитанные из информационной базы для нескольких объектов.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылки - Массив из ЛюбаяСсылка
//         - ФиксированныйМассив из ЛюбаяСсылка - ссылки на объекты.
//           Если массив пуст, то результатом будет пустое соответствие.
//  Реквизиты - Строка - имена реквизитов перечисленные через запятую, в формате требований к свойствам
//                       структуры. Например, "Код, Наименование, Родитель".
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объектам выполняется с учетом прав пользователя;
//                                если какой-либо объект будет исключен из выборки по правам, то этот объект
//                                будет исключен и из результата;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - список объектов и значений их реквизитов:
//   * Ключ - ЛюбаяСсылка - ссылка на объект;
//   * Значение - Структура:
//    ** Ключ - Строка - имя реквизита;
//    ** Значение - Произвольный - значение реквизита.
// 
Функция ЗначенияРеквизитовОбъектов(Ссылки, Знач Реквизиты, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено) Экспорт
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Если ТипЗнч(Реквизиты) = Тип("Массив") Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		Реквизиты = МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(Реквизиты, ",");
	КонецЕсли;
	
	Если ПустаяСтрока(Реквизиты) Тогда 
		ВызватьИсключение МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
			НСтр("ru = 'Неверный второй параметр %1 в функции %2: 
				|Поле объекта должно быть указано.';
				|en = 'Invalid value of the %1 parameter, function %2:
				|The object field must be specified.'"), "Реквизиты", "ESD_ТНОбщегоНазначенияСервер.ЗначенияРеквизитовОбъектов");
	КонецЕсли;
	
	Если Найти(Реквизиты, ".") <> 0 Тогда 
		ВызватьИсключение МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(
			НСтр("ru = 'Неверный второй параметр %1 в функции %2: 
				|Обращение через точку не поддерживается.';
				|en = 'Invalid value of the %1 parameter, function %2:
				|Dot syntax is not supported.'"), "Реквизиты", "ESD_ТНОбщегоНазначенияСервер.ЗначенияРеквизитовОбъектов");
	КонецЕсли;
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если Ссылки.Количество() = 0 Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодЯзыка) Тогда
		КодЯзыка = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(КодЯзыка, "_", Истина)[0];
	КонецЕсли;
	
	РеквизитыТекстЗапроса = Реквизиты;
	
	СсылкиПоТипам = Новый Соответствие;
	Для Каждого Ссылка Из Ссылки Цикл
		Тип = ТипЗнч(Ссылка);
		Если СсылкиПоТипам[Тип] = Неопределено Тогда
			СсылкиПоТипам[Тип] = Новый Массив;
		КонецЕсли;
		ЭлементПоТипу = СсылкиПоТипам[Тип]; // Массив
		ЭлементПоТипу.Добавить(Ссылка);
	КонецЦикла;
	
	ТекстыЗапросов = Новый Массив;
	ПараметрыЗапроса = Новый Структура;
	
	СформироватьТекстыЗапросов(СсылкиПоТипам, ТекстыЗапросов, ПараметрыЗапроса, ВыбратьРазрешенные, РеквизитыТекстЗапроса);
	
	ТекстЗапроса = МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(
		ТекстыЗапросов, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КодЯзыка", КодЯзыка);
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(Реквизиты);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
		
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Преобразует таблицу значений в массив структур.
// Может использоваться для передачи на клиент данных в том случае, если таблица
// значений содержит только такие значения, которые могут
// быть переданы с сервера на клиент.
//
// Полученный массив содержит структуры, каждая из которых повторяет
// структуру колонок таблицы значений.
//
// Не рекомендуется использовать для преобразования таблиц значений
// с большим количеством строк.
//
// Параметры:
//  ТаблицаЗначений - ТаблицаЗначений - исходная таблица значений.
//
// Возвращаемое значение:
//  Массив - коллекция строк таблицы в виде структур.
//
Функция ТаблицаЗначенийВМассивЭПД(ТаблицаЗначений) Экспорт
	
	Массив = Новый Массив();
	Для Каждого Строка Из ТаблицаЗначений Цикл
		НоваяСтрока = Новый Структура;
		Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
			ЗначениеКолонки = Строка[Колонка.Имя];
			Если ТипЗнч(ЗначениеКолонки) = Тип("ТаблицаЗначений") Тогда
				ЗначениеКолонки = ТаблицаЗначенийВМассивЭПД(ЗначениеКолонки);
			КонецЕсли;
			НоваяСтрока.Вставить(Колонка.Имя, ЗначениеКолонки);
		КонецЦикла;
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Возврат Массив;

КонецФункции

// Единая точка входа для всего функционала описанного в модулях перечислений
//
// Параметры:
//  ИмяМетаданных - Строка - имя метаданных документа
//  ИмяФункции - Строка - имя функции описанной в данном модуле
//  Параметр1 - Произвольный - первый параметр вызываемой функции
//  Параметр2 - Произвольный - второй параметр вызываемой функции
//  Параметр3 - Произвольный - третий параметр вызываемой функции
//
// Возвращаемое значение:
//   Произвольный - зависит от конкретной вызванной функции
//
Функция РезультатФункцииТитулов(ИмяМетаданных, ИмяФункции,
		Параметр1 = Неопределено, Параметр2 = Неопределено, Параметр3 = Неопределено) Экспорт
		
	Если ИмяМетаданных = ТранспортнаяНакладная() Тогда
		Возврат МодульКода("Перечисления.ESD_ТипТитулаЭтрН").РезультатФункцииТитуловЭТрН(ИмяФункции, Параметр1, Параметр2, Параметр3);
	ИначеЕсли ИмяМетаданных = ПутевойЛист() Тогда
		Возврат МодульКода("Перечисления.ESD_ТипТитулаЭПЛ").РезультатФункцииТитуловЭПЛ(ИмяФункции, Параметр1, Параметр2, Параметр3);
	ИначеЕсли ИмяМетаданных = ЗаказНаПеревозку() Тогда
		Возврат МодульКода("Перечисления.ESD_ТипТитулаЗнП").РезультатФункцииТитуловЗнП(ИмяФункции, Параметр1, Параметр2, Параметр3);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПрочитатьПоОбъекту(ОбъектИС, Сервис = "", Аккаунт = "") Экспорт
	
	Возврат Новый Структура("Объект,Сервис,Аккаунт,АктивныйЭтап,Состояние,UID,SbisId");
	
КонецФункции

#Область Пользователи

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с пользователями.

// Только для внутреннего использования.
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи
//  СправочникСсылка.ВнешниеПользователи
//
Функция ТекущийПользователь() Экспорт
	
	Если ТипЗнч(ПараметрыСеанса) = Тип("Структура") Тогда
		ТекущийВнешнийПользователь = Неопределено;
		ПараметрыСеанса.Свойство("ТекущийВнешнийПользователь", ТекущийВнешнийПользователь);
		ТекущийПользователь = Неопределено;
		ПараметрыСеанса.Свойство("ТекущийПользователь", ТекущийПользователь);
	ИначеЕсли ТипЗнч(ПараметрыСеанса) = Тип("Соответствие") Тогда
		ТекущийВнешнийПользователь = ПараметрыСеанса["ТекущийВнешнийПользователь"];
		ТекущийПользователь = ПараметрыСеанса["ТекущийПользователь"];
	Иначе
		ТекущийВнешнийПользователь = Неопределено;
		ТекущийПользователь = Неопределено;
	КонецЕсли;
	
	РезультатФункции = ТекущийВнешнийПользователь;
	Если Не ЗначениеЗаполнено(РезультатФункции) Тогда
		РезультатФункции = ТекущийПользователь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РезультатФункции) Тогда
		РезультатФункции = ПользовательПоПользователюИнформационнойБазы();
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПользовательПоПользователюИнформационнойБазы() Экспорт
	
	РезультатФункции = Неопределено;
	СправочникПользователи = Метаданные.Справочники.Найти("Пользователи");
	Если СправочникПользователи = Неопределено 
		Или СправочникПользователи.Реквизиты.Найти("ИдентификаторПользователяИБ") = Неопределено Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ПользовательИнформационнойБазы = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	
	ЗапросДанных.УстановитьПараметр("ИдентификаторПользователяИБ", ПользовательИнформационнойБазы.УникальныйИдентификатор);
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ВыборкаДанных.Следующий() Тогда
		РезультатФункции = ВыборкаДанных.Ссылка;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // Пользователи

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ПараметрыДаты
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ПараметрыДаты

#Область ЗаполнениеНаОснованииИспользуяНастройкиСопоставления

Функция СтруктураЗаполненияНаОснованииНовогоРедактора(МассивОснований) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("НовыйРедактор",   Истина);
	РезультатФункции.Вставить("МассивОснований", МассивОснований);
	РезультатФункции.Вставить("ТипТитула",       Неопределено);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ЗаполнениеНаОснованииПоНовомуРедактору(Форма, СсылкаНаОснование) Экспорт
	
	МассивОснованийДляЗаполнения = ДанныеОснованийДляЗаполненияНаОснованииINI(СсылкаНаОснование);
	МассивОснований = Новый Массив;
	Для Каждого СтруктураОснования Из МассивОснованийДляЗаполнения Цикл
		МассивОснований.Добавить(СтруктураОснования.Основание);
	КонецЦикла;
	
	ОбъектЗаполнения = Форма.РеквизитФормыВЗначение("Объект");
	
	СтруктураЗаполнения = СтруктураЗаполненияНаОснованииНовогоРедактора(МассивОснований);
	ОбъектЗаполнения.Заполнить(СтруктураЗаполнения);
	
	НеобходимоЗаполнитьСсылкуНаОснование = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(
		ОбъектЗаполнения, "ДокументОснование_ОбъектМетаданных");
		
	Если НеобходимоЗаполнитьСсылкуНаОснование Тогда
		ОбъектЗаполнения.ДокументОснование_ОбъектМетаданных = СсылкаНаОснование.Метаданные().Имя;
		ОбъектЗаполнения.ДокументОснование_Идентификатор    = СсылкаНаОснование.УникальныйИдентификатор();
	КонецЕсли;
	
	Форма.ЗначениеВРеквизитФормы(ОбъектЗаполнения, "Объект");
	
	Форма.ПриЧтенииСозданииПослеЗаписиНаСервере();
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ОК",        Истина);
	РезультатФункции.Вставить("Ошибка",    "");
	РезультатФункции.Вставить("Ссылка",    Неопределено);
	РезультатФункции.Вставить("Основание", Неопределено);
	
	Если ОбъектЗаполнения.ДополнительныеСвойства.Свойство("ОшибкаСопоставления") Тогда
		
		РезультатФункции.ОК = Ложь;
		РезультатФункции.Ошибка    = ОбъектЗаполнения.ДополнительныеСвойства.ОшибкаСопоставления.Текст;
		РезультатФункции.Ссылка    = ОбъектЗаполнения.ДополнительныеСвойства.ОшибкаСопоставления.Ссылка;
		РезультатФункции.Основание = ОбъектЗаполнения.ДополнительныеСвойства.ОшибкаСопоставления.Основание;
		
	КонецЕсли;
		
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗаполнитьНаОснованииИспользуяНастройкиСопоставления(ОбъектЗаполнения, ДанныеЗаполнения) Экспорт
	
	ДоступныеПоля = ОбъектЗаполнения.ДоступныеПоляПоЭтапу(ДанныеЗаполнения.ТипТитула);
	
	МассивРассчитанныхОснований = Новый Массив;
	Для Каждого СсылкаНаОснование Из ДанныеЗаполнения.МассивОснований Цикл
		
		МетаданныеОбъекта = ОбъектЗаполнения.Метаданные();
		Источник = СсылкаНаОснование.Метаданные().ПолноеИмя();
		Приемник = МетаданныеОбъекта.ПолноеИмя();
		
		ОбъектНастроекСопоставлений = МодульКода("Справочники.ESD_НастройкиСопоставлений").СсылкаПоИсточникуПриемнику(
			Источник, Приемник);
		Если Не ЗначениеЗаполнено(ОбъектНастроекСопоставлений) Тогда
			ОбъектНастроекСопоставлений = МодульКода("Справочники.ESD_НастройкиСопоставлений").СсылкаПоИсточникуПриемнику(
				"", Приемник);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ОбъектНастроекСопоставлений) Тогда
			СообщитьПользователюСервер("Нет настроек сопоставления для объекта: " + Источник);
			Продолжить;
		КонецЕсли;
		
		ОбъектНастроекСопоставлений = ОбъектНастроекСопоставлений.ПолучитьОбъект();
		ОбъектНастроекСопоставлений.Источник = Источник;
		РезультатРасчетаПолей = ОбъектНастроекСопоставлений.РезультатРасчетаПолей(СсылкаНаОснование);
		
		ОшибкиРасчета = РезультатРасчетаПолей["Ошибки"];
		Если ЗначениеЗаполнено(ОшибкиРасчета) Тогда
			
			ТекстОшибки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(ОшибкиРасчета, "; ");
			
			ОшибкаСопоставления = Новый Структура;
			ОшибкаСопоставления.Вставить("Текст",     ТекстОшибки);
			ОшибкаСопоставления.Вставить("Ссылка",    ОбъектНастроекСопоставлений.Ссылка);
			ОшибкаСопоставления.Вставить("Основание", СсылкаНаОснование);
			ОбъектЗаполнения.ДополнительныеСвойства.Вставить("ОшибкаСопоставления", ОшибкаСопоставления);
			
		КонецЕсли;
		
		ОставитьТолькоДоступныеПоляПоЭтапу(РезультатРасчетаПолей, ДоступныеПоля);
		
		МассивРассчитанныхОснований.Добавить(РезультатРасчетаПолей);
		
	КонецЦикла;
	
	ПередЗаполнением(ОбъектЗаполнения, ДанныеЗаполнения, ДоступныеПоля);
	
	ПервоеОснование = Истина;
	Для Каждого РезультатРасчетаПолей Из МассивРассчитанныхОснований Цикл
		ОбъектЗаполнения.ЗаполнитьНаОснованииРасчетаСопоставлений(РезультатРасчетаПолей, ДанныеЗаполнения.ТипТитула, ПервоеОснование);
		ПервоеОснование = Ложь;
	КонецЦикла;
	
	// Место группировки грузов
	СгрупироватьГрузПоОснованиям(ОбъектЗаполнения, МассивРассчитанныхОснований);
	
КонецПроцедуры

Процедура ПередЗаполнением(ОбъектЗаполнения, ДанныеЗаполнения, ДоступныеПоля) Экспорт
	
	МетаданныеОбъекта = ОбъектЗаполнения.Метаданные();
	
	ЭтоПервыйТитул = РезультатФункцииТитулов(МетаданныеОбъекта.Имя, "ЭтоПервыйТитул", ДанныеЗаполнения.ТипТитула);
	Если ЭтоПервыйТитул = Неопределено Тогда
		ЭтоПервыйТитул = Истина;
	КонецЕсли;
	
	Если Не ЭтоПервыйТитул Тогда
		Возврат;
	КонецЕсли;
	
	НеобходимыеРеквизиты = Новый Соответствие;
	НеобходимыеРеквизиты.Вставить("Код",          Истина);
	НеобходимыеРеквизиты.Вставить("Наименование", Истина);
	
	Для Каждого СтандартныйРеквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		Если НеобходимыеРеквизиты.Получить(СтандартныйРеквизит.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОчиститьЕслиДоступно(ОбъектЗаполнения, СтандартныйРеквизит.Имя, ДоступныеПоля);
	КонецЦикла;
	
	РеквизитыИсключения = Новый Соответствие;
	РеквизитыИсключения.Вставить("ПЛПредыдущий", Истина);
	РеквизитыИсключения.Вставить("ПЛСледующий",  Истина);
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		Если РеквизитыИсключения[Реквизит.Имя] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОчиститьЕслиДоступно(ОбъектЗаполнения, Реквизит.Имя, ДоступныеПоля);
	КонецЦикла;
	
	ТЧИсключения = Новый Соответствие;
	ТЧИсключения.Вставить("ДанныеЮрЛиц", Истина);
	Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		Если ТЧИсключения[ТабличнаяЧасть.Имя] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОчиститьЕслиДоступно(ОбъектЗаполнения, ТабличнаяЧасть.Имя, ДоступныеПоля, Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьЕслиДоступно(ОбъектЗаполнения, ИмяРеквизита, ДоступныеПоля, ЭтоТабличнаяЧасть = Ложь) Экспорт
	
	РеквизитДоступен = ДоступныеПоля.Количество() = 0;
	Если ЭтоТабличнаяЧасть И РеквизитДоступен Тогда
		ОбъектЗаполнения[ИмяРеквизита].Очистить();
	КонецЕсли;
	
	РеквизитДоступен = РеквизитДоступен Или ДоступныеПоля[ИмяРеквизита] <> Неопределено;
	Если Не ЭтоТабличнаяЧасть И РеквизитДоступен Тогда
		ОбъектЗаполнения[ИмяРеквизита] = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыОбъекта(ОбъектЗаполнения, РезультатРасчетаПолей, Очищать) Экспорт
	
	МетаданныеОбъекта = ОбъектЗаполнения.Метаданные();
	
	Для Каждого КлючЗначение Из РезультатРасчетаПолей Цикл
		Если МетаданныеОбъекта.Реквизиты.Найти(КлючЗначение.Ключ) <> Неопределено
			Или ЕстьВСтандартныхРеквизитах(МетаданныеОбъекта.СтандартныеРеквизиты, КлючЗначение.Ключ) Тогда
			Значение = КлючЗначение.Значение;
			Если ТипЗнч(Значение) = Тип("Соответствие") Тогда
				Значение = Значение["Ссылка"];
			КонецЕсли;
			ОбъектЗаполнения[КлючЗначение.Ключ] = Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьВСтандартныхРеквизитах(СтандартныеРеквизиты, Реквизит) Экспорт
	
	РезультатФункции = Ложь;
	
	Для Каждого СтандартныйРеквизит Из СтандартныеРеквизиты Цикл
		РезультатФункции = РезультатФункции Или СтандартныйРеквизит.Имя = Реквизит;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗаполнитьДанныеЮрЛиц(ОбъектЗаполнения, РезультатРасчетаПолей, МассивЮрЛиц) Экспорт
	
	Для Каждого ИмяЮрЛица Из МассивЮрЛиц Цикл
		
		ДанныеЮрЛица = РезультатРасчетаПолей[ИмяЮрЛица];
		Если ДанныеЮрЛица = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОчиститьДанныеЮрЛиц(ОбъектЗаполнения, ИмяЮрЛица);
		
		ЗаполнитьДанныеЮрЛица(ОбъектЗаполнения, ДанныеЮрЛица, ИмяЮрЛица);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьДанныеЮрЛица(ОбъектЗаполнения, ДанныеЮрЛица, ИмяЮрЛица) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеЮрЛица) Тогда
		Возврат 0;
	КонецЕсли;
	
	КлючСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(ОбъектЗаполнения, "ДанныеЮрЛиц");
		
	СтрокаЮрЛица = ОбъектЗаполнения.ДанныеЮрЛиц.Добавить();
	ЗаполнитьЗначенияИзСоответствия(СтрокаЮрЛица, ДанныеЮрЛица);
	СтрокаЮрЛица.НаименованиеОрганизации = ДанныеЮрЛица["Наименование"];
	СтрокаЮрЛица.КлючСтроки = КлючСтроки;
	СтрокаЮрЛица.Роль = МодульКода("Перечисления.ESD_РолиКонтрагентов").РольПоИмени(ИмяЮрЛица);
	
	СтруктураФИО = МодульКода("ESD_ТНЗагрузкаСервер").СтруктураФИО(ДанныеЮрЛица);
	СтрокаЮрЛица.СтруктураФИО = ЗначениеВСтрокуВнутр(СтруктураФИО);
	
	КлючКонтактныеДанные = "КонтактныеДанные";
	Если ДанныеЮрЛица[КлючКонтактныеДанные] <> Неопределено Тогда
		Для Каждого СтруктураКонтактныхДанных Из ДанныеЮрЛица[КлючКонтактныеДанные] Цикл
			СтрокаКонтактныхДанных = ОбъектЗаполнения.КонтактныеДанные.Добавить();
			ЗаполнитьЗначенияИзСоответствия(СтрокаКонтактныхДанных, СтруктураКонтактныхДанных);
			СтрокаКонтактныхДанных.Роль = СтрокаЮрЛица.Роль;
			СтрокаКонтактныхДанных.КлючСтроки_ДанныеЮрЛиц = СтрокаЮрЛица.КлючСтроки;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтрокаЮрЛица.КлючСтроки;
	
КонецФункции

Процедура ОчиститьДанныеЮрЛиц(ОбъектЗаполнения, ИмяЮрЛица) Экспорт
	
	ОтборДанныеЮрЛиц = Новый Структура;
	ОтборДанныеЮрЛиц.Вставить("Роль", МодульКода("Перечисления.ESD_РолиКонтрагентов").РольПоИмени(ИмяЮрЛица));
	
	ОтборКонтактныхДанных = Новый Структура;
	ОтборКонтактныхДанных.Вставить("КлючСтроки_ДанныеЮрЛиц", "");
	
	СтрокиДанныеЮрЛиц = ОбъектЗаполнения.ДанныеЮрЛиц.НайтиСтроки(ОтборДанныеЮрЛиц);
	Для Каждого СтрокаДанныеЮрЛиц Из СтрокиДанныеЮрЛиц Цикл
		
		ОтборКонтактныхДанных.КлючСтроки_ДанныеЮрЛиц = СтрокаДанныеЮрЛиц.КлючСтроки;
		СтрокиКонтактныеДанные = ОбъектЗаполнения.КонтактныеДанные.НайтиСтроки(ОтборКонтактныхДанных);
		Для Каждого СтрокаКонтактныеДанные Из СтрокиКонтактныеДанные Цикл
			ОбъектЗаполнения.КонтактныеДанные.Удалить(СтрокаКонтактныеДанные);
		КонецЦикла;
		
		ОбъектЗаполнения.ДанныеЮрЛиц.Удалить(СтрокаДанныеЮрЛиц);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТранспортныеСредства(ОбъектЗаполнения, РезультатРасчетаПолей) Экспорт
	
	ТранспортноеСредство = РезультатРасчетаПолей["ТранспортноеСредство"];
	Если ТранспортноеСредство <> Неопределено Тогда
		ВидАвтомобиль = ЗначениеМетаданных("ESD_ВидыТС.Автомобиль");
		РегистрационныйНомер = ТранспортноеСредство["Наименование"];
		Если ЗначениеЗаполнено(РегистрационныйНомер) Тогда
			ОчиститьТранспортноеСредство(ОбъектЗаполнения, ВидАвтомобиль);
			СтрокаТранспортногоСредства = ОбъектЗаполнения.ТранспортныеСредства.Добавить();
			СтрокаТранспортногоСредства.Вид = ВидАвтомобиль;
			ЗаполнитьЗначенияИзСоответствия(СтрокаТранспортногоСредства, ТранспортноеСредство);
			СтрокаТранспортногоСредства.РегистрационныйНомер = РегистрационныйНомер;
			ЗаполнитьДокументыВладения(СтрокаТранспортногоСредства, ТранспортноеСредство);
		КонецЕсли;
	КонецЕсли;
	
	Прицепы = РезультатРасчетаПолей["Прицепы"];
	Если Прицепы <> Неопределено Тогда
		ВидПрицеп = ЗначениеМетаданных("ESD_ВидыТС.Прицеп");
		ОчиститьТранспортноеСредство(ОбъектЗаполнения, ВидПрицеп);
		Для Каждого Прицеп Из Прицепы Цикл
			Путь = Новый Массив;
			Путь.Добавить("Прицепы.Прицеп");
			Прицеп = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
				Прицеп, Путь, Новый Соответствие);
			СтрокаТранспортногоСредства = ОбъектЗаполнения.ТранспортныеСредства.Добавить();
			СтрокаТранспортногоСредства.Вид = ВидПрицеп;
			ЗаполнитьЗначенияИзСоответствия(СтрокаТранспортногоСредства, Прицеп);
			СтрокаТранспортногоСредства.РегистрационныйНомер = Прицеп["Наименование"];
			ЗаполнитьДокументыВладения(СтрокаТранспортногоСредства, Прицеп);
			Если Не ЗначениеЗаполнено(СтрокаТранспортногоСредства.РегистрационныйНомер) Тогда
				ОбъектЗаполнения.ТранспортныеСредства.Удалить(ОбъектЗаполнения.ТранспортныеСредства.Количество() - 1);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьТранспортноеСредство(ОбъектЗаполнения, Вид) Экспорт
	
	ОтборТранспорта = Новый Структура;
	ОтборТранспорта.Вставить("Вид", Вид);
	
	СтрокиТранспорта = ОбъектЗаполнения.ТранспортныеСредства.НайтиСтроки(ОтборТранспорта);
	Для Каждого СтрокаТранспорта Из СтрокиТранспорта Цикл
		ОбъектЗаполнения.ТранспортныеСредства.Удалить(СтрокаТранспорта);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДокументыВладения(СтрокаТранспортногоСредства, ТранспортноеСредство) Экспорт
	
	ДокументыВладения = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
		ТранспортноеСредство, "ДокументыВладения", Новый Массив);
	
	ОснованияВладения = Новый Массив;
	Для Каждого ДокументВладения Из ДокументыВладения Цикл
		Путь = Новый Массив;
		Путь.Добавить("ДокументыВладения.ДокументВладения");
		ДокументВладения = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеИзКоллекции(
			ДокументВладения, Путь, Новый Соответствие);
		Если ЗначениеЗаполнено(ДокументВладения["Ссылка"]) Тогда
			ОснованияВладения.Добавить(ДокументВладения["Ссылка"]);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОснованияВладения) Тогда
		СтрокаТранспортногоСредства.ОснованияВладения = ЗначениеВСтрокуВнутр(ОснованияВладения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВодителей(ОбъектЗаполнения, РезультатРасчетаПолей) Экспорт
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Водители = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(РезультатРасчетаПолей, "Водители", Новый Массив);
	
	РольВодитель = ЗначениеМетаданных("ESD_РолиОтветственных.Водитель");
	
	Если Водители.Количество() > 0 Тогда
		// Если в нескольких документах есть водитель, то берем водителя из последнего документа
		ОчиститьОтветственных(ОбъектЗаполнения, "Водитель");
	КонецЕсли;
	
	Для Каждого Водитель Из Водители Цикл
		Водитель = Водитель["Водители.Водитель"];
		КлючСтроки = МодульТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(ОбъектЗаполнения, "ОтветственныеЛица");
		СтрокаОтветственного = ОбъектЗаполнения.ОтветственныеЛица.Добавить();
		ЗаполнитьЗначенияИзСоответствия(СтрокаОтветственного, Водитель);
		ФИОЗаполнено = ЗначениеЗаполнено(СтрокаОтветственного.Фамилия)
			Или ЗначениеЗаполнено(СтрокаОтветственного.Имя)
			Или ЗначениеЗаполнено(СтрокаОтветственного.Отчество);
		Если Не ФИОЗаполнено Тогда
			ОбъектЗаполнения.ОтветственныеЛица.Удалить(ОбъектЗаполнения.ОтветственныеЛица.Количество() - 1);
			Продолжить;
		КонецЕсли;
		СтрокаОтветственного.Телефоны   = "";
		СтрокаОтветственного.КлючСтроки = КлючСтроки;
		СтрокаОтветственного.Роль       = РольВодитель;
		СтрокаОтветственного.Серия      = Водитель["СерияВУ"];
		СтрокаОтветственного.Номер      = Водитель["НомерВУ"];
		СтрокаОтветственного.ДатаВыдачи = Водитель["ДатаВыдачиВУ"];
		
		ЗаполнитьТелефоныОтветственногоЛица(СтрокаОтветственного, Водитель);
		
		Путь = Новый Массив;
		Путь.Добавить("Водители.ПутевыеЛисты");
		ПутевыеЛисты = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Водитель, Путь, Новый Массив);
		Для Каждого ПутевойЛист Из ПутевыеЛисты Цикл
			ПутевойЛист = ПутевойЛист["Водители.ПутевыеЛисты.Документ"];
			СтрокаПутевогоЛиста = ОбъектЗаполнения.ПутевыеЛисты.Добавить();
			СтрокаПутевогоЛиста.Документ = ПутевойЛист["Ссылка"];
			СтрокаПутевогоЛиста.КлючСтроки_ОтветственныеЛица = КлючСтроки;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьГрузы(ОбъектЗаполнения, РезультатРасчетаПолей) Экспорт
	
	ПолеГрузы = РезультатРасчетаПолей["Грузы"];
	Если ПолеГрузы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Груз Из ПолеГрузы Цикл
		
		КлючСтрокиЮрЛица = 0;
		ДанныеЗаказчика = Груз["Грузы.Заказчик"];
		Если ДанныеЗаказчика <> Неопределено Тогда
			КлючСтрокиЮрЛица = ЗаполнитьДанныеЮрЛица(ОбъектЗаполнения, ДанныеЗаказчика, "Заказчик");
		КонецЕсли;
		
		СтрокаГруза = ОбъектЗаполнения.Грузы.Добавить();
		ЗаполнитьЗначенияИзСоответствия(СтрокаГруза, Груз);
		СтрокаГруза.КлючСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НовыйКлючОсновнойСтроки(ОбъектЗаполнения, "Грузы");
		СтрокаГруза.КлючСтроки_ДанныеЮрЛиц = КлючСтрокиЮрЛица;
		
		ЗаполнитьПодчиненныеГрузуТаблицы(ОбъектЗаполнения, Груз, СтрокаГруза.КлючСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПодчиненныеГрузуТаблицы(ОбъектЗаполнения, Груз, КлючСтроки_Грузы) Экспорт
	
	ПодчиненныеТаблицы = Новый Массив;
	ПодчиненныеТаблицы.Добавить("Маркировки");
	ПодчиненныеТаблицы.Добавить("Контейнеры");
	ПодчиненныеТаблицы.Добавить("ОпасныеГрузы");
	ПодчиненныеТаблицы.Добавить("СведенияГосСистем");
	
	Для Каждого ИмяПодчиненнойТаблицы Из ПодчиненныеТаблицы Цикл
		ДанныеПодчиненнойТаблицы = Груз["Грузы." + ИмяПодчиненнойТаблицы];
		Если ДанныеПодчиненнойТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтруктураДанныхПодчиненнойТаблицы Из ДанныеПодчиненнойТаблицы Цикл
			СтрокаПодчиненнойТаблицы = ОбъектЗаполнения[ИмяПодчиненнойТаблицы].Добавить();
			ЗаполнитьЗначенияИзСоответствия(СтрокаПодчиненнойТаблицы, СтруктураДанныхПодчиненнойТаблицы);
			СтрокаПодчиненнойТаблицы.КлючСтроки_Грузы = КлючСтроки_Грузы;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОтветственных(ОбъектЗаполнения, РезультатРасчетаПолей, МассивОтветственных) Экспорт
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Для Каждого ИмяОтветственного Из МассивОтветственных Цикл
		Ответственный = РезультатРасчетаПолей[ИмяОтветственного];
		Если Ответственный = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Роль = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(ИмяОтветственного, "_");
		Роль = Роль[Роль.ВГраница()];
		
		ОчиститьОтветственных(ОбъектЗаполнения, Роль);
		
		СтрокаОтветственногоЛица = ОбъектЗаполнения.ОтветственныеЛица.Добавить();
		ЗаполнитьЗначенияИзСоответствия(СтрокаОтветственногоЛица, Ответственный);
		СтрокаОтветственногоЛица.КлючСтроки = МодульТНОбщегоНазначенияКлиентСервер.НовыйКлючОсновнойСтроки(
			ОбъектЗаполнения, "ОтветственныеЛица");
		СтрокаОтветственногоЛица.Роль = ЗначениеМетаданных("ESD_РолиОтветственных." + Роль);
		СтрокаОтветственногоЛица.Серия      = Ответственный["ЛицензияСерия"];
		СтрокаОтветственногоЛица.Номер      = Ответственный["ЛицензияНомер"];
		СтрокаОтветственногоЛица.ДатаВыдачи = Ответственный["ЛицензияДатаС"];
		Если МодульТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(СтрокаОтветственногоЛица, "ДатаОкончанияДействия") Тогда
			СтрокаОтветственногоЛица.ДатаОкончанияДействия = Ответственный["ЛицензияДатаПо"];
		КонецЕсли;
		
		СтрокаОтветственногоЛица.Телефоны = "";
		ЗаполнитьТелефоныОтветственногоЛица(СтрокаОтветственногоЛица, Ответственный);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьОтветственных(ОбъектЗаполнения, ИмяОтветственного) Экспорт
	
	ОтборОтветственного = Новый Структура;
	ОтборОтветственного.Вставить("Роль", ЗначениеМетаданных("ESD_РолиОтветственных." + ИмяОтветственного));
	
	ОтборПутевыхЛистов = Новый Структура;
	ОтборПутевыхЛистов.Вставить("КлючСтроки_ОтветственныеЛица", "");
	
	СтрокиОтветственных = ОбъектЗаполнения.ОтветственныеЛица.НайтиСтроки(ОтборОтветственного);
	Для Каждого СтрокаОтветственного Из СтрокиОтветственных Цикл
		ОтборПутевыхЛистов.КлючСтроки_ОтветственныеЛица = СтрокаОтветственного.КлючСтроки;
		Если МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ОбъектЗаполнения, "ПутевыеЛисты") Тогда
			СтрокиПутевыхЛистов = ОбъектЗаполнения.ПутевыеЛисты.НайтиСтроки(ОтборПутевыхЛистов);
			Для Каждого СтрокаПутевогоЛиста Из СтрокиПутевыхЛистов Цикл
				ОбъектЗаполнения.ПутевыеЛисты.Удалить(СтрокаПутевогоЛиста);
			КонецЦикла;
		КонецЕсли;
		ОбъектЗаполнения.ОтветственныеЛица.Удалить(СтрокаОтветственного);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТелефоныОтветственногоЛица(СтрокаОтветственного, ДанныеОтветственного) Экспорт
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Телефоны = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеОтветственного, "Телефоны", Новый Массив);
	МассивТелефонов = Новый Массив;
	Для Каждого ДанныеТелефона Из Телефоны Цикл
		Путь = Новый Массив;
		Путь.Добавить("Телефоны.Телефон");
		ЗначениеТелефона = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеТелефона, Путь);
		Если ЗначениеЗаполнено(ЗначениеТелефона) Тогда
			МассивТелефонов.Добавить(ЗначениеТелефона);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивТелефонов) Тогда
		СтрокаОтветственного.Телефоны = ЗначениеВСтрокуВнутр(МассивТелефонов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияИзСоответствия(Приемник, Источник) Экспорт
	
	Если ТипЗнч(Источник) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	ПрефиксМножественногоПоля = "";
	Для Каждого КлючЗначение Из Источник Цикл
		Ключ = КлючЗначение.Ключ;
		
		ПозицияТочки = Найти(Ключ, ".");
		Пока ПозицияТочки > 0 Цикл
			ПрефиксМножественногоПоля = ПрефиксМножественногоПоля + Лев(Ключ, ПозицияТочки);
			Ключ = Прав(Ключ, СтрДлина(Ключ) - ПозицияТочки);
			ПозицияТочки = Найти(Ключ, ".");
		КонецЦикла;
		
		Прервать;
	КонецЦикла;
	
	СтруктураДляЗаполнения = Новый Структура;
	Для Каждого КлючЗначение Из Источник Цикл
		Ключ = СтрЗаменить(КлючЗначение.Ключ, ПрефиксМножественногоПоля, "");
		Значение = КлючЗначение.Значение;
		Если ТипЗнч(Значение) = Тип("Соответствие") И ЗначениеЗаполнено(Значение["Ссылка"]) Тогда
			Значение = Значение["Ссылка"];
		КонецЕсли;
		СтруктураДляЗаполнения.Вставить(Ключ, Значение);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Приемник, СтруктураДляЗаполнения);
	
КонецПроцедуры

#Область ЗаполнениеСсылок

Процедура ЗаполнитьСсылкиНаОбъекты(РезультатРасчетаПолей) Экспорт
	
	ЗаполнитьСсылкиДокументовЭПД(РезультатРасчетаПолей);
	
	ЗаполнитьСсылкиВидовУпаковки(РезультатРасчетаПолей);
	
	ЗаполнитьСсылкиОпасныхГрузов(РезультатРасчетаПолей);
	
КонецПроцедуры

Процедура ЗаполнитьСсылкиДокументовЭПД(РезультатРасчетаПолей) Экспорт
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	МодульСправочникДокументыЭПД         = МодульКода("Справочники.ESD_ДокументыЭПД");
	
	ЗначениеДоговорПеревозки = ЗначениеМетаданных("ESD_ТипыДокумента.ДоговорПеревозки");

	МассивДанныхДокументовЭПД = Новый Массив;
	
	МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
		МассивДанныхДокументовЭПД,
		РезультатРасчетаПолей["Заказчик_Договор"],
		ЗначениеДоговорПеревозки);
		
	МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
		МассивДанныхДокументовЭПД,
		РезультатРасчетаПолей["Договор"],
		ЗначениеДоговорПеревозки);
		
	МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
		МассивДанныхДокументовЭПД,
		РезультатРасчетаПолей["ИнициаторПереадресацииПодтверждение"],
		ЗначениеМетаданных("ESD_ТипыДокумента.ПравоПереадресации"));
		
	МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
		МассивДанныхДокументовЭПД,
		РезультатРасчетаПолей["Отгрузка_НаОснованииДокумент"],
		ЗначениеМетаданных("ESD_ТипыДокумента.ПередачиЦенностей"));
		
	МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
		МассивДанныхДокументовЭПД,
		РезультатРасчетаПолей["Отгрузка_ОтветственныйНаОсновании"],
		ЗначениеМетаданных("ESD_ТипыДокумента.ОтветственныйНаОсновании"));
		
	МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
		МассивДанныхДокументовЭПД,
		РезультатРасчетаПолей["Отправитель_СопроводительнаяВедомость"],
		ЗначениеМетаданных("ESD_ТипыДокумента.СопроводительнаяВедомость"));
		
	МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
		МассивДанныхДокументовЭПД,
		РезультатРасчетаПолей["Составитель_НаОснованииДокумент"],
		ЗначениеМетаданных("ESD_ТипыДокумента.СоставительНаОсновании"));
		
	МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
		МассивДанныхДокументовЭПД,
		РезультатРасчетаПолей["ПредставительЗаказчика_Основание"],
		ЗначениеМетаданных("ESD_ТипыДокумента.СоставительНаОсновании"));
	
	ДокументыВладенияТС = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "ТранспортноеСредство.ДокументыВладения", Новый Массив);
	Для Каждого ДокументВладенияТС Из ДокументыВладенияТС Цикл
		МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
			МассивДанныхДокументовЭПД,
			ДокументВладенияТС["ДокументыВладения.ДокументВладения"],
			ЗначениеМетаданных("ESD_ТипыДокумента.ПодтверждениеВладения"));
	КонецЦикла;
	
	Водители = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(РезультатРасчетаПолей, "Водители", Новый Массив);
	Для Каждого Водитель Из Водители Цикл
		ДанныеПутевыхЛистов = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Водитель, "ПутевыеЛисты", Новый Массив);
		Для Каждого ПутевойЛист Из ДанныеПутевыхЛистов Цикл
			МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
				МассивДанныхДокументовЭПД,
				ПутевойЛист["Водители.ПутевыеЛисты.Документ"],
				ЗначениеМетаданных("ESD_ТипыДокумента.ПутевойЛист"));
		КонецЦикла;
	КонецЦикла;
	
	ДанныеОтметок = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(РезультатРасчетаПолей, "Отметки", Новый Массив);
	Для Каждого Отметка Из ДанныеОтметок Цикл
		ДанныеАктов = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Отметка, "Акты", Новый Массив);
		Для Каждого Акт Из ДанныеАктов Цикл
			МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(МассивДанныхДокументовЭПД, Акт["Отметки.Акты.Документ"]);
		КонецЦикла;
	КонецЦикла;
	
	ДанныеСопроводительныхДокументов = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "СопроводительныеДокументы", Новый Массив);
	Для Каждого СопроводительныйДокумент Из ДанныеСопроводительныхДокументов Цикл
		МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
			МассивДанныхДокументовЭПД,
			СопроводительныйДокумент["СопроводительныеДокументы.СопроводительныйДокумент"]);
	КонецЦикла;
	
	Прицепы = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(РезультатРасчетаПолей, "Прицепы", Новый Массив);
	Для Каждого Прицеп Из Прицепы Цикл
		Путь = Новый Массив;
		Путь.Добавить("Прицепы.Прицеп");
		Путь.Добавить("ДокументыВладения");
		ДокументыВладенияПрицепа = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(Прицеп, Путь, Новый Массив);
		Для Каждого ДокументВладенияПрицепа Из ДокументыВладенияПрицепа Цикл
			МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
				МассивДанныхДокументовЭПД,
				ДокументВладенияПрицепа["ДокументыВладения.ДокументВладения"],
				ЗначениеМетаданных("ESD_ТипыДокумента.ПодтверждениеВладения"));
		КонецЦикла;
	КонецЦикла;
	
	Грузы = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(РезультатРасчетаПолей, "Грузы", Новый Массив);
	Для Каждого Груз Из Грузы Цикл
		МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
			МассивДанныхДокументовЭПД, Груз["Грузы.Договор"], ЗначениеДоговорПеревозки);
	КонецЦикла;
		
	УполномоченныеЛицаЗаказчика = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
		РезультатРасчетаПолей, "УполномоченныеЛицаЗаказчика", Новый Массив);
	Для Каждого УполномоченноеЛицоЗаказчика Из УполномоченныеЛицаЗаказчика Цикл
		МодульСправочникДокументыЭПД.ДобавитьДанныеДокументаЭПД(
			МассивДанныхДокументовЭПД,
			УполномоченноеЛицоЗаказчика["УполномоченныеЛицаЗаказчика.Основание"],
			ЗначениеМетаданных("ESD_ТипыДокумента.УполномоченныйНаОсновании"));
	КонецЦикла;
	
	МодульСправочникДокументыЭПД.ЗаполнитьСсылкиДокументовЭПД(МассивДанныхДокументовЭПД);
	
КонецПроцедуры

Процедура ЗаполнитьСсылкиВидовУпаковки(РезультатРасчетаПолей) Экспорт
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	МассивДанныхВидовУпаковки = Новый Массив;
	
	ДанныеГрузов = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(РезультатРасчетаПолей, "Грузы", Новый Массив);
	Для Каждого ДанныеГруза Из ДанныеГрузов Цикл
		Путь = Новый Массив;
		Путь.Добавить("Грузы.ВидТары");
		ДанныеВидаУпаковки = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(
			ДанныеГруза, Путь, Новый Соответствие);
		МассивДанныхВидовУпаковки.Добавить(ДанныеВидаУпаковки);
	КонецЦикла;
	
	МодульКода("Справочники.ESD_ВидыУпаковки").ЗаполнитьСсылкиВидовУпаковкиНовыйРедактор(МассивДанныхВидовУпаковки);
	
КонецПроцедуры

Процедура ЗаполнитьСсылкиОпасныхГрузов(РезультатРасчетаПолей) Экспорт
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	МассивДанныхОпасныхГрузов = Новый Массив;
	
	ДанныеГрузов = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(РезультатРасчетаПолей, "Грузы", Новый Массив);
	Для Каждого ДанныеГруза Из ДанныеГрузов Цикл
		Путь = Новый Массив;
		Путь.Добавить("Грузы.ОпасныйГруз");
		ДанныеОпасныйГруз = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеГруза, Путь, Новый Соответствие);
		МассивДанныхОпасныхГрузов.Добавить(ДанныеОпасныйГруз);
		
		Путь = Новый Массив;
		Путь.Добавить("Грузы.ОпасныеГрузы");
		ДанныеОпасныхГрузов = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеГруза, Путь, Новый Массив);
		Для Каждого ДанныеОпасногоГруза Из ДанныеОпасныхГрузов Цикл
			Путь = Новый Массив;
			Путь.Добавить("Грузы.ОпасныеГрузы.ОпасныйГруз");
			ДанныеОпасныйГруз = МодульТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеОпасногоГруза, Путь, Новый Соответствие);
			МассивДанныхОпасныхГрузов.Добавить(ДанныеОпасныйГруз);
		КонецЦикла;
	КонецЦикла;
	
	МодульКода("Справочники.ESD_ОпасныеГрузы").ЗаполнитьСсылкиОпасныхГрузовНовыйРедактор(МассивДанныхОпасныхГрузов);
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеСсылок

Процедура ОставитьТолькоДоступныеПоляПоЭтапу(РезультатРасчетаПолей, ДоступныеПоля) Экспорт
	
	Если ДоступныеПоля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоляДляУдаления = Новый Массив;
	Для Каждого КлючЗначение Из РезультатРасчетаПолей Цикл
		Если ДоступныеПоля[КлючЗначение.Ключ] = Неопределено Тогда
			ПоляДляУдаления.Добавить(КлючЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ИмяПоля Из ПоляДляУдаления Цикл
		РезультатРасчетаПолей.Удалить(ИмяПоля);
	КонецЦикла;
	
	РезультатРасчетаПолей.Вставить("ДоступныеПоля", ДоступныеПоля);
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОснованииИспользуяНастройкиСопоставления

// Расчет ссылки на скачивание универсального расширения
// с учетом расширение это или конфигурация
// 
// Параметры:
// 	ИсходнаяСсылка - Строка - исходная ссылка из ядра
// 
// Возвращаемое значение:
// 	Строка - ссылка на скачивание ESD с учетом продукта 
// 
Функция СсылкаНаСкачиваниеУниверсальногоРасширения(ИсходнаяСсылка) Экспорт
	
	СсылкаНаСкачивание = "";
	Если Не ЗначениеЗаполнено(ИсходнаяСсылка) Тогда
		Возврат СсылкаНаСкачивание;
	КонецЕсли;
		
	// в CF нет функциональных опций	
	Если ЭтоCF() Тогда
		ФайлПродукта = "ESD_CF.cf";
	Иначе
		ФайлПродукта = "ESD.cfe";
	КонецЕсли;
	
	СсылкаПоЧастям = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ИсходнаяСсылка, "/");
	Если СсылкаПоЧастям.Количество() Тогда
		
		ПоследняяЧасть = СсылкаПоЧастям[СсылкаПоЧастям.ВГраница()];
		СсылкаПоЧастям.Удалить(СсылкаПоЧастям.ВГраница());
		Если СсылкаПоЧастям.Найти(ПоследняяЧасть) = Неопределено Тогда
			СсылкаПоЧастям.Добавить(ПоследняяЧасть);
		КонецЕсли;

		СсылкаПоЧастям.Добавить(ФайлПродукта);
		СсылкаНаСкачивание = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(СсылкаПоЧастям, "/");
		
	Иначе
		СсылкаНаСкачивание = ИсходнаяСсылка;
	КонецЕсли;	
	
	Возврат СсылкаНаСкачивание;
	
КонецФункции

Процедура ESD_УстановитьНомерДокумента(ОбъектДокумента) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектДокумента.Номер) Тогда
		ОбъектДокумента.УстановитьНовыйНомер();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОбъектДокумента.НомерСбис) Тогда
		ОбъектДокумента.НомерСбис = ОбъектДокумента.Номер;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоляПредставления(Поля) Экспорт
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("НомерСбис");
	Поля.Добавить("Ссылка");
	
КонецПроцедуры

Функция ПредставлениеДокумента(Данные) Экспорт
	
	РезультатФункции = "%1 %2 от %3";
	
	Номер = СокрЛП(Данные.НомерСбис);
	Если Не ЗначениеЗаполнено(Номер) Тогда
		Номер = СокрЛП(Данные.Номер);
	КонецЕсли;
	
	РезультатФункции = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
		РезультатФункции, Данные.Ссылка.Метаданные().Синоним, Номер, Формат(Данные.Дата));
		
	Возврат РезультатФункции;
		
КонецФункции

Процедура ОбновитьНастройкиДоТекущегоРелиза() Экспорт
	
	Если ЭтоУниверсальноеРасширение() Тогда
		Обработки.ESD_ВерсииНастроекСопоставлений.ОбновитьНастройкиДоТекущегоРелиза();
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоCF() Экспорт
	
	// Для старых конфигураций работающих на CF	
	ИмяОбработки = "ESD_РабочийСтол";	
	Возврат Метаданные.Обработки.Найти(ИмяОбработки) <> Неопределено;
	
КонецФункции

Функция РезультатСозданияДокументов(МассивДокументов, ТипДокумента) Экспорт
		
	ЗаголовокОперации = "Создание документов";
	
	ОбщееКоличество = МассивДокументов.Количество();
	НомерДокумента  = 0;
	Прогресс        = 0;
	СтоПроцентов    = 100;
	
	СтатусыДокументов_ = Новый Соответствие;
	Для Каждого Ссылка Из МассивДокументов Цикл
				
		НомерДокумента = НомерДокумента + 1;
		Статус         = 3; // ошибка
		ТекстОшибки    = "";
		
		ТекстСообщения = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
			"Документ %1 из %2 ", НомерДокумента, ОбщееКоличество);
		
		МодульКода("ESD_ДлительныеОперации").ЗаписатьПрогрессДлительнойОперации(
			ЗаголовокОперации, ТекстСообщения, Прогресс);
			
		НачатьТранзакцию();
			
		Попытка
			
			ПараметрыВыгрузки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыВыгрузки(Ссылка);
			ПараметрыВыгрузки.ИмяМетаданных = ТипДокумента;
			
			НовыйЗаполненныйДокументЭПД(ПараметрыВыгрузки);
			Статус = 1; // успешно
			
			ЗафиксироватьТранзакцию();
			
		Исключение

		    ОтменитьТранзакцию();
			ТекстОшибки = "Не удалось создать документ на основании : " + СокрЛП(Ссылка);
		
		КонецПопытки;
				
		Данные = Новый Структура();
		Данные.Вставить("Статус", Статус);
		Данные.Вставить("Ошибка", ТекстОшибки);
		
		СтатусыДокументов_.Вставить(Ссылка, Данные);
						
		Прогресс = Окр(НомерДокумента * СтоПроцентов / ОбщееКоличество, 0, РежимОкругления.Окр15как20);
		
	КонецЦикла;
	
	// финальное состояние
	МодульКода("ESD_ДлительныеОперации").ЗаписатьПрогрессДлительнойОперации(
			ЗаголовокОперации,
			"Создание завершено",
			СтоПроцентов);
	
	Возврат СтатусыДокументов_;
	
КонецФункции

Функция СсылкаНаОбъектОснование(ОбъектМетаданных, Идентификатор) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектМетаданных)
		Или Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Если Метаданные.Документы.Найти(ОбъектМетаданных) <> Неопределено Тогда
		Менеджер = Документы[ОбъектМетаданных];
	Иначе
		Менеджер = Справочники[ОбъектМетаданных];
	КонецЕсли;
	
	Возврат Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	
КонецФункции

Функция ОписаниеТипаСсылки(СсылкаНаОбъект) Экспорт
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("Строка") Тогда
		ИмяТипа = СсылкаНаОбъект;
	Иначе
		ИмяТипа = СсылкаНаОбъект.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	ИмяТипа = СтрЗаменить(ИмяТипа, "Справочник", "СправочникСсылка");
	ИмяТипа = СтрЗаменить(ИмяТипа, "Документ", "ДокументСсылка");
	
	Возврат Новый ОписаниеТипов(ИмяТипа);
	
КонецФункции

Функция ПолныеДанныеСсылкиИзБД(Ссылка) Экспорт
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МетаданныеСсылки = Ссылка.Метаданные();
	ОписаниеРеквизитов = ОписаниеРеквизитовПоСсылке(МетаданныеСсылки);
	ОписаниеРеквизитов.Вставить("ПолноеИмяМетаданных", МетаданныеСсылки.ПолноеИмя());
	
	ТекстЗапроса = ТекстЗапросаДанныхСсылкиИзБД(ОписаниеРеквизитов);
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокСсылок", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат РезультатЗапросаДанныхИзБД(Выборка, ОписаниеРеквизитов);	
КонецФункции

Функция ПолныеДанныеСсылокИзБД(СписокСсылок) Экспорт
	Результат = Новый Соответствие;
	
	Если Не ЗначениеЗаполнено(СписокСсылок) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОписанияРеквизитов = Новый Структура;
	Для Каждого Ссылка Из СписокСсылок Цикл
		МетаданныеСсылки = Ссылка.Метаданные();
		ПолноеИмяМетаданных = МетаданныеСсылки.ПолноеИмя();
		ПредставлениеИмениМетаданных = СтрЗаменить(ПолноеИмяМетаданных, ".", "");
		Если ОписанияРеквизитов.Свойство(ПредставлениеИмениМетаданных) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеРеквизитов = ОписаниеРеквизитовПоСсылке(МетаданныеСсылки);
		ОписаниеРеквизитов.Вставить("ПолноеИмяМетаданных", ПолноеИмяМетаданных);
		ОписанияРеквизитов.Вставить(ПредставлениеИмениМетаданных, ОписаниеРеквизитов); 
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапросаДанныхСсылокИзБД(ОписанияРеквизитов);
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокСсылок", СписокСсылок);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	i = 0;
	Для Каждого КлючЗначение Из ОписанияРеквизитов Цикл
		Выборка = РезультатЗапроса[i].Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Вставить(Выборка.Ссылка, РезультатЗапросаДанныхИзБД(Выборка, КлючЗначение.Значение));		
		КонецЦикла;
		i = i + 1;	
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_СлужебныйПрограммныйИнтерфейс
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_СлужебныйПрограммныйИнтерфейс

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_СлужебныеНастройки_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_СлужебныеНастройки_СлужебныеПроцедурыИФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_НастройкаФункционала_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_НастройкаФункционала_СлужебныеПроцедурыИФункции

#Область ЗаполнениеАдресов

Процедура ОбработатьЭлементАдресаКвартиры(ИсходнаяСтруктура, СтруктураАдреса)
	
	Если ИсходнаяСтруктура.Свойство("apartments") Тогда
		Для Каждого Данные Из ИсходнаяСтруктура.apartments Цикл
			Если Данные.type = "Г" Тогда
				СтруктураАдреса.Структура.Город = Данные.number;
			ИначеЕсли Данные.type = "Ул" Тогда
				СтруктураАдреса.Структура.Улица = Данные.number;
			ИначеЕсли Данные.type = "Квартира" Тогда
				СтруктураАдреса.Структура.Квартира = Данные.number;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьЭлементАдресаЗдания(ИсходнаяСтруктура, СтруктураАдреса)
	
	Если ИсходнаяСтруктура.Свойство("buildings") Тогда
		Для Каждого Данные Из ИсходнаяСтруктура.buildings Цикл
			Если Данные.type = "Корпус" Тогда
				СтруктураАдреса.Структура.Корпус = Данные.number;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеАдресов

Функция ESD_РолиДоступныБСП(Роли)
	Результат = Неопределено;
	
	Если Метаданные.ОбщиеМодули.Найти("Пользователи") <> Неопределено Тогда
		Попытка
			ОбщийМодульПользователи = Вычислить("Пользователи");
			Результат = ОбщийМодульПользователи.РолиДоступны(Роли, , Ложь);
			// BSLLS:MissingCodeTryCatchEx-off	
		Исключение
			Результат = Неопределено;
		КонецПопытки;
		// BSLLS:MissingCodeTryCatchEx-on
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция НаименованиеДлительнойОперации(Ключ)
	Наименование = Новый Соответствие;
	Наименование.Вставить("ВыгрузитьВСбис", НСтр("ru = 'Загрузка документов в SABY';
			                 					|en = 'Download documents to SABY'"));
	Наименование.Вставить("ОбновитьДокументИзСбис", НСтр("ru = 'Синхронизация документов из SABY';
			                 							|en = 'Document synchronization to SABY'"));
	Возврат Наименование.Получить(Ключ);	
КонецФункции

#Область ФизЛица

Процедура ПолучитьДанныеФизлиц(МассивФизлиц, МенеджерВременныхТаблиц)
	
	НоваяЗапись = Справочники.ФизическиеЛица.СоздатьЭлемент();
	ЕстьФИО = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(НоваяЗапись, "Фамилия");
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.УстановитьПараметр("МассивФизлиц",            МассивФизлиц);
	
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если ЕстьФИО Тогда
		ЗапросДанных.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВложенныйЗапрос.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВложенныйЗапрос.Фамилия КАК Фамилия,
		|	ВложенныйЗапрос.Имя КАК Имя,
		|	ВложенныйЗапрос.Отчество КАК Отчество,
		|	ВложенныйЗапрос.Порядок КАК Порядок
		|ПОМЕСТИТЬ ФИОФизлиц
		|ИЗ
		|	(ВЫБРАТЬ
		|		ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		|		ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		|		ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
		|		1 КАК Порядок
		|	ИЗ
		|		РегистрСведений.ФИОФизическихЛиц.СрезПоследних(, ФизическоеЛицо В (&МассивФизлиц)) КАК ФИОФизическихЛицСрезПоследних
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ФизическиеЛица.Ссылка,
		|		ФизическиеЛица.Фамилия,
		|		ФизическиеЛица.Имя,
		|		ФизическиеЛица.Отчество,
		|		2
		|	ИЗ
		|		Справочник.ФизическиеЛица КАК ФизическиеЛица
		|	ГДЕ
		|		ФизическиеЛица.Ссылка В (&МассивФизлиц)) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Порядок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо";
	Иначе
		ЗапросДанных.Текст =
		"ВЫБРАТЬ
		|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество
		|ПОМЕСТИТЬ ФИОФизлиц
		|ИЗ
		|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(, ФизическоеЛицо В (&МассивФизлиц)) КАК ФИОФизическихЛицСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо";
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ЗапросДанных.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
	|	ФизическиеЛица.Наименование КАК Наименование,
	|	ФизическиеЛица.ИНН КАК ИНН,
	|	ЕСТЬNULL(ФИОФизлиц.Фамилия, """") КАК Фамилия,
	|	ЕСТЬNULL(ФИОФизлиц.Имя, """") КАК Имя,
	|	ЕСТЬNULL(ФИОФизлиц.Отчество, """") КАК Отчество
	|ПОМЕСТИТЬ РеквизитыФизлиц
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФИОФизлиц КАК ФИОФизлиц
	|		ПО (ФИОФизлиц.ФизическоеЛицо = ФизическиеЛица.Ссылка)
	|ГДЕ
	|	ФизическиеЛица.Ссылка В(&МассивФизлиц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК ФизическоеЛицо,
	|	ФизическиеЛицаКонтактнаяИнформация.Тип КАК Тип,
	|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
	|ПОМЕСТИТЬ ТелефоныЭлектроннаяПочтаФизлиц
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|ГДЕ
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка В(&МассивФизлиц)
	|	И ФизическиеЛицаКонтактнаяИнформация.Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон), ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ФИОФизлиц";
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ЗапросДанных.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПолучитьВУФизлиц(МассивФизлиц, МенеджерВременныхТаблиц)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.УстановитьПараметр("МассивФизлиц", МассивФизлиц);
	ЗапросДанных.УстановитьПараметр(
		"ВодительскоеУдостоверение", Справочники.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение);
	
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК ФизическоеЛицо,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВУФизлиц
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	|			,
	|			Физлицо В (&МассивФизлиц)
	|				И ВидДокумента = &ВодительскоеУдостоверение) КАК ДокументыФизическихЛицСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо";
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ЗапросДанных.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ЮрЛица

Процедура ПолучитьДанныеЮрЛицИзБазы(МассивЮрЛиц, МенеджерВременныхТаблиц)
		
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЭтаКонфигурация = ЭтоДоступнаяКонфигурация();
	
	Если ЭтаКонфигурация.Имя = "ERP" Тогда
		
		ЗапросДанных.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Ссылка,
		|	ДополнительныеСведения.Значение КАК Значение
		|ПОМЕСТИТЬ ДопСведения
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект В(&МассивЮрЛиц)
		|	И ДополнительныеСведения.Свойство.Наименование = &ИмяСвойстваКодФилиала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Наименование КАК Наименование,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП,
		|	Контрагенты.СтранаРегистрации.Наименование КАК СтранаРегистрации,
		|	Контрагенты.РегистрационныйНомер КАК ОГРН,
		|	ВЫБОР
		|		КОГДА Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
		|			ТОГДА ""ЮрЛицо""
		|		КОГДА Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
		|			ТОГДА ""ИндивидуальныйПредприниматель""
		|		КОГДА Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент)
		|			ТОГДА ""ЮрЛицоНеРезидент""
		|		КОГДА Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
		|			ТОГДА ""ИндивидуальныйПредприниматель""
		|	КОНЕЦ КАК ЮрФизЛицо,
		|	ЕСТЬNULL(ДопСведения.Значение, """") КАК КодФилиала
		|ПОМЕСТИТЬ ДанныеЮрЛицИзБазы
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДопСведения КАК ДопСведения
		|		ПО Контрагенты.Ссылка = ДопСведения.Ссылка
		|ГДЕ
		|	Контрагенты.Ссылка В(&МассивЮрЛиц)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Организации.Ссылка,
		|	Организации.Наименование,
		|	Организации.ИНН,
		|	Организации.КПП,
		|	Организации.СтранаРегистрации.Наименование,
		|	Организации.ОГРН,
		|	ВЫБОР
		|		КОГДА Организации.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
		|			ТОГДА ""ЮрЛицо""
		|		КОГДА Организации.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
		|			ТОГДА ""ИндивидуальныйПредприниматель""
		|		КОГДА Организации.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент)
		|			ТОГДА ""ЮрЛицоНеРезидент""
		|		КОГДА Организации.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
		|			ТОГДА ""ИндивидуальныйПредприниматель""
		|	КОНЕЦ КАК ЮрФизЛицо,
		|	ЕСТЬNULL(ДопСведения.Значение, """")
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДопСведения КАК ДопСведения
		|		ПО Организации.Ссылка = ДопСведения.Ссылка
		|ГДЕ
		|	Организации.Ссылка В(&МассивЮрЛиц)";
		
	Иначе
		
		ЗапросДанных.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Ссылка,
		|	ДополнительныеСведения.Значение КАК Значение
		|ПОМЕСТИТЬ ДопСведения
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект В(&МассивЮрЛиц)
		|	И ДополнительныеСведения.Свойство.Наименование = &ИмяСвойстваКодФилиала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Наименование КАК Наименование,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП,
		|	Контрагенты.СтранаРегистрации.Наименование КАК СтранаРегистрации,
		|	Контрагенты.РегистрационныйНомер КАК ОГРН,
		|	ВЫБОР
		|		КОГДА Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
		|			ТОГДА ""ЮрЛицо""
		|		КОГДА Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
		|			ТОГДА ""ИндивидуальныйПредприниматель""
		|	КОНЕЦ КАК ЮрФизЛицо,
		|	ЕСТЬNULL(ДопСведения.Значение, """") КАК КодФилиала
		|ПОМЕСТИТЬ ДанныеЮрЛицИзБазы
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДопСведения КАК ДопСведения
		|		ПО Контрагенты.Ссылка = ДопСведения.Ссылка
		|ГДЕ
		|	Контрагенты.Ссылка В(&МассивЮрЛиц)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Организации.Ссылка,
		|	Организации.Наименование,
		|	Организации.ИНН,
		|	Организации.КПП,
		|	Организации.СтранаРегистрации.Наименование,
		|	Организации.ОГРН,
		|	ВЫБОР
		|		КОГДА Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
		|			ТОГДА ""ЮрЛицо""
		|		КОГДА Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
		|			ТОГДА ""ИндивидуальныйПредприниматель""
		|	КОНЕЦ,
		|	ЕСТЬNULL(ДопСведения.Значение, """")
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДопСведения КАК ДопСведения
		|		ПО Организации.Ссылка = ДопСведения.Ссылка
		|ГДЕ
		|	Организации.Ссылка В(&МассивЮрЛиц)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДопСведения";
		
		Если ЭтаКонфигурация.Имя = "УАТ" Тогда
			ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "Контрагенты.РегистрационныйНомер", "&ПустаяСтрока");
		КонецЕсли;
		
		Если ЭтаКонфигурация.Имя = "Бух3" Тогда
			
			ЗапросДанных.Текст = СтрЗаменить(
				ЗапросДанных.Текст,
				"	ВЫБОР
				|		КОГДА Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
				|			ТОГДА ""ЮрЛицо""
				|		КОГДА Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
				|			ТОГДА ""ФизЛицо""
				|	КОНЕЦ",
				"	ВЫБОР
				|		КОГДА Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
				|			ТОГДА ""ЮрЛицо""
				|			ИНАЧЕ ""ИндивидуальныйПредприниматель""
				|	КОНЕЦ");
				
			ЗапросДанных.Текст = СтрЗаменить(
				ЗапросДанных.Текст,
				"	ВЫБОР
				|		КОГДА Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
				|			ТОГДА ""ЮрЛицо""
				|		КОГДА Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
				|			ТОГДА ""ИндивидуальныйПредприниматель""
				|	КОНЕЦ",
				"	ВЫБОР
				|		КОГДА Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
				|			ТОГДА ""ЮрЛицо""
				|			ИНАЧЕ ""ИндивидуальныйПредприниматель""
				|	КОНЕЦ");
				
		КонецЕсли;
		
	КонецЕсли;
	
	ЗапросДанных.УстановитьПараметр("ПустаяСтрока", "");
	ЗапросДанных.УстановитьПараметр("МассивЮрЛиц",  МассивЮрЛиц);
	
	ЗапросДанных.УстановитьПараметр(
		"ИмяСвойстваКодФилиала",
		МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИмяСвойстваКодФилиала());
		
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ЗапросДанных.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПараметрыСторонДокумента(Стороны)
	
	МассивСторон = Новый Массив;
	Для Каждого Сторона Из Стороны Цикл
		
		ПараметрыСтороны = Новый Структура;
		ПараметрыСтороны.Вставить("Наименование", Сторона.НаименованиеОрганизации);
		
		// наименование органа исполнительной власти выдавшего документ
		// пока не храним это значение
		Если Сторона.ЮрФизЛицо = ЗначениеМетаданных("ESD_ЮрФизЛицо.ЮрЛицо")
			Или Сторона.ЮрФизЛицо = ЗначениеЮрФизЛицаКонфигурации("ЮрЛицо") Тогда
			
			ПараметрыСтороны.Вставить("ЮЛ", Новый Структура);
			ПараметрыСтороны.ЮЛ.Вставить("ИНН", Сторона.ИНН);
			
		ИначеЕсли Сторона.ЮрФизЛицо = ЗначениеМетаданных("ESD_ЮрФизЛицо.ЮрЛицоНеРезидент")
			Или Сторона.ЮрФизЛицо = ЗначениеЮрФизЛицаКонфигурации("ЮрЛицоНеРезидент") Тогда 
			
			СтруктураИнЛица = МодульКода("ESD_ТНВыгрузкаСервер").ШаблонИностранногоЛица();
			
			// Поиск будет только по наименованию
			СтруктураИнЛица.Страна       = СокрЛП(Сторона.СтранаРегистрации);
			СтруктураИнЛица.Наименование = Сторона.НаименованиеОрганизации;
			
			ПараметрыСтороны.Вставить("ИностранноеЛицо", СтруктураИнЛица);
			
		Иначе  
			
			// Физ или ИП
			ПараметрыСтороны.Вставить("ФЛ", Новый Структура);
			ПараметрыСтороны.ФЛ.Вставить("ИНН", Сторона.ИНН);
			
		КонецЕсли;
		
		МассивСторон.Добавить(ПараметрыСтороны);
		
	КонецЦикла;
	
	Возврат МассивСторон;
	
КонецФункции

Процедура ЗапросПоОрганизации(МассивЗапросов, КПП, Наименование)
	
	Если Метаданные.Справочники.Найти("Организации") = Неопределено Тогда
		Возврат;
	КонецЕсли;
				
	ТекстЗапросаОрганизации =
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка,
		|	1 КАК Порядок,
		|	ИСТИНА КАК ЭтоОрганизация
		|ПОМЕСТИТЬ НайденныеЮрЛица
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ИНН = &ИНН
		|	И 1 = 1";
	
	ЕстьИНН = Метаданные.Справочники["Организации"].Реквизиты.Найти("ИНН");
	ЕстьКПП = Метаданные.Справочники["Организации"].Реквизиты.Найти("КПП");
	
	НетИННиКПП = (ЕстьИНН = Неопределено) И (ЕстьКПП = Неопределено);
	
	Если ЕстьКПП <> Неопределено И ЗначениеЗаполнено(КПП) Тогда
		
		УсловиеКПП = "Организации.КПП = &КПП";
		ТекстЗапросаОрганизации = СтрЗаменить(ТекстЗапросаОрганизации, "1 = 1", УсловиеКПП);
		
	КонецЕсли;
	
	Если Не НетИННиКПП Тогда
		
		МассивЗапросов.Добавить(ТекстЗапросаОрганизации);
		
	ИначеЕсли ЗначениеЗаполнено(Наименование) Тогда
		
		ПоискОрганизацииПоНаименованию = 
			"ВЫБРАТЬ
			|	Организации.Ссылка КАК Ссылка,
			|	3 КАК Порядок,
			|	ИСТИНА КАК ЭтоОрганизация
			|ПОМЕСТИТЬ НайденныеЮрЛица
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Наименование = &Наименование";
		
		МассивЗапросов.Добавить(ПоискОрганизацииПоНаименованию);
		
	Иначе
		
		ТекстЗапросаОрганизации =
			"ВЫБРАТЬ
			|	Неопределено КАК Ссылка,
			|	99 КАК Порядок,
			|	ИСТИНА КАК ЭтоОрганизация
			|ПОМЕСТИТЬ НайденныеЮрЛица
			|ГДЕ
			|	ЛОЖЬ";
		
		МассивЗапросов.Добавить(ТекстЗапросаОрганизации);
		
	КонецЕсли;
			
КонецПроцедуры	

Процедура ЗапросПоКонтрагенту(МассивЗапросов, КПП, Наименование)

	Если Метаданные.Справочники.Найти("Контрагенты") = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	ТекстЗапросаКонтрагенты = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	2 КАК Порядок,
		|	ЛОЖЬ КАК ЭтоОрганизация
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН
		|   И 1 = 1";
	
	ЕстьИНН = Метаданные.Справочники["Контрагенты"].Реквизиты.Найти("ИНН");
	ЕстьКПП = Метаданные.Справочники["Контрагенты"].Реквизиты.Найти("КПП");
	
	НетИННиКПП = (ЕстьИНН = Неопределено) И (ЕстьКПП = Неопределено);
	
	Если ЕстьКПП <> Неопределено И ЗначениеЗаполнено(КПП) Тогда
		
		УсловиеКПП = "Контрагенты.КПП = &КПП";
		ТекстЗапросаКонтрагенты = СтрЗаменить(ТекстЗапросаКонтрагенты, "1 = 1", УсловиеКПП);
		
	КонецЕсли;
	
	Если Не НетИННиКПП Тогда
		
		МассивЗапросов.Добавить(ТекстЗапросаКонтрагенты);
		
	ИначеЕсли ЗначениеЗаполнено(Наименование) Тогда
	
		ПоискКонтрагентаПоНаименованию = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Ссылка,
			|	4 КАК Порядок,
			|	ЛОЖЬ КАК ЭтоОрганизация
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Наименование = &Наименование";
		
	    МассивЗапросов.Добавить(ПоискКонтрагентаПоНаименованию);
		
	Иначе		
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура ЗачиститьШтрафы(ОбъектДок, КлючиОтметокДляУдаления)
	
	Если Не МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ОбъектДок, "Штрафы") Тогда
		Возврат;
	КонецЕсли;
	
	ИндексШтрафы = ОбъектДок.Штрафы.Количество() - 1;
	Пока ИндексШтрафы >= 0 Цикл
				
		СтрокаШтраф = ОбъектДок.Штрафы[ИндексШтрафы];
			
		ЕстьСтрока = КлючиОтметокДляУдаления.Получить(СтрокаШтраф.КлючСтроки_Отметки);
		Если ЕстьСтрока <> Неопределено Тогда
			ОбъектДок.Штрафы.Удалить(ИндексШтрафы);
		КонецЕсли;
		
		ИндексШтрафы = ИндексШтрафы - 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗачиститьАкты(ОбъектДок, КлючиОтметокДляУдаления)
	
	Если Не МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(ОбъектДок, "Акты") Тогда
		Возврат;
	КонецЕсли;
	
	ИндексАкты = ОбъектДок.Акты.Количество() - 1;
	Пока ИндексАкты >= 0 Цикл
				
		СтрокаАкт = ОбъектДок.Акты[ИндексАкты];
			
		ЕстьСтрока = КлючиОтметокДляУдаления.Получить(СтрокаАкт.КлючСтроки_Отметки);
		Если ЕстьСтрока <> Неопределено  Тогда
			ОбъектДок.Акты.Удалить(ИндексАкты);
		КонецЕсли;
		
		ИндексАкты = ИндексАкты - 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьВремяВМассивДаты(МассивИтог, ЧастьВремя, ЕстьВремя, ФорматБезСмещения, СмещениеВСекундах)
	
	Если Не ЕстьВремя Тогда
		Возврат;
	КонецЕсли;
	
	ЧислоДвоеточийВДате = 2;
	
	Если ФорматБезСмещения Тогда 
		
		Время = ЧастьВремя;    
		Если СтрЧислоВхождений(ЧастьВремя, ":") = ЧислоДвоеточийВДате Тогда
			РазделительВремя = ":";
		Иначе
			РазделительВремя = ".";
		КонецЕсли;
		
	Иначе 
		
		// может быть +/-
		Если Найти(ЧастьВремя, "+") > 0 Тогда
			РазделительСмещение = "+";  
		Иначе 
			РазделительСмещение = "-";
		КонецЕсли;
				
		МассивВремени = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ЧастьВремя, РазделительСмещение);
		Время         = МассивВремени[0];
		Смещение      = МассивВремени[1];
		
		РазделительВремя = ":";
		
		СмещениеВходящее = Дата("00010101" + СтрЗаменить(Смещение, РазделительВремя, ""));
		СмещениеСеанса   = Дата("00010101") + СмещениеСтандартногоВремени(ЧасовойПоясСеанса());
		
		СмещениеВСекундах = СмещениеВходящее - СмещениеСеанса;
		
	КонецЕсли;
	
	ЧастиВремени = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(Время, РазделительВремя);
	МассивИтог.Добавить(ЧастиВремени[0]);
	МассивИтог.Добавить(ЧастиВремени[1]);
	МассивИтог.Добавить(ЧастиВремени[2]);
	
КонецПроцедуры

Функция ДатаБезВремениВСтандартномФормате(ДатаВходящая)
	
	// старый формат
	// 2023-02-02
	// 2023.01.03
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	Если Найти(ДатаВходящая, "-") <> 0 Тогда
		МассивЧастейДаты = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(ДатаВходящая, "-");
	Иначе
		МассивЧастейДаты = МодульТНОбщегоНазначенияКлиентСервер.СтрРазделитьЭПД(ДатаВходящая, ".");
	КонецЕсли;
	
	// формат может быть перевернут 03.01.2023
	КоличествоСимволовГод = 4;
	ФорматПеревернут = СтрДлина(МассивЧастейДаты[0]) = КоличествоСимволовГод;
	
	Если ФорматПеревернут Тогда
		КоличествоУдалить = МассивЧастейДаты.Количество();
		МассивЧастейДаты.Добавить(МассивЧастейДаты[2]);
		МассивЧастейДаты.Добавить(МассивЧастейДаты[1]);
		МассивЧастейДаты.Добавить(МассивЧастейДаты[0]);
		Пока КоличествоУдалить <> 0 Цикл
			МассивЧастейДаты.Удалить(0);
			КоличествоУдалить = КоличествоУдалить - 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(МассивЧастейДаты, ".");
	
КонецФункции

#Область ПолучениеДанныхПоСсылкеИзБазы

Функция ДанныеТранспортныхСредствИзКонфигурацииУАТ(МассивСсылокТС, МенеджерВременныхТаблицПереданный)
	
	МенеджерВременныхТаблиц = МенеджерВременныхТаблицПереданный;
	
	РезультатФункции = Новый Соответствие;
	Если МассивСсылокТС = Неопределено И МенеджерВременныхТаблиц = Неопределено Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ОчиститьМенеджерВременныхТаблиц = Ложь;
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		ОчиститьМенеджерВременныхТаблиц = Истина;
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗапросДанных = Новый Запрос;
		ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	уатТС.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТаблицаТранспортныхСредств
		|ИЗ
		|	Справочник.уатТС КАК уатТС
		|ГДЕ
		|	уатТС.Ссылка В(&МассивСсылокТС)";
		ЗапросДанных.УстановитьПараметр("МассивСсылокТС", МассивСсылокТС);
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
		ЗапросДанных.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ТранспортныеСредства.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ТранспортныеСредства.Ссылка.ВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Автотранспорт) ТОГДА ЗНАЧЕНИЕ(Перечисление.ESD_ВидыТС.Автомобиль)
	|		КОГДА ТранспортныеСредства.Ссылка.ВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Прицеп) ТОГДА ЗНАЧЕНИЕ(Перечисление.ESD_ВидыТС.Прицеп)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ESD_ВидыТС.ПустаяСсылка)
	|	КОНЕЦ КАК Вид,
	|	ТранспортныеСредства.Ссылка.ГосударственныйНомер КАК РегистрационныйНомер,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТранспортныеСредства.Ссылка.ТипТС) КАК Тип,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТранспортныеСредства.Ссылка.Марка) КАК Марка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТранспортныеСредства.Ссылка.Модель) КАК Модель,
	|	ТранспортныеСредства.Ссылка.VIN КАК ВИН,
	|	ЕСТЬNULL(РегистрСведенийуатДокументыТС.Серия, """") + ЕСТЬNULL(РегистрСведенийуатДокументыТС.Номер, """") КАК НомерСТС,
	|	ТранспортныеСредства.Ссылка.Грузоподъемность КАК Грузоподъемность,
	|	ТранспортныеСредства.Ссылка.ПолезныйРазмерВысота / 1000 * ТранспортныеСредства.Ссылка.ПолезныйРазмерДлина / 1000 * ТранспортныеСредства.Ссылка.ПолезныйРазмерШирина / 1000 КАК Вместимость,
	|	ВЫБОР
	|		КОГДА ТранспортныеСредства.Ссылка.ТипВладенияТС = ЗНАЧЕНИЕ(Перечисление.уатТипыВладенияТС.Собственность) ТОГДА ЗНАЧЕНИЕ(Перечисление.ESD_ТипыВладенияТС.Собственность)
	|		КОГДА ТранспортныеСредства.Ссылка.ТипВладенияТС = ЗНАЧЕНИЕ(Перечисление.уатТипыВладенияТС.СовместнаяСобственностьСупругов) ТОГДА ЗНАЧЕНИЕ(Перечисление.ESD_ТипыВладенияТС.СовместнаяСобственностьСупругов)
	|		КОГДА ТранспортныеСредства.Ссылка.ТипВладенияТС = ЗНАЧЕНИЕ(Перечисление.уатТипыВладенияТС.Аренда) ТОГДА ЗНАЧЕНИЕ(Перечисление.ESD_ТипыВладенияТС.Аренда)
	|		КОГДА ТранспортныеСредства.Ссылка.ТипВладенияТС = ЗНАЧЕНИЕ(Перечисление.уатТипыВладенияТС.Лизинг) ТОГДА ЗНАЧЕНИЕ(Перечисление.ESD_ТипыВладенияТС.Лизинг)
	|		КОГДА ТранспортныеСредства.Ссылка.ТипВладенияТС = ЗНАЧЕНИЕ(Перечисление.уатТипыВладенияТС.БезвозмездноеПользование) ТОГДА ЗНАЧЕНИЕ(Перечисление.ESD_ТипыВладенияТС.БезвозмездноеПользование)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ESD_ТипыВладенияТС.ПустаяСсылка)
	|	КОНЕЦ КАК ТипВладения
	|ИЗ
	|	ТаблицаТранспортныхСредств КАК ТранспортныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатРегистрационныеДокументы КАК РегистрСведенийуатДокументыТС
	|		ПО ТранспортныеСредства.Ссылка = РегистрСведенийуатДокументыТС.ВладелецДокументов
	|			И РегистрСведенийуатДокументыТС.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|			И РегистрСведенийуатДокументыТС.ДатаОкончания <= &ТекущаяДата
	|			И ВидДокумента = ЗНАЧЕНИЕ(Справочник.уатВидыДокументов.СТС)";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ВидыТС", ВидыТС());
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ТипыВладенияТС", ТипыВладенияТС());
		
	ЕстьГрузоподъемность = МодульТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(
		Справочники["уатТС"].ПустаяСсылка(), "Грузоподъемность");
		
	Если Не ЕстьГрузоподъемность Тогда
		
		ЗапросДанных.Текст = СтрЗаменить(
			ЗапросДанных.Текст,
			"ТранспортныеСредства.Ссылка.Грузоподъемность",
			"0");
		
	КонецЕсли;	
	
	ЗапросДанных.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока ВыборкаДанных.Следующий() Цикл
		СтруктураТС = МодульТНОбщегоНазначенияКлиентСервер.СтруктураТранспортногоСредства();
		ЗаполнитьЗначенияСвойств(СтруктураТС, ВыборкаДанных);
		РезультатФункции.Вставить(ВыборкаДанных.Ссылка, СтруктураТС);
	КонецЦикла;
	
	Если ОчиститьМенеджерВременныхТаблиц Тогда
		МенеджерВременныхТаблиц.Закрыть();
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДанныеТранспортныхСредствИзДругихКонфигураций(МассивСсылокТС, МенеджерВременныхТаблицПереданный = Неопределено)
	
	МенеджерВременныхТаблиц = МенеджерВременныхТаблицПереданный;
	
	ЕстьСправочникТранспортныхСредств = Метаданные.Справочники.Найти("ТранспортныеСредства") <> Неопределено;
	Если Не ЕстьСправочникТранспортныхСредств Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В конфигурации не найден справочник транспортных средств";
		Сообщение.Сообщить();
	КонецЕсли;
	
	РезультатФункции = Новый Соответствие;
	Если Не ЕстьСправочникТранспортныхСредств Или (МассивСсылокТС = Неопределено И МенеджерВременныхТаблиц = Неопределено) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

	ЕстьВид = МодульТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(
		Справочники.ТранспортныеСредства.ПустаяСсылка(), "Вид");
	
	Если Не ЕстьВид Тогда
		Возврат ДанныеТранспортныхСредствИзДругихКонфигурацийБезРасширения(МассивСсылокТС);
	КонецЕсли;
	
	ОчиститьМенеджерВременныхТаблиц = Ложь;
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		ОчиститьМенеджерВременныхТаблиц = Истина;
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗапросДанных = Новый Запрос;
		ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ТранспортныеСредства.Ссылка КАК Ссылка,
		|	ТранспортныеСредства.Вид КАК Вид
		|ПОМЕСТИТЬ ТаблицаТранспортныхСредств
		|ИЗ
		|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
		|ГДЕ
		|	ТранспортныеСредства.Ссылка В(&МассивСсылокТС)";
		ЗапросДанных.УстановитьПараметр("МассивСсылокТС", МассивСсылокТС);
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
		ЗапросДанных.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ТранспортныеСредства.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ТранспортныеСредства.Ссылка.Вид = ЗНАЧЕНИЕ(Перечисление.ESD_ВидыТС.ПустаяСсылка)
	|		ТОГДА ТранспортныеСредства.Вид
	|		ИНАЧЕ ТранспортныеСредства.Ссылка.Вид
	|	КОНЕЦ КАК Вид,
	|	ТранспортныеСредства.Ссылка.Код КАК РегистрационныйНомер,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТранспортныеСредства.Ссылка.Тип) КАК Тип,
	|	ТранспортныеСредства.Ссылка.Марка КАК Марка,
	|	ТранспортныеСредства.Ссылка.VIN КАК ВИН,
	|	ТранспортныеСредства.Ссылка.НомерСТС КАК НомерСТС,
	|	ТранспортныеСредства.Ссылка.ГрузоподъемностьВТоннах КАК Грузоподъемность,
	|	ТранспортныеСредства.Ссылка.ВместимостьВКубическихМетрах КАК Вместимость,
	|	ТранспортныеСредства.Ссылка.ТипВладения КАК ТипВладения,
	|	ТранспортныеСредства.Ссылка.ДокументыПодтверждающиеВладение.(
	|		ДокументВладения КАК ДокументВладения
	|	) КАК ОснованияВладения
	|ИЗ
	|	ТаблицаТранспортныхСредств КАК ТранспортныеСредства";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ВидыТС", ВидыТС());
	
	ЕстьРегистрационныйЗнак = МодульТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(
		Справочники.ТранспортныеСредства.ПустаяСсылка(), "РегистрационныйЗнак");
	
	Если ЕстьРегистрационныйЗнак Тогда
		ЗапросДанных.Текст = СтрЗаменить(
			ЗапросДанных.Текст,
			"ТранспортныеСредства.Ссылка.Код",
			"ТранспортныеСредства.Ссылка.РегистрационныйЗнак");
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока ВыборкаДанных.Следующий() Цикл
		СтруктураТС = МодульТНОбщегоНазначенияКлиентСервер.СтруктураТранспортногоСредства();
		ЗаполнитьЗначенияСвойств(СтруктураТС, ВыборкаДанных, , "ОснованияВладения");
		ВыборкаОснованийВладения = ВыборкаДанных.ОснованияВладения.Выбрать();
		МассивОснований = Новый Массив;
		Пока ВыборкаОснованийВладения.Следующий() Цикл
			МассивОснований.Добавить(ВыборкаОснованийВладения.ДокументВладения);
		КонецЦикла;
		Если МассивОснований.Количество() > 0 Тогда
			СтруктураТС.ОснованияВладения = ЗначениеВСтрокуВнутр(МассивОснований);
		КонецЕсли;
		РезультатФункции.Вставить(ВыборкаДанных.Ссылка, СтруктураТС);
	КонецЦикла;
	
	Если ОчиститьМенеджерВременныхТаблиц Тогда
		МенеджерВременныхТаблиц.Закрыть();
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДанныеТранспортныхСредствИзДругихКонфигурацийБезРасширения(МассивСсылокТС)
	
	РезультатФункции = Новый Соответствие;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.УстановитьПараметр("МассивСсылокТС", МассивСсылокТС);
	
	ЗапросДанных.Текст = 
	"ВЫБРАТЬ *
	|ИЗ
	|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	|ГДЕ
	|	ТранспортныеСредства.Ссылка В(&МассивСсылокТС)";
	
	ПустаяСсылка = Справочники.ТранспортныеСредства.ПустаяСсылка();
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");

	ЕстьРегистрационныйЗнак = МодульТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(
		ПустаяСсылка, "РегистрационныйЗнак");
			
	ЕстьГрузоподъемность = МодульТНОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойство(
		ПустаяСсылка, "ГрузоподъемностьВТоннах");
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока ВыборкаДанных.Следующий() Цикл
		
		СтруктураТС = МодульТНОбщегоНазначенияКлиентСервер.СтруктураТранспортногоСредства();
		ЗаполнитьЗначенияСвойств(СтруктураТС, ВыборкаДанных);
		
		Если ЗначениеЗаполнено(СтруктураТС.Тип) Тогда
			СтруктураТС.Тип = СокрЛП(СтруктураТС.Тип);
		КонецЕсли;	
		
		Если ЕстьГрузоподъемность Тогда 
			СтруктураТС.Грузоподъемность = ВыборкаДанных.ГрузоподъемностьВТоннах; 
			СтруктураТС.Вместимость      = ВыборкаДанных.ВместимостьВКубическихМетрах;
		КонецЕсли;	
		
		Если ЕстьРегистрационныйЗнак Тогда
			СтруктураТС.РегистрационныйНомер = ВыборкаДанных.РегистрационныйЗнак;
		Иначе 
			СтруктураТС.РегистрационныйНомер = ВыборкаДанных.Код;
		КонецЕсли;
				
		РезультатФункции.Вставить(ВыборкаДанных.Ссылка, СтруктураТС);
		
	КонецЦикла;
		
	Возврат РезультатФункции;
	
КонецФункции

Функция ОписаниеРеквизитовПоСсылке(МетаданныеСсылки)
	СписокРеквизитов = Новый Массив;
	Реквизиты = МетаданныеСсылки.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		СписокРеквизитов.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	СписокТабличныхЧастей = Новый Соответствие;
	ТабличныеЧасти = МетаданныеСсылки.ТабличныеЧасти;
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		РеквизитыТЧ = Новый Массив;
		Для Каждого РеквизитТЧ Из ТабличнаяЧасть.Реквизиты Цикл 
			РеквизитыТЧ.Добавить(РеквизитТЧ.Имя);	
		КонецЦикла;
		СписокТабличныхЧастей.Вставить(ТабличнаяЧасть.Имя, РеквизитыТЧ);	
	КонецЦикла;
	
	Возврат Новый Структура("Реквизиты,ТабличныеЧасти", СписокРеквизитов, СписокТабличныхЧастей);
КонецФункции

Функция РезультатЗапросаДанныхИзБД(Выборка, ОписаниеРеквизитов)
	ДанныеСсылки = Новый Структура;
	
	Реквизиты = Новый Структура;
	Для Каждого ИмяРеквизита Из ОписаниеРеквизитов.Реквизиты Цикл
		Реквизиты.Вставить(ИмяРеквизита, Выборка[ИмяРеквизита]);				
	КонецЦикла;
	ДанныеСсылки.Вставить("Реквизиты", Реквизиты);
	
	ТабличныеЧасти = Новый Структура;
	Для Каждого ОписаниеТабличнаяЧасть Из ОписаниеРеквизитов.ТабличныеЧасти Цикл
		ИмяТЧ = ОписаниеТабличнаяЧасть.Ключ;
		РеквизитыТЧ = ОписаниеТабличнаяЧасть.Значение;
		
		ДанныеТЧ = Новый Массив;
		ВыборкаПоТЧ = Выборка[ИмяТЧ].Выбрать();
		Пока ВыборкаПоТЧ.Следующий() Цикл
			ДанныеСтрокиТЧ = Новый Структура;
			Для Каждого РеквизитТЧ Из РеквизитыТЧ Цикл
				ДанныеСтрокиТЧ.Вставить(РеквизитТЧ, ВыборкаПоТЧ[РеквизитТЧ]);	
			КонецЦикла;
			ДанныеТЧ.Добавить(ДанныеСтрокиТЧ);
		КонецЦикла;
		
		ТабличныеЧасти.Вставить(ИмяТЧ, ДанныеТЧ);
	КонецЦикла;
	ДанныеСсылки.Вставить("ТабличныеЧасти", ТабличныеЧасти);
		
	Возврат ДанныеСсылки;
КонецФункции

Функция ТекстЗапросаДанныхСсылокИзБД(ОписанияРеквизитов)
	СписокПодзапросов = Новый Массив;
	Для Каждого ОписаниеРеквизитов Из ОписанияРеквизитов Цикл
		ТекстПодзапроса = ТекстЗапросаДанныхСсылкиИзБД(ОписаниеРеквизитов.Значение);
		СписокПодзапросов.Добавить(ТекстПодзапроса);
	КонецЦикла;
	
	Возврат МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(СписокПодзапросов, "; ");
КонецФункции

Функция ТекстЗапросаДанныхСсылкиИзБД(ОписаниеРеквизитов)
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	ПолноеИмяМетаданных = ОписаниеРеквизитов.ПолноеИмяМетаданных;
	Реквизиты = ОписаниеРеквизитов.Реквизиты;
	ТабличныеЧасти = ОписаниеРеквизитов.ТабличныеЧасти;
	
	ТекстРеквизитов = МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(Реквизиты, ", ");
	
	СписокРеквизитовТЧ = Новый Массив;
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		ИмяТЧ = ТабличнаяЧасть.Ключ;
		РеквизитыТЧ = ТабличнаяЧасть.Значение;
		
		ТекстРеквизитовТЧ = ИмяТЧ + ".(" + МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(РеквизитыТЧ, ", ") + ") КАК " + ИмяТЧ;
		СписокРеквизитовТЧ.Добавить(ТекстРеквизитовТЧ);
	КонецЦикла;
	
	Если СписокРеквизитовТЧ.Количество() Тогда
		ТекстРеквизитовТЧ = МодульТНОбщегоНазначенияКлиентСервер.СтрСоединитьЭПД(СписокРеквизитовТЧ, ", ");
		ТекстРеквизитов = ТекстРеквизитов + ", " + ТекстРеквизитовТЧ;	
	КонецЕсли;
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Ссылка,
		|	" + ТекстРеквизитов + "
		|ИЗ
		|	" + ПолноеИмяМетаданных + " КАК ОбъектДанных
		|ГДЕ
		|	ОбъектДанных.Ссылка В(&СписокСсылок)";
	
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти // ПолучениеДанныхПоСсылкеИзБазы

#Область ФЛК

// Проверяет заполненность реквизитов документа.
//
// Параметры:
//  ДанныеДокумента - Структура - структура реквизитов и табличных часте документа
//  ПараметрыПроверкиРеквизитов - Структура - структура параметров для проверки реквизитов на заполненность
//    Для реквизитов табличных частей реквизиты указываются через точку. Сначала имя табличной части а потом реквизит.
//  Ошибки - Массив - массив структур ошибок. Расхождения по реквизитам.
//
Процедура ПроверитьЗаполненНеЗаполнен(ДанныеДокумента, ПараметрыПроверкиРеквизитов, Ошибки)
	
	ТабличныеЧасти = Новый Структура;
	
	// Проверка реквизитов объекта и заполнение структуры по реквизитам табличных частей.
	Для Каждого Реквизит Из ПараметрыПроверкиРеквизитов.ПроверяемыеРеквизиты Цикл
		
		ПозицияТочки = Найти(Реквизит.РеквизитОбъекта, ".");
		
		Если ПозицияТочки > 0 Тогда 
			// В случае если указан реквизит табличной части
			ПроверкаРеквизитаТабличнойЧасти(Реквизит, ПозицияТочки, ТабличныеЧасти);
		Иначе 
			// В случае если указан реквизит объекта
			ПроверкаРеквизитаОбъекта(Реквизит, ДанныеДокумента, ПараметрыПроверкиРеквизитов, Ошибки);
		КонецЕсли;
		
	КонецЦикла;
	
	ПроверитьЗаполненНеЗаполненРеквизитТЧ(ДанныеДокумента, ПараметрыПроверкиРеквизитов, Ошибки, ТабличныеЧасти);
	
	ПараметрыПроверкиРеквизитов.ПроверяемыеРеквизиты.Очистить();
	
КонецПроцедуры

Процедура ПроверитьЗаполненНеЗаполненРеквизитТЧ(ДанныеДокумента, ПараметрыПроверкиРеквизитов, Ошибки, ТабличныеЧасти)
	
	// Проверка реквизитов в табличных частях
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		
		ИмяТабличнойЧасти = ТабличнаяЧасть.Ключ;
		ТЧ = ДанныеДокумента[ИмяТабличнойЧасти];
		МассивРеквизитов = ТабличнаяЧасть.Значение;
		
		// Цикл по всем строкам табличной части.
		Для ИндексСтроки = 0 По ТЧ.Количество() - 1 Цикл
			
			ИмяТЧ = ПараметрыПроверкиРеквизитов.ДокументМенеджер.ИмяТЧДокумента(
				ИмяТабличнойЧасти, ТЧ[ИндексСтроки], ДанныеДокумента);
			
			// Цикл по всем проверяемым реквизитам для текущей табличной части.
			Для Каждого Реквизит Из МассивРеквизитов Цикл
				
				ИмяРеквизита = Реквизит.РеквизитОбъекта;
				
				РеквизитДляПроверки = ПараметрыПроверкиРеквизитов.ДокументМенеджер.ИзменитьРеквизитТЧ(
					ТЧ[ИндексСтроки], ИмяТЧ, Реквизит, ДанныеДокумента);
				
				ПроверятьРеквизитТЧДокумента = ПараметрыПроверкиРеквизитов.ДокументМенеджер.ПроверятьРеквизитТЧДокумента(
					ТЧ[ИндексСтроки], ИмяТЧ, РеквизитДляПроверки, ДанныеДокумента);
					
				ИсточникДанныхТЧ = ИсточникДанныхТЧ(ТЧ[ИндексСтроки], ИмяРеквизита, ДанныеДокумента, ИмяТабличнойЧасти);
					
				Если Не ПроверятьРеквизитТЧДокумента
					Или ЗначениеЗаполнено(ИсточникДанныхТЧ[ИмяРеквизита]) Тогда
					Продолжить;
				КонецЕсли;
				
				ПолеОшибки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
					"Объект.%1",
				    ИмяТабличнойЧасти + "[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "]." + РеквизитДляПроверки.РеквизитОбъекта);

				ДобавитьОшибкуПользователю(
					Ошибки,
					ПолеОшибки,
					РеквизитДляПроверки.Ошибка,
					ИмяТЧ + "." + РеквизитДляПроверки.РеквизитОбъекта,
					РеквизитДляПроверки.ЭлементФормы,
					ИндексСтроки);
					
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИсточникДанныхТЧ(СтрокаТЧ, ИмяРеквизита, ДанныеДокумента, ИмяТабличнойЧасти)
	
	ИмяТелефон = "Телефон";
	
	ТаблицыОтветственныхЛиц = Новый Соответствие;
	ТаблицыОтветственныхЛиц.Вставить("ОтветственныеЛица", Истина);
	ТаблицыОтветственныхЛиц.Вставить("Водители", Истина);
	ТаблицыОтветственныхЛиц.Вставить("ОтветственныйМедосмотрВыезд", Истина);
	ТаблицыОтветственныхЛиц.Вставить("ОтветственныйМедосмотрЗаезд", Истина);
	ТаблицыОтветственныхЛиц.Вставить("ОтветственныйТехосмотр", Истина);
	ТаблицыОтветственныхЛиц.Вставить("ОтветственныйОдометрВыезд", Истина);
	ТаблицыОтветственныхЛиц.Вставить("ОтветственныйОдометрЗаезд", Истина);
	
	ЭтоРеквизитЮрЛица = ТаблицыОтветственныхЛиц[ИмяТабличнойЧасти] = Неопределено
		И (ИмяРеквизита = "Фамилия" Или ИмяРеквизита = "Имя" Или ИмяРеквизита = ИмяТелефон);
	
	Если Не ЭтоРеквизитЮрЛица Тогда
		Возврат СтрокаТЧ;
	КонецЕсли;
	
	РезультатФункции = Новый Соответствие;
	
	Если МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(СтрокаТЧ, "СтруктураФИО")
		И ЗначениеЗаполнено(СтрокаТЧ.СтруктураФИО) Тогда
		СтруктураФИО = ЗначениеИзСтрокиВнутр(СтрокаТЧ.СтруктураФИО);
		Для Каждого КлючЗначение Из СтруктураФИО Цикл
			РезультатФункции.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяРеквизита = ИмяТелефон Тогда
		ОтборТелефона = Новый Структура;
		ОтборТелефона.Вставить("КлючСтроки_ДанныеЮрЛиц", СтрокаТЧ.КлючСтроки);
		ОтборТелефона.Вставить("Тип",                    ЗначениеМетаданных(ТипыКонтактнойИнформации() + ".Телефон"));
		
		НайденныеСтроки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(
			ДанныеДокумента.КонтактныеДанные, ОтборТелефона);
		РезультатФункции.Вставить(ИмяТелефон, НайденныеСтроки);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ПроверкаРеквизитаТабличнойЧасти(Реквизит, ПозицияТочки, ТабличныеЧасти)
	
	ДлинаСтроки       = СтрДлина(Реквизит.РеквизитОбъекта);
	ИмяТабличнойЧасти = Лев(Реквизит.РеквизитОбъекта, ПозицияТочки - 1);
	ИмяРеквизита      = Прав(Реквизит.РеквизитОбъекта, ДлинаСтроки - ПозицияТочки);
	
	Если ТабличныеЧасти.Свойство(ИмяТабличнойЧасти) Тогда
		ПроверяемыеРеквизитыТЧ = ТабличныеЧасти[ИмяТабличнойЧасти];
	Иначе
		ПроверяемыеРеквизитыТЧ = Новый Массив;
		ТабличныеЧасти.Вставить(ИмяТабличнойЧасти, ПроверяемыеРеквизитыТЧ);
	КонецЕсли;
	
	Реквизит.РеквизитОбъекта = ИмяРеквизита;
	
	ПроверяемыеРеквизитыТЧ.Добавить(Реквизит);
	
КонецПроцедуры

Процедура ПроверкаРеквизитаОбъекта(Реквизит, ДанныеДокумента, ПараметрыПроверкиРеквизитов, Ошибки)
	
	Если Не ПараметрыПроверкиРеквизитов.ДокументМенеджер.ПроверятьРеквизитДокумента(Реквизит.РеквизитОбъекта, ДанныеДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеРеквизитаЗаполнено = ЗначениеЗаполнено(ДанныеДокумента[Реквизит.РеквизитОбъекта]);
	
	Если Не ЗначениеРеквизитаЗаполнено Тогда
		
		ДобавитьОшибкуПользователю(
			Ошибки,
			МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД("Объект.%1", Реквизит),
			Реквизит.Ошибка,
			Реквизит.РеквизитОбъекта,
			Реквизит.ЭлементФормы);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ДобавитьОшибкуТипаВладения(СтрокаТС, Ошибки, СоответствиеРеквизитовОшибок)
	
	Если СтрокаТС.Вид = ЗначениеМетаданных("ESD_ВидыТС.Автомобиль") Тогда
		СтруктураДанныхОшибки = СоответствиеРеквизитовОшибок.Получить("ТранспортноеСредствоДокумент");
		ДобавитьОшибкуПользователю(
			Ошибки,
			"ТранспортноеСредствоСтрокой",
			СтруктураДанныхОшибки.Ошибка,
			СтруктураДанныхОшибки.РеквизитОбъекта,
			СтруктураДанныхОшибки.ЭлементФормы);
	Иначе
		СтруктураДанныхОшибки = СоответствиеРеквизитовОшибок.Получить("Прицепы.ПрицепДокумент");
		ДобавитьОшибкуПользователю(
			Ошибки,
			МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД("Объект.ТранспортныеСредства[%1]", СтрокаТС.НомерСтроки),
			СтруктураДанныхОшибки.Ошибка,
			СтруктураДанныхОшибки.РеквизитОбъекта,
			СтруктураДанныхОшибки.ЭлементФормы,
			СтрокаТС.НомерСтроки - 1);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСОХ(СтрокаДокументаЭПД, ДанныеДокумента, Ошибки)
	
	Если Не ДанныеДокумента.Свойство("ДанныеЮрЛиц") Или Не СтрокаДокументаЭПД.ЭтоОформитель Тогда
		Возврат;
	КонецЕсли;
	
	ОтборОтправителя  = Новый Структура("Роль", ЗначениеМетаданных("ESD_РолиКонтрагентов.Отправитель"));
	СтрокиОтправителя = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(
		ДанныеДокумента.ДанныеЮрЛиц, ОтборОтправителя);
	
	Для Каждого СтрокаОтправителя Из СтрокиОтправителя Цикл
		Если Не ЗначениеЗаполнено(СтрокаОтправителя.ИНН) Тогда
			Продолжить;
		КонецЕсли;
		
		ОтборПоИНН = Новый Структура("ИНН", СтрокаОтправителя.ИНН);
		СтрокиСторон = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(
			СтрокаДокументаЭПД.ДанныеЮрЛиц, ОтборПоИНН);
			
		ИмяСтороны = "отправитель";
		Если ДанныеДокумента.ИмяМетаданных = ЗаказНаПеревозку() Тогда
			ИмяСтороны = "заказчик";
		КонецЕсли;
			
		Если СтрокиСторон.Количество() = 0 Тогда
			ДобавитьОшибкуПользователю(
				Ошибки,
				СтрокаДокументаЭПД.ЭлементФормы,
				"Одной из сторон документа должен быть " + ИмяСтороны,
				СтрокаДокументаЭПД.РеквизитОбъекта,
				СтрокаДокументаЭПД.ЭлементФормы);
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ФЛК

#Область Лента

Процедура ОбновитьДанныеЛенты(Форма)
	
	Форма.Лента.Очистить();
	
	ИмяМетаданных = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИмяМетаданныхПоФорме(Форма);
	
	ФормаОбъект = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ФормаОбъект(Форма);

	ТекущиеЭтапыДокумента = МодульКода("Документы." + ИмяМетаданных).ТекущиеЭтапыДокумента(Форма);
	ДанныеДляЛенты = МодульКода("РегистрыСведений.ESD_ДанныеТитулов").ДанныеДляЛенты(
		ФормаОбъект, ИмяМетаданных, ТекущиеЭтапыДокумента);
	
	КоличествоВидимость = РазмерЛентыВТитулах();
	
	Для Каждого СтруктураДанных Из ДанныеДляЛенты Цикл
		
		СтрокаЛенты = Форма.Лента.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЛенты, СтруктураДанных);
		
		ЗаполнитьПризнакТекущегоЭтапа(Форма, ИмяМетаданных, СтрокаЛенты);
		
		ЗаполнитьНаименованиеТитула(СтрокаЛенты, ИмяМетаданных);
		
		СтрокаЛенты.Видимость = КоличествоВидимость > 0;
		КоличествоВидимость   = КоличествоВидимость - 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНаименованиеТитула(СтрокаСобытия, ИмяМетаданных)
	
	ПредставленияТитула = РезультатФункцииТитулов(ИмяМетаданных, "ПредставленияТитула", СтрокаСобытия.ТипТитула);	
	СтрокаСобытия.НаименованиеТитула = ПредставленияТитула.Имя;
	
КонецПроцедуры

Процедура СдвинутьНаСтроку(Лента, СтрокаЛенты)
	
	КоличествоВидимость = РазмерЛентыВТитулах();
	
	ИндексСтроки = Лента.Индекс(СтрокаЛенты);
	
	Индекс = Лента.Количество() - 1;
	Пока Индекс >= 0 Цикл
		СтрокаЛенты = Лента[Индекс];
		Если Индекс <= ИндексСтроки Тогда
			СтрокаЛенты.Видимость = КоличествоВидимость > 0;
			КоличествоВидимость   = КоличествоВидимость - 1;
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура СдвинутьЛентуВправо(Лента)
	
	Если Лента.Количество() <= РазмерЛентыВТитулах() Или Лента[Лента.Количество() - 1].Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Для ИндексНачала = 0 По Лента.Количество() - 1 Цикл
		Если Лента[ИндексНачала].Видимость Тогда
			Лента[ИндексНачала].Видимость = Ложь;
			ИндексНачала = ИндексНачала + 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПоследнийИндекс = Мин(ИндексНачала + РазмерЛентыВТитулах() - 1, Лента.Количество() - 1);
	
	Для Индекс = ИндексНачала По ПоследнийИндекс Цикл
		Лента[Индекс].Видимость = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура СдвинутьЛентуВлево(Лента)
	
	Если Лента.Количество() <= РазмерЛентыВТитулах() Или Лента[0].Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Для ИндексНачала = 0 По Лента.Количество() - 1 Цикл
		Если Лента[ИндексНачала].Видимость Тогда
			ИндексНачала = ИндексНачала - 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПоследнийИндекс = Мин(ИндексНачала + РазмерЛентыВТитулах() - 1, Лента.Количество() - 1);
	
	Для Индекс = ИндексНачала По Лента.Количество() - 1 Цикл
		Лента[Индекс].Видимость = Индекс <= ПоследнийИндекс;
	КонецЦикла;
	
КонецПроцедуры

Функция РазмерЛентыВТитулах()
	
	Возврат 6;
	
КонецФункции

Процедура ЗаполнитьПризнакТекущегоЭтапа(Форма, ИмяМетаданных, СтрокаЛенты)
	
	ДокументооборотЗавершен = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ДокументооборотЗавершен(Форма.ИндексКартинки);
	ТекущиеЭтапыДокумента   = МодульКода("Документы." + ИмяМетаданных).ТекущиеЭтапыДокумента(Форма);
	
	ЕстьТитулВТекущихЭтапах = Ложь;
	Если ТекущиеЭтапыДокумента.Количество() <> 0 Тогда
		ЕстьТитулВТекущихЭтапах = Не ЗначениеЗаполнено(СтрокаЛенты.ИдентификаторТитула)
			И ТекущиеЭтапыДокумента.Найти(СтрокаЛенты.ТипТитула) <> Неопределено;
	КонецЕсли;
	
	Если СтрокаЛенты.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.ИзменениеСтоимости")
		Или СтрокаЛенты.ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.СогласованиеСтоимости") Тогда
		СтрокаЛенты.ТекущийТитул = ЕстьТитулВТекущихЭтапах;
	Иначе
		СтрокаЛенты.ТекущийТитул = Не ДокументооборотЗавершен И ЕстьТитулВТекущихЭтапах;
	КонецЕсли;
	
КонецПроцедуры

#Область Отрисовка

Процедура ОчиститьЛенту(Форма)
	
	Пока Форма.Элементы.ГруппаЛента.ПодчиненныеЭлементы.Количество() <> 0 Цикл
		Форма.Элементы.Удалить(Форма.Элементы.ГруппаЛента.ПодчиненныеЭлементы.Получить(0));
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьКнопку(Форма, ИмяКоманды)
	
	Если Форма.Лента.Количество() = 0 Или Форма.Лента.Количество() <= РазмерЛентыВТитулах() Тогда
		Возврат;
	КонецЕсли;
		
	КнопкаФормы = Форма.Элементы.Добавить("Кнопка" + ИмяКоманды, Тип("КнопкаФормы"), Форма.Элементы.ГруппаЛента);
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормы.ИмяКоманды = ИмяКоманды;
	КнопкаФормы.Отображение = ОтображениеКнопки.Картинка;
	КнопкаФормы.ОтображениеФигуры = ОтображениеФигурыКнопки.ПриАктивности;
	КнопкаФормы.Высота = 4;
	
КонецПроцедуры

Процедура ДобавитьДекорациюЛинию(Форма, СтрокаЛенты = Неопределено, Ширина = 3, ИмяДекорации = "ДекорацияЛиния")
	
	Серая   = Истина;
	Красная = Ложь;
	
	ПолноеИмяДекорации = ИмяДекорации;
	ИдентификаторСтроки = "";
	Если СтрокаЛенты <> Неопределено Тогда
		ИдентификаторСтроки = Формат(СтрокаЛенты.ПолучитьИдентификатор(), "ЧДЦ=0; ЧГ=");
		ПолноеИмяДекорации = ПолноеИмяДекорации + ИдентификаторСтроки;
		Серая   = Не ЗначениеЗаполнено(СтрокаЛенты.Период) И Не СтрокаЛенты.ТекущийТитул;
		Красная = Форма.ТитулОтрицательноЗавершен(СтрокаЛенты);
	КонецЕсли;
	
	ГруппаЛинии = Форма.Элементы.Добавить(
		"ГруппаЛинии_" + ИдентификаторСтроки,
		Тип("ГруппаФормы"),
		Форма.Элементы.ГруппаЛента);
		
	ГруппаЛинии.Вид                                = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЛинии.Отображение                        = ОтображениеОбычнойГруппы.Нет;
	ГруппаЛинии.ОтображатьЗаголовок                = Ложь;
	ГруппаЛинии.Группировка                        = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаЛинии.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	ГруппаЛинии.РастягиватьПоГоризонтали           = Ложь;
	ГруппаЛинии.Ширина                             = Ширина;
	
	ДекорацияФормы = Форма.Элементы.Добавить("Отступ" + ПолноеИмяДекорации, Тип("ДекорацияФормы"), ГруппаЛинии);
	ДекорацияФормы.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияФормы.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ДекорацияФормы.РастягиватьПоГоризонтали = Ложь;
	ДекорацияФормы.Ширина = Ширина;
	
	ДекорацияФормы = Форма.Элементы.Добавить(ПолноеИмяДекорации, Тип("ДекорацияФормы"), ГруппаЛинии);
	ДекорацияФормы.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияФормы.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	ДекорацияФормы.РастягиватьПоГоризонтали = Ложь;
	ДекорацияФормы.Ширина = Ширина;
	ДекорацияФормы.Рамка = Форма.Элементы.Стили.Рамка;
	
	Если Красная Тогда
		ДекорацияФормы.ЦветРамки = ЦветаСтиля.ЦветОсобогоТекста;
	ИначеЕсли Серая Тогда
		ДекорацияФормы.ЦветРамки = ЦветаСтиля.ЦветРамкиКнопки;
	Иначе
		ДекорацияФормы.ЦветРамки = WebЦвета.ЖелтоЗеленый;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДекорациюТитул(Форма, СтрокаЛенты)
	
	ИдентификаторСтроки = Формат(СтрокаЛенты.ПолучитьИдентификатор(), "ЧДЦ=0; ЧН=0; ЧГ=");
	
	ГруппаТитул = Форма.Элементы.Добавить(
		"Группа_" + ИдентификаторСтроки,
		Тип("ГруппаФормы"),
		Форма.Элементы.ГруппаЛента);
		
	ГруппаТитул.Вид                                = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаТитул.Отображение                        = ОтображениеОбычнойГруппы.Нет;
	ГруппаТитул.ОтображатьЗаголовок                = Ложь;
	ГруппаТитул.Группировка                        = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаТитул.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	ГруппаТитул.ВертикальныйИнтервал               = ИнтервалМеждуЭлементамиФормы.Нет;
	ГруппаТитул.РастягиватьПоГоризонтали           = Ложь;
	ГруппаТитул.РастягиватьПоВертикали             = Ложь;
	ГруппаТитул.Ширина                             = ШиринаПоТитулу(СтрокаЛенты.ТипТитула);
	
	ДекорацияФормы = Форма.Элементы.Добавить(
		"Титул_" + ИдентификаторСтроки,
		Тип("ДекорацияФормы"),
		Форма.Элементы[ГруппаТитул.Имя]);
		
	ДекорацияФормы.Вид = ВидДекорацииФормы.Картинка;
	ДекорацияФормы.Гиперссылка = Истина;
	ДекорацияФормы.РастягиватьПоГоризонтали = Истина;
	ДекорацияФормы.Высота = 2;
		
	МассивДанныхПодсказки = Новый Массив;
	Если ЗначениеЗаполнено(СтрокаЛенты.Период) Тогда
		ПериодСтрокой = Формат(СтрокаЛенты.Период, "ДФ='dd.MM.yyyy ЧЧ:мм'");
	Иначе
		ПериодСтрокой = "";
	КонецЕсли;		
	
	Если Форма.ТитулОтрицательноЗавершен(СтрокаЛенты) Тогда
		ЦветТитула = ЦветаСтиля.ЦветОсобогоТекста;
		МассивДанныхПодсказки.Добавить("Красный");
	Иначе
		ЦветТитула = WebЦвета.ТемноЗеленый;
		МассивДанныхПодсказки.Добавить("Зеленый");
	КонецЕсли;
	
	Если СтрокаЛенты.ТекущийТитул Тогда
		Картинка = КартинкаИнтерфейсаСервер(Форма, "ESD_ТекущийТитул");
		МассивДанныхПодсказки.Добавить("ESD_ТекущийТитул");
	ИначеЕсли ЗначениеЗаполнено(СтрокаЛенты.ИдентификаторТитула) Тогда
		Картинка = КартинкаИнтерфейсаСервер(Форма, "ESD_АктивныйТитул");
		МассивДанныхПодсказки.Добавить("ESD_АктивныйТитул");
	Иначе
		Картинка = КартинкаИнтерфейсаСервер(Форма, "ESD_НеактивныйТитул");
		ЦветТитула = ЦветаСтиля.ЦветРамкиКнопки;
		МассивДанныхПодсказки[0] = "Серый";
		МассивДанныхПодсказки.Добавить("ESD_НеактивныйТитул");
	КонецЕсли;
	
	ДекорацияФормы.Картинка = Картинка;
	
	ФорматированнаяСтрока = Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока(СтрокаЛенты.Представление, ШрифтыСтиля.ОбычныйШрифтТекста, ЦветТитула),
		Символы.ПС,
		Новый ФорматированнаяСтрока(ПериодСтрокой, ШрифтыСтиля.МелкийШрифтТекста, WebЦвета.Серый));
		
	МассивДанныхПодсказки.Добавить(СтрокаЛенты.Представление);
	Если ЗначениеЗаполнено(ПериодСтрокой) Тогда
		МассивДанныхПодсказки.Добавить(ПериодСтрокой);
	КонецЕсли;
		
	ДекорацияФормы.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	ДекорацияФормы.Подсказка            = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(
		МассивДанныхПодсказки, "/");
	
	ДекорацияФормы.УстановитьДействие("Нажатие", "ДекорацияТитулОбработкаНавигационнойСсылки");
	
	ДекорацияФормыТекст = Форма.Элементы.Добавить(
		"НадписьТитула_" + ИдентификаторСтроки,
		Тип("ДекорацияФормы"),
		Форма.Элементы[ГруппаТитул.Имя]);
		
	ДекорацияФормыТекст.Вид                     = ВидДекорацииФормы.Надпись;
	ДекорацияФормыТекст.Заголовок               = ФорматированнаяСтрока;
	ДекорацияФормыТекст.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ДекорацияФормыТекст.Ширина                  = ШиринаПоТитулу(СтрокаЛенты.ТипТитула);
	ДекорацияФормыТекст.Высота                  = ВысотаПоТитулу(СтрокаЛенты.Представление);
	
КонецПроцедуры

Функция ШиринаПоТитулу(ТипТитула) Экспорт
	
	РезультатФункции = 10;
	
	Если ТипТитула = ЗначениеМетаданных("ESD_ТипТитулаЭтрН.Переадресовка") Тогда		
		РезультатФункции = 12;		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ВысотаПоТитулу(ПредставлениеТитула)
	
	Высота = 2;
	
	НесколькоСлов = Найти(ПредставлениеТитула, " ") > 0;
	Если НесколькоСлов Тогда
		Высота = Высота + 1;
	КонецЕсли;  
	
	Возврат Высота;
	
КонецФункции

Процедура ДобавитьПодсказку(Форма)
	
	ДекорацияФормы = Форма.Элементы.Добавить("ПодсказкаЛенты", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаЛента);
	ДекорацияФормы.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	ДекорацияФормы.Подсказка = "При нажатии на картинку, происходит переход к данным выбранного титула";
	
КонецПроцедуры

#КонецОбласти // Отрисовка

#КонецОбласти // Лента

Функция АдресКонтрагентаИлиОрганизации(ВидИлиТипКИ)
	
	Возврат ВидИлиТипКИ = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации
		Или ВидИлиТипКИ = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации
		Или ВидИлиТипКИ = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента
		Или ВидИлиТипКИ = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	
КонецФункции

Функция ОписанияОшибок(СписокОшибок)
	
	РезультатФункции = Новый Массив;
	
	Для Каждого СтруктураОшибки Из СписокОшибок Цикл
		
		РезультатФункции.Добавить(СтруктураОшибки.ТекстДляОднойОшибки);
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗаполнитьТаблицуЗначений(Форма, ДанныеЗаполнения, РеквизитФормы, ЗначениеИсточник)
	
	Форма[РеквизитФормы.Имя].Очистить();
	
	Если Не ЗначениеЗаполнено(ЗначениеИсточник) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеИсточник) = Тип("Массив") Тогда
		Массив = ЗначениеИсточник;
	Иначе
		Массив = ЗначениеИзСтрокиВнутр(ЗначениеИсточник);
	КонецЕсли;
	
	ЗаполнениеКолонок(Форма, РеквизитФормы, Массив);
	
КонецПроцедуры

Процедура ЗаполнениеКолонок(Форма, РеквизитФормы, Массив)
	
	Для Каждого Значение Из Массив Цикл 
		
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Продолжить;
		КонецЕсли;	
		
		НС = Форма[РеквизитФормы.Имя].Добавить();
		
		ЕстьОдноименныйРеквизит = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ЕстьРеквизитИлиСвойство(НС, РеквизитФормы.Имя);
		
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			
			Если ЕстьОдноименныйРеквизит Тогда 
				ИмяКолонки = РеквизитФормы.Имя;
			Иначе 
				ИмяКолонки = Лев(РеквизитФормы.Имя, СтрДлина(РеквизитФормы.Имя) - 1);
			КонецЕсли;
			
			НС[ИмяКолонки] = Значение;
			
		Иначе
			
			// Структура
			Для Каждого КлючЗначение Из Значение Цикл
				НС[КлючЗначение.Ключ] = КлючЗначение.Значение;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция АктивныйЭтапДокумента(Ссылка) Экспорт
	
	ИндексКартинки = 0;
	АктивныйЭтап   = "";
	
	ДанныеСостояния = ДанныеСостоянияОбъекта(Ссылка);
	Если ДанныеСостояния <> Неопределено Тогда
		
		АктивныйЭтап = ДанныеСостояния.АктивныйЭтап;
		
		Состояние = ДанныеСостояния.Состояние;
		
		Если ТипЗнч(Состояние) = Тип("Структура") Тогда						
			ИндексКартинки = Состояние.ИндексКартинки;			
		ИначеЕсли ЗначениеЗаполнено(Состояние) Тогда									
			ИндексКартинки = МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗначениеРеквизитаОбъекта(Состояние, "ИндексКартинки");			
		Иначе
			ИндексКартинки = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("АктивныйЭтап",   АктивныйЭтап);
	Структура.Вставить("ИндексКартинки", ИндексКартинки);
	Структура.Вставить("Состояние",      Состояние);
	
	Возврат Структура;
	
КонецФункции

Процедура СгрупироватьГрузПоОснованиям(ОбъектЗаполнения, МассивОснований)
	
	СтруктураПараметров = ПараметрыГруппировки();
	НоваяСтруктура      = Новый Структура;
	СтруктураПараметров.Вставить("ГруппировкаНовымРедактором", Истина);
	
	// проверим нужна ли группировка по общим параметрам
	Если НеГруппироватьГруз(ОбъектЗаполнения, НоваяСтруктура, СтруктураПараметров, НоваяСтруктура) Тогда
		Возврат;
    КонецЕсли;
	
	// сформируем общую таблицу по грузу
	ОбщаяТаблицаГрузов = ОбъектЗаполнения.Грузы.Выгрузить();
	ОбщаяТаблицаГрузов.Очистить();
	
	ОбщаяТаблицаГрузов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
	Для Каждого Основание Из МассивОснований Цикл
		
		Грузы = Основание["Грузы"];
		Если Не ЗначениеЗаполнено(Грузы) Тогда
			Продолжить;
		КонецЕсли;	
		
		Для Каждого Груз Из Грузы Цикл			
			СтрокаГруза = ОбщаяТаблицаГрузов.Добавить();
			ЗаполнитьЗначенияИзСоответствия(СтрокаГруза, Груз);			
		КонецЦикла;
					
	КонецЦикла;
	
	// есть позиции для группировки
	Если ОбщаяТаблицаГрузов.Количество() Тогда
		
		// сгруппируем итоговую таблицу	
		ГрузыСвернуто = СвернутаяТаблицаГрузов(ОбщаяТаблицаГрузов, СтруктураПараметров);
		
		// заполним итоги
		ЗаполнитьГрузыОбъектаДокумент(ОбъектЗаполнения, ГрузыСвернуто);
		
	КонецЕсли;		
		
КонецПроцедуры

#Область ЗаполнениеНаОснованииINI

Функция РезультатЗаполненияНаОснованииINI(ПараметрыЗаполнения) Экспорт
	
	Если ПараметрыЗаполнения.НаКлиенте Тогда
		РезультатРасчета = ПараметрыЗаполнения.РезультатРасчетаИНИ;
	Иначе
		РезультатРасчета = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатРасчетаINI(ПараметрыЗаполнения, ОбъектОбработки());
	КонецЕсли;
	
	Если РезультатРасчета.Результат.Ошибка Тогда
		Возврат РезультатРасчета.Результат;
	Иначе
		РезультатФункции = РезультатРасчета.Результат;
		ДанныеИзИНИ      = РезультатРасчета.ДанныеИзИНИ;
	КонецЕсли;
	
	МодульКода("Документы." + ПараметрыЗаполнения.ИмяМетаданных).СформироватьНовыеОснования(РезультатФункции, ДанныеИзИНИ);
	МодульКода("Документы." + ПараметрыЗаполнения.ИмяМетаданных).ДополнитьПодстановки(ДанныеИзИНИ, ПараметрыЗаполнения);
	
	ТитулДляЗаполнения = РезультатФункцииТитулов(ПараметрыЗаполнения.ИмяМетаданных, "ПервыйТитул");
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.Этап) Тогда
		ТитулДляЗаполнения = РезультатФункцииТитулов(
			ПараметрыЗаполнения.ИмяМетаданных, "ЗначениеПоПредставлению", ПараметрыЗаполнения.Этап);
	КонецЕсли;
	ПредставленияТитула = РезультатФункцииТитулов(ПараметрыЗаполнения.ИмяМетаданных, "ПредставленияТитула", ТитулДляЗаполнения);
	
	МассивПодстановок = Новый Массив;
	МассивПодстановок.Добавить(ДанныеИзИНИ);
	
	Подстановки = Новый Соответствие;
	ПодстановкаТитула = Новый Соответствие;
	ПодстановкаТитула.Вставить(ПредставленияТитула.ИмяПодстановки, МассивПодстановок);
	Подстановки.Вставить("Подстановки", ПодстановкаТитула);
	
	ПараметрыЗагрузки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыЗагрузки();
	ПараметрыЗагрузки.ДанныеДокумента           = Подстановки;
	
	ПараметрыЗагрузки.ИдСбис                    = Неопределено;
	ПараметрыЗагрузки.ИзДокумента               = Истина;
	ПараметрыЗагрузки.ЭтоЗаполнениеСПомощьюINI  = Истина;
	ПараметрыЗагрузки.ЭтоПервоеОснование        = ПараметрыЗаполнения.ЭтоПервоеОснование;
	ПараметрыЗагрузки.ИмяМетаданных             = ПараметрыЗаполнения.ИмяМетаданных;
	ПараметрыЗагрузки.НоменклатураГруза         = ПараметрыЗаполнения.НоменклатураГруза;
	ПараметрыЗагрузки.КлючСтроки                = ПараметрыЗаполнения.КлючСтроки;
	ПараметрыЗагрузки.СопроводительныеДокументы = ПараметрыЗаполнения.СопроводительныеДокументы;
	
	ПараметрыЗаполненияНаОсновании = Новый Структура;
	ПараметрыЗаполненияНаОсновании.Вставить("РольКонтрагента", ПараметрыЗаполнения.РольКонтрагента);
	ПараметрыЗагрузки.ПараметрыОснования = ПараметрыЗаполненияНаОсновании;
	
	Если ПараметрыЗаполнения.ЭтоВыбранныйДокумент Тогда
		ПараметрыЗагрузки.ДокументОснование      = ПараметрыЗаполнения.Основание;
		Если Не ПараметрыЗагрузки.ИзРасширения Тогда
			ПараметрыЗагрузки.ТипИсточника           = ПараметрыЗаполнения.Основание.Метаданные().ПолноеИмя();
			ПараметрыЗагрузки.ИдентификаторИсточника = Строка(ПараметрыЗаполнения.Основание.УникальныйИдентификатор());
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыЗаполнения.Свойство("Объект") Тогда
		ПараметрыЗагрузки.Ссылка = ПараметрыЗаполнения.Объект;
		ПараметрыЗагрузки.Вставить("Объект", ПараметрыЗаполнения.Объект);
	Иначе
		ПараметрыЗагрузки.Ссылка = ПараметрыЗаполнения.Ссылка;
	КонецЕсли;
	
	МодульКода("ESD_ТНЗагрузкаСервер").ЗаписатьДанныеДокумента(ПараметрыЗагрузки);
	
	УстановитьЗапретЗаполнения(ПараметрыЗаполнения);
	
	РезультатФункции.ТекстСообщения = "Заполнение на основании завершено";
	
	Если РезультатФункции.Ошибка Тогда
		ЗаписатьОшибкуВЖурналРегистрации(
			ПараметрыЗаполнения.Ссылка,
			"Заполнение не выполнено",
			РезультатФункции.ТекстСообщения);
	КонецЕсли;
	
	РезультатФункции.Вставить("Ссылка",           ПараметрыЗагрузки.Ссылка);
	РезультатФункции.Вставить("ЗапретЗаполнения", ПараметрыЗаполнения.ЗапретЗаполнения);
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДанныеОснованийДляЗаполненияНаОснованииINI(ДокументОснование, ПараметрыЗаполнения = Неопределено) Экспорт
	
	ШаблонИмениИНИ = "%1";
	Если ПараметрыЗаполнения <> Неопределено Тогда
		ШаблонИмениИНИ = ПараметрыЗаполнения.ШаблонИмениИНИ;
	КонецЕсли;
	
	ИмяМетаданных = ИмяМетаданныхДокумента(ДокументОснование);
	РезультатФункции = Новый Массив;
	ИмяИНИ = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(ШаблонИмениИНИ, ИмяМетаданных);
	РезультатФункции.Добавить(СтруктураОснования(ДокументОснование, ИмяИНИ));
	
	ДобавитьТранспортнуюНакладную(РезультатФункции, ДокументОснование, ШаблонИмениИНИ);
	
	ДобавитьОснованияПоТранспортнойНакладной(РезультатФункции, ДокументОснование, ШаблонИмениИНИ);
	
	ДобавитьОснованияПоПоручениюЭкспедитору(РезультатФункции, ДокументОснование, ШаблонИмениИНИ);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьТранспортнуюНакладную(МассивОснований, ДокументОснование, ШаблонИмениINI)
	Если Метаданные.Документы.Найти("ТранспортнаяНакладная") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ТранспортнаяНакладная.Ссылка КАК Ссылка 
	|ИЗ
	|	Документ.ТранспортнаяНакладная КАК ТранспортнаяНакладная
	|ГДЕ
	|	ТранспортнаяНакладная.ЗаданиеНаПеревозку = &ДокументОснование";
	
	ЗапросДанных.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Попытка
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
		ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ВыборкаДанных.Следующий() Тогда	
		ИмяИНИ = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(ШаблонИмениINI, "ТранспортнаяНакладная");
		МассивОснований.Добавить(СтруктураОснования(ВыборкаДанных.Ссылка, ИмяИНИ));	
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьОснованияПоТранспортнойНакладной(МассивОснований, ДокументОснование, ШаблонИмениINI)
	Если Метаданные.Документы.Найти("ТранспортнаяНакладная") = Неопределено
		Или ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.ТранспортнаяНакладная") 
	Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование КАК Ссылка
	|ИЗ
	|	Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	|ГДЕ
	|	ТранспортнаяНакладнаяДокументыОснования.Ссылка = &ДокументОснование
	|	И НЕ ТранспортнаяНакладнаяДокументыОснования.Ссылка.ПометкаУдаления";
	ЗапросДанных.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	ОтборОснования = Новый Структура("Основание", ДокументОснование);
	СтрокаОснования = МодульТНОбщегоНазначенияКлиентСервер.НайтиСтрокиУниверсально(
		МассивОснований, ОтборОснования)[0];
	ИндексВставки = МассивОснований.Найти(СтрокаОснования);
	
	Попытка
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
		ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		Возврат;
	КонецПопытки;
	
	Пока ВыборкаДанных.Следующий() Цикл	
		ИмяМетаданных = ИмяМетаданныхДокумента(ВыборкаДанных.Ссылка);	
		ИмяИНИ = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(ШаблонИмениINI, ИмяМетаданных);
		МассивОснований.Вставить(ИндексВставки, СтруктураОснования(ВыборкаДанных.Ссылка, ИмяИНИ));	
	КонецЦикла;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ТранспортнаяНакладная.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
	|ИЗ
	|	Документ.ТранспортнаяНакладная КАК ТранспортнаяНакладная
	|ГДЕ
	|	ТранспортнаяНакладная.Ссылка = &ДокументОснование
	|	И ТранспортнаяНакладная.ЗаданиеНаПеревозку <> &ПустаяСсылка";
	
	ДокПустаяСсылка = Документы["ЗаданиеНаПеревозку"].ПустаяСсылка();
	ЗапросДанных.УстановитьПараметр("ДокументОснование", ДокументОснование);
	ЗапросДанных.УстановитьПараметр("ПустаяСсылка",      ДокПустаяСсылка);
	
	Попытка
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
		ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ВыборкаДанных.Следующий() Тогда
		ИмяИНИ = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(ШаблонИмениINI, "ЗаданиеНаПеревозку");
		МассивОснований.Добавить(СтруктураОснования(ВыборкаДанных.ЗаданиеНаПеревозку, ИмяИНИ));
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьОснованияПоПоручениюЭкспедитору(МассивОснований, ДокументОснование, ШаблонИмениINI)
	Если Метаданные.Документы.Найти("ПоручениеЭкспедитору") = Неопределено
		Или ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.ПоручениеЭкспедитору") Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|ГДЕ
	|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = &Распоряжение";
	ЗапросДанных.УстановитьПараметр("Распоряжение", ДокументОснование);
	
	
	МодульТНОбщегоНазначенияКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	ОтборОснования = Новый Структура("Основание", ДокументОснование);
	СтрокаОснования = МодульТНОбщегоНазначенияКлиентСервер.НайтиСтрокиУниверсально(
		МассивОснований, ОтборОснования)[0];
	ИндексВставки = МассивОснований.Найти(СтрокаОснования);
	
	Попытка
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
		ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ВыборкаДанных.Следующий() Тогда
		ИмяМетаданных = ИмяМетаданныхДокумента(ВыборкаДанных.Ссылка);
		ИмяИНИ = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(ШаблонИмениINI, ИмяМетаданных);
		СтруктураОснования = СтруктураОснования(ВыборкаДанных.Ссылка, ИмяИНИ);
		МассивОснований.Вставить(ИндексВставки, СтруктураОснования);
	КонецЕсли;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоручениеЭкспедиторуОснования.Основание КАК Основание
	|ИЗ
	|	Документ.ПоручениеЭкспедитору.Основания КАК ПоручениеЭкспедиторуОснования
	|ГДЕ
	|	ПоручениеЭкспедиторуОснования.Ссылка = &Ссылка
	|	И ПоручениеЭкспедиторуОснования.Основание ССЫЛКА Документ.ПриобретениеТоваровУслуг";
	
	ЗапросДанных.УстановитьПараметр("Ссылка", ДокументОснование);
	
	Попытка
		ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		Возврат;
	КонецПопытки;
	
	Пока ВыборкаДанных.Следующий() Цикл
		ИмяМетаданных = ИмяМетаданныхДокумента(ВыборкаДанных.Основание);
		ИмяИНИ = МодульТНОбщегоНазначенияКлиентСервер.СтрШаблонЭПД(ШаблонИмениINI, ИмяМетаданных);
		СтруктураОснования = СтруктураОснования(ВыборкаДанных.Основание, ИмяИНИ);
		МассивОснований.Вставить(ИндексВставки, СтруктураОснования);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗапретЗаполнения(ПараметрыЗаполнения)
	
	Если ПараметрыЗаполнения.ИмяМетаданных = ТранспортнаяНакладная() Тогда
		МодульКода("Документы." + ПараметрыЗаполнения.ИмяМетаданных).УстановитьЗапретЗаполненияЭТрН(ПараметрыЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Функция СвернутьГруз(ОбъектСсылка, ПараметрыЗаполнения, РезультатФункции) Экспорт
	
	НоменклатураГруза   = ПараметрыЗаполнения.НоменклатураГруза;
	СтруктураПараметров = ПараметрыГруппировки();
	КолонкаНоменклатура = "Номенклатура";
	                    
	Если ТипЗнч(ОбъектСсылка) = Тип("Структура") Тогда 
		ОбъектДок = ОбъектСсылка;
		Грузы = МодульКода("ESD_ТНОбщегоНазначенияСервер").МассивВТаблицуЗначений(ОбъектДок.Грузы);
		НоменклатураГруза = Грузы.ВыгрузитьКолонку(КолонкаНоменклатура);
	ИначеЕсли ЭтоСсылка(ОбъектСсылка) Тогда
		ОбъектДок = ОбъектСсылка.ПолучитьОбъект();
	Иначе // Значит пришел объект в переменной "ОбъектСсылка"
		ОбъектДок = ОбъектСсылка;
	КонецЕсли;
	
	Если НеГруппироватьГруз(ОбъектДок, НоменклатураГруза, СтруктураПараметров, РезультатФункции) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Если ЭтоСсылка(ОбъектСсылка) Тогда
		Грузы = ОбъектДок.Грузы.Выгрузить();
		Грузы.Колонки.Добавить(КолонкаНоменклатура, Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
		Для Каждого КлючЗначение Из НоменклатураГруза Цикл
			Грузы[КлючЗначение.Ключ][КолонкаНоменклатура] = КлючЗначение.Значение;
		КонецЦикла;
	Иначе
		Если ТипЗнч(ОбъектСсылка) <> Тип("Структура") Тогда // Значит пришел объект в переменной "ОбъектСсылка"
			Грузы = ОбъектДок.Грузы.Выгрузить();
			Грузы.Колонки.Добавить(КолонкаНоменклатура, Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			
			Для Каждого КлючЗначение Из НоменклатураГруза Цикл
				Грузы[КлючЗначение.Ключ][КолонкаНоменклатура] = КлючЗначение.Значение;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ГрузыСвернуто = СвернутаяТаблицаГрузов(Грузы, СтруктураПараметров);
	ЗаполнитьГрузыОбъектаДокумент(ОбъектДок, ГрузыСвернуто);
	
	Если ТипЗнч(ОбъектСсылка) = Тип("Структура") Тогда
		РезультатФункции.Ссылка = ОбъектДок;
	Иначе
		ОбъектДок.Записать();
	КонецЕсли;

	Возврат РезультатФункции;
	
КонецФункции    

Функция СвернутаяТаблицаГрузов(Грузы, СтруктураПараметров)
	
    СуммируемыеКолонки = Новый Массив;
	СуммируемыеКолонки.Добавить("Высота");
	СуммируемыеКолонки.Добавить("Длина");
	СуммируемыеКолонки.Добавить("Количество");
	СуммируемыеКолонки.Добавить("КоличествоПаллет");
	СуммируемыеКолонки.Добавить("МассаБрутто");
	СуммируемыеКолонки.Добавить("МассаНетто");
	СуммируемыеКолонки.Добавить("Объем");
	СуммируемыеКолонки.Добавить("Стоимость");
	СуммируемыеКолонки.Добавить("Ширина");

	ЗапросДанных     = ЗапросПоГруппировкеГруза(Грузы, СтруктураПараметров, СуммируемыеКолонки);
	РезультатЗапроса = ЗапросДанных.Выполнить();
	
	Грузы.Очистить();
		
	Погрузка_КоличествоМест = 0;
	Погрузка_Масса          = 0;
	
	СуммируемыеКолонки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрСоединитьЭПД(СуммируемыеКолонки, ",");
	
	ВыборкаПоКритериюГруппировки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаПоКритериюГруппировки.Следующий() Цикл
		
		СтрокаГруза = Грузы.Добавить();
		
		ВыборкаДанных = ВыборкаПоКритериюГруппировки.Выбрать();
		Если ВыборкаДанных.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтрокаГруза, ВыборкаДанных);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаГруза, ВыборкаПоКритериюГруппировки, СуммируемыеКолонки);
		
		ЗаполнитьНаименованиеСгруппированногоГруза(
			СтрокаГруза, СтруктураПараметров, ВыборкаПоКритериюГруппировки.КритерийГруппировки);
		
		Погрузка_КоличествоМест = Погрузка_КоличествоМест + ВыборкаПоКритериюГруппировки.Количество;
		Погрузка_Масса          = Погрузка_Масса + ВыборкаПоКритериюГруппировки.МассаБрутто;
		
	КонецЦикла;
		
	Результат = Новый Структура;
	Результат.Вставить("Таблица",                 Грузы);
	Результат.Вставить("Погрузка_КоличествоМест", Погрузка_КоличествоМест);
	Результат.Вставить("Погрузка_Масса",          Формат(Погрузка_Масса, "ЧГ="));
	
	Возврат Результат;
	
КонецФункции

Функция ЗапросПоГруппировкеГруза(Грузы, СтруктураПараметров, СуммируемыеКолонки)
	
	МодульТНКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	КолонкиДляЗапроса = Новый Массив;
	Для Каждого Колонка Из Грузы.Колонки Цикл
		СтрокаЗапроса = "Грузы.%1 КАК %1";
		КолонкиДляЗапроса.Добавить(МодульТНКлиентСервер.СтрШаблонЭПД(СтрокаЗапроса, Колонка.Имя));
	КонецЦикла;
		
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.УстановитьПараметр("Грузы", Грузы);
	
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	Выразить(Грузы.Наименование Как Строка(255)) КАК КритерийГруппировки,
	|	1 КАК Колонки
	|ПОМЕСТИТЬ ТаблицаГрузов
	|ИЗ
	|	&Грузы КАК Грузы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаГрузов.КритерийГруппировки КАК КритерийГруппировки,
	|	2 КАК Колонки
	|ИЗ
	|	ТаблицаГрузов КАК ТаблицаГрузов
	|ИТОГИ
	|	СУММА(Колонки)
	|ПО
	|	КритерийГруппировки";
	
	РазделительСтрок = ",
	|	";
	
	КолонкиПервойТаблицы = МодульТНКлиентСервер.СтрСоединитьЭПД(КолонкиДляЗапроса, РазделительСтрок);
	ЗапросДанных.Текст   = СтрЗаменить(ЗапросДанных.Текст, "1 КАК Колонки", КолонкиПервойТаблицы);
	
	КолонкиВторойТаблицы = СтрЗаменить(КолонкиПервойТаблицы, "Грузы.",        "ТаблицаГрузов.");
	ЗапросДанных.Текст   = СтрЗаменить(ЗапросДанных.Текст,   "2 КАК Колонки", КолонкиВторойТаблицы);
	
	КолонкиСуммыДляЗапроса = Новый Массив;
	Для Каждого ИмяКолонки Из СуммируемыеКолонки Цикл
		СтрокаЗапроса = "СУММА(%1)";
		КолонкиСуммыДляЗапроса.Добавить(МодульТНКлиентСервер.СтрШаблонЭПД(СтрокаЗапроса, ИмяКолонки));
	КонецЦикла;
	
	КолонкиСуммыДляЗапроса = МодульТНКлиентСервер.СтрСоединитьЭПД(КолонкиСуммыДляЗапроса, РазделительСтрок);
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "СУММА(Колонки)", КолонкиСуммыДляЗапроса);
		
	ЗаполнитьКритерийГруппировки(СтруктураПараметров, ЗапросДанных, Грузы);
	
	Возврат ЗапросДанных;
	
КонецФункции

Процедура ЗаполнитьГрузыОбъектаДокумент(ОбъектДок, ГрузыСвернуто)

	Если ТипЗнч(ОбъектДок) = Тип("Структура") Тогда
		ЭтоЭТрН = ОбъектДок.ИмяМетаданных = ТранспортнаяНакладная();
		ОбъектДок.Грузы = ТаблицаЗначенийВМассивЭПД(ГрузыСвернуто.Таблица);		
	Иначе
		ОбъектДок.Грузы.Загрузить(ГрузыСвернуто.Таблица);
		ЭтоЭТрН = МодульКода("ESD_ТНОбщегоНазначенияСервер").ИмяМетаданныхДокумента(ОбъектДок.Ссылка) = ТранспортнаяНакладная();
	КонецЕсли;
	
	Если ЭтоЭТрН Тогда
		
		ОбъектДок.Погрузка_КоличествоМест = ГрузыСвернуто.Погрузка_КоличествоМест;
		ОбъектДок.Погрузка_Масса          = ГрузыСвернуто.Погрузка_Масса;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НеГруппироватьГруз(ОбъектДок, НоменклатураГруза, СтруктураПараметров, РезультатФункции)
	
	// в ВО - сейчас нет настроек для группировки груза,
	// если нет параметров группировки - не группируем
	Если СтруктураПараметров = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Если ТипЗнч(ОбъектДок) = Тип("Структура") Тогда
		ИмяМетаданных = ОбъектДок.ИмяМетаданных;	
	Иначе
		ИмяМетаданных = МодульКода("ESD_ТНОбщегоНазначенияСервер").ИмяМетаданныхДокумента(ОбъектДок.Ссылка);
	КонецЕсли;
	
	ЭтоЭПЛ   = (ИмяМетаданных = ПутевойЛист());
	ЭтоЭТрН  = (ИмяМетаданных = ТранспортнаяНакладная());
	ЭтоЗаказ = (ИмяМетаданных = ЗаказНаПеревозку());
	
	ЭтоДокумент = Макс(ЭтоЭТрН, ЭтоЭПЛ, ЭтоЗаказ);		
	Если Не ЭтоДокумент Или ЭтоЭПЛ Тогда
		// у справочников и в ЭПЛ нет груза
		Возврат Истина;
	КонецЕсли;
	
	НеЗаполненаНоменклатураДляГруппировки = Ложь;
	
	ГруппировкаНовымРедактором = СтруктураПараметров.Свойство("ГруппировкаНовымРедактором");
	Если Не ГруппировкаНовымРедактором Тогда	
		
		НеЗаполненаНоменклатураДляГруппировки = СтруктураПараметров.ГруппироватьПоРеквизитуНоменклатуры
													И НоменклатураГруза.Количество() = 0;
			
		Если НеЗаполненаНоменклатураДляГруппировки Тогда
			РезультатФункции.ТекстЗаголовка = "Не выполнена группировка товаров";
			РезультатФункции.Вставить("ТекстСообщения", "Не заполнена номенклатура в файле настроек");
		КонецЕсли;

	КонецЕсли;
			
	ЕстьГруз = ОбъектДок.Грузы.Количество() 
				Или ГруппировкаНовымРедактором;  
	    
	НеГруппируем = Не СтруктураПараметров.ГруппироватьТоварыИзДокументовОснований
				   Или Не ЕстьГруз
				   Или НеЗаполненаНоменклатураДляГруппировки;
		
	Возврат НеГруппируем;
	
КонецФункции

Функция ПараметрыГруппировки()
	СтруктураПараметров = ESD_ЗагрузитьНастройкиОбъекта("ПараметрыГруппировкиПозицийОснований");
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыГруппировкиПозицийОснований();
	КонецЕсли;
	
	Возврат СтруктураПараметров;
КонецФункции

Процедура ЗаполнитьКритерийГруппировки(СтруктураПараметров, ЗапросДанных, Грузы)
	
	ПодстрокаЗамены = "ТаблицаГрузов.КритерийГруппировки";
	
	Если СтруктураПараметров.ГруппироватьВОднуПозицию Тогда
		Если ЗначениеЗаполнено(СтруктураПараметров.НаименованиеОбщейПозиции) Тогда
			Наименование = СтруктураПараметров.НаименованиеОбщейПозиции;
		Иначе
			Наименование = Грузы[0].Наименование;
		КонецЕсли;
		НаименованиеОбщейПозиции = """%1""";
		НаименованиеОбщейПозиции = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
			НаименованиеОбщейПозиции, Наименование);
		ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, ПодстрокаЗамены, НаименованиеОбщейПозиции);
	ИначеЕсли СтруктураПараметров.ГруппироватьПоРеквизитуНоменклатуры Тогда
		ЗапросДанных.Текст = СтрЗаменить(
			ЗапросДанных.Текст,
			ПодстрокаЗамены,
			"ТаблицаГрузов.Номенклатура." + СтруктураПараметров.РеквизитНоменклатуры);
	Иначе
		ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, ПодстрокаЗамены, "Выразить(ТаблицаГрузов.Наименование Как Строка(255))");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаименованиеСгруппированногоГруза(СтрокаГруза, СтруктураПараметров, КритерийГруппировки)
	
	Если СтруктураПараметров.ГруппироватьВОднуПозицию И ЗначениеЗаполнено(СтруктураПараметров.НаименованиеОбщейПозиции) Тогда
		СтрокаГруза.Наименование = СтруктураПараметров.НаименованиеОбщейПозиции;
	КонецЕсли;
	
	Если СтруктураПараметров.ГруппироватьПоРеквизитуНоменклатуры Тогда
		СтрокаГруза.Наименование = Строка(КритерийГруппировки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОснованииINI

#Область ПолучениеРеквизитовОбъектов

Процедура СформироватьСтруктуруРеквизитов(Реквизиты, СтруктураПолей)
	
	// Разбор реквизитов, если второй параметр Строка.
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Реквизиты = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(Реквизиты, ",", Ложь);
		Для Индекс = 0 По Реквизиты.ВГраница() Цикл
			Реквизиты[Индекс] = СокрЛП(Реквизиты[Индекс]);
		КонецЦикла;
	КонецЕсли;
	
	// Приведение реквизитов к единому формату.
	Если ТипЗнч(Реквизиты) = Тип("Структура")
		Или ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		Для Каждого КлючИЗначение Из Реквизиты Цикл
			СтруктураПолей.Вставить(КлючИЗначение.Ключ, СокрЛП(КлючИЗначение.Значение));
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
		Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		Для Каждого Реквизит Из Реквизиты Цикл
			Реквизит = СокрЛП(Реквизит);
			ПсевдонимПоля = СтрЗаменить(Реквизит, ".", "");
			СтруктураПолей.Вставить(ПсевдонимПоля, Реквизит);
		КонецЦикла;
	Иначе
		ШаблонИсключения = НСтр("ru = 'Неверный тип второго параметра %1 в функции %2: %3.';
			|en = 'Invalid type of parameter %1 in function %2: %3.'");
		ВызватьИсключение МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
			ШаблонИсключения,
			"Реквизиты",
			"ESD_ТНОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта",
			Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
КонецПроцедуры

Процедура РеквизитыВМассив(Реквизиты, СтруктураПолей)
	
	Если Тип("Структура") = ТипЗнч(Реквизиты)
		Или Тип("ФиксированнаяСтруктура") = ТипЗнч(Реквизиты) Тогда
		Реквизиты = Новый Массив;
		Для Каждого КлючИЗначение Из СтруктураПолей Цикл
			ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
						КлючИЗначение.Значение,
						КлючИЗначение.Ключ);
			Реквизиты.Добавить(ИмяПоля);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРезультат(Ссылка, Реквизиты, ВыбратьРазрешенные, КодЯзыка, Результат, СтруктураПолей)
	
	Если ЗначениеЗаполнено(Реквизиты) Тогда
		
		МассивСсылок = Новый Массив;
	    МассивСсылок.Добавить(Ссылка);
		
		ЗначенияРеквизитовОбъекта = ЗначенияРеквизитовОбъектов(
			МассивСсылок, Реквизиты, ВыбратьРазрешенные, КодЯзыка)[Ссылка];
		Если ЗначенияРеквизитовОбъекта <> Неопределено Тогда
			Для Каждого КлючИЗначение Из СтруктураПолей Цикл
				ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
							КлючИЗначение.Значение,
							КлючИЗначение.Ключ);
				Если Найти(ИмяПоля, ".") = 0 И ЗначенияРеквизитовОбъекта.Свойство(ИмяПоля) Тогда
					Результат[КлючИЗначение.Ключ] = ЗначенияРеквизитовОбъекта[ИмяПоля];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьТекстыЗапросов(СсылкиПоТипам, ТекстыЗапросов, ПараметрыЗапроса, ВыбратьРазрешенные, РеквизитыТекстЗапроса)
	
	ИменаОбъектовМетаданных = Новый Массив;
	
	Для Каждого СсылкиПоТипу Из СсылкиПоТипам Цикл
		Тип = СсылкиПоТипу.Ключ;
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		Если ОбъектМетаданных = Неопределено Тогда
			ВызватьИсключение МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
				НСтр("ru = 'Неверный первый параметр %1 в функции %2: 
					|Значения массива должны быть ссылками.';
					|en = 'Invalid value of the %1 parameter, function %2:
					|The array values must be of the Ref type.'"), "Ссылки", "ESD_ТНОбщегоНазначенияСервер.ЗначенияРеквизитовОбъектов");
		КонецЕсли;
		
		ПолноеИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
		ИменаОбъектовМетаданных.Добавить(ПолноеИмяОбъектаМетаданных);
		
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Ссылка КАК Ссылка,
			|	&Реквизиты КАК Реквизиты
			|ИЗ
			|	&ПолноеИмяОбъектаМетаданных КАК ПсевдонимЗаданнойТаблицы
			|ГДЕ
			|	ПсевдонимЗаданнойТаблицы.Ссылка В (&Ссылки)";
		Если Не ВыбратьРазрешенные Или ТекстыЗапросов.Количество() > 0 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Реквизиты КАК Реквизиты", РеквизитыТекстЗапроса);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
		ИмяПараметра = "Ссылки" + СтрЗаменить(ПолноеИмяОбъектаМетаданных, ".", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Ссылки", "&" + ИмяПараметра);
		ПараметрыЗапроса.Вставить(ИмяПараметра, СсылкиПоТипу.Значение);
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ПолучениеРеквизитовОбъектов

Функция СформироватьИмяМетаданных(Тип, Имя)
	
	Если Тип = "Документы" Тогда 
		ТипМетаданных = "ДокументСсылка";
	ИначеЕсли Тип = "Справочники" Тогда
		ТипМетаданных = "СправочникСсылка";
	ИначеЕсли Тип = "Перечисления" Тогда
		ТипМетаданных = "ПеречислениеСсылка";
	Иначе
		ТипМетаданных = "";
	КонецЕсли;	
	
	ИмяТипа = ТипМетаданных + "." + Имя;
	
	Возврат ИмяТипа;
	
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ИмяФункцииФоновогоЗадания
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ИмяФункцииФоновогоЗадания

Функция ТекстСообщенияТекущийПользовательНедоступенВСеансеБезРазделителей()
	
	Возврат МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
	НСтр("ru = 'Недопустимое получение параметра сеанса %1
	|в сеансе без указания всех разделителей.';
	|en = 'Couldn''t get session parameter for user ""%1"".
	|Not all session delimiters are specified.'"),
	"ТекущийПользователь");
	
КонецФункции

Процедура ЗагруженныеДанныеПечатнойФормыДляОткрытия(ПараметрыЗагрузки, РезультатФункции, ДополнительныеПараметры)
	
	МодульТНЗагрузкаСервер = МодульКода("ESD_ТНЗагрузкаСервер");
			
	АдресДвоичныхДанныхФайла = МодульТНЗагрузкаСервер.АдресДвоичныхДанныхФайла(ПараметрыЗагрузки, ДополнительныеПараметры);
	Если ПараметрыЗагрузки.ЗагрузкаТребуется И Не ЗначениеЗаполнено(АдресДвоичныхДанныхФайла) Тогда
		Если ДополнительныеПараметры.ВыгрузкаАрхива Тогда
			РезультатФункции.ОписаниеОшибки = "Не удалось получить архив документа из Saby.";
		Иначе 	
			РезультатФункции.ОписаниеОшибки = "Не удалось получить печатную форму из Saby.";
		КонецЕсли;
	Иначе
		РезультатФункции.АдресДвоичныхДанных = АдресДвоичныхДанныхФайла;
	КонецЕсли;
			
КонецПроцедуры

Функция ПрисоединенныйФайлПоВладельцуИОписанию(ВладелецФайла, Описание) Экспорт
	
	РезультатФункции = Неопределено;
	ИмяСправочника = МодульКода("ESD_РаботаСФайлами").ИмяСправочникаХраненияФайлов(ВладелецФайла, "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
		"ВЫБРАТЬ
		|	Справочник.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.%1 КАК Справочник
		|ГДЕ
		|	Справочник.ВладелецФайла = &ВладелецФайла
		|	И Не Справочник.ПометкаУдаления
		|	И Подстрока(Справочник.Описание,1,100) = &Описание", ИмяСправочника);
	
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайла);
	Запрос.УстановитьПараметр("Описание", Описание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РезультатФункции = Выборка.Ссылка;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

#Область ФормированиеПечатнойФормыQR

Процедура СформироватьПечатнуюФормуQR(Результат, ДополнительныеПараметры)
	
	Если Не ЗначениеЗаполнено(Результат.АдресДвоичныхДанных) Тогда
		Возврат;
	КонецЕсли;
	
	QRКодыДляВывода = QRКодыДляВывода(Результат);
	
	Результат.ПечатнаяФормаQR = Новый ТабличныйДокумент;
	
	ШиринаШтрихкода = 20;
	ШиринаЗаголовка = 80;
	РазмерШрифтаЗаголовка = 14;
	
	Результат.ПечатнаяФормаQR.Область(1, , 1).СоздатьФорматСтрок();
	ОбластьЗаголовка = Результат.ПечатнаяФормаQR.Область(1, 1, 1, 1);
	ОбластьЗаголовка.ШиринаКолонки = ШиринаЗаголовка;
	// BSLLS:StyleElementConstructors-off
	ОбластьЗаголовка.Шрифт = Новый Шрифт(ОбластьЗаголовка.Шрифт, , РазмерШрифтаЗаголовка, Истина);
	// BSLLS:StyleElementConstructors-on
	ОбластьЗаголовка.Текст = ДополнительныеПараметры.Заголовок;
	
	СтрокаДокумента = 2;
	Результат.ПечатнаяФормаQR.Область(СтрокаДокумента, , СтрокаДокумента).СоздатьФорматСтрок();
	НомерКартинки = 1;
	Для Каждого КартинкаКода Из QRКодыДляВывода Цикл
		ОбластьШтрихкода = Результат.ПечатнаяФормаQR.Область(СтрокаДокумента, НомерКартинки, СтрокаДокумента, НомерКартинки);
		ОбластьШтрихкода.ШиринаКолонки = ШиринаШтрихкода;
		ОбластьШтрихкода.Картинка = КартинкаКода;
		НомерКартинки = НомерКартинки + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция QRКодыДляВывода(Результат)
	
	РезультатФункции = Новый Массив;
	
	МассивДвоичныхДанных = ПолучитьИзВременногоХранилища(Результат.АдресДвоичныхДанных);
	УдалитьИзВременногоХранилища(Результат.АдресДвоичныхДанных);
	
	Для Каждого ДвоичныеДанныеКартинки Из МассивДвоичныхДанных Цикл
		КартинкаКода = Новый Картинка(ДвоичныеДанныеКартинки);
		РезультатФункции.Добавить(КартинкаКода);
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // ФормированиеПечатнойФормыQR

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ПодключаемыйФункционал_ФормированиеПечатнойФормы
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ПодключаемыйФункционал_ФормированиеПечатнойФормы

#Область НастройкаСпискаДокументов

// Установка отбора в динамическом списке по аккаунту
//  Параметры:
// 	 Список - ДинамическийСписок - список для установки отбора
//
Процедура УстановитьПараметрАккаунтаВСписке(Список)
	
	Аккаунт = АвторизованныйАккаунтСтрокой();
	
	Использование = Истина;
	
	ЗначениеПараметраКомпоновкиДанных = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Аккаунт"));
	Если ЗначениеПараметраКомпоновкиДанных <> Неопределено Тогда
		Если Использование И ЗначениеПараметраКомпоновкиДанных.Значение <> Аккаунт Тогда
			ЗначениеПараметраКомпоновкиДанных.Значение = Аккаунт;
		КонецЕсли;
		Если ЗначениеПараметраКомпоновкиДанных.Использование <> Использование Тогда
			ЗначениеПараметраКомпоновкиДанных.Использование = Использование;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Установка значения параметра "КодСостоянияЗавершенПоложительно" в динамическом списке
//  Параметры:
// 	 Список - ДинамическийСписок - список для установки параметра
//
Процедура УстановитьПараметрКодЗавершенПоложительно(Список)
	ЗначениеПараметраКомпоновкиДанных = Список.Параметры
		.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КодСостоянияЗавершенПоложительно"));
	Если ЗначениеПараметраКомпоновкиДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеПараметраКомпоновкиДанных.Значение = МодульКода("РегистрыСведений.ESD_Состояние").КодЗавершенПоложительно();
	ЗначениеПараметраКомпоновкиДанных.Использование = Истина;	
КонецПроцедуры

// Устанавливает представление поля Дата в списках, содержащих реквизит с составом даты Дата и время.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма со списком документов.
//
Процедура УстановитьУсловноеОформлениеПоляДата(Форма)
	
	ПолноеИмяРеквизита = "Список.Дата";
	ИмяЭлемента        = "Дата";
	
	ЧастиПолногоИмени = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ПолноеИмяРеквизита, ".");
	
	Если ЧастиПолногоИмени.Количество() <> 2 Тогда 
		// Недопустимое значение параметра ПолноеИмяРеквизита.
		// Имя реквизита должно быть в формате ""<ИмяСписка>.<ИмяПоля>""'");
		Возврат;
	КонецЕсли;
	
	ИмяСписка = ЧастиПолногоИмени[0];
	РеквизитСписок = Форма[ИмяСписка];
	
	Если ТипЗнч(РеквизитСписок) = Тип("ДинамическийСписок") Тогда 
		// ДинамическийСписок позволяет установить условное оформление с помощью собственного компоновщика.
		// При этом параметр ИмяЭлемента игнорируется, потому что компоновщик динамического списка
		// не знает как будут отображены реквизиты списка, потому путем к реквизиту и значения отбора и оформления 
		// является имя реквизита динамического списка.
		УсловноеОформление = РеквизитСписок.УсловноеОформление;
		ПутьКРеквизиту = ЧастиПолногоИмени[1];
		ИмяОформляемогоПоля = ПутьКРеквизиту;
	Иначе 
		// Остальные списки, например, ДанныеФормыДерево:
		// не имеют собственного компоновщика, потому используют компоновщик самой формы.
		УсловноеОформление = Форма.УсловноеОформление;
		ПутьКРеквизиту = ПолноеИмяРеквизита;
		ИмяОформляемогоПоля = ИмяЭлемента;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УсловноеОформление.ИдентификаторПользовательскойНастройки) Тогда
		УсловноеОформление.ИдентификаторПользовательскойНастройки = "ОсновноеОформление";
	КонецЕсли;
	
	// Представление даты.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ДЛФ=D");
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяОформляемогоПоля);
	
	// Представление даты сегодня.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", НСтр("ru = 'ДФ=ЧЧ:мм';
																			|en = 'DF=hh:mm tt'"));
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяОформляемогоПоля);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКРеквизиту);
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКРеквизиту);
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоСледующегоДня);
	
КонецПроцедуры

// Устанавливает условное оформление списка для старых форм.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма со списком.
//
Процедура УстановитьУсловноеОформлениеСписка(Форма)
	
	Если Не ЭтоУниверсальноеРасширение() Тогда
		Возврат;
	КонецЕсли;	
	
	Если Метаданные.ОсновнойРежимЗапуска = РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение Тогда 
	
		Для Каждого ЭлементОформления Из Форма.Список.УсловноеОформление.Элементы Цикл
			
			Если ЭлементОформления.Представление = "НеПросмотренные" Тогда
				ЭлементОформления.Использование = Истина;
			КонецЕсли;
							
		КонецЦикла;		
		
		Форма.Элементы.Дата.Ширина = 9;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // НастройкаСпискаДокументов

#Область ПоддержаныеКонфигурации

Функция ИменаКонфигураций()
	
	РезультатФункции = Новый Соответствие;
    РезультатФункции.Вставить("Бух3", "БухгалтерияПредприятия");
	РезультатФункции.Вставить("ERP",  "УправлениеПредприятием");
	РезультатФункции.Вставить("КА",   "КомплекснаяАвтоматизация");
	РезультатФункции.Вставить("УАТ",  "УправлениеАвтотранспортом");
	РезультатФункции.Вставить("УТ11", "УправлениеТорговлей");
	РезультатФункции.Вставить("УТ10", "УправлениеТорговлей");
	РезультатФункции.Вставить("УПП",  "УправлениеПроизводственнымПредприятием");
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПредставленияКонфигураций()
	
	РезультатФункции = Новый Соответствие;
	РезультатФункции.Вставить("Бух3", "Бухгалтерия предприятия, редакция 3");
	РезультатФункции.Вставить("ERP",  "1С:ERP Управление предприятием 2");
	РезультатФункции.Вставить("КА",   "1С:Комплексная автоматизация 2");
	РезультатФункции.Вставить("УТ11", "Управление торговлей, редакция 11");
	РезультатФункции.Вставить("УТ10", "Управление торговлей, редакция 10");
	РезультатФункции.Вставить("УАТ",  "Управление автотранспортом, редакция 2.2");	
	РезультатФункции.Вставить("УПП",  "Управление производственным предприятием, редакция 1.3");
		
	Возврат РезультатФункции;
	
КонецФункции

Функция ОписаниеКонфигурации(Ключ, Версия)
	
	Имя           = ИменаКонфигураций()[Ключ];
	Представление = ПредставленияКонфигураций()[Ключ];
		
	Описание = Новый Структура;
	Описание.Вставить("Имя",           Имя);
	Описание.Вставить("Представление", Представление);
	Описание.Вставить("Версия",        Версия);
	
	Возврат Описание;
	
КонецФункции

Функция ВерсияПоддержана(МинимальнаяВерсия, ВерсияКонфигурации)
	
	Модуль_ESDКлиентСервер = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер");
	
	МинимальнаяПоЧастям = Модуль_ESDКлиентСервер.СтрРазделитьЭПД(МинимальнаяВерсия,  ".");
	ВерсияПоЧастям      = Модуль_ESDКлиентСервер.СтрРазделитьЭПД(ВерсияКонфигурации, ".");
		
	ИндексЧасти = 0;
	Поддержана  = Истина;
	
	Для Каждого ЧастьРелиза Из МинимальнаяПоЧастям Цикл
		
		Если ЧастьРелиза > ВерсияПоЧастям[ИндексЧасти] Тогда 
		  Поддержана = Ложь;
		  Прервать;
		КонецЕсли;
		
		ИндексЧасти = ИндексЧасти + 1;
		
	КонецЦикла;
	
	Возврат Поддержана;
	
КонецФункции

#КонецОбласти // ПоддержаныеКонфигурации

Функция НовыйЗаполненныйДокументЭПД(ПараметрыВыгрузки, ОбъектДокумента = Неопределено, Результат = Неопределено) Экспорт
	
	Модуль_ESDСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	МассивОснованийДляЗаполнения = Модуль_ESDСервер.ДанныеОснованийДляЗаполненияНаОснованииINI(ПараметрыВыгрузки.Ссылка);
	
	МассивОснований = Новый Массив;
	Для Каждого СтруктураОснования Из МассивОснованийДляЗаполнения Цикл
		МассивОснований.Добавить(СтруктураОснования.Основание);
	КонецЦикла;
	
	ОбъектЗаполнения = ОбъектДокумента;
	Если ОбъектЗаполнения = Неопределено Тогда
		ОбъектЗаполнения = ОбъектДокумента(ПараметрыВыгрузки, Истина);
	КонецЕсли;
	
	Если Не РезультатФункцииТитулов(ПараметрыВыгрузки.ИмяМетаданных, "ЭтоПервыйТитул", ПараметрыВыгрузки.ТипТитула)
		И ПараметрыВыгрузки.ИмяМетаданных <> ПутевойЛист() И ПараметрыВыгрузки.ИмяМетаданных <> ТранспортнаяНакладная() Тогда
		Возврат ОбъектЗаполнения.Ссылка;
	КонецЕсли;
		
	ТекстОшибки = "Ошибка заполнения документа через ";
	НужноОбработатьОшибкуЗаполненияДокумента = Ложь;
	Если ЭтоУниверсальноеРасширение() Тогда
		СтруктураЗаполнения = СтруктураЗаполненияНаОснованииНовогоРедактора(МассивОснований);
		СтруктураЗаполнения.Вставить("ТипТитула", ПараметрыВыгрузки.ТипТитула);
		
		ОбъектЗаполнения.Заполнить(СтруктураЗаполнения);
		НужноОбработатьОшибкуЗаполненияДокумента = ОбъектЗаполнения.ДополнительныеСвойства.Свойство("ОшибкаСопоставления");
		ТекстОшибки = ТекстОшибки + "сопоставление";	
	Иначе	
		ПредставленияТитула = РезультатФункцииТитулов(
			ПараметрыВыгрузки.ИмяМетаданных, "ПредставленияТитула", ПараметрыВыгрузки.ТипТитула);
		
		// заполнение через ини
		ПараметрыИНИ = Модуль_ESDСервер.ПараметрыЗаполненияПоИНИ(ОбъектЗаполнения, ПараметрыВыгрузки.ИмяМетаданных);
		ПараметрыИНИ.Модуль                   = МодульКода("ESD_ТНОбщегоНазначенияСервер");
		ПараметрыИНИ.ДокументОснование        = ПараметрыВыгрузки.Ссылка;
		ПараметрыИНИ.ПараметрыЗаполнения.Этап = ПредставленияТитула.Представление;
	
		РезультатФункции = Модуль_ESDСервер.ЗаполнитьОбъектПоОснованиямИНИ(ПараметрыИНИ);
		НужноОбработатьОшибкуЗаполненияДокумента = РезультатФункции.Ошибка;
		ТекстОшибки = ТекстОшибки + "ini";	
	КонецЕсли;
	
	ОбъектЗаполнения.ДокументОснование_Идентификатор    = ПараметрыВыгрузки.Ссылка.УникальныйИдентификатор();
	ОбъектЗаполнения.ДокументОснование_ОбъектМетаданных = Модуль_ESDСервер.ИмяМетаданныхДокумента(ПараметрыВыгрузки.Ссылка);
	
	Если ОбъектЗаполнения.ДополнительныеСвойства.Свойство("ЗначенияПоУмолчанию") Тогда
		ЗаполнитьЗначенияСвойств(ОбъектЗаполнения, ОбъектЗаполнения.ДополнительныеСвойства.ЗначенияПоУмолчанию);
	КонецЕсли;
	
	ОбъектЗаполнения.Записать();
	
	Если НужноОбработатьОшибкуЗаполненияДокумента Тогда 
		ОбработатьОшибкуЗаполненияДокумента(ОбъектЗаполнения, ПараметрыВыгрузки, ТекстОшибки, Результат);
	КонецЕсли;
	
	Возврат ОбъектЗаполнения.Ссылка;
	
КонецФункции

Процедура ОбработатьОшибкуЗаполненияДокумента(ОбъектЗаполнения, ПараметрыВыгрузки, ТекстОшибки, Результат = Неопределено)
	
	Если Результат = Неопределено Тогда
		ВызватьИсключение ТекстОшибки;
	Иначе
		Ошибки = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураОшибок(ПараметрыВыгрузки.ИмяМетаданных);
		Ошибки = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ДобавитьОшибкуПользователю", Ошибки, Неопределено, ТекстОшибки);
		КлючСоответствия = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").КлючСсылка(ОбъектЗаполнения.Ссылка);
		Результат.Ошибки.Вставить(КлючСоответствия, Ошибки);
		Если ОбъектЗаполнения.ДополнительныеСвойства.Свойство("ОшибкаСопоставления") Тогда
			Результат.ОшибкаСопоставления = ОбъектЗаполнения.ДополнительныеСвойства.ОшибкаСопоставления;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ОбъектДокумента(ПараметрыВыгрузки, ВыполнитьЗаполнениеПоУмолчанию = Ложь) Экспорт
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ESD_ТранспортнаяНакладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ESD_ТранспортнаяНакладная КАК ESD_ТранспортнаяНакладная
	|ГДЕ
	|	НЕ ESD_ТранспортнаяНакладная.ПометкаУдаления
	|	И ESD_ТранспортнаяНакладная.ДокументОснование_ОбъектМетаданных = &ДокументОснование_ОбъектМетаданных
	|	И ESD_ТранспортнаяНакладная.ДокументОснование_Идентификатор = &ДокументОснование_Идентификатор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ТранспортнаяНакладная", ПараметрыВыгрузки.ИмяМетаданных);
	
	ЗапросДанных.УстановитьПараметр("ДокументОснование_ОбъектМетаданных", ПараметрыВыгрузки.Ссылка.Метаданные().Имя);
	ЗапросДанных.УстановитьПараметр(
		"ДокументОснование_Идентификатор", Строка(ПараметрыВыгрузки.Ссылка.УникальныйИдентификатор()));
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	
	ДанныеСостояния = Неопределено;
	Если ВыборкаДанных.Количество() = 0 Тогда
		ДанныеСостояния = МодульКода("ESD_ТНОбщегоНазначенияСервер").ДанныеСостоянияОбъекта(
			ПараметрыВыгрузки.Ссылка, ПараметрыВыгрузки.ИмяМетаданных, Ложь);
	КонецЕсли;
	
	Если ВыборкаДанных.Следующий() Тогда
		РезультатФункции = ВыборкаДанных.Ссылка.ПолучитьОбъект();
		Если ПараметрыВыгрузки.ЗаменаВодителя Тогда
			РезультатФункции = ДокументЗаменыВодителя(ПараметрыВыгрузки, РезультатФункции);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ДанныеСостояния) И ЗначениеЗаполнено(ДанныеСостояния.Ссылка) Тогда
		РезультатФункции = ДанныеСостояния.Ссылка.ПолучитьОбъект();
	Иначе
		РезультатФункции = Документы[ПараметрыВыгрузки.ИмяМетаданных].СоздатьДокумент();
		Если ВыполнитьЗаполнениеПоУмолчанию Тогда
			РезультатФункции.Заполнить(Неопределено);
		КонецЕсли;
		РезультатФункции.УстановитьНовыйНомер();
		РезультатФункции.Дата = ТекущаяДатаСеанса();
		РезультатФункции.Направление = ЗначениеМетаданных("ESD_Направление.Исходящий");
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДокументЗаменыВодителя(ПараметрыВыгрузки, ТекущийДокументЭПЛ)
	
	Модуль_ESDСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	РезультатФункции = Документы[ПараметрыВыгрузки.ИмяМетаданных].СоздатьДокумент();
	РезультатФункции.УстановитьНовыйНомер();
	РезультатФункции.Дата = ТекущаяДатаСеанса();
	РезультатФункции.Направление = ЗначениеМетаданных("ESD_Направление.Исходящий");
	
	Если Не РезультатФункции.ДополнительныеСвойства.Свойство("ЗначенияПоУмолчанию") Тогда
		РезультатФункции.ДополнительныеСвойства.Вставить("ЗначенияПоУмолчанию", Новый Структура);
	КонецЕсли;
	
	ДанныеСостояния = ДанныеСостоянияОбъекта(ТекущийДокументЭПЛ.Ссылка, ПараметрыВыгрузки.ИмяМетаданных);
	
	РезультатФункции.ДополнительныеСвойства.ЗначенияПоУмолчанию.Вставить("ПЛПредыдущий", ДанныеСостояния.ИД);
	РезультатФункции.ДополнительныеСвойства.ЗначенияПоУмолчанию.Вставить(
		"ПризнакНачалаРейса", ЗначениеМетаданных("ESD_ПризнакНачалаРейса.ПриемСдачаПослеСмены"));
	
	Модуль_ESDСервер.УдалитьСвязьОбъекта(ТекущийДокументЭПЛ.Ссылка, ПараметрыВыгрузки.ИмяМетаданных);
	
	ТипТитула = РезультатФункцииТитулов(ПараметрыВыгрузки.ИмяМетаданных, "ПервыйТитул");
	ПредставленияТитула = РезультатФункцииТитулов(ПараметрыВыгрузки.ИмяМетаданных, "ПредставленияТитула", ТипТитула);
	
	ПараметрыВыгрузки.ТипТитула         = ТипТитула;
	ПараметрыВыгрузки.Этап              = ПредставленияТитула.Представление;
	ПараметрыВыгрузки.КодТитула         = ПредставленияТитула.КодТитула;
	ПараметрыВыгрузки.ИдентификаторСБИС = "";
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область include_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // include_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиентСервер
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиентСервер

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_CommonModule_ОбъектОбработки
#КонецОбласти // include_etrn_base_CommonModule_ОбъектОбработки

#Область include_etrn_base_CommonModule_КартинкаИнтерфейсаСервер
#КонецОбласти // include_etrn_base_CommonModule_КартинкаИнтерфейсаСервер

#Область include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере
#КонецОбласти // include_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область include_etrn_base_CommonModule_Метаданные
#КонецОбласти // include_etrn_base_CommonModule_Метаданные

