
// Запускает выполнение функции в фоновом задании, если это возможно.
//
// Параметры:
//  СтруктураПараметров - Структура - все параметры, необходимые для запуска функции через длительную операцию.
//  УникальныйИдентификаторФормы - УникальныйИдентификатор - уникальный идентификатор формы, 
//    во временное хранилище которой надо поместить результат выполнения процедуры.
//
// Возвращаемое значение:
//   Структура - см. ДлительныеОперации.ВыполнитьФункцию
//
Функция ДлительнаяОперация(СтруктураПараметров, УникальныйИдентификаторФормы) Экспорт
	ПрефиксМодуляВнешнейОбработки = "";
	Если СтруктураПараметров.Свойство("ПрефиксМодуляВнешнейОбработки") Тогда
		ПрефиксМодуляВнешнейОбработки = СтруктураПараметров.ПрефиксМодуляВнешнейОбработки;
	КонецЕсли;
	
	МодульДлительныеОперации = МодульКода("ДлительныеОперации");

	ПараметрыВыполнения = МодульДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификаторФормы);
	
	ИмяКоманды = СтруктураПараметров.ИмяКоманды;
	
	Наименование = НаименованиеДлительнойОперации(ИмяКоманды);
	
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Наименование;
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	
	ЭтоВыгрузка = ИмяКоманды = "ВыгрузитьВСбис" Или ИмяКоманды = "ВыгрузитьВСбисИзСписка"
		Или ИмяКоманды = "ЗагрузитьВСбисДинамическийТитул";
	
	Если ЭтоВыгрузка Тогда
		
		ИмяФункции = ИмяФункцииФоновогоЗадания(
			"ESD_ТНВыгрузкаСервер.РезультатВыгрузкиДокументов",
			ПрефиксМодуляВнешнейОбработки + "РезультатВыгрузкиДокументов",
			СтруктураПараметров,
			ПараметрыВыполнения);
			
		ПараметрыВыполнения.ВнешнийОтчетОбработка = СтруктураПараметров.ДопПараметры.ДвоичныеДанныеОбработки;	
		
		РезультатФункции = МодульДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения,
			ИмяФункции, 
			СтруктураПараметров.МассивДокументов,
			СтруктураПараметров.context_params,
			СтруктураПараметров.ДопПараметры);
			
	ИначеЕсли ИмяКоманды = "ОбновитьДокументИзСбис" Тогда
		
		ИмяФункции = ИмяФункцииФоновогоЗадания(
			"ESD_ТНЗагрузкаСервер.ЗагрузкаДокументовПоИзменениям",
			ПрефиксМодуляВнешнейОбработки + "ЗагрузкаДокументовПоИзменениям",
			СтруктураПараметров,
			ПараметрыВыполнения);
		
		РезультатФункции = МодульДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения,
			ИмяФункции, 
			СтруктураПараметров);
			
	ИначеЕсли ИмяКоманды = "ПрочитатьДокумент" Или ИмяКоманды = "ОбновитьАктивныйЭтап" Тогда
		
		ИмяФункции = ИмяФункцииФоновогоЗадания(
			"ESD_ТНЗагрузкаСервер.РезультатЗагрузкиДокументов",
			ПрефиксМодуляВнешнейОбработки + "РезультатЗагрузкиДокументов",
			СтруктураПараметров,
			ПараметрыВыполнения);
			
		ПараметрыВыполнения.ВнешнийОтчетОбработка = СтруктураПараметров.ДопПараметры.ДвоичныеДанныеОбработки;
			
		РезультатФункции = МодульДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения,
			ИмяФункции,  
			СтруктураПараметров.МассивДокументов,
			СтруктураПараметров.context_params,
			СтруктураПараметров.ДопПараметры);
			
	ИначеЕсли ИмяКоманды = "АктуальныйСтатусВерсии" Тогда 		
		
		ИмяФункции = ИмяФункцииФоновогоЗадания(
			"ESD_ТНОбщегоНазначенияСервер.СтатусВерсииРасширения",
			ПрефиксМодуляВнешнейОбработки + "ЗагрузкаДокументовПоИзменениям",
			СтруктураПараметров,
			ПараметрыВыполнения);
		
		РезультатФункции = МодульДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения, 
			ИмяФункции);
			
	ИначеЕсли ИмяКоманды = "РаспознаваниеВУ"
		Или ИмяКоманды = "ЗагрузитьДанныеТСПоРегНомеру"
		Или ИмяКоманды = "ЗагрузитьДанныеТСПоВИН" Тогда 		
		
		ИмяФункции = ИмяФункцииФоновогоЗадания(
			"ESD_ТНЗагрузкаСервер." + ИмяКоманды,
			ПрефиксМодуляВнешнейОбработки + ИмяКоманды,
			СтруктураПараметров,
			ПараметрыВыполнения);
			
		ПараметрыВыполнения.ВнешнийОтчетОбработка = СтруктураПараметров.ДопПараметры.ДвоичныеДанныеОбработки;
		
		РезультатФункции = МодульДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения, 
			ИмяФункции,
			СтруктураПараметров.ДопПараметры);		
			
	Иначе 
		
		РезультатФункции = Неопределено;
			
	КонецЕсли;
	
	Возврат РезультатФункции;

КонецФункции

