
//DynamicDirective
// Заполняет документ на основании другого документа с помощью ИНИ.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта для заполнения.
//  ДокументОснование - ДокументСсылка - ссылка на документ основание.
//  ИмяМетаданных - Строка - имя метаданных документа
//  
// Возвращаемое значение:
//   Структура - результат заполнения на основании ИНИ
//
Функция ЗаполнитьНаОснованииINI(Форма, ДокументОснование, ИмяМетаданных) Экспорт
	
	ФормаОбъект = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ФормаОбъект(Форма);
	
	ПараметрыЗаполнения = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыЗаполненияНаОснованииINI(
		ФормаОбъект, ИмяМетаданных);
	
	Если ПараметрыЗаполнения.НаКлиенте Тогда
		ТранспортВО = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТранспортВО(Форма, ПараметрыЗаполнения.context_params);
		ТранспортБлокли = ТранспортВО.ТранспортБлокли;
	Иначе
		ТранспортБлокли = Неопределено;
	КонецЕсли;
	
	#Если НаСервере Тогда
		МодульФормы = МодульКодаКлиент("ESD_ТНОбщегоНазначенияСервер");
	#Иначе 	
		МодульФормы = МодульКодаКлиент("ЭтаФорма");
	#КонецЕсли
	
	Если ПараметрыЗаполнения.НаКлиенте Тогда
		ПараметрыИНИ = ПараметрыЗаполненияПоИНИ(ФормаОбъект.Ссылка, ИмяМетаданных, ПараметрыЗаполнения);
	Иначе
		ПараметрыИНИ = ПараметрыЗаполненияПоИНИ(ФормаОбъект, ИмяМетаданных, ПараметрыЗаполнения);
	КонецЕсли;
	
	ПараметрыИНИ.Модуль            = МодульФормы;
	ПараметрыИНИ.ДокументОснование = ДокументОснование;
	ПараметрыИНИ.ТранспортБлокли   = ТранспортБлокли;
	
	РезультатФункции = ЗаполнитьОбъектПоОснованиямИНИ(ПараметрыИНИ);
	
	РезультатФункции.Вставить("ТекстЗаголовка", "Ошибка");
	
	#Если НаСервере Тогда
		Картинка = МодульФормы.КартинкаИнтерфейсаСервер(Форма, "ESD_Успешно32");
	#Иначе 	
		Картинка = МодульФормы.КартинкаИнтерфейса(Форма, "ESD_Успешно32");
	#КонецЕсли
	
	РезультатФункции.Вставить("Картинка", Картинка);
		
	Если РезультатФункции.Ошибка Тогда
		 		
		#Если НаСервере Тогда
			Картинка = МодульФормы.КартинкаИнтерфейсаСервер(Форма, "ESD_Ошибка32");
		#Иначе 	
			Картинка = МодульФормы.КартинкаИнтерфейса(Форма, "ESD_Ошибка32");
		#КонецЕсли
		
		РезультатФункции.Картинка = Картинка;
		
	Иначе
		РезультатФункции.ТекстЗаголовка = "Выполнено";
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective
// Заполняет документ на основании оснований связанных документов по ИНИ.
//
// Параметры:
//  Параметры - Структура - параметры заполнения документа. см.ПараметрыЗаполненияПоИНИ 
//  
// Возвращаемое значение:
//   Структура - результат заполнения на основании ИНИ
//
Функция ЗаполнитьОбъектПоОснованиямИНИ(Параметры) Экспорт
	
	ПараметрыЗаполнения = Параметры.ПараметрыЗаполнения;
	Если Параметры.Свойство("Объект") Тогда
		ПараметрыЗаполнения.Вставить("Объект", Параметры.Объект);
	КонецЕсли;	
	
	ОснованияДляЗаполнения = ВыполнитьНаСервере(
		"ESD_ТНОбщегоНазначенияСервер.ДанныеОснованийДляЗаполненияНаОснованииINI", Параметры.ДокументОснование, ПараметрыЗаполнения);	
	
	ПерваяИтерация = Истина;
	Для Каждого СтруктураОснования Из ОснованияДляЗаполнения Цикл
		
		ПараметрыЗаполнения.ini_name             = СтруктураОснования.ini_name;
		ПараметрыЗаполнения.Основание            = СтруктураОснования.Основание;
		ПараметрыЗаполнения.ЭтоВыбранныйДокумент = СтруктураОснования.Основание = Параметры.ДокументОснование;
		ПараметрыЗаполнения.ЭтоПервоеОснование   = ПерваяИтерация;
		ПараметрыЗаполнения.РольКонтрагента      = СтруктураОснования.РольКонтрагента;
		
		Если ПараметрыЗаполнения.НаКлиенте Тогда
			ПараметрыЗаполнения.РезультатРасчетаИНИ = Параметры.Модуль.РезультатРасчетаINI(
				ПараметрыЗаполнения, Параметры.ТранспортБлокли);
		КонецЕсли;
		
		РезультатФункции = ВыполнитьНаСервере(
			"ESD_ТНОбщегоНазначенияСервер.РезультатЗаполненияНаОснованииINI", ПараметрыЗаполнения);
		
		Если РезультатФункции.Ошибка Тогда
			Прервать;
		КонецЕсли;
		
		Если ТипЗнч(Параметры.Объект) = Тип("Структура") Тогда
			ПараметрыЗаполнения.Объект           = РезультатФункции.Ссылка;
			Параметры.Объект                     = ПараметрыЗаполнения.Объект;
			ПараметрыЗаполнения.ЗапретЗаполнения = РезультатФункции.ЗапретЗаполнения;
		КонецЕсли;
		
		ДобавитьОснованияДляЗаполнения(ПараметрыЗаполнения, ОснованияДляЗаполнения, РезультатФункции);
		
		ПерваяИтерация = Ложь;
		
	КонецЦикла;
	
	// Группировка груза
	ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.СвернутьГруз", Параметры.Объект, ПараметрыЗаполнения, РезультатФункции);
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective
// Формирует набор параметров для заполнения документов по ИНИ.
//
// Параметры:
//  Объект - ДокументОбъект - объект заполнения данными
//  ИмяМетаданных - Строка - имя метаданных документа
//  ПараметрыЗаполнения - Структура - параметры для заполнения документа 
//  
// Возвращаемое значение:
//   Структура - параметры заполнения по ИНИ
//
Функция ПараметрыЗаполненияПоИНИ(Объект, ИмяМетаданных, ПараметрыЗаполнения = Неопределено) Экспорт
	
	Если ПараметрыЗаполнения = Неопределено Тогда 
		ПараметрыИНИ = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыЗаполненияНаОснованииINI(
			Объект, ИмяМетаданных);
	Иначе
		ПараметрыИНИ = ПараметрыЗаполнения;
	КонецЕсли;	
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Модуль",              Неопределено);
	РезультатФункции.Вставить("Объект",              Объект); 
	РезультатФункции.Вставить("ДокументОснование",   Неопределено); 
	РезультатФункции.Вставить("ИмяМетаданных",       ИмяМетаданных); 
	РезультатФункции.Вставить("ПараметрыЗаполнения", ПараметрыИНИ);
	РезультатФункции.Вставить("ТранспортБлокли",     Неопределено);
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective
// Расчитывает ИНИ по заданным параметрам
//
// Параметры:
//  ПараметрыЗаполнения - Структура - параметры для выполнения расчета ИНИ.
//  ТранспортБлокли - ФормаКлиентскогоПриложения - форма транспорта
//
// Возвращаемое значение:
//   Структура - результат расчета ИНИ
//
Функция РезультатРасчетаINI(ПараметрыЗаполнения, ТранспортБлокли) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаполнения.Основание) Тогда		
		Возврат СтруктураРезультатаINI(Истина, "Ошибка параметров", "Не заполнено основание расчета!");		
	КонецЕсли;
		
	Если ПараметрыЗаполнения.context_params = Неопределено Тогда
		
		// попытаемся получить параметры авторизации
		ПараметрыЗаполнения.context_params = ВыполнитьНаСервере(
			"ESD_ТНОбщегоНазначенияСервер.ПроверитьНаличиеПараметровПодключенияЭПД", Неопределено);
		
		Если Не ЗначениеЗаполнено(ПараметрыЗаполнения.context_params) Тогда			
			Возврат СтруктураРезультатаINI(Истина, "Нет авторизации", "Для заполнения данных выполните авторизацию!");			
		КонецЕсли;	
		
	КонецЕсли;
	
	ПараметрыВызова = Новый Соответствие();
	ПараметрыВызова.Вставить("Endpoint",  "");
	ПараметрыВызова.Вставить("Algorithm", ПараметрыЗаполнения.ini_name);
	ПараметрыВызова.Вставить("EndpointArgs", Новый Структура);
	ПараметрыВызова["EndpointArgs"].Вставить("ref", ПараметрыЗаполнения.Основание);
	
	Результат = ТранспортБлокли.API_BLOCKLY_RUN(ПараметрыВызова);
	
	Если Результат.status <> "complete" Тогда
		РезультатФункции = СтруктураРезультатаINI(Истина, "Ошибка расчета", Результат.Result.message);
	Иначе
		ДанныеИзИНИ = Результат.Result;
		
		ВосстановитьИерархию(ДанныеИзИНИ);
		
		РезультатФункции = СтруктураРезультатаINI();
		РезультатФункции.ДанныеИзИНИ = ДанныеИзИНИ;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective

Функция СтруктураРезультатаINI(Ошибка = Ложь, ТекстЗаголовка = "", ТекстСообщения = "")
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Результат",   Новый Структура);
	РезультатФункции.Вставить("ДанныеИзИНИ", Неопределено);
	
	РезультатФункции.Результат.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	РезультатФункции.Результат.Вставить("ТекстСообщения", ТекстСообщения);
	РезультатФункции.Результат.Вставить("Ошибка",         Ошибка);
	РезультатФункции.Результат.Вставить("НовыеОснования", Новый Массив);

    Возврат РезультатФункции;
	
КонецФункции

//DynamicDirective

Процедура ДобавитьОснованияДляЗаполнения(ПараметрыЗаполнения, ОснованияДляЗаполнения, РезультатФункции)
	
	ИмяИНИ = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(
		ПараметрыЗаполнения.ШаблонИмениИНИ, "ДанныеКонтрагентаОрганизации");
	
	Если Не РезультатФункции.Свойство("НовыеОснования") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("РольКонтрагента");
	
	Для Каждого НовоеОснование Из РезультатФункции.НовыеОснования Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, НовоеОснование);
		НайденныеСтроки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").НайтиСтрокиУниверсально(
			ОснованияДляЗаполнения, СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтруктураОснования = НайденныеСтроки[0];
		Иначе
			СтруктураОснования = МодульКодаКлиент("ESD_ТНОбщегоНазначенияСервер").СтруктураОснования("", "", "");
			ОснованияДляЗаполнения.Добавить(СтруктураОснования);
		КонецЕсли;
		
		СтруктураОснования.Основание       = НовоеОснование.Основание;
		СтруктураОснования.ini_name        = ИмяИНИ;
		СтруктураОснования.РольКонтрагента = НовоеОснование.РольКонтрагента;
		
	КонецЦикла;
	
КонецПроцедуры

//DynamicDirective

Функция ИмяКлиентскогоТранспортаБлокли()
	
	Возврат "BlocklyExecutor";
	
КонецФункции

#Область ВосстановлениеИерархии

//DynamicDirective
// Создает иерархию структуры по ключам написанным через разделитель 
//
// Параметры:
//  ИсходныеДанные - Структура - плоская структура с ключами содержащими разделитель
//  Разделитель    - Строка - разделитель уровней вложенности иерархии
//
Процедура ВосстановитьИерархию(ИсходныеДанные, Разделитель = ".") Экспорт
	
	Если ТипЗнч(ИсходныеДанные) = Тип("Структура") Или ТипЗнч(ИсходныеДанные) = Тип("Соответствие") Тогда
		Для Каждого КлючЗначение Из ИсходныеДанные Цикл
			Значение = ИсходныеДанные[КлючЗначение.Ключ];
			УровниИерархии = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(КлючЗначение.Ключ, Разделитель);
			ПоместитьНаУровеньИерархии(ИсходныеДанные, Значение, УровниИерархии, КлючЗначение.Ключ);
			ВосстановитьИерархию(Значение, Разделитель);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ИсходныеДанные) = Тип("Массив") Тогда
		Для Каждого Значение Из ИсходныеДанные Цикл
			ВосстановитьИерархию(Значение, Разделитель);
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

//DynamicDirective
// Перемещение значения на нужный уровень иерархии в зависимости от ключа с разделителем 
//
// Параметры:
//  ИсходныеДанные - Структура - плоская структура с ключами содержащими разделитель
//  Значение       - Структура - узел структуры для построения иерархии
//  УровниИерархии - Массив    - массив кровней полученный после рзделения на уровни
//  ИсходныйКлюч   - Строка    - ключ с разделителями
//
Процедура ПоместитьНаУровеньИерархии(ИсходныеДанные, Значение, УровниИерархии, ИсходныйКлюч)
	
	Если УровниИерархии.Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	НовыйУровеньИерархии = ИсходныеДанные;
	ИмяПоследнегоУровня  = УровниИерархии[УровниИерархии.ВГраница()];
	
	Для Каждого ИмяУровня Из УровниИерархии Цикл
		
		Если Не УровеньИерархииСуществует(НовыйУровеньИерархии, ИмяУровня) Тогда
			ДобавитьУровеньИерархии(НовыйУровеньИерархии, ИмяУровня);
		КонецЕсли;
		
		Если ИмяУровня <> ИмяПоследнегоУровня Тогда
			НовыйУровеньИерархии = НовыйУровеньИерархии[ИмяУровня];
		КонецЕсли;
		
	КонецЦикла;
	
	НовыйУровеньИерархии.Вставить(ИмяУровня, Значение);
	ИсходныеДанные.Удалить(ИсходныйКлюч);
	
КонецПроцедуры

//DynamicDirective
// Проверка существования/отсутствия уровня иерархии в узле 
//
// Параметры:
//  ТекущийУровеньИерархии - Структура - узел для проверки уровня
//  ИмяУровня - Строка - имя проверяемого уровня
//
// Возвращаемое значение:
//   Булево - Истина, если уровень существует
//
Функция УровеньИерархииСуществует(ТекущийУровеньИерархии, ИмяУровня)
	
	Если ТипЗнч(ТекущийУровеньИерархии) = Тип("Соответствие") Тогда
		Возврат ТекущийУровеньИерархии[ИмяУровня] <> Неопределено;
	ИначеЕсли ТипЗнч(ТекущийУровеньИерархии) = Тип("Структура") Тогда
		Возврат ТекущийУровеньИерархии.Свойство(ИмяУровня);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//DynamicDirective
// Добавление нового уровня иерархии в узел 
//
// Параметры:
//  ТекущийУровеньИерархии - Структура - узел для добавления уровня
//  ИмяУровня - Строка - имя нового уровня
//
Процедура ДобавитьУровеньИерархии(ТекущийУровеньИерархии, ИмяУровня)
	
	Если ТипЗнч(ТекущийУровеньИерархии) = Тип("Соответствие") Тогда
		ТекущийУровеньИерархии.Вставить(ИмяУровня, Новый Соответствие);
	ИначеЕсли ТипЗнч(ТекущийУровеньИерархии) = Тип("Структура") Тогда
		ТекущийУровеньИерархии.Вставить(ИмяУровня, Новый Структура);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ВосстановлениеИерархии

