
Функция ИмяФункцииФоновогоЗадания(ИмяДляРасширения, ИмяДляВнешнейОбработки, СтруктураПараметров, ПараметрыВыполнения)
	
	РезультатФункции = "";

	Если СтруктураПараметров.ДопПараметры.ДвоичныеДанныеОбработки = Неопределено Тогда
		РезультатФункции = ИмяДляРасширения;
	Иначе
		ПараметрыВыполнения.ЗапуститьВФоне = Ложь;
		ПараметрыВыполнения.ЗапуститьНеВФоне = Истина;
		РезультатФункции = ИмяДляВнешнейОбработки;
		СтруктураПараметров.ДопПараметры.ДвоичныеДанныеОбработки = Неопределено;
	КонецЕсли;
	
	Если Не ПараметрыВыполнения.Свойство("ВнешнийОтчетОбработка") Тогда
		ПараметрыВыполнения.Вставить("ВнешнийОтчетОбработка", Неопределено);
	КонецЕсли;
	
	РезультатФункции = СтрЗаменить(РезультатФункции, "ESD", "Saby");
	
	Возврат РезультатФункции;

КонецФункции

