
// Получает параметры СБИС объекта документа из базы.
//
// Параметры:
//  ОбъектДок - ДокументОбъект - объект документа для получения параметров.
//    Например в качестве параметра может передаваться ДокументОбъект.Saby_ТранспортнаяНакладная.
//
// Возвращаемое значение:
//   Структура - имеет всегда фиксированны набор ключей
//       * ИД - Строка - новый текст запроса. 
//       * АктивныйЭтап - Строка - новый текст запроса.
//       * Состояние - Строка - новый текст запроса.
//
Функция ТекущийТитулИИДДокумента(ОбъектДок) Экспорт
	
	// признаки для расчета состояния
	ДОЗавершенУспешно      = 7;
	ДОЗавершенОтрицательно = 9;
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ИД",                     "");
	РезультатФункции.Вставить("АктивныйЭтап",           Неопределено);
	РезультатФункции.Вставить("Состояние",              Неопределено);
	РезультатФункции.Вставить("ДОЗавершенПоложительно", Ложь);
	РезультатФункции.Вставить("ДОЗавершенОтрицательно", Ложь);
	
	Если Не ЗначениеЗаполнено(ОбъектДок.Ссылка) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Данные = ДанныеСостоянияОбъекта(ОбъектДок.Ссылка);
	Если Данные <> Неопределено Тогда 
		
		РезультатФункции.ИД           = Данные.UID;
		РезультатФункции.АктивныйЭтап = Данные.АктивныйЭтап;
		РезультатФункции.Состояние    = Данные.Состояние;
				
		Если ЗначениеЗаполнено(Данные.Состояние) Тогда
			
			КодСостояния = МодульКода("ESD_ТНОбщегоНазначенияСервер").ЗначениеРеквизитаОбъекта(Данные.Состояние, "ИдентификаторСБИС");
			
			РезультатФункции.ДОЗавершенПоложительно = (КодСостояния = ДОЗавершенУспешно);
			РезультатФункции.ДОЗавершенОтрицательно = (КодСостояния = ДОЗавершенОтрицательно);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Получает идентификатор загруженного документа в СБИС
//
// Параметры:
//  Ссылка - ДокументСсылка.Saby_ТранспортнаяНакладная - ссылка на документ для получения идентификатора.
//
// Возвращаемое значение:
//   Строка - идентификатор документа.
//
Функция ИдентификаторВСбис(Ссылка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("Структура") Тогда
		УИД = Ссылка.Идентификатор;
	Иначе
		// ToDo: Вынести в общий модуль. Получение уид и активного этапа. Использовать еще при создани дока 
		Выборка = ДанныеСостоянияОбъекта(Ссылка);
		Если Выборка <> Неопределено Тогда
			УИД = Выборка.UID;
		Иначе 
			УИД = "";
		КонецЕсли;
	КонецЕсли;
	
	Возврат УИД;
	
КонецФункции

// Возвращает ссылку на документ ЭТрН по идентификатору СБИС
//
// Параметры:
//  ИдСбис - Строка - идентификатор документа в СБИС
//
// Возвращаемое значение:
//   ДокументСсылка.Saby_ТранспортнаяНакладная - Ссылка на документ. Если не найден, то Неопределено
//
Функция ДокументПоИдентификаторуСбис(ИдСбис) Экспорт
	
	СсылкаДокВБазе = Неопределено;
	
    Аккаунт = АвторизованныйАккаунтСтрокой();
	
	ВыборкаСостояния = МодульКода("РегистрыСведений.ESD_Состояние").ПрочитатьПоUID(ИДСбис, , Аккаунт);
	Если ВыборкаСостояния.Следующий() Тогда
		СсылкаДокВБазе = ВыборкаСостояния.Объект;
	КонецЕсли;

	Возврат СсылкаДокВБазе;
	
КонецФункции

// Обновляет данные в регистре Saby_Состояние по документу.
//
// Параметры:
//  Параметры - Структура - данные для записи
//
Процедура ОбновитьДанныеСостояния(Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Параметры.ИД) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("Аккаунт") Или Не ЗначениеЗаполнено(Параметры.Аккаунт) Тогда
		Аккаунт = АвторизованныйАккаунтСтрокой();
	Иначе
		Аккаунт = Параметры.Аккаунт;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.Ссылка) = Тип("Структура") Тогда
		Параметры.Ссылка.Идентификатор       = Параметры.ИД;
		Параметры.Ссылка.ТекущийЭтап         = Параметры.АктивныйЭтап;
		Параметры.Ссылка.АктивныйЭтапСтрокой = Параметры.АктивныйЭтап;
	Иначе
		МодульКода("РегистрыСведений.ESD_Состояние").ОбновитьПоUID(
			Параметры.ИД, ,
			Аккаунт,
			СокрЛП(Параметры.АктивныйЭтап),
			Параметры.Состояние,
			Параметры.Ссылка, , ,
			Параметры.СбисИД);
	КонецЕсли;
	
КонецПроцедуры

// Считывает данные из регистра Saby_Состояние по документу.
//
// Параметры:
//  Ссылка - ДокументСсылка - документ для получения данных
// 
// Возвращаемое значение:
//   Выборка - найденная из регистра запись или неопределенно
//
Функция ДанныеСостоянияОбъекта(Ссылка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("Структура") Тогда
		Данные = Новый Структура;
		Данные.Вставить("SbisId",       "");
		Данные.Вставить("UID",          Ссылка.Идентификатор);
		Данные.Вставить("Аккаунт",      "");
		Данные.Вставить("АктивныйЭтап", Ссылка.АктивныйЭтапСтрокой);
		Данные.Вставить("Объект",       Неопределено);
		Данные.Вставить("Сервис",       "");
		Данные.Вставить("Состояние",    Ссылка.Состояние);
	Иначе
		Аккаунт = АвторизованныйАккаунтСтрокой();
		Данные = МодульКода("РегистрыСведений.ESD_Состояние").ПрочитатьПоОбъекту(Ссылка, , Аккаунт);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

// Формируем структуру параметров для обновления статусов
//
// Возвращаемое значение:
//   Структура - шаблон для записи в регистр
//
Функция ПараметрыЗаписиРегистраСостояний() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИД",           "");
	Параметры.Вставить("АктивныйЭтап", "");
	Параметры.Вставить("Ссылка",       "");
	Параметры.Вставить("Состояние",    ЗначениеМетаданных("ESD_СостоянияОбъектов.ПустаяСсылка", "Справочник"));
	Параметры.Вставить("СбисИД",       "");
	Параметры.Вставить("Ошибка",       "");

	Возврат Параметры;
	
КонецФункции

// Изменяет признак не просмотренного документа
//
// Параметры:
// 	СсылкаНаДокумент - ДокументСсылка - ссылка на документ для поиска
//
Процедура УбратьПризнакНеПросмотрен(Знач СсылкаНаДокумент) Экспорт
	
	ДанныеСостояния = ДанныеСостоянияОбъекта(СсылкаНаДокумент);
	Если ДанныеСостояния = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСостояния = ПараметрыЗаписиРегистраСостояний();
	ЗаполнитьЗначенияСвойств(ПараметрыСостояния, ДанныеСостояния);
	
	ПараметрыСостояния.ИД           = ДанныеСостояния.UID;
	ПараметрыСостояния.АктивныйЭтап = СокрЛП(ДанныеСостояния.АктивныйЭтап);
	ПараметрыСостояния.Ссылка       = СсылкаНаДокумент;
	ПараметрыСостояния.Состояние    = ДанныеСостояния.Состояние;
	ПараметрыСостояния.СбисИД       = "";
	
	ОбновитьДанныеСостояния(ПараметрыСостояния);
		
КонецПроцедуры

Функция КодСостояния(СостояниеДокумента) Экспорт
	
	Возврат ЗначениеРеквизитаОбъекта(СостояниеДокумента, "ИдентификаторСБИС");
	
КонецФункции

Процедура ЗаписатьОшибкиВыполненияВРегистрСостояний(МассивСообщений) Экспорт
	Возврат;
КонецПроцедуры

