
Функция КодироватьСтрокуВURL(СтрокаДляКодирования) Экспорт
	
	ЗакодированныеДанные = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(СтрокаДляКодирования));
	ЗакодированныеДанные = КодироватьСтроку(ЗакодированныеДанные, СпособКодированияСтроки.КодировкаURL);
	
	Возврат ЗакодированныеДанные;
	
КонецФункции

// Декодирование строки по правилам URL
//
// Параметры:
//  СтрокаДляДекодирования - строка - строка URL.
//
// Возвращаемое значение:
//  Строка - декодированная строка
Функция ДекодироватьURLВСтроку(СтрокаДляДекодирования) Экспорт
	ДекодированныеДанные = РаскодироватьСтроку(СтрокаДляДекодирования, СпособКодированияСтроки.КодировкаURL);
	ДекодированныеДанные = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(ДекодированныеДанные));
	
	Возврат ДекодированныеДанные;
КонецФункции

// Преобразует объект 1С в JSON
//
// Параметры:
//  Объект - Структура - структура данных 1С.
//	ПараметрыЗаписиJSON - ПараметрыЗаписиJSON - параметры записи JSON.
//
// Возвращаемое значение:
//  Строка - сформированный JSON
Функция ЗакодироватьJSON(Объект, Знач ПараметрыЗаписиJSON = Неопределено) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	
	Если ПараметрыЗаписиJSON = Неопределено Тогда
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
	КонецЕсли;
	
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, Объект);
	
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

// Преобразует строку JSON в объект 1С
//
// Параметры:
//  СтрокаJSON - Строка - строка формата JSON.
//	ВСоответствие - Булево - указатель преобразования в "соответствие" 1С.
//
// Возвращаемое значение:
//  Структура - сформированный объект 1С
Функция ДекодироватьJSON(СтрокаJSON, ВСоответствие = Ложь) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	РезультатФункции = ПрочитатьJSON(ЧтениеJSON, ВСоответствие);
	ЧтениеJSON.Закрыть();
	
	Возврат РезультатФункции;	
КонецФункции

