
// Дополняет параметры, необходимые для работы с датой.
//
// Параметры:
//  СвойстваКлиента - Структура- шаблон для заполнения параметров
// 
Процедура ДополнитьПараметрыДаты(СвойстваКлиента) Экспорт
		
	ДатаСеанса                             = ТекущаяДатаСеанса();
	ЧасовойПоясСеанса                      = ЧасовойПоясСеанса();
	ДатаСеансаУниверсальная                = УниверсальноеВремя(ДатаСеанса, ЧасовойПоясСеанса);
	СмещениеСтандартногоВремени            = СмещениеСтандартногоВремени(ЧасовойПоясСеанса);
	ТекущаяУниверсальнаяДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	СвойстваКлиента.Вставить("ПоправкаКВремениСеанса",         ДатаСеанса - СвойстваКлиента.ТекущаяДатаНаКлиенте);
	СвойстваКлиента.Вставить("ПоправкаКУниверсальномуВремени", ДатаСеансаУниверсальная - ДатаСеанса);
	СвойстваКлиента.Вставить("СмещениеСтандартногоВремени",    СмещениеСтандартногоВремени);
	СвойстваКлиента.Вставить("СмещениеДатыКлиента",            ТекущаяУниверсальнаяДатаВМиллисекундах
		- СвойстваКлиента.ТекущаяУниверсальнаяДатаВМиллисекундахНаКлиенте);
		
КонецПроцедуры

