
// Возвращает двоичные данные QR из Saby.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры загрузки
//  АдресФайлаSaby - Строка - адрес печатной формы pdf
//
// Возвращаемое значение:
//   Строка - адрес двоичных данных файла печатной формы.
//
//DynamicDirective
Функция АдресДвоичныхДанныхQR(ПараметрыЗагрузки, Знач АдресФайлаSaby = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(АдресФайлаSaby) Тогда
		// Если не получили адрес файла - попробуем повторно обратиться на онлайн
		РезультатSaby = SabyСсылкаНаПечатнуюФормуQR(ПараметрыЗагрузки);
		Если РезультатSaby.Ошибка Или Не ЗначениеЗаполнено(РезультатSaby.Данные) Тогда
			Возврат РезультатSaby;
		КонецЕсли;
		АдресФайлаSaby = РезультатSaby.Данные;
	КонецЕсли;
	
	// Список полученных двоичных данных
	СписокДвоичныхДанных = Новый Массив;

	// Может вернуться списком, может строкой - обрабатываем в методе "ЗначениеВМассив"
	СписокАдресовQR = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ЗначениеВМассив(АдресФайлаSaby);
	Для Каждого Адрес_ Из СписокАдресовQR Цикл
		РезультатSaby = SabyЗагрузитьДанныеПоСсылке(ПараметрыЗагрузки, Адрес_);
		Если РезультатSaby.Успешно Тогда
			СписокДвоичныхДанных.Добавить(РезультатSaby.Данные);
		КонецЕсли;
	КонецЦикла;

	Ошибка_ = Ложь;
	Если СписокДвоичныхДанных.Количество() Тогда
		Данные_ = ПоместитьВоВременноеХранилище(СписокДвоичныхДанных, 
			ПараметрыЗагрузки.УникальныйИдентификатор);
	Иначе
		Ошибка_ = Истина;
		Данные_ = "Ошибка загрузки QR-кода из Saby.
			|Для просмотра деталей используйте функционал ""Логирования"" на форме ""Настройки""";
	КонецЕсли;

	Возврат SabyРезультатВзаимодействияСОнлайном(Ошибка_, Данные_);
КонецФункции

// Возвращает ссылку на печатную форму QR
//
// Параметры:
//	ПараметрыЗагрузки - Структура - параметры загрузки данных из Saby
//
// Возвращаемое значение:
//	Строка, Неопределено - результат обращения в Saby
//
//DynamicDirective
Функция SabyСсылкаНаПечатнуюФормуQR(ПараметрыЗагрузки)
	РезультатФункции = SabyРезультатВзаимодействияСОнлайном();
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.ИдентификаторСБИС) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Идентификатор", ПараметрыЗагрузки.ИдентификаторСБИС);
	ПараметрыМетода.Вставить("ДопПоля", "Расширение,QRFrameLinks");
	
	Попытка
		Результат = ВыполнитьМетодSaby_ПрочитатьДокумент(ПараметрыЗагрузки, ПараметрыМетода);
		РезультатФункции.Данные = Результат["QRFrameLinks"];
	Исключение
		ИнфоОшибки = ИнформацияОбОшибке();
		ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ЗаписатьОшибкуВЖурналРегистрации",
			ПараметрыЗагрузки.СсылкаНаДокумент,
			"Загрузка QR", ИнфоОшибки.Описание);
	КонецПопытки;
	
	Возврат РезультатФункции;
КонецФункции

