
Процедура ДобавитьСсылочныеКолонкиТаблицыВидовУпаковки(ТаблицаВидовУпаковки)
	
	ТаблицаВидовУпаковки.Колонки.Добавить("Ссылка", МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").ОписаниеТипаСтрока(36));
	
КонецПроцедуры

Процедура ПолучитьТаблицуСправочникВидыУпаковки(МенеджерВременныхТаблиц)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	""Не существует"" КАК Ссылка,
	|	""Не существует"" КАК Код,
	|	""Не существует"" КАК Наименование,
	|	""Не существует"" КАК Идентификатор,
	|	""Не существует"" КАК ТехническоеНаименование
	|ПОМЕСТИТЬ СправочникВидыУпаковки";
	
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

