
Функция Подключаемый_События_НазваниеТекущегоЭтапа(АктивныйЭтап, СсылкаНаДокумент) Экспорт
	НаименованиеЭтапа = НРег(СокрЛП(АктивныйЭтап));
	Если Перечисления.ESD_ТипТитулаЭПЛ.ЭтоПредрейсовыйМедосмотрЭПЛДистанционный(НаименованиеЭтапа) Тогда
		МедицинскаяОрганизация = СсылкаНаДокумент.ДоРейса_МедицинскаяОрганизация;
	ИначеЕсли Перечисления.ESD_ТипТитулаЭПЛ.ЭтоПослерейсовыйМедосмотрЭПЛДистанционный(НаименованиеЭтапа) Тогда
		МедицинскаяОрганизация = СсылкаНаДокумент.ПослеРейса_МедицинскаяОрганизация;				
	Иначе
		МедицинскаяОрганизация = Неопределено;
	КонецЕсли; 
	
	ПредставлениеМО = Перечисления.ESD_МедицинскиеОрганизации.ПредставлениеПоЗначению(МедицинскаяОрганизация);
	
	Если ЗначениеЗаполнено(ПредставлениеМО) Тогда
		Результат = АктивныйЭтап +  " " + ПредставлениеМО;
	Иначе
		Результат = АктивныйЭтап;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

