
// Загрузка основных данных документа ЭДО
//
// Параметры:
//	ПараметрыЗагрузки - Структура - структура параметров загрузки
//	ОбщиеПараметрыЗагрузки - Структура - структура параметров "транспорта"
//
// Возвращаемое значение:
//	Структура, Соответствие - загруженные данные
Функция ЭДО_ВизиткаДокумента(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	Перем ПараметрыДокументаДляАПИ;
	Если Не ПараметрыЗагрузки.Свойство("ПараметрыДокументаДляАПИ", ПараметрыДокументаДляАПИ) Тогда
		ПараметрыДокументаДляАПИ = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер")
			.ПараметрыДокументаДляАПИ(ПараметрыЗагрузки.ИмяМетаданных);
	КонецЕсли;
	
	Результат = Новый Структура("Ошибка, Данные", Ложь, Неопределено);
	
	ИмяМетода = ПараметрыДокументаДляАПИ.Тип + ".ПрочитатьВизитку";
	ПараметрыМетода = Новый Структура("ИдО", ПараметрыЗагрузки.ИдентификаторСБИС);
	РезультатSaby = ВыполнитьМетодSaby(ИмяМетода, ПараметрыМетода, , ОбщиеПараметрыЗагрузки);
	Если РезультатSaby.Ошибка Тогда
		Результат.Ошибка = Истина;
		Результат.Данные = РезультатSaby.ОписаниеОшибки;
	Иначе
		МодульRecord = МодульКода("ESD_Record");
		Результат.Данные = МодульRecord.Decrease(РезультатSaby.Результат["result"]);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Получение из СБИС вариантов печатной формы документа
//
// Параметры:
//  ИмяМетаданных - Строка - вид документа
//	ОбщиеПараметрыЗагрузки - Структура - общие параметры загрузки
//
// Возвращаемое значение:
//   Соответствие - представление объекта Record, содержащий доступные печатные формы документа
//
Функция ЭДО_ВариантыПечатнойФормы(ИмяМетаданных, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("ДопПоля", Новый Массив);
	ПараметрыМетода.Вставить("Навигация", Неопределено);
	ПараметрыМетода.Вставить("Сортировка", Неопределено);
	ПараметрыМетода.Вставить("Фильтр", Неопределено);
	
	Результат = Новый Структура("Ошибка, Данные", Ложь, Неопределено);
	
	ПараметрыДокументаДляАПИ = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыДокументаДляАПИ(ИмяМетаданных);
	ИмяМетода = ПараметрыДокументаДляАПИ.Тип + ".GetVisualVariants";
	РезультатSaby = ВыполнитьМетодSaby(ИмяМетода, ПараметрыМетода);
	Если РезультатSaby.Ошибка Тогда
		Результат.Ошибка = Истина;
		Результат.Данные = РезультатSaby.ОписаниеОшибки;
	Иначе
		МодульRecord = МодульКода("ESD_Record");
		Результат.Данные = МодульRecord.Decrease(РезультатSaby.Результат["result"]);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Выполняет генерацию печатной формы и возвращает ссылку
//
// Параметры:
//	ПараметрыЗагрузки - Структура - параметры генерации и загрузки ссылки (см. функцию SabyСформироватьПараметрыЗагрузкиФайлов)
//
// Возвращаемое значение:
//	Строка, Неопределено - ссылка на сгенерированную ПФ или неопределено при ошибке или отсутствии
//	
Функция ЭДО_СгенерироватьСсылкуНаПечатнуюФорму(ПараметрыЗагрузки) Экспорт
	Перем ОбщиеПараметрыЗагрузки;
	РезультатSaby = SabyРезультатВзаимодействияСОнлайном();
	
	Если Не ПараметрыЗагрузки.ЭтоЧерновик Тогда
		Возврат РезультатSaby;
	КонецЕсли;
	
	Если ПараметрыЗагрузки.Свойство("context_params") И ПараметрыЗагрузки.Свойство("ОбъектОбработки") Тогда
		ОбщиеПараметрыЗагрузки = Новый Структура("ОбъектОбработки, context_params");
		ЗаполнитьЗначенияСвойств(ОбщиеПараметрыЗагрузки, ПараметрыЗагрузки);
	КонецЕсли;
	
	РезультатSaby = ЭДО_ВизиткаДокумента(ПараметрыЗагрузки, ОбщиеПараметрыЗагрузки);
	Если РезультатSaby.Ошибка Тогда
		Возврат РезультатSaby;
	КонецЕсли;
	
	ДанныеДокументаЭДО = РезультатSaby.Данные;	
	РезультатSaby = ЭДО_ЗапуститьГенерациюПечатнойФормы(ДанныеДокументаЭДО["@Документ"], ОбщиеПараметрыЗагрузки);
	Если Не РезультатSaby.Ошибка И РезультатSaby.Данные = Истина Тогда
		РезультатSaby = SabyСсылкаНаПечатнуюФорму(ПараметрыЗагрузки);
	КонецЕсли;
	
	Возврат РезультатSaby;
КонецФункции

Функция ЭДО_ЗапуститьГенерациюПечатнойФормы(Идентификатор, ОбщиеПараметрыЗагрузки = Неопределено) Экспорт
	Результат = Новый Структура("Ошибка,Данные", Ложь, Неопределено);
	
	ИмяМетода = "ОсновнойРедактируемыйДокумент.СгенерироватьDWC";
	
	ПараметрыМетода = Новый Структура("ключДокумента", Идентификатор);
	ПараметрыМетода.Вставить("ТолькоПерезаписывать", Ложь);
	ПараметрыМетода.Вставить("Принудительно", Ложь);
	
	ПараметрыГенерации = Новый Структура("ДействиеПользователя", "Печать");
	ПараметрыМетода.Вставить("ПараметрыГенерации", ПараметрыГенерации);
	
	РезультатSaby = ВыполнитьМетодSaby(ИмяМетода, ПараметрыМетода, , ОбщиеПараметрыЗагрузки);
	Если РезультатSaby.Ошибка Тогда
		Результат.Ошибка = Истина;
		Результат.Данные = РезультатSaby.ОписаниеОшибки;
	Иначе
		Результат.Данные = РезультатSaby.Результат["result"];
	КонецЕсли;
	
	Возврат Результат;			
КонецФункции

