
Функция ОбработкаДанныхSaby_Подстановки_Комментарий(Знач ДанныеПодстановки) Экспорт
	Результат = "";
	Если Не ЗначениеЗаполнено(ДанныеПодстановки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеПодстановки) = Тип("Массив") Тогда
		ДанныеПодстановки = ДанныеПодстановки[ДанныеПодстановки.ВГраница()];
	КонецЕсли;
	
	Результат = ESD_ТНОбщегоНазначенияКлиентСервер.ЗначениеИзКоллекции(ДанныеПодстановки, "Документ.Ответ.Причина", "");
	Если ПустаяСтрока(Результат) Тогда
		Результат = ДанныеПодстановки["Комментарий"];
	КонецЕсли;
	
	Возврат Результат;		
КонецФункции

