
Функция ТекущиеЭтапыСсылки(СсылкаНаДокумент) Экспорт
	РезультатФункции = Новый Массив;

	ДанныеСостояния = ESD_ТНОбщегоНазначенияСервер.ДанныеСостоянияОбъекта(СсылкаНаДокумент);
	Если ДанныеСостояния <> Неопределено Тогда
		ТекущийТитул = ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов(
			ИмяМетаданных(), "ЗначениеПоПредставлению", ДанныеСостояния.АктивныйЭтап);
	Иначе
		ТекущийТитул = ESD_ТНОбщегоНазначенияСервер.РезультатФункцииТитулов(ИмяМетаданных(), "ПервыйТитул");
	КонецЕсли;
	
	РезультатФункции.Добавить(ТекущийТитул);
	Возврат РезультатФункции;
КонецФункции

Функция ТекущиеЭтапыОбъекта(ОбъектДокумента) Экспорт
    РезультатФункции = Новый Массив;
	
	Для Каждого СтрокаТекущегоТитула Из ОбъектДокумента.ТекущиеЭтапы Цикл
		РезультатФункции.Добавить(СтрокаТекущегоТитула.ТипТитула);
	КонецЦикла;

    Возврат РезультатФункции;   
КонецФункции

