
//DynamicDirective

Функция ВыполнитьНаСервере(ПолноеИмяФункции, Параметр1, Параметр2 = Неопределено)
	
	ЧастиИмени = СтрРазделить(ПолноеИмяФункции, ".");
	ИмяМодуля  = ЧастиИмени[0];
	ИмяФункции = ЧастиИмени[ЧастиИмени.ВГраница()];
	
	МодульКода = МодульКода(ИмяМодуля);
	
	Если ИмяФункции = "ДлительнаяОперация" Тогда
		Возврат МодульКода.ДлительнаяОперация(Параметр1, Параметр2);
	ИначеЕсли ИмяФункции = "ИдентификаторВСбис" Тогда
		Возврат МодульКода.ИдентификаторВСбис(Параметр1);
	ИначеЕсли ИмяФункции = "ДанныеПечатнойФормыДляОткрытия" Тогда
		Возврат МодульКода.ДанныеПечатнойФормыДляОткрытия(Параметр1, Параметр2);
	ИначеЕсли ИмяФункции = "КонтактнаяИнформацияПоПредставлению" Тогда
		Возврат МодульКода.КонтактнаяИнформацияПоПредставлению(Параметр1, Параметр2);
	ИначеЕсли ИмяФункции = "ПрочитатьJSONДляВебКлиента" Тогда
		Возврат МодульКода.ПрочитатьJSONДляВебКлиента(Параметр1);
	ИначеЕсли ИмяФункции = "ПараметрыВидаКонтактнойИнформации" Тогда
		Возврат МодульКода.ПараметрыВидаКонтактнойИнформации(Параметр1);
	ИначеЕсли ИмяФункции = "АктивныйЭтапСтрокой" Тогда
		Возврат МодульКода.АктивныйЭтапСтрокой(Параметр1);
	ИначеЕсли ИмяФункции = "ПоследнееУспешноЗагруженноеИзменение" Тогда
		Возврат МодульКода.ПоследнееУспешноЗагруженноеИзменение(Параметр1);
	ИначеЕсли ИмяФункции = "ВсеЗначенияПеречисления" Тогда
		Возврат МодульКода.ВсеЗначенияПеречисления(Параметр1, Параметр2);
	ИначеЕсли ИмяФункции = "ДесериализоватьЗначение" Тогда
		Возврат МодульКода.ДесериализоватьЗначение(Параметр1);
	ИначеЕсли ИмяФункции = "ОбновитьВнешнийВидЭлементовОшибок" Тогда
		Возврат МодульКода.ОбновитьВнешнийВидЭлементовОшибок(Параметр1);
	ИначеЕсли ИмяФункции = "АдресВФорматеОбмена" Тогда
		Возврат МодульКода.АдресВФорматеОбмена(Параметр1);
	ИначеЕсли ИмяФункции = "ДанныеВодителяПоСсылке" Тогда
        Возврат МодульКода.ДанныеВодителяПоСсылке(Параметр1);
	ИначеЕсли ИмяФункции = "ПреобразоватьСтрокуВДатуЭПД" Тогда
		Возврат МодульКода.ПреобразоватьСтрокуВДатуЭПД(Параметр1);
	Иначе
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Параметр1", Параметр1);
		СтруктураПараметров.Вставить("Параметр2", Параметр2);
		
		Возврат ВыполнитьНаСервереДополнительно(МодульКода, ИмяФункции, СтруктураПараметров);
		
	КонецЕсли;
	
КонецФункции

//DynamicDirective

Функция ВыполнитьНаСервереДополнительно(МодульКода, ИмяФункции, Параметры)
	
	Если ИмяФункции = "ПроверитьНаличиеПараметровПодключения" Тогда
		Возврат МодульКода.ПроверитьНаличиеПараметровПодключения();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции


