
//DynamicDirective

Функция ВыполнитьНаСервере(ПолноеИмяФункции, Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено)
	
	ЧастиИмени = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").СтрРазделитьЭПД(ПолноеИмяФункции, ".");
	ИмяМодуля  = ЧастиИмени[0];
	ИмяФункции = ЧастиИмени[ЧастиИмени.ВГраница()];
	
	МодульКода = МодульКода(ИмяМодуля);
	
	Если ИмяФункции = "ДлительнаяОперация" Тогда
		РезультатФункции = МодульКода.ДлительнаяОперация(Параметр1, Параметр2);
	ИначеЕсли ИмяФункции = "ИдентификаторВСбис" Тогда
		РезультатФункции = МодульКода.ИдентификаторВСбис(Параметр1);
	ИначеЕсли ИмяФункции = "ДанныеПечатнойФормыДляОткрытия" Тогда
		РезультатФункции = МодульКода.ДанныеПечатнойФормыДляОткрытия(Параметр1, Параметр2, Параметр3);
	ИначеЕсли ИмяФункции = "КонтактнаяИнформацияПоПредставлению" Тогда
		РезультатФункции = МодульКода.КонтактнаяИнформацияПоПредставлению(Параметр1, Параметр2);
	ИначеЕсли ИмяФункции = "ПрочитатьJSONДляВебКлиента" Тогда
		РезультатФункции = МодульКода.ПрочитатьJSONДляВебКлиента(Параметр1);
	ИначеЕсли ИмяФункции = "ПараметрыВидаКонтактнойИнформации" Тогда
		РезультатФункции = МодульКода.ПараметрыВидаКонтактнойИнформации(Параметр1);
	ИначеЕсли ИмяФункции = "АктивныйЭтапСтрокой" Тогда
		РезультатФункции = МодульКода.АктивныйЭтапСтрокой(Параметр1);
	ИначеЕсли ИмяФункции = "ПоследнееУспешноЗагруженноеИзменение" Тогда
		РезультатФункции = МодульКода.ПоследнееУспешноЗагруженноеИзменение(Параметр1);
	ИначеЕсли ИмяФункции = "ВсеЗначенияПеречисления" Тогда
		РезультатФункции = МодульКода.ВсеЗначенияПеречисления(Параметр1, Параметр2);
	ИначеЕсли ИмяФункции = "ДесериализоватьЗначение" Тогда
		РезультатФункции = МодульКода.ДесериализоватьЗначение(Параметр1);
	ИначеЕсли ИмяФункции = "ОбновитьВнешнийВидЭлементовОшибок" Тогда
		РезультатФункции = МодульКода.ОбновитьВнешнийВидЭлементовОшибок(Параметр1);
	ИначеЕсли ИмяФункции = "АдресВФорматеОбмена" Тогда
		РезультатФункции = МодульКода.АдресВФорматеОбмена(Параметр1);
	ИначеЕсли ИмяФункции = "ДанныеВодителяПоСсылке" Тогда
		РезультатФункции = МодульКода.ДанныеВодителяПоСсылке(Параметр1);
	ИначеЕсли ИмяФункции = "ПреобразоватьСтрокуВДатуЭПД" Тогда
		РезультатФункции = МодульКода.ПреобразоватьСтрокуВДатуЭПД(Параметр1);
	Иначе
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Параметр1", Параметр1);
		СтруктураПараметров.Вставить("Параметр2", Параметр2);
		СтруктураПараметров.Вставить("Параметр3", Параметр3);
		
		РезультатФункции = ВыполнитьНаСервереДополнительно(МодульКода, ИмяФункции, СтруктураПараметров);
		
	КонецЕсли;
	
	Возврат РезультатФункции;

КонецФункции

//DynamicDirective

Функция ВыполнитьНаСервереДополнительно(МодульКода, ИмяФункции, Параметры)
	
	Если ИмяФункции = "ПроверитьНаличиеПараметровПодключения" Тогда
		РезультатФункции = МодульКода.ПроверитьНаличиеПараметровПодключения();
	ИначеЕсли ИмяФункции = "СтруктураОтветственного" Тогда
		РезультатФункции = МодульКода.СтруктураОтветственного(Параметры.Параметр1, Параметры.Параметр2, Параметры.Параметр3);
	ИначеЕсли ИмяФункции = "ДанныеДляОткрытияДокументаВСБИС" Тогда
		РезультатФункции = МодульКода.ДанныеДляОткрытияДокументаВСБИС(Параметры.Параметр1);
	ИначеЕсли ИмяФункции = "ПричинаОшибкиИзЯдра" Тогда
		РезультатФункции = МодульКода.ПричинаОшибкиИзЯдра(Параметры.Параметр1);
	ИначеЕсли ИмяФункции = "ДобавитьОшибкуПользователю" Тогда
		РезультатФункции = МодульКода.ДобавитьОшибкуПользователю(Параметры.Параметр1, Параметры.Параметр2, Параметры.Параметр3);
	ИначеЕсли ИмяФункции = "РезультатФункцииТитулов" Тогда
		РезультатФункции = МодульКода.РезультатФункцииТитулов(Параметры.Параметр1, Параметры.Параметр2, Параметры.Параметр3);
	ИначеЕсли ИмяФункции = "ПараметрыЗаписиРегистраСостояний" Тогда
		РезультатФункции = МодульКода.ПараметрыЗаписиРегистраСостояний();
	ИначеЕсли ИмяФункции = "ОбновитьДанныеСостояния" Тогда
		РезультатФункции = Неопределено;
		МодульКода.ОбновитьДанныеСостояния(Параметры.Параметр1);
	ИначеЕсли ИмяФункции = "ЗаписатьОшибкуВЖурналРегистрации" Тогда
		РезультатФункции = Неопределено;
		МодульКода.ЗаписатьОшибкуВЖурналРегистрации(Параметры.Параметр1, Параметры.Параметр2, Параметры.Параметр3);
	ИначеЕсли ИмяФункции = "ПреобразоватьСтрокуВДатуЭПД" Тогда
		РезультатФункции = МодульКода.ПреобразоватьСтрокуВДатуЭПД(Параметры.Параметр1);
	ИначеЕсли ИмяФункции = "ДанныеСостоянияОбъекта" Тогда
		РезультатФункции = МодульКода.ДанныеСостоянияОбъекта(Параметры.Параметр1);
	Иначе
		РезультатФункции = ВыполнитьНаСервереЕще(МодульКода, ИмяФункции, Параметры);
	КонецЕсли;
	
	Возврат РезультатФункции;

КонецФункции

//DynamicDirective

Функция ВыполнитьНаСервереЕще(МодульКода, ИмяФункции, Параметры)
	
	Если ИмяФункции = "ДанныеОснованийДляЗаполненияНаОснованииINI" Тогда
		РезультатФункции = МодульКода.ДанныеОснованийДляЗаполненияНаОснованииINI(Параметры.Параметр1, Параметры.Параметр2);
	ИначеЕсли ИмяФункции = "РезультатЗаполненияНаОснованииINI" Тогда
		РезультатФункции = МодульКода.РезультатЗаполненияНаОснованииINI(Параметры.Параметр1);
	ИначеЕсли ИмяФункции = "СвернутьГруз" Тогда
		РезультатФункции = Неопределено;
		МодульКода.СвернутьГруз(Параметры.Параметр1, Параметры.Параметр2, Параметры.Параметр3);
	ИначеЕсли ИмяФункции = "ПроверитьНаличиеПараметровПодключения" Тогда
		РезультатФункции = МодульКода.ПроверитьНаличиеПараметровПодключения();
	ИначеЕсли ИмяФункции = "ШаблонИмениINI" Тогда
		РезультатФункции = МодульКода.ШаблонИмениINI();
	ИначеЕсли ИмяФункции = "РезультатЗагрузкиДокументов" Тогда
		РезультатФункции = МодульКода.РезультатЗагрузкиДокументов(Параметры.Параметр1, Параметры.Параметр2, Параметры.Параметр3);
	ИначеЕсли ИмяФункции = "РезультатВыгрузкиДокументов" Тогда
		РезультатФункции = МодульКода.РезультатВыгрузкиДокументов(Параметры.Параметр1, Параметры.Параметр2, Параметры.Параметр3);
	Иначе
		РезультатФункции = Неопределено;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

