
Функция ЗначениеМетаданных(ИмяПредопределенныхДанных, ТипМетаданных = "Перечисление")
	
	ИмяМетаданных = СтрЗаменить(ИмяПредопределенныхДанных, "ESD", "Saby");

	Возврат ПредопределенноеЗначение(ТипМетаданных + "." + ИмяМетаданных);
	
КонецФункции

Функция ЗначениеМетаданныхКлиент(ИмяПредопределенныхДанных, ТипМетаданных = "Перечисление")
	
	ИмяМетаданных = СтрЗаменить(ИмяПредопределенныхДанных, "ESD", "Saby");

	Возврат ПредопределенноеЗначение(ТипМетаданных + "." + ИмяМетаданных);
	
КонецФункции

