
// Возвращает соответствие из всех значений перечисления.
// Параметры:
// 	ИмяМетаданных - Строка - имя метаданных перечисления
//  ПоЗначению - Булево - ключ для поиска имен (как в конфигураторе), дает зеркальный результат
//
// Возвращаемое значение:
//   Соответствие - коллекция всех значений указанных в перечислении.
//     * КлючСтруктуры - Строка - имя перечисления как оно задано в конфигураторе
//     * ЗначениеСтруктуры - ПеречислениеСсылка - ссылка на соответствующее значение.
//
Функция ВсеЗначенияПеречисления(ИмяМетаданных, ПоЗначению = Ложь) Экспорт
	
	РезультатФункции = Новый Соответствие;
													  
	Для Каждого ЗначениеПеречисления Из Перечисления[ИмяМетаданных] Цикл
		
		ИмяЗначения = xmlСтрока(ЗначениеПеречисления);
		
		Если ПоЗначению Тогда
			РезультатФункции.Вставить(ЗначениеПеречисления, ИмяЗначения);
		Иначе
			РезультатФункции.Вставить(ИмяЗначения, ЗначениеПеречисления);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

// Возвращает соответствие из всех титулов перечисления.
// Параметры:
// 	ИмяМетаданных - Строка - имя метаданных перечисления
//
// Возвращаемое значение:
//   Соответствие - соответствие всех значений в перечислении.
//     * Ключ - Строка - синоним 
//     * Значение - Строка - имя перечисления как оно задано в конфигураторе.
//
Функция ВсеЗначенияПеречисленияПоСинониму(ИмяМетаданных) Экспорт
	
	РезультатФункции = Новый Соответствие;
													  
	Для Каждого ЗначениеПеречисления Из Перечисления[ИмяМетаданных] Цикл
		ИмяЗначения = xmlСтрока(ЗначениеПеречисления);
		РезультатФункции.Вставить(СокрЛП(ЗначениеПеречисления), ИмяЗначения);
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

