
#Область Документы

Функция ТранспортнаяНакладная()
	
	Возврат "Saby_ТранспортнаяНакладная";
	
КонецФункции

Функция ПутевойЛист()

	Возврат "Saby_ПутевойЛист";

КонецФункции

Функция ЗаказНаПеревозку()

	Возврат "Saby_ЗаказНаПеревозку";

КонецФункции

#КонецОбласти // Документы

#Область Справочники

Функция ОпасныеГрузы()

	Возврат "Saby_ОпасныеГрузы";

КонецФункции

Функция ДокументыЭПД()
	
	Возврат "Saby_ДокументыЭПД";
	
КонецФункции

Функция ВидыУпаковки()
	
	Возврат "Saby_ВидыУпаковки";
	
КонецФункции

Функция СторонаДокумента()
	
	Возврат "Saby_Организации";
	
КонецФункции

Функция СостоянияОбъектов()
	
	Возврат "Saby_СостоянияОбъектов";
	
КонецФункции

#КонецОбласти // Справочники

#Область Перечисления

Функция РолиОтветственных()

	Возврат "Saby_РолиОтветственных";

КонецФункции

Функция Направление()

	Возврат "Saby_Направление";

КонецФункции

Функция РолиКонтрагентов()

	Возврат "Saby_РолиКонтрагентов";

КонецФункции

Функция ТипыДокумента()
	
	Возврат "Saby_ТипыДокумента";

КонецФункции

Функция ТипТитулаЭтрН()
	
	Возврат "Saby_ТипТитулаЭтрН";
	
КонецФункции

Функция ТипТитулаЭПЛ()
	
	Возврат "Saby_ТипТитулаЭПЛ";
	
КонецФункции

Функция ТипТитулаЗнП()
	
	Возврат "Saby_ТипТитулаЗнП";
	
КонецФункции

Функция ВидыТС()
	
	Возврат "Saby_ВидыТС";
	
КонецФункции

Функция ТипыВладенияТС()
	
	Возврат "Saby_ТипыВладенияТС";
	
КонецФункции

Функция ПризнакНачалаРейса()
	
	Возврат "Saby_ПризнакНачалаРейса";
	
КонецФункции

Функция КлассыОпасностиГрузов()
	
	Возврат "Saby_КлассыОпасностиГрузов";
	
КонецФункции

Функция ГруппыУпаковки()
	
	Возврат "Saby_ГруппыУпаковки";
	
КонецФункции

Функция ТипыКонтактнойИнформации()

	Возврат "ТипыКонтактнойИнформации";

КонецФункции

Функция ЮрФизЛицо()

	Возврат "Saby_ЮрФизЛицо";

КонецФункции

#КонецОбласти // Перечисления

#Область РегистрСведений

Функция ДанныеТитулов()
	
	Возврат "Saby_ДанныеТитулов";
	
КонецФункции

Функция РегистрСостояний()
	
	Возврат "Saby_Состояние";
	
КонецФункции

#КонецОбласти // РегистрСведений

#Область ОбщиеФормы

Функция ОрганизацииЭПД()
	
	Возврат "Saby_ОрганизацииЭПД";
	
КонецФункции

Функция ОтветственныйЭПД()
	
	Возврат "Saby_ОтветственныйЭПД";
	
КонецФункции

Функция ВыборТиповЭПД()
	
	Возврат "Saby_ВыборТиповЭПД";
	
КонецФункции

Функция ИныеПолучателиДокументаЭПД()
	
	Возврат "Saby_ИныеПолучателиДокументаЭПД";
	
КонецФункции

Функция НастройкиПериодаЭПД()
	
	Возврат "Saby_НастройкиПериодаЭПД";
	
КонецФункции

Функция ТранспортноеСредствоЭПД()
	
	Возврат "Saby_ТранспортноеСредствоЭПД";
	
КонецФункции

Функция ФормыЯдра()
	
	Возврат "Обработка.SABY.Форма.";
	
КонецФункции

#КонецОбласти // ОбщиеФормы

