
#Область Документы

&НаКлиенте
Функция ТранспортнаяНакладнаяКлиент()
	
	Возврат "Saby_ТранспортнаяНакладная";
	
КонецФункции

&НаКлиенте
Функция ПутевойЛистКлиент()

	Возврат "Saby_ПутевойЛист";

КонецФункции

&НаКлиенте
Функция ЗаказНаПеревозкуКлиент()

	Возврат "Saby_ЗаказНаПеревозку";

КонецФункции

#КонецОбласти // Документы

#Область Справочники

&НаКлиенте
Функция ОпасныеГрузыКлиент()

	Возврат "Saby_ОпасныеГрузы";

КонецФункции

&НаКлиенте
Функция ДокументыЭПДКлиент()
	
	Возврат "Saby_ДокументыЭПД";
	
КонецФункции

&НаКлиенте
Функция ВидыУпаковкиКлиент()
	
	Возврат "Saby_ВидыУпаковки";
	
КонецФункции

&НаКлиенте
Функция СторонаДокументаКлиент()
	
	Возврат "Saby_Организации";
	
КонецФункции

&НаКлиенте
Функция СостоянияОбъектовКлиент()
	
	Возврат "Saby_СостоянияОбъектов";
	
КонецФункции

#КонецОбласти // Справочники

#Область Перечисления

&НаКлиенте
Функция РолиОтветственныхКлиент()

	Возврат "Saby_РолиОтветственных";

КонецФункции

&НаКлиенте
Функция НаправлениеКлиент()

	Возврат "Saby_Направление";

КонецФункции

&НаКлиенте
Функция РолиКонтрагентовКлиент()

	Возврат "Saby_РолиКонтрагентов";

КонецФункции

&НаКлиенте
Функция ТипыДокументаКлиент()
	
	Возврат "Saby_ТипыДокумента";

КонецФункции

&НаКлиенте
Функция ТипТитулаЭтрНКлиент()
	
	Возврат "Saby_ТипТитулаЭтрН";
	
КонецФункции

&НаКлиенте
Функция ТипТитулаЭПЛКлиент()
	
	Возврат "Saby_ТипТитулаЭПЛ";
	
КонецФункции

&НаКлиенте
Функция ТипТитулаЗнПКлиент()
	
	Возврат "Saby_ТипТитулаЗнП";
	
КонецФункции

&НаКлиенте
Функция ВидыТСКлиент()
	
	Возврат "Saby_ВидыТС";
	
КонецФункции

&НаКлиенте
Функция ТипыВладенияТСКлиент()
	
	Возврат "Saby_ТипыВладенияТС";
	
КонецФункции

&НаКлиенте
Функция ПризнакНачалаРейсаКлиент()
	
	Возврат "Saby_ПризнакНачалаРейса";
	
КонецФункции

&НаКлиенте
Функция КлассыОпасностиГрузовКлиент()
	
	Возврат "Saby_КлассыОпасностиГрузов";
	
КонецФункции

&НаКлиенте
Функция ГруппыУпаковкиКлиент()
	
	Возврат "Saby_ГруппыУпаковки";
	
КонецФункции

&НаКлиенте
Функция ТипыКонтактнойИнформацииКлиент()

	Возврат "ТипыКонтактнойИнформации";

КонецФункции

&НаКлиенте
Функция ЮрФизЛицоКлиент()

	Возврат "Saby_ЮрФизЛицо";

КонецФункции

#КонецОбласти // Перечисления

#Область РегистрСведений

&НаКлиенте
Функция ДанныеТитуловКлиент()
	
	Возврат "Saby_ДанныеТитулов";
	
КонецФункции

&НаКлиенте
Функция РегистрСостоянийКлиент()
	
	Возврат "Saby_Состояние";
	
КонецФункции

#КонецОбласти // РегистрСведений

#Область ОбщиеФормы

&НаКлиенте
Функция ОрганизацииЭПДКлиент()
	
	Возврат "Saby_ОрганизацииЭПД";
	
КонецФункции

&НаКлиенте
Функция ОтветственныйЭПДКлиент()
	
	Возврат "Saby_ОтветственныйЭПД";
	
КонецФункции

&НаКлиенте
Функция ВыборТиповЭПДКлиент()
	
	Возврат "Saby_ВыборТиповЭПД";
	
КонецФункции

&НаКлиенте
Функция ИныеПолучателиДокументаЭПДКлиент()
	
	Возврат "Saby_ИныеПолучателиДокументаЭПД";
	
КонецФункции

&НаКлиенте
Функция НастройкиПериодаЭПДКлиент()
	
	Возврат "Saby_НастройкиПериодаЭПД";
	
КонецФункции

&НаКлиенте
Функция ТранспортноеСредствоЭПДКлиент()
	
	Возврат "Saby_ТранспортноеСредствоЭПД";
	
КонецФункции

&НаКлиенте
Функция ФормыЯдраКлиент()
	
	Возврат "Обработка.SABY.Форма.";
	
КонецФункции

#КонецОбласти // ОбщиеФормы

