
#Область Документы

//DynamicDirective
Функция ТранспортнаяНакладнаяКлиент()
	Возврат "Saby_ТранспортнаяНакладная";
КонецФункции

//DynamicDirective
Функция ПутевойЛистКлиент()
	Возврат "Saby_ПутевойЛист";
КонецФункции

//DynamicDirective
Функция ЗаказНаПеревозкуКлиент()
	Возврат "Saby_ЗаказНаПеревозку";
КонецФункции

#КонецОбласти // Документы

#Область Справочники

//DynamicDirective
Функция ОпасныеГрузыКлиент()
	Возврат "Saby_ОпасныеГрузы";
КонецФункции

//DynamicDirective
Функция ДокументыЭПДКлиент()
	Возврат "Saby_ДокументыЭПД";
КонецФункции

//DynamicDirective
Функция ВидыУпаковкиКлиент()
	Возврат "Saby_ВидыУпаковки";
КонецФункции

//DynamicDirective
Функция СторонаДокументаКлиент()
	Возврат "Saby_Организации";
КонецФункции

//DynamicDirective
Функция СостоянияОбъектовКлиент()
	Возврат "Saby_СостоянияОбъектов";
КонецФункции

#КонецОбласти // Справочники

#Область Перечисления

//DynamicDirective
Функция РолиОтветственныхКлиент()
	Возврат "Saby_РолиОтветственных";
КонецФункции

//DynamicDirective
Функция НаправлениеКлиент()
	Возврат "Saby_Направление";
КонецФункции

//DynamicDirective
Функция РолиКонтрагентовКлиент()
	Возврат "Saby_РолиКонтрагентов";
КонецФункции

//DynamicDirective
Функция ТипыДокументаКлиент()
	Возврат "Saby_ТипыДокумента";
КонецФункции

//DynamicDirective
Функция ТипТитулаЭтрНКлиент()
	Возврат "Saby_ТипТитулаЭтрН";
КонецФункции

//DynamicDirective
Функция ТипТитулаЭПЛКлиент()
	Возврат "Saby_ТипТитулаЭПЛ";
КонецФункции

//DynamicDirective
Функция ТипТитулаЗнПКлиент()
	Возврат "Saby_ТипТитулаЗнП";
КонецФункции

//DynamicDirective
Функция ВидыТСКлиент()
	Возврат "Saby_ВидыТС";
КонецФункции

//DynamicDirective
Функция ТипыВладенияТСКлиент()
	Возврат "Saby_ТипыВладенияТС";
КонецФункции

//DynamicDirective
Функция ПризнакНачалаРейсаКлиент()
	Возврат "Saby_ПризнакНачалаРейса";
КонецФункции

//DynamicDirective
Функция КлассыОпасностиГрузовКлиент()
	Возврат "Saby_КлассыОпасностиГрузов";
КонецФункции

//DynamicDirective
Функция ГруппыУпаковкиКлиент()
	Возврат "Saby_ГруппыУпаковки";
КонецФункции

//DynamicDirective
Функция ТипыКонтактнойИнформацииКлиент()
	Возврат "ТипыКонтактнойИнформации";
КонецФункции

//DynamicDirective
Функция ЮрФизЛицоКлиент()
	Возврат "Saby_ЮрФизЛицо";
КонецФункции

#КонецОбласти // Перечисления

#Область РегистрСведений

//DynamicDirective
Функция ДанныеТитуловКлиент()
	Возврат "Saby_ДанныеТитулов";
КонецФункции

//DynamicDirective
Функция РегистрСостоянийКлиент()
	Возврат "Saby_Состояние";
КонецФункции

#КонецОбласти // РегистрСведений

#Область ОбщиеФормы

//DynamicDirective
Функция ОрганизацииЭПДКлиент()
	Возврат "Saby_ОрганизацииЭПД";
КонецФункции

//DynamicDirective
Функция ОтветственныйЭПДКлиент()
	Возврат "Saby_ОтветственныйЭПД";
КонецФункции

//DynamicDirective
Функция ВыборТиповЭПДКлиент()
	Возврат "Saby_ВыборТиповЭПД";
КонецФункции

//DynamicDirective
Функция ИныеПолучателиДокументаЭПДКлиент()
	Возврат "Saby_ИныеПолучателиДокументаЭПД";
КонецФункции

//DynamicDirective
Функция НастройкиПериодаЭПДКлиент()
	Возврат "Saby_НастройкиПериодаЭПД";
КонецФункции

//DynamicDirective
Функция ТранспортноеСредствоЭПДКлиент()
	Возврат "Saby_ТранспортноеСредствоЭПД";
КонецФункции

//DynamicDirective
Функция ФормыЯдраКлиент()
	Возврат "Обработка.Saby_SABY.Форма.";
КонецФункции

//DynamicDirective
Функция ВыборПечатнойФормыКлиент()
	Возврат "ESD_ВыборПечатнойФормы";	
КонецФункции

#КонецОбласти // ОбщиеФормы

