
#Область Документы

Функция ТранспортнаяНакладнаяКлиент()
	
	Возврат "Saby_ТранспортнаяНакладная";
	
КонецФункции

Функция ПутевойЛистКлиент()

	Возврат "Saby_ПутевойЛист";

КонецФункции

Функция ЗаказНаПеревозкуКлиент()

	Возврат "Saby_ЗаказНаПеревозку";

КонецФункции

#КонецОбласти // Документы

#Область Справочники

Функция ОпасныеГрузыКлиент()

	Возврат "Saby_ОпасныеГрузы";

КонецФункции

Функция ДокументыЭПДКлиент()
	
	Возврат "Saby_ДокументыЭПД";
	
КонецФункции

Функция ВидыУпаковкиКлиент()
	
	Возврат "Saby_ВидыУпаковки";
	
КонецФункции

Функция СторонаДокументаКлиент()
	
	Возврат "Saby_Организации";
	
КонецФункции

Функция СостоянияОбъектовКлиент()
	
	Возврат "Saby_СостоянияОбъектов";
	
КонецФункции

#КонецОбласти // Справочники

#Область Перечисления

Функция РолиОтветственныхКлиент()

	Возврат "Saby_РолиОтветственных";

КонецФункции

Функция НаправлениеКлиент()

	Возврат "Saby_Направление";

КонецФункции

Функция РолиКонтрагентовКлиент()

	Возврат "Saby_РолиКонтрагентов";

КонецФункции

Функция ТипыДокументаКлиент()
	
	Возврат "Saby_ТипыДокумента";

КонецФункции

Функция ТипТитулаЭтрНКлиент()
	
	Возврат "Saby_ТипТитулаЭтрН";
	
КонецФункции

Функция ТипТитулаЭПЛКлиент()
	
	Возврат "Saby_ТипТитулаЭПЛ";
	
КонецФункции

Функция ТипТитулаЗнПКлиент()
	
	Возврат "Saby_ТипТитулаЗнП";
	
КонецФункции

Функция ВидыТСКлиент()
	
	Возврат "Saby_ВидыТС";
	
КонецФункции

Функция ТипыВладенияТСКлиент()
	
	Возврат "Saby_ТипыВладенияТС";
	
КонецФункции

Функция ПризнакНачалаРейсаКлиент()
	
	Возврат "Saby_ПризнакНачалаРейса";
	
КонецФункции

Функция КлассыОпасностиГрузовКлиент()
	
	Возврат "Saby_КлассыОпасностиГрузов";
	
КонецФункции

Функция ГруппыУпаковкиКлиент()
	
	Возврат "Saby_ГруппыУпаковки";
	
КонецФункции

Функция ТипыКонтактнойИнформацииКлиент()

	Возврат "ТипыКонтактнойИнформации";

КонецФункции

Функция ЮрФизЛицоКлиент()

	Возврат "Saby_ЮрФизЛицо";

КонецФункции

#КонецОбласти // Перечисления

#Область РегистрСведений

Функция ДанныеТитуловКлиент()
	
	Возврат "Saby_ДанныеТитулов";
	
КонецФункции

Функция РегистрСостоянийКлиент()
	
	Возврат "Saby_Состояние";
	
КонецФункции

#КонецОбласти // РегистрСведений

#Область ОбщиеФормы

Функция ОрганизацииЭПДКлиент()
	
	Возврат "Saby_ОрганизацииЭПД";
	
КонецФункции

Функция ОтветственныйЭПДКлиент()
	
	Возврат "Saby_ОтветственныйЭПД";
	
КонецФункции

Функция ВыборТиповЭПДКлиент()
	
	Возврат "Saby_ВыборТиповЭПД";
	
КонецФункции

Функция ИныеПолучателиДокументаЭПДКлиент()
	
	Возврат "Saby_ИныеПолучателиДокументаЭПД";
	
КонецФункции

Функция НастройкиПериодаЭПДКлиент()
	
	Возврат "Saby_НастройкиПериодаЭПД";
	
КонецФункции

Функция ТранспортноеСредствоЭПДКлиент()
	
	Возврат "Saby_ТранспортноеСредствоЭПД";
	
КонецФункции

Функция ФормыЯдраКлиент()
	
	Возврат "Обработка.ESD_SABY.Форма.";
	
КонецФункции

#КонецОбласти // ОбщиеФормы

