
&НаКлиенте
Функция МодульКодаКлиент(ИмяМодуля)
	
	Модули = Новый Соответствие;
	Модули.Вставить("ESD_Core",                              Saby_Core);
	Модули.Вставить("ESD_ТНВыгрузкаСервер",                  Saby_ТНВыгрузкаСервер);
	Модули.Вставить("ESD_ТНОбщегоНазначенияКлиентСервер",    Saby_ТНОбщегоНазначенияКлиентСервер);
	Модули.Вставить("ESD_ТНЗагрузкаСервер",                  Saby_ТНЗагрузкаСервер);
	Модули.Вставить("ESD_ТНОбщегоНазначенияСервер",          Saby_ТНОбщегоНазначенияСервер);
	Модули.Вставить("ESD_ТНОбщегоНазначенияКлиент",          Saby_ТНОбщегоНазначенияКлиент);
	Модули.Вставить("ФайловаяСистемаКлиент",                 ФайловаяСистемаКлиент);
	Модули.Вставить("УправлениеКонтактнойИнформациейКлиент", УправлениеКонтактнойИнформациейКлиент);
	
	ИмяМодуляКонфигурации = СтрЗаменить(ИмяМодуля, "Saby", "ESD");
	
	Возврат Модули[ИмяМодуляКонфигурации];
	
КонецФункции

