
&НаКлиенте
Функция МодульКодаКлиент(ИмяМодуля)
	
	Модули = Новый Соответствие;
	Модули.Вставить("Saby_Core",                           Saby_Core);
	Модули.Вставить("Saby_ТНВыгрузкаСервер",               Saby_ТНВыгрузкаСервер);
	Модули.Вставить("Saby_ТНОбщегоНазначенияКлиентСервер", Saby_ТНОбщегоНазначенияКлиентСервер);
	Модули.Вставить("Saby_ТНЗагрузкаСервер",               Saby_ТНЗагрузкаСервер);
	Модули.Вставить("Saby_ТНОбщегоНазначенияСервер",       Saby_ТНОбщегоНазначенияСервер);
	Модули.Вставить("Saby_ТНОбщегоНазначенияКлиент",       Saby_ТНОбщегоНазначенияКлиент);
	Модули.Вставить("ФайловаяСистемаКлиент",               ФайловаяСистемаКлиент);
	Модули.Вставить("Saby_ОбщегоНазначенияКлиентСервер",   Saby_ОбщегоНазначенияКлиентСервер);
	
	Возврат Модули[ИмяМодуля];
	
КонецФункции

