
Функция МодульКодаКлиент(ИмяМодуля)
	
	Модули = Новый Соответствие;
	Модули.Вставить("ESD_ТНОбщегоНазначенияСервер",       Saby_ТНОбщегоНазначенияСервер);
	Модули.Вставить("ESD_ТНЗагрузкаСервер",               Saby_ТНЗагрузкаСервер);
	Модули.Вставить("ESD_ТНОбщегоНазначенияКлиентСервер", Saby_ТНОбщегоНазначенияКлиентСервер);
	Модули.Вставить("ESD_ТНВыгрузкаСервер",               Saby_ТНВыгрузкаСервер);
	Модули.Вставить("ESD_Core",                           Saby_Core);
	Модули.Вставить("ESD_ОбщегоНазначенияКлиентСервер",   Saby_ОбщегоНазначенияКлиентСервер);
	
	#Если Сервер Тогда

		ИмяБухгалтерскийУчетПереопределяемый = "БухгалтерскийУчетПереопределяемый";
		Если Метаданные.ОбщиеМодули.Найти(ИмяБухгалтерскийУчетПереопределяемый) <> Неопределено Тогда
			МодульБухгалтерскийУчетПереопределяемый = ОбщегоНазначения.ВычислитьВБезопасномРежиме(
				ИмяБухгалтерскийУчетПереопределяемый);
			Модули.Вставить(ИмяБухгалтерскийУчетПереопределяемый, МодульБухгалтерскийУчетПереопределяемый);
		Иначе
			Модули.Вставить(ИмяБухгалтерскийУчетПереопределяемый, Неопределено);
		КонецЕсли;

		ИмяДлительныеОперации = "ДлительныеОперации";
		Если Метаданные.ОбщиеМодули.Найти(ИмяДлительныеОперации) <> Неопределено Тогда
			МодульДлительныеОперации = ОбщегоНазначения.ВычислитьВБезопасномРежиме(ИмяДлительныеОперации);
			Модули.Вставить(ИмяДлительныеОперации, МодульДлительныеОперации);
		Иначе
			Модули.Вставить(ИмяДлительныеОперации, Неопределено);
		КонецЕсли;
		
		ИмяУправлениеКонтактнойИнформацией = "УправлениеКонтактнойИнформацией";
		Если Метаданные.ОбщиеМодули.Найти(ИмяУправлениеКонтактнойИнформацией) <> Неопределено Тогда
			МодульУправлениеКонтактнойИнформациейСлужебный = ОбщегоНазначения.ВычислитьВБезопасномРежиме(
				ИмяУправлениеКонтактнойИнформацией);
			Модули.Вставить(ИмяУправлениеКонтактнойИнформацией, МодульУправлениеКонтактнойИнформациейСлужебный);
		Иначе
			Модули.Вставить(ИмяУправлениеКонтактнойИнформацией, Неопределено);
		КонецЕсли;

		ИмяУправлениеКонтактнойИнформациейСлужебный = "УправлениеКонтактнойИнформациейСлужебный";
		Если Метаданные.ОбщиеМодули.Найти(ИмяУправлениеКонтактнойИнформациейСлужебный) <> Неопределено Тогда
			МодульУправлениеКонтактнойИнформациейСлужебный = ОбщегоНазначения.ВычислитьВБезопасномРежиме(
				ИмяУправлениеКонтактнойИнформациейСлужебный);
			Модули.Вставить(ИмяУправлениеКонтактнойИнформациейСлужебный, МодульУправлениеКонтактнойИнформациейСлужебный);
		Иначе
			Модули.Вставить(ИмяУправлениеКонтактнойИнформациейСлужебный, Неопределено);
		КонецЕсли;

		Модули.Вставить("Справочники.ESD_СостоянияОбъектов", Справочники.Saby_СостоянияОбъектов);
		Модули.Вставить("Справочники.ESD_ОпасныеГрузы",      Справочники.Saby_ОпасныеГрузы);
		Модули.Вставить("Справочники.ESD_ДокументыЭПД",      Справочники.Saby_ДокументыЭПД);
		Модули.Вставить("Справочники.ESD_ВидыУпаковки",      Справочники.Saby_ВидыУпаковки);
		Модули.Вставить("Справочники.ESD_СторонаДокумента",  Справочники.Saby_СторонаДокумента);
		
		Модули.Вставить("Документы.ESD_ТранспортнаяНакладная", Документы.Saby_ТранспортнаяНакладная);
		Модули.Вставить("Документы.ESD_ЗаказНаПеревозку",      Документы.Saby_ЗаказНаПеревозку);
		Модули.Вставить("Документы.ESD_ПутевойЛист",           Документы.Saby_ПутевойЛист);
		
		КодыОграниченийПроездаЧерезТуннели = Перечисления.Saby_КодыОграниченийПроездаЧерезТуннели;

		Модули.Вставить("Перечисления.ESD_ТипыДокумента",                      Перечисления.Saby_ТипыДокумента);
		Модули.Вставить("Перечисления.ESD_ТипТитулаЭПЛ",                       Перечисления.Saby_ТипТитулаЭПЛ);
		Модули.Вставить("Перечисления.ESD_ТипТитулаЭтрН",                      Перечисления.Saby_ТипТитулаЭтрН);
		Модули.Вставить("Перечисления.ESD_ТипыВладенияТС",                     Перечисления.Saby_ТипыВладенияТС);
		Модули.Вставить("Перечисления.ESD_ТипТитулаЗнП",                       Перечисления.Saby_ТипТитулаЗнП);
		Модули.Вставить("Перечисления.ESD_ЮрФизЛицо",                          Перечисления.Saby_ЮрФизЛицо);
		Модули.Вставить("Перечисления.ESD_ТипДокументаЗнП",                    Перечисления.Saby_ТипДокументаЗнП);
		Модули.Вставить("Перечисления.ESD_РолиКонтрагентов",                   Перечисления.Saby_РолиКонтрагентов);
		Модули.Вставить("Перечисления.ESD_МетодОпределенияМассы",              Перечисления.Saby_МетодОпределенияМассы);
		Модули.Вставить("Перечисления.ESD_КодыОграниченийПроездаЧерезТуннели", КодыОграниченийПроездаЧерезТуннели);
		Модули.Вставить("Перечисления.ESD_Направление",                        Перечисления.Saby_Направление);
		Модули.Вставить("Перечисления.ESD_ТипГруза",                           Перечисления.Saby_ТипГруза);
		Модули.Вставить("Перечисления.ESD_ПризнакНачалаРейса",                 Перечисления.Saby_ПризнакНачалаРейса);
		Модули.Вставить("Перечисления.ESD_КлассыОпасностиГрузов",              Перечисления.Saby_КлассыОпасностиГрузов);
		Модули.Вставить("Перечисления.ESD_РолиОтветственных",                  Перечисления.Saby_РолиОтветственных);
		Модули.Вставить("Перечисления.ESD_ГруппыУпаковки",                     Перечисления.Saby_ГруппыУпаковки);
		Модули.Вставить("Перечисления.ESD_ВладелецОбъектаОтгрузки",            Перечисления.Saby_ВладелецОбъектаОтгрузки);
		Модули.Вставить("Перечисления.ESD_ВидПеревозки",                       Перечисления.Saby_ВидПеревозки);
		Модули.Вставить("Перечисления.ESD_ВидСообщенияЭПЛ",                    Перечисления.Saby_ВидСообщенияЭПЛ);
		Модули.Вставить("Перечисления.ESD_ВидКоммерческойПеревозки",           Перечисления.Saby_ВидКоммерческойПеревозки);
		Модули.Вставить("Перечисления.ESD_ВидыТС",                             Перечисления.Saby_ВидыТС);
		Модули.Вставить("Перечисления.ESD_ДоступныеДействия",                  Перечисления.Saby_ДоступныеДействия);
		
		Модули.Вставить("РегистрыСведений.ESD_ДвоичныеДанныеФайлов", РегистрыСведений.Saby_ДвоичныеДанныеФайлов);
		Модули.Вставить("РегистрыСведений.ESD_Состояние",            РегистрыСведений.Saby_Состояние);
		Модули.Вставить("РегистрыСведений.ESD_ДанныеТитулов",        РегистрыСведений.Saby_ДанныеТитулов);

	#КонецЕсли
	
	#Если Не Сервер Тогда
		Модули.Вставить("ESD_ТНОбщегоНазначенияКлиент", Saby_ТНОбщегоНазначенияКлиент);
	#КонецЕсли
	
	ИмяМодуляКонфигурации = СтрЗаменить(ИмяМодуля, "Saby", "ESD");
	
	Возврат Модули[ИмяМодуляКонфигурации];
	
КонецФункции

