
&НаСервере
Процедура НастроитьФормуДляСтарыхПлатформ()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	ВерсияПлатформыБольшеИлиРавна8_3_12 = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").СравнитьВерсии(
		СистемнаяИнформация.ВерсияПриложения, "8.3.12.0") >= 0;
		
	Если Строка(Метаданные.РежимСовместимости) = "НеИспользовать" Тогда
		ВерсияСовместимостиБольшеИлиРавна8_3_12 = Истина;
	Иначе
		ВерсияСовместимостиБольшеИлиРавна8_3_12 = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").СравнитьВерсии(
			Метаданные.РежимСовместимости, "8.3.12.0") >= 0;
	КонецЕсли;
		
	Если ВерсияПлатформыБольшеИлиРавна8_3_12 И ВерсияСовместимостиБольшеИлиРавна8_3_12 Тогда
		МассивИменГрупп = Новый Массив;
		МассивИменГрупп.Добавить("ГруппаДополнительныеКонтакты");
		МассивИменГрупп.Добавить("Группа_Прицепы");
		МассивИменГрупп.Добавить("Группа_Водители");
		Для Каждого ИмяГруппы Из МассивИменГрупп Цикл
			Элементы[ИмяГруппы].Поведение             = ПоведениеОбычнойГруппы.Всплывающая;
			Элементы[ИмяГруппы].ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
		КонецЦикла;
	Иначе
		Элементы.ЗаменаВодители.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
		Элементы.ЗаменаТС.ЦветРамки       = ЦветаСтиля.ЦветФонаФормы;
		Элементы.ЗаменаПрицепы.ЦветРамки  = ЦветаСтиля.ЦветФонаФормы;
	КонецЕсли;
	
КонецПроцедуры

#Область includr_etrn_src_vo2_CommonModule_ВыполнениеФункцииНаСервере //&НаСервере
#КонецОбласти // includr_etrn_src_vo2_CommonModule_ВыполнениеФункцииНаСервере //&НаСервере

#Область includr_etrn_src_vo2_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_src_vo2_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_src_vo2_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_src_vo2_CommonModule_ОпределениеМодуляКодаКлиент

#Область includr_etrn_src_vo2_CommonModule_ЗначениеМетаданных
#КонецОбласти // includr_etrn_src_vo2_CommonModule_ЗначениеМетаданных

#Область includr_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_CommonModule
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_CommonModule

#Область includr_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_CommonModule //&НаКлиенте
#КонецОбласти // includr_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_CommonModule //&НаКлиенте

#Область include_etrn_src_vo2_Document_ТранспортнаяНакладная_DocumentForm_ФормаДинамическихТитулов_ДанныеБазы
#КонецОбласти // include_etrn_base_Document_ТранспортнаяНакладная_DocumentForm_ФормаДинамическихТитулов_ДанныеБазы

#Область includr_etrn_src_vo2_CommonModule_КартинкаИнтерфейса //&НаКлиенте
#КонецОбласти // includr_etrn_src_vo2_CommonModule_КартинкаИнтерфейса //&НаКлиенте

#Область includr_etrn_src_vo2_CommonModule_ДокументыЭПД //&НаКлиенте
#КонецОбласти // includr_etrn_src_vo2_CommonModule_ДокументыЭПД //&НаКлиенте

#Область includr_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ПараметрыДаты
#КонецОбласти // includr_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ПараметрыДаты

#Область includr_etrn_base_CommonModule_ТНВыгрузкаСервер_ВзаимодействиеСОнлайном //&НаКлиенте
#КонецОбласти // includr_etrn_base_CommonModule_ТНВыгрузкаСервер_ВзаимодействиеСОнлайном //&НаКлиенте

#Область includr_etrn_src_vo2_CommonModule_Метаданные
#КонецОбласти // includr_etrn_src_vo2_CommonModule_Метаданные

#Область includr_etrn_src_vo2_CommonModule_МетаданныеКлиент
#КонецОбласти // includr_etrn_src_vo2_CommonModule_МетаданныеКлиент

