
&НаСервере
Процедура НастроитьДокументыЭПД()
	
	СкрытьВидимость = Новый Массив;
	СкрытьВидимость.Добавить("ДокументыЭПДДокументВладения");
	СкрытьВидимость.Добавить("ДокументыЭПДТип");
	
	МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", Ложь, СкрытьВидимость);
	
	Элементы.ДокументыЭПДТип.ОграничениеТипа = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").ОписаниеТипаСтрока(32);
	Элементы.ДокументыЭПДТип.РежимВыбораИзСписка = Истина;
	Элементы.ДокументыЭПДТип.СписокВыбора.Добавить("ПодтверждениеВладения", "Подтверждение владения");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДокументыЭПД(ДанныеЗаполнения)

	ЗаполнениеНеТребуется = Не ДанныеЗаполнения.ЭтоВО
							Или Не ДанныеЗаполнения.Свойство("ОснованияВладения")
							Или Не ЗначениеЗаполнено(ДанныеЗаполнения.ОснованияВладения);
	
	Если ЗаполнениеНеТребуется Тогда
		Возврат;
	КонецЕсли;	
			
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("Тип",          "ПодтверждениеВладения");
	ПараметрыДокумента.Вставить("ИмяРеквизита", Неопределено);
	ПараметрыДокумента.Вставить("Заголовок",    "Документ владения");
	ПараметрыДокумента.Вставить("ТипЭПД",       "ДокументыТС");	
	ПараметрыДокумента.Вставить("Индекс",       Неопределено);	
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтруктураДокумента", ПараметрыДокумента);	
	
	Для Каждого ДокВладения Из ДанныеЗаполнения.ОснованияВладения Цикл
		ЗаполнитьДанныеДокументаЭПД(ДокВладения, ДополнительныеПараметры);			
	КонецЦикла;
	
	ЭтаФорма.МаксимальныйКлючСтроки_ДокументыЭПД = ЭтаФорма.ДокументыЭПД.Количество();
	
КонецПроцедуры

&НаСервере
Функция ФормаОбъект(Форма)
	
	Возврат Форма;
	
КонецФункции

&НаСервере
Процедура НастроитьФормуДляСтарыхПлатформ()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	ВерсияПлатформыБольшеИлиРавна8_3_12 = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").СравнитьВерсии(
		СистемнаяИнформация.ВерсияПриложения, "8.3.12.0") >= 0;
		
	Если Строка(Метаданные.РежимСовместимости) = "НеИспользовать" Тогда
		ВерсияСовместимостиБольшеИлиРавна8_3_12 = Истина;
	Иначе
		ВерсияСовместимостиБольшеИлиРавна8_3_12 = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").СравнитьВерсии(
			Метаданные.РежимСовместимости, "8.3.12.0") >= 0;
	КонецЕсли;
		
	Если ВерсияПлатформыБольшеИлиРавна8_3_12 И ВерсияСовместимостиБольшеИлиРавна8_3_12 Тогда
		Элементы.ГруппаТаблицаДанныхГИБДД.Поведение             = ПоведениеОбычнойГруппы.Всплывающая;
		Элементы.ГруппаТаблицаДанныхГИБДД.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	КонецЕсли;
	
КонецПроцедуры

#Область include_etrn_src_vo3_CommonModule_ОпределениеМодуляКода
#КонецОбласти // include_etrn_src_vo3_CommonModule_ОпределениеМодуляКода

#Область include_etrn_src_vo3_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // include_etrn_src_vo3_CommonModule_ОпределениеМодуляКодаКлиент

#Область include_etrn_src_vo3_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_src_vo3_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_Enum_ТипыВладенияТС_Enum
#КонецОбласти // include_etrn_base_Enum_ТипыВладенияТС_Enum

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_РаботаСоСвязаннымиТаблицами //&НаСервере
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_РаботаСоСвязаннымиТаблицами //&НаСервере

#Область include_etrn_src_vo3_CommonModule_ВыполнениеФункцииНаСервере //&НаСервере
#КонецОбласти // include_etrn_src_vo3_CommonModule_ВыполнениеФункцииНаСервере //&НаСервере

#Область include_etrn_src_vo3_CommonModule_КартинкаИнтерфейса
#КонецОбласти // include_etrn_src_vo3_CommonModule_КартинкаИнтерфейса

#Область include_etrn_src_vo3_CommonModule_ДокументыЭПД //&НаСервере
#КонецОбласти // include_etrn_src_vo3_CommonModule_ДокументыЭПД //&НаСервере

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_CommonModule
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиент_CommonModule

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ОбщиеСтруктуры //&НаКлиенте
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ОбщиеСтруктуры //&НаСервере

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ПолучениеДанныхИзКоллекций //&НаКлиенте
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_ПолучениеДанныхИзКоллекций //&НаКлиенте

#Область include_etrn_src_vo3_CommonModule_ТНОбщегоНазначенияКлиентСервер_РаботаСоСтроками //&НаКлиенте
#КонецОбласти // include_etrn_src_vo3_CommonModule_ТНОбщегоНазначенияКлиентСервер_РаботаСоСтроками //&НаКлиенте

