
&НаСервере
Процедура НастроитьДокументыЭПД()
	
	СкрытьВидимость = Новый Массив;
	СкрытьВидимость.Добавить("ДокументыЭПДДокументВладения");
	СкрытьВидимость.Добавить("ДокументыЭПДТип");
	
	МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", Ложь, СкрытьВидимость);
	
	Элементы.ДокументыЭПДТип.ОграничениеТипа = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").ОписаниеТипаСтрока(32);
	Элементы.ДокументыЭПДТип.РежимВыбораИзСписка = Истина;
	Элементы.ДокументыЭПДТип.СписокВыбора.Добавить("ПодтверждениеВладения", "Подтверждение владения");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДокументыЭПД(ДанныеЗаполнения)
	
	Если Не ДанныеЗаполнения.Свойство("ДокументыЭПД") Или Не ЗначениеЗаполнено(ДанныеЗаполнения.ДокументыЭПД) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтруктураДокументаЭПД Из ДанныеЗаполнения.ДокументыЭПД Цикл
		СтрокаДокументаЭПД = ЭтаФорма.ДокументыЭПД.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокументаЭПД, СтруктураДокументаЭПД);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ФормаОбъект(Форма)
	
	Возврат Форма;
	
КонецФункции

#Область include_etrn_src_vo3_CommonModule_ОпределениеМодуляКода
#КонецОбласти // include_etrn_src_vo3_CommonModule_ОпределениеМодуляКода

#Область include_etrn_src_vo3_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // include_etrn_src_vo3_CommonModule_ОпределениеМодуляКодаКлиент

#Область include_etrn_src_vo3_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_src_vo3_CommonModule_ЗначениеМетаданных

#Область include_etrn_base_Enum_ТипыВладенияТС_Enum
#КонецОбласти // include_etrn_base_Enum_ТипыВладенияТС_Enum

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_РаботаСоСвязаннымиТаблицами //&НаКлиенте
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияКлиентСервер_РаботаСоСвязаннымиТаблицами //&НаКлиенте

