
// Преобразование строки в двоичные данные
// 
// Параметры:
//  Строка - Строка - текстовая строка
//
// Возвращаемое значение:
//  ДвоичныеДанные - закодированная строка в двоичных данных
//
Функция СтрокаВДвоичныеДанные(Строка)
    Поток = Новый ПотокВПамяти();
    ЗаписьДанных = Новый ЗаписьДанных(Поток, КодировкаТекста.UTF8);
    ЗаписьДанных.ЗаписатьСимволы(Строка);
    ЗаписьДанных.Закрыть();
    Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
КонецФункции

// Преобразование двоичных данных в строку
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - исходные двоичные данные, содержащие строку
//
// Возвращаемое значение:
//  Строка - полученная из двоичных данных строка
//
Функция ДвоичныеДанныеВСтроку(ДвоичныеДанные) Экспорт
    Чтение = Новый ЧтениеДанных(ДвоичныеДанные, КодировкаТекста.UTF8);
    Результат = Чтение.ПрочитатьСтроку();
    Чтение.Закрыть();

    Возврат Результат;
КонецФункции

