 
 #Область СлужебныеПроцедурыИФункции
 
Функция МассивТиповВладельцевПрисоединенныхФайлов() Экспорт
	
	Типы = Новый Массив();
	Типы.Добавить(Тип("ДокументСсылка." + ТранспортнаяНакладная()));
	Типы.Добавить(Тип("ДокументСсылка." + ПутевойЛист()));
	Типы.Добавить(Тип("ДокументСсылка." + ЗаказНаПеревозку()));
	
	Возврат Типы; 
	
КонецФункции 

Функция МассивТиповПрисоединенныхФайлов() Экспорт
	
	ШаблонТипа = "СправочникСсылка.%1ПрисоединенныеФайлы";
	
	Типы = Новый Массив();
	ТипТранспортнаяНакладная = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(ШаблонТипа, ТранспортнаяНакладная());
	Типы.Добавить(Тип(ТипТранспортнаяНакладная));
	ТипПутевойЛист = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(ШаблонТипа, ПутевойЛист());
	Типы.Добавить(Тип(ТипПутевойЛист));
	ТипЗаказНаПеревозку = МодульКода("Saby_ТНОбщегоНазначенияКлиентСервер").СтрШаблонЭПД(ШаблонТипа, ЗаказНаПеревозку());
	Типы.Добавить(Тип(ТипЗаказНаПеревозку));
	
	Возврат Типы;
	
КонецФункции 

// В качестве параметр передается ссылка на справочник или документ
// Параметры:
//  Владелец - Ссылка - владелец справочника присоединенного файла
//
// Возвращаемое значение:
// 	Булево - Истина, если владелец присоединенного файла создан в расширении иначе Ложь
//
Функция ВладелецФайлаВРасширении(Владелец) Экспорт 
	
	Результат = Ложь;
	Для Каждого ЭлементТип Из МассивТиповВладельцевПрисоединенныхФайлов() Цикл
		Если ТипЗнч(Владелец) = ЭлементТип Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;   
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#Область include_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // include_etrn_base_CommonModule_ОпределениеМодуляКода

#Область include_etrn_base_CommonModule_Метаданные
#КонецОбласти // include_etrn_base_CommonModule_Метаданные
