
// Зачистка документа основания по команде из формы
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма источник вызова
//
&НаКлиенте
Процедура ОчиститьДокументОснованиеНаФорме(Форма) Экспорт
	Если Не ЗначениеЗаполнено(Форма.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
		
	Форма.Модифицированность = Истина;
	Форма.ДокументОснование = Неопределено;
	Форма.Элементы.ДекорацияДокументОснование.Заголовок = "Выбрать документ основание";
	Форма.Элементы.ОчиститьДокументОснование.Доступность = Ложь;
	
	ФормаОбъект = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ФормаОбъект(Форма);
	ФормаОбъект.ДокументОснование_Идентификатор    = "";
	ФормаОбъект.ДокументОснование_ОбъектМетаданных = "";
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНажатие(Форма, Приемник = "") Экспорт
    Если ЗначениеЗаполнено(Форма.ДокументОснование) Тогда
		ПоказатьЗначение(, Форма.ДокументОснование);
	КонецЕсли;
КонецПроцедуры

// Обработка выбора значения документа основания
// Параметры:
//  Значение - ДокументСсылка - выбранный документ как источник для заполнения данных
//  ДопПараметры - Структура - дополнительные параметры
//
&НаКлиенте
Процедура ПослеВыбораЗначенияДокументаОснования(Значение, ДопПараметры) Экспорт
	Если Значение = Неопределено Тогда
		// если ничего не выбрали то выходим
		Возврат;
	КонецЕсли;

	Форма = ДопПараметры.Форма;
	Форма.Модифицированность = Истина;
	Форма.ДокументОснование = Значение;
	Форма.Элементы.ДекорацияДокументОснование.Заголовок = СокрЛП(Значение);
	
	ФормаОбъект = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ФормаОбъект(Форма);
	Если Не ЗначениеЗаполнено(ФормаОбъект.Ссылка) Тогда
		ЗаписатьДанныеДокумента(Форма);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Форма.ДокументОснование) Тогда	
		Форма.Элементы.ОчиститьДокументОснование.Доступность = Истина;
		Оповестить("ВыбранДокументОснованиеINI", , Форма);	
	Иначе	
		Форма.ДокументОснование = "";
		
		ФормаОбъект.ДокументОснование_Идентификатор    = "";
		ФормаОбъект.ДокументОснование_ОбъектМетаданных = "";
		
		Форма.Элементы.ОчиститьДокументОснование.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры

// Запись документа из формы
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма источник вызова
//
&НаКлиенте
Процедура ЗаписатьДанныеДокумента(Форма) Экспорт
	РежимЗаписи = РежимЗаписиДокумента.Запись;
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписи);
	Форма.Записать(ПараметрыЗаписи);
КонецПроцедуры

