
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыИзПараметров(Параметры);
	
	ОбновитьВидимостьДоступностьЭлементовФормы(Параметры.ТолькоПросмотр);
	
	Если Параметры.Свойство("ОснованияВладения") И ЭтаФорма.ДокументыЭПД.Количество() = 0 Тогда
		ЗаполнитьОснованияВладенияИзСтроки(Параметры.ОснованияВладения);
	КонецЕсли;
	
	УстановитьТипыРеквизитов();
	
	ОбновитьОтображениеОснованийВладения();
	
	НастроитьДокументыЭПД();
	
	НастроитьФормуДляСтарыхПлатформ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// решение проблемы установки фокуса в ОФ на форме источнике
	Если Не ЭтаФорма.ВводДоступен() Тогда
	    ВремяАктивации = 0.5;
		ЭтаФорма.ПодключитьОбработчикОжидания("АктивизироватьФормуТС", ВремяАктивации, Истина);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОбработатьОповещенияДляФормы(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	ОбновитьДанныеПоСсылке();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипВладенияПриИзменении(Элемент)
	
	ОбновитьОтображениеОснованийВладения();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыЭПД

&НаКлиенте
Процедура ДокументыЭПДПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элемент.ТекущиеДанные.КлючСтроки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").НовыйКлючСтроки(
			ЭтаФорма, "ДокументыЭПД");
		
		Элемент.ТекущиеДанные.Тип = ЗначениеМетаданныхКлиент("ESD_ТипыДокумента.ПодтверждениеВладения");
		
	КонецЕсли;
	
	Если ЭтаФорма.ЭтоВО Тогда
		
		МодульКодаКлиент("ЭтаФорма").ДокументыЭПДОткрыть(
			Элемент.ТекущийЭлемент.Имя,
			"Документ владения",
			"ДокументТС",
			Элементы.ДокументыЭПД.ТолькоПросмотр);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыЭПДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтаФорма.ЭтоВО И Элементы.ДокументыЭПД.ТолькоПросмотр Тогда
		
		МодульКодаКлиент("ЭтотОбъект").ДокументыЭПДОткрыть(
			"ДокументыЭПДНаименование",
			"Документ владения",
			"ДокументТС",
			Элементы.ДокументыЭПД.ТолькоПросмотр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыЭПДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Копирование И Не ЭтаФорма.ЭтоВО Или Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МодульКодаКлиент("ЭтаФорма").СкопироватьСвязанныеДанныеДокументаЭПД(ЭтаФорма, Элемент.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыДокументыЭПД

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СтруктураТранспортногоСредства = Новый Структура();
	СтруктураТранспортногоСредства.Вставить("Вид",                  ЭтаФорма.Вид);
	СтруктураТранспортногоСредства.Вставить("РегистрационныйНомер", ЭтаФорма.РегистрационныйНомер);
	СтруктураТранспортногоСредства.Вставить("Тип",                  ЭтаФорма.Тип);
	СтруктураТранспортногоСредства.Вставить("Марка",                ЭтаФорма.Марка);
	СтруктураТранспортногоСредства.Вставить("Модель",               ЭтаФорма.Модель);
	СтруктураТранспортногоСредства.Вставить("ВИН",                  ЭтаФорма.ВИН);
	СтруктураТранспортногоСредства.Вставить("НомерСТС",             ЭтаФорма.НомерСТС);
	СтруктураТранспортногоСредства.Вставить("Грузоподъемность",     ЭтаФорма.Грузоподъемность);
	СтруктураТранспортногоСредства.Вставить("Вместимость",          ЭтаФорма.Вместимость);
	СтруктураТранспортногоСредства.Вставить("ТипВладения",          ЭтаФорма.ТипВладения);
	СтруктураТранспортногоСредства.Вставить("ИнвентарныйНомер",     ЭтаФорма.ИнвентарныйНомер);
	СтруктураТранспортногоСредства.Вставить("Идентификатор",        ЭтаФорма.Идентификатор);
	СтруктураТранспортногоСредства.Вставить("ЭтоВО",                ЭтаФорма.ЭтоВО);
	
	Если ЭтаФорма.ЭтоВО Тогда
		// Формируем сложную структуру по данным связанных таблиц
		ДанныеДокументов = МодульКодаКлиент("ЭтаФорма").СформироватьДокументыЭПД(ЭтаФорма.ДокументыЭПД, ЭтаФорма.ДанныеЮрЛиц);
	Иначе
		// простая структура со ссылками на справочник "документы эпд"
		ДанныеДокументов = ОснованияВладенияВСтроку(ЭтаФорма.ДокументыЭПД);
	КонецЕсли;
	
	СтруктураТранспортногоСредства.Вставить("ОснованияВладения", ДанныеДокументов);
	
	Закрыть(СтруктураТранспортногоСредства);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаОсновании(Команда)
	
	ОбновитьДанныеПоСсылке();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсеПоля(Команда)
	
	ОчиститьРеквизитыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРеквизитыФормы(РеквизитыИсключения = Неопределено)
	
	Если РеквизитыИсключения = Неопределено Тогда
		РеквизитыИсключения = Новый Массив();
	КонецЕсли;
	
	РеквизитыИсключения.Добавить("Вид");
	РеквизитыИсключения.Добавить("Объект");
	РеквизитыИсключения.Добавить("ЭтоВО");
	РеквизитыИсключения.Добавить("ДвоичныеДанныеОбработки");
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ОчиститьРеквизитыФормы(ЭтаФорма, РеквизитыИсключения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРегистрационномуНомеру(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.РегистрационныйНомер) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Нстр("ru = 'Необходимо заполнить Регистрационный номер!'");
		Сообщение.Поле = Элементы.РегистрационныйНомер.Имя;
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Элементы.ДекорацияЗагрузкаПоРегНомеру.Видимость = Истина;
	
	РеквизитыИсключения = Новый Массив;
	РеквизитыИсключения.Добавить("РегистрационныйНомер");
	РеквизитыИсключения.Добавить("ДвоичныеДанныеОбработки");
	
	ОчиститьРеквизитыФормы(РеквизитыИсключения);
	
	МодульТНОбщегоНазначенияКлиент = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент");
	ПараметрыКоманды = МодульТНОбщегоНазначенияКлиент.ВыполнитьКомандуСбис_ПараметрыКоманды();
	ПараметрыКоманды.ДвоичныеДанныеОбработки = ЭтаФорма.ДвоичныеДанныеОбработки;
	ПараметрыКоманды.НаКлиенте = ЭтаФорма.ЭтоВО;
	ПараметрыКоманды.Вставить("РегистрационныйНомер", ЭтаФорма.РегистрационныйНомер);
	МодульТНОбщегоНазначенияКлиент.ВыполнитьКомандуСбис(ЭтаФорма, "ЗагрузитьДанныеТСПоРегНомеру", , ПараметрыКоманды);	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеНаОсновании

&НаКлиенте
Процедура ОбновитьДанныеПоСсылке()
	Если Не ЗначениеЗаполнено(ЭтаФорма.ТранспортноеСредство) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ОбновитьДанныеТранспортногоСредстваЭПД();
	
	Если Результат.Ошибка Тогда	
		МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ОповеститьПользователяОРезультатах(
			ЭтаФорма, "ЗаполнитьИзINI", Результат);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // ЗаполнениеНаОсновании

&НаСервере
Процедура ЗаполнитьРеквизитыИзПараметров(ДанныеЗаполнения)
	
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ESD_ЗаполнитьРеквизитыФормы(ЭтаФорма, ДанныеЗаполнения);
	
	ЭтаФорма.ДвоичныеДанныеОбработки = ДанныеЗаполнения.ДвоичныеДанныеОбработки;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Вид) Тогда
		Если ДанныеЗаполнения.ЭтоПрицеп Тогда
			ЭтаФорма.Вид = ЗначениеМетаданных("ESD_ВидыТС.Прицеп");
		Иначе
			ЭтаФорма.Вид = ЗначениеМетаданных("ESD_ВидыТС.Автомобиль");
		КонецЕсли;
	КонецЕсли;
	
	ЗагрузитьДокументыЭПД(ДанныеЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеОснованийВладения()
	
	Элементы.ДокументыЭПД.Видимость = МодульКода("Перечисления.ESD_ТипыВладенияТС").ТребуетПодтвержденияВладения(
		ЭтаФорма.ТипВладения);
	
	Если Не Элементы.ДокументыЭПД.Видимость Тогда
		ЭтаФорма.ДокументыЭПД.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОснованияВладенияВСтроку(Знач ОснованияВладения)
	
	МассивОснований = Новый Массив;
	Для Каждого СтрокаОснованияВладения Из ОснованияВладения Цикл
		СтруктураДокументаЭПД = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураДокументаЭПД();
		ЗаполнитьЗначенияСвойств(СтруктураДокументаЭПД, СтрокаОснованияВладения);
		СтруктураДокументаЭПД.Ссылка = СтрокаОснованияВладения.ДокументВладения;
		МассивОснований.Добавить(СтруктураДокументаЭПД);
	КонецЦикла;
	
	Если МассивОснований.Количество() > 0 Тогда
		Возврат ЗначениеВСтрокуВнутр(МассивОснований);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОснованияВладенияИзСтроки(Знач ОснованияВладенияСтрокой)
	
	ДокументыЭПД.Очистить();
	
	Если Не ЗначениеЗаполнено(ОснованияВладенияСтрокой) Тогда
		Возврат;
	КонецЕсли;
	
	МассивОснований = ЗначениеИзСтрокиВнутр(ОснованияВладенияСтрокой);
	
	Для Каждого Основание Из МассивОснований Цикл
		Если Не ЗначениеЗаполнено(Основание) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДокументыЭПД.Добавить();
		НоваяСтрока.ДокументВладения = Основание.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьЭлементовФормы(ТолькоПросмотр)
	
	Элементы.ГруппаЗаполнениеНаОсновании.Видимость = Не ТолькоПросмотр;
	
	УбратьДоступность = Новый Массив;
	СкрытьВидимость   = Новый Массив;
	
	УбратьДоступность.Добавить("ФормаЗаписатьИЗакрыть");
	УбратьДоступность.Добавить("ФормаОчиститьВсеПоля");
	УбратьДоступность.Добавить("ЗаполнитьНаОсновании");
	УбратьДоступность.Добавить("ЗаполнитьПоРегистрационномуНомеру");
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", Не ТолькоПросмотр, УбратьДоступность);
	
	Если ЭтаФорма.ТипДокументаИсточника = ПутевойЛист() Тогда
		
		СкрытьВидимость.Добавить("ГруппаВИН");
		СкрытьВидимость.Добавить("НомерСТС");
		СкрытьВидимость.Добавить("Грузоподъемность");
		СкрытьВидимость.Добавить("Вместимость");
		СкрытьВидимость.Добавить("ТипВладения");
		СкрытьВидимость.Добавить("ДокументыЭПД");
		
		Если ЭтаФорма.Вид = ЗначениеМетаданных("ESD_ВидыТС.Прицеп") Тогда
			
			СкрытьВидимость.Добавить("Тип");
			СкрытьВидимость.Добавить("ИнвентарныйНомер");
			
		КонецЕсли;
		
	Иначе
		
		СкрытьВидимость.Добавить("ИнвентарныйНомер");
		СкрытьВидимость.Добавить("Модель");
		
	КонецЕсли;
	
	Если ЭтаФорма.ЭтоВО Тогда
		СкрытьВидимость.Добавить("ДокументыЭПДДокументВладения");
	Иначе
		СкрытьВидимость.Добавить("ДокументыЭПДНаименование");
	КонецЕсли;
	
	СкрытьВидимость.Добавить("ДекорацияЗагрузкаПоРегНомеру");
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "Видимость", Ложь, СкрытьВидимость);
	
	Если ТолькоПросмотр Тогда
		УстановитьТолькоПросмотр(ТолькоПросмотр);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТолькоПросмотр(ТолькоПросмотр)
	
	МассивЭлементов = Новый Массив;
	Для Каждого РеквизитФормы Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если ЭтаФорма.Элементы.Найти(РеквизитФормы.Имя) <> Неопределено Тогда
			МассивЭлементов.Добавить(РеквизитФормы.Имя);
		КонецЕсли;
	КонецЦикла;
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(
		ЭтаФорма, "ТолькоПросмотр", Истина, МассивЭлементов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыРеквизитов()
	
	МодульТНОбщегоНазначенияСервер = МодульКода("ESD_ТНОбщегоНазначенияСервер");
	
	ИмяТипаСтрока = "Строка";
	
	РазмерТипаСтрока = 32;
	ТипСтрока = Новый ОписаниеТипов(ИмяТипаСтрока, , Новый КвалификаторыСтроки(РазмерТипаСтрока));
	
	МассивТипов = Новый Массив;
	Если ЭтаФорма.ЭтоВО Тогда
		МассивТипов.Добавить(ИмяТипаСтрока);
	Иначе
		МассивТипов.Добавить("Перечисления." + ТипыВладенияТС());
	КонецЕсли;
	
	МодульТНОбщегоНазначенияСервер.УстановитьОграниченияТипов(Элементы.ТипВладения, МассивТипов, ТипСтрока);
	
	Если ЭтаФорма.ЭтоВО Тогда
		
		Элементы.ТипВладения.РежимВыбораИзСписка = Истина;
		Элементы.ТипВладения.КнопкаВыпадающегоСписка = Истина;
		Элементы.ТипВладения.СписокВыбора.Добавить("Собственность");
		Элементы.ТипВладения.СписокВыбора.Добавить("СовместнаяСобственностьСупругов", "Совместная собственность супругов");
		Элементы.ТипВладения.СписокВыбора.Добавить("Аренда");
		Элементы.ТипВладения.СписокВыбора.Добавить("Лизинг");
		Элементы.ТипВладения.СписокВыбора.Добавить("БезвозмездноеПользование", "Безвозмездное пользование");
		
	КонецЕсли;
	
	УстановитьТипыТранспортногоСредства();
	
	МассивТипов.Очистить();
	Если ЭтаФорма.ЭтоВО Тогда
		МассивТипов.Добавить(ИмяТипаСтрока);
	Иначе 
		МассивТипов.Добавить("Справочники." + ДокументыЭПД());
	КонецЕсли;
	
	МодульТНОбщегоНазначенияСервер.УстановитьОграниченияТипов(Элементы.ДокументыЭПДДокументВладения, МассивТипов);
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Тип", ЗначениеМетаданных("ESD_ТипыДокумента.ПодтверждениеВладения"));
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(ПараметрВыбора);
	ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	Элементы.ДокументыЭПДДокументВладения.ПараметрыВыбора = ПараметрыВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьФормуТС() Экспорт
	
	Если Не ЭтаФорма.ВводДоступен() Тогда
		ЭтаФорма.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗагрузкиДанныхТСПоРегНомеру(Результат) Экспорт
	
	Элементы.ДекорацияЗагрузкаПоРегНомеру.Видимость = Ложь;
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		
		Причина = ВыполнитьНаСервере("ESD_ТНОбщегоНазначенияСервер.ПричинаОшибкиИзЯдра", Результат);
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка заполнения данных по регистрационному номеру ТС! " + Причина;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	СТС = СокрЛП(Результат["RegCertNumber"]);
	СТС = СтрЗаменить(СТС, " ", ""); // убрать пробелы
	
	ЭтаФорма.Тип              = Результат["PassportTypeName"];
	ЭтаФорма.ВИН              = Результат["VIN"];
	ЭтаФорма.НомерСТС         = СТС;
	ЭтаФорма.Идентификатор    = Результат["UUID"];
	ЭтаФорма.ИнвентарныйНомер = Результат["GarageNumber"];
	
КонецПроцедуры

#Область include_etrn_base_CommonForm_ТранспортноеСредствоЭПД_ТипыТранспортногоСредства
#КонецОбласти // include_etrn_base_CommonForm_ТранспортноеСредствоЭПД_ТипыТранспортногоСредства

#Область include_etrn_base_CommonForm_ТранспортноеСредствоЭПД_СлужебныеПроцедурыИФункции
#КонецОбласти // include_etrn_base_CommonForm_ТранспортноеСредствоЭПД_СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
