
&НаКлиенте
Функция ОбновитьДанныеТранспортногоСредстваЭПД()
	Если ЗначениеЗаполнено(ЭтаФорма.ИмяИНИ) Тогда
		ПараметрыРасчета = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиентСервер").ПараметрыЗаполненияНаОснованииINI();
		ПараметрыРасчета.Вставить("ini_name",  ЭтаФорма.ИмяИНИ);
		ПараметрыРасчета.Вставить("Основание", ЭтаФорма.ТранспортноеСредство);
		
		РезультатРасчета = Неопределено;
		ТранспортВО = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").ТранспортВО(ЭтаФорма);
		РезультатРасчета = РезультатРасчетаINI(ПараметрыРасчета, ТранспортВО.ТранспортБлокли);
		
		Результат = ЗаполнитьДанныеТранспортногоСредстваЭПД_НаОснованииINI(ПараметрыРасчета, РезультатРасчета);
	Иначе
		Результат = ДанныеТранспортногоСредстваИзСправочникаНаСервере(ЭтаФорма.ТранспортноеСредство);
	КонецЕсли;

	Если Результат.Свойство("СтруктураТС") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Результат.СтруктураТС, , "Вид");
		ЗаполнитьОснованияВладенияИзСтроки(Результат.СтруктураТС.ОснованияВладения);
		
		ОбновитьОтображениеОснованийВладения();
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ДанныеТранспортногоСредстваИзСправочникаНаСервере(Знач ТранспортноеСредство)
	РезультатФункции = Новый Структура("Ошибка, ТекстСообщения", Ложь, "");
    
	СтруктураТС = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтруктураТранспортногоСредства();
    РезультатФункции.Вставить("СтруктураТС", СтруктураТС);

	МассивТС = Новый Массив;
	МассивТС.Добавить(ТранспортноеСредство);
	РеквизитыТС = МодульКода("ESD_ТНОбщегоНазначенияСервер").РеквизитыТранспортныхСредств(МассивТС);
	РеквизитыТС = РеквизитыТС[ТранспортноеСредство];
	Если РеквизитыТС <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(РезультатФункции.СтруктураТС, РеквизитыТС);
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеТранспортногоСредстваЭПД_НаОснованииINI(Знач ПараметрыРасчета, Знач РезультатРасчета = Неопределено)
	Если РезультатРасчета = Неопределено Тогда
		ОбъектОбработки = ОбъектОбработки();
		РезультатРасчета = МодульКода("ESD_ТНОбщегоНазначенияСервер").РезультатРасчетаINI(ПараметрыРасчета, ОбъектОбработки);
	КонецЕсли;
	
	Если РезультатРасчета.Результат.Ошибка Тогда	
		Возврат РезультатРасчета.Результат;	
	ИначеЕсли НЕ ЗначениеЗаполнено(РезультатРасчета.ДанныеИзИНИ) Тогда	
		РезультатРасчета.Результат.Ошибка          = Истина;
		РезультатРасчета.Результат.ТекстСообщения  = Нстр("ru = 'Не удалось получить данные с сервера.
			|Обратитесь к администратору системы'");	
	Иначе	
		ДляДокумента = Новый Структура;
		ДляДокумента.Вставить("ДокументыЭПД", Новый Массив);
		МодульКода("ESD_ТНЗагрузкаСервер").ДанныеТСПрицеповСпецРазрешений(
			ЭтаФорма, ДляДокумента, РезультатРасчета.ДанныеИзИНИ["ТранспортноеСредство"]);
		Если ЗначениеЗаполнено(ДляДокумента.ТранспортныеСредства) Тогда
			РезультатРасчета.Результат.Вставить("СтруктураТС", ДляДокумента.ТранспортныеСредства[0]);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат РезультатРасчета.Результат;
КонецФункции

