
&НаСервере
Процедура НастроитьДокументыЭПД()
	
	СкрытьВидимость = Новый Массив;
	СкрытьВидимость.Добавить("ДокументыЭПДТип");
	СкрытьВидимость.Добавить("ДокументыЭПДНаименование");
	СкрытьВидимость.Добавить("ДокументыЭПДНомер");
	СкрытьВидимость.Добавить("ДокументыЭПДДата");
	СкрытьВидимость.Добавить("ДокументыЭПДДопСведения");
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").ИзменитьСвойствоЭлементовФормы(ЭтаФорма, "Видимость", Ложь, СкрытьВидимость);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДокументыЭПД(ДанныеЗаполнения)
	Возврат;
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуДляСтарыхПлатформ()
	
	Возврат;
	
КонецПроцедуры

#Область include_etrn_base_CommonForm_ТранспортноеСредствоЭПД_ЗаполнениеНаОсновании
#КонецОбласти // include_etrn_base_CommonForm_ТранспортноеСредствоЭПД_ЗаполнениеНаОсновании

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере 
#КонецОбласти // includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область includr_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // includr_etrn_base_CommonModule_ЗначениеМетаданных

#Область includr_etrn_base_CommonModule_Метаданные
#КонецОбласти // includr_etrn_base_CommonModule_Метаданные

#Область includr_etrn_base_CommonModule_ОбъектОбработки
#КонецОбласти // includr_etrn_base_CommonModule_ОбъектОбработки

