
&НаСервере
Процедура НастроитьДокументыЭПД()
	СкрытьВидимость = Новый Массив;
	СкрытьВидимость.Добавить("ДокументыЭПДТип");
	СкрытьВидимость.Добавить("ДокументыЭПДНаименование");
	СкрытьВидимость.Добавить("ДокументыЭПДНомер");
	СкрытьВидимость.Добавить("ДокументыЭПДДата");
	СкрытьВидимость.Добавить("ДокументыЭПДДопСведения");
	
	МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер")
		.ИзменитьСвойствоЭлементовФормы(ЭтаФорма, "Видимость", Ложь, СкрытьВидимость);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДокументыЭПД(ДанныеЗаполнения)
	Возврат;
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуДляСтарыхПлатформ()
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыЭПД_ОбработатьВыбор(ТекущиеДанные, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ДокументыЭПДДокументВладения" И Элементы.ДокументыЭПД.ТолькоПросмотр Тогда
		СтандартнаяОбработка = Ложь;
		ДокументыЭПД_Открыть(ТекущиеДанные.ДокументВладения);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыЭПД_Открыть(ДокументЭПД)
	Если Не ЗначениеЗаполнено(ДокументЭПД) Тогда
		Возврат;
	КонецЕсли;

	#Если ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
	// BSLLS:UsingSynchronousCalls-off
	ОткрытьЗначение(ДокументЭПД);	
	// BSLLS:UsingSynchronousCalls-on
	#Иначе
	ПоказатьЗначение(, ДокументЭПД);
	#КонецЕсли
КонецПроцедуры

#Область include_etrn_base_CommonForm_ТранспортноеСредствоЭПД_ЗаполнениеНаОсновании
#КонецОбласти // include_etrn_base_CommonForm_ТранспортноеСредствоЭПД_ЗаполнениеНаОсновании

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКодаКлиент

#Область includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере 
#КонецОбласти // includr_etrn_base_CommonModule_ВыполнениеФункцииНаСервере

#Область includr_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // includr_etrn_base_CommonModule_ЗначениеМетаданных

#Область includr_etrn_base_CommonModule_Метаданные
#КонецОбласти // includr_etrn_base_CommonModule_Метаданные

#Область includr_etrn_base_CommonModule_ОбъектОбработки
#КонецОбласти // includr_etrn_base_CommonModule_ОбъектОбработки

