
Процедура ESD_ОбработкаПереходаНаНовуюВерсию()
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ПереходНаНовуюВерсию_ПеренестиЗначениеКонстанты_ВерсияНастроекСопоставлений();
	ПереходНаНовуюВерсию_ПеренестиЗначениеКонстанты_ХранитьСтатусыВДопСведениях();
КонецПроцедуры

Процедура ПереходНаНовуюВерсию_ПеренестиЗначениеКонстанты_ВерсияНастроекСопоставлений()
	Если Метаданные.Константы.Найти("ESD_ВерсияНастроекСопоставлений") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеНастройки_ = Обработки.ESD_ВерсииНастроекСопоставлений.СлужебныеНастройки_Загрузить();
	Если ЗначениеЗаполнено(ТекущиеНастройки_.НомерВерсии) Тогда
		Возврат;
	КонецЕсли;
		
	ТекущаяВерсия_ = Константы.ESD_ВерсияНастроекСопоставлений.Получить();
	Если ЗначениеЗаполнено(ТекущаяВерсия_) Тогда
		ТекущиеНастройки_.НомерВерсии = ТекущаяВерсия_;
		Обработки.ESD_ВерсииНастроекСопоставлений.СлужебныеНастройки_Записать(ТекущиеНастройки_);
	КонецЕсли;
КонецПроцедуры

Процедура ПереходНаНовуюВерсию_ПеренестиЗначениеКонстанты_ХранитьСтатусыВДопСведениях()
	Если Метаданные.Константы.Найти("ESD_ХранитьСтатусыВДопСведениях") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеЗначенияНастроек_ = СлужебныеНастройки_Загрузить();
	Если ТипЗнч(ТекущиеЗначенияНастроек_.ХранитьСтатусыВДополнительныхСведениях) = Тип("Булево") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеЗначенияНастроек_.ХранитьСтатусыВДополнительныхСведениях = 
		Константы.ESD_ХранитьСтатусыВДопСведениях.Получить();
	СлужебныеНастройки_Записать(ТекущиеЗначенияНастроек_);
КонецПроцедуры

