
// Получение параметров авторизации пользователя в сервисе Saby
//
// Возвращаемое значение:
//	Структура - параметры авторизациия пользователя
//
Функция ESD_ПараметрыАвторизацииПользователя() Экспорт
	Результат = Новый Структура("Подключение,Сессия");
	МодульКодаCore = МодульКода("ESD_Core");
	
	Результат.Подключение = МодульКодаCore.НастройкиПодключенияПрочитать();
	Если ЗначениеЗаполнено(Результат.Подключение) Тогда
		Результат.Сессия = МодульКодаCore.СтруктураСессии(Результат.Подключение);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Признак прохождения авторизации пользователя в сервисе Saby
//
// Параметры:
//	ПараметрыСессии - Структура - параметры сессии пользователя из настроек подключения
//
// Возвращаемое значение:
//	Булево - признак авторизации
Функция ESD_АвторизацияПройдена(Знач ПараметрыСессии) Экспорт
	Результат = Ложь;
	Если Не(ТипЗнч(ПараметрыСессии) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыСессии)) Тогда
		Возврат Результат;
	КонецЕсли;

	AccountId = Неопределено;
	Если ПараметрыСессии.Свойство("AccountId", AccountId) И ЗначениеЗаполнено(AccountId) Тогда
		Результат = Истина;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

