
// Формирование соответствия базовых параметров работы функционала
//
// Возвращаемое значение:
//	Соответствие - кешируемые/сохраняемые значения параметров
//
Функция НачальныеПараметрыРаботыФункционала()
	Параметры = Новый Соответствие;
	Параметры.Вставить("ЕстьДоступКФункционалуESD", Ложь);
	Параметры.Вставить("ЕстьДоступКЯдру", Ложь);
	Параметры.Вставить("ПройденаАвторизацияSaby", Ложь);
	Параметры.Вставить("ПройденаПервичнаяИнициализация", Ложь);
	Возврат Параметры;
КонецФункции

// Действия выполняемые при начале работы системы
//
// Параметры:
//	Кеш - Соответствие - кешируемые/сохраняемые значения для использования извне
//
Процедура ESD_ПриНачалеРаботыСервер(Кеш = Неопределено) Экспорт
	ESD_ПараметрыРаботыФункционала(Кеш);
	Если Не Кеш["ЕстьДоступКФункционалуESD"] Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ПриПервичнойИнициализации(Кеш);
	ПриАвторизацииПользователя(Кеш);
КонецПроцедуры

// Формирование соответствия базовых параметров при работе пользователя
//
// Параметры:
//	Параметры - Соответствие - объект значений параметров
//
// Возвращаемое значение:
//	Соответствие - кешируемые/сохраняемые значения параметров
//
Функция ESD_ПараметрыРаботыФункционала(Параметры = Неопределено) Экспорт
	Если Параметры = Неопределено Тогда
		// BSLLS:FunctionOutParameter-off
		Параметры = НачальныеПараметрыРаботыФункционала();
		// BSLLS:FunctionOutParameter-on
	КонецЕсли;
	
	// Основной параметр доступности функционала
	ФункционалДоступен = ESD_ЕстьДоступКФункционалу(); 
	Параметры.Вставить("ЕстьДоступКФункционалуESD", ФункционалДоступен);
	Если ФункционалДоступен <> Истина Тогда
		Возврат Параметры;			
	КонецЕсли;
	
	// Проверка доступности обработки "SABY"
	МетаданныеОбработки = Метаданные.Обработки.Найти("ESD_SABY");
	Параметры.Вставить("ЕстьДоступКЯдру", МетаданныеОбработки <> Неопределено И ПравоДоступа("Использование", МетаданныеОбработки));
	
	// Заполним параметры авторизации
	ESD_ПараметрыАвторизации(Параметры);
	
	Возврат Параметры;
КонецФункции

// Формирование и/или заполнение параметров авторизации
//
// Параметры:
//	Параметры - Соответствие - начальная коллекция параметров
//
// Возвращаемое значение:
// 	Соответствие - коллекция параметров, дополненная значениями авторизации
Функция ESD_ПараметрыАвторизации(Параметры = Неопределено) Экспорт
	Если Параметры = Неопределено Тогда
		// BSLLS:FunctionOutParameter-off
		Параметры = НачальныеПараметрыРаботыФункционала();
		// BSLLS:FunctionOutParameter-on	
	КонецЕсли;
	
	// Получаем параметры авторизации пользователя
	ПараметрыАвторизации = ESD_ПараметрыАвторизацииПользователя();
	// Записываем признак прохождения авторизации
	Параметры.Вставить("ПройденаАвторизацияSaby", ESD_АвторизацияПройдена(ПараметрыАвторизации.Сессия));
	
	// Проверка установленного значения константы
	Параметры.Вставить("ПройденаПервичнаяИнициализация", ЗначениеКонстанты("ESD_ПройденаПервичнаяИнициализация", Истина));
	
	// Если ранее была сделана авторизация, считаем что инициализация пройдена
	Если Не Параметры["ПройденаПервичнаяИнициализация"] И ПараметрыАвторизации.Подключение <> Неопределено Тогда
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
		УстановитьЗначениеКонстанты("ESD_ПройденаПервичнаяИнициализация", Истина);
		Параметры["ПройденаПервичнаяИнициализация"] = Истина;	
	КонецЕсли;
	
	Возврат Параметры;
КонецФункции

// Действия, разово выполняемые после прохождения первичной инициализации 
//
Процедура ESD_ПослеПервичнойИнициализации() Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	УстановитьЗначениеКонстанты("ESD_ПройденаПервичнаяИнициализация", Истина);
	ПослеПервичнойИнициализации_ВключитьФункционалПоУмолчанию();
	ПослеПервичнойИнициализации_ЗагрузитьНастройкиСопоставлений();
	
	Кеш = ESD_ПараметрыРаботыФункционала();
	ПриПервичнойИнициализации(Кеш);
КонецПроцедуры

// Действия, выполняемые после авторизации пользователя в Saby
//
// Параметры:
//	Кеш - Соответствие - см. функцию "ESD_ПараметрыРаботыФункционала"
//
Процедура ESD_ПослеАвторизацииПользователя(Кеш = Неопределено) Экспорт
	Если Кеш = Неопределено Тогда
		Кеш = ESD_ПараметрыРаботыФункционала(Кеш);
	КонецЕсли;
	
	Если Не Кеш["ПройденаАвторизацияSaby"] Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	// Выполним настройку функционала при авторизации пользователя
	ПриАвторизацииПользователя(Кеш);
КонецПроцедуры

// Получения признака доступности функционала расширения ESD 
//
// Возвращаемое значение:
//	Булево - признак доступности функционала расширения ESD
//
Функция ESD_ЕстьДоступКФункционалу() Экспорт
	РолиСтрока = "ESD_ОсновнаяРоль,ESD_СтандартныеПрава,ESD_ЭкспортныеКоманды";
	Возврат ESD_РолиДоступны(РолиСтрока, , Ложь);
КонецФункции

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_НастройкаФункционала_СлужебныйПрограммныйИнтерфейсПереопределяемый
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_НастройкаФункционала_СлужебныйПрограммныйИнтерфейсПереопределяемый

