
Процедура ПриПервичнойИнициализации(Кеш)
	Если Не Кеш["ПройденаПервичнаяИнициализация"] Тогда
		Возврат;
	КонецЕсли;
	
	ESD_ОбработкаПереходаНаНовуюВерсию();
	
	// Загрузим актуальные регламентные задания
	ЗагрузитьРегламентныеЗадания();
	// Проведем настройку функционала при первом запуске
	МодульКода("РегистрыСведений.ESD_НастройкаПравРасширения").ПриПервомЗапуске();
	// Обновим настройки до текущего релиза
	ОбновитьНастройкиДоТекущегоРелиза();
	
	// заполним настройки ядра	
	Если Кеш["ЕстьДоступКЯдру"] Тогда
		ОбъектОбработки = ОбъектОбработки();
		ОбъектОбработки.ПриНачалеРаботы();
	КонецЕсли;
КонецПроцедуры

Процедура ПриАвторизацииПользователя(Кеш)
	Если Не Кеш["ПройденаАвторизацияSaby"] Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим настройки подключения
	МодульКода("ESD_Core").ОбновитьНастройкиПодключенияПриНачалеРаботы();
	// Установим текущего авторизованного пользователя инициатором служебных рег. заданий
	ESD_РегламентныеЗаданияСлужебный.СлужебныеРегламентныеЗадания_УстановитьТекущегоПользователя();
КонецПроцедуры

Процедура ЗагрузитьРегламентныеЗадания()
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ESD_РегламентныеЗаданияСлужебный.ЗагрузитьРегламентныеЗадания(Истина);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ПослеПервичнойИнициализации_ВключитьФункционалПоУмолчанию()
	
КонецПроцедуры

Процедура ПослеПервичнойИнициализации_ЗагрузитьНастройкиСопоставлений()
	КонфигурацияНастроек = Справочники.ESD_НастройкиСопоставлений.ТекущаяКонфигурация();	
	Справочники.ESD_НастройкиСопоставлений.ЗагрузитьНастройкиКонфигурации(КонфигурацияНастроек);
КонецПроцедуры

#Область include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_НастройкаФункционала_ПереходНаНовуюВерсию
#КонецОбласти // include_etrn_base_CommonModule_ТНОбщегоНазначенияСервер_ДополнительныйФункционал_НастройкаФункционала_ПереходНаНовуюВерсию

