#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ЗначенияРезультата.Видимость = ЗначениеЗаполнено(ЭтаФорма.ЗначенияРезультата);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьЗначенияРезультатаОбъектаНаСервере(ТекущийОбъект.Результат.Получить());
	Элементы.ГруппаЛевая.ТолькоПросмотр = Истина;
	Элементы.Комментарий.ТолькоПросмотр = Истина;
	Элементы.ЗначенияРезультатаЗначение.ТолькоПросмотр = Истина;
	Элементы.ЗначенияРезультатаИмя.ТолькоПросмотр = Истина;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ЗначенияРезультатаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.Значение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗначенияРезультатаОбъектаНаСервере(ЗначенияРезультата)
	Если ЗначенияРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ЗначенияРезультата.Загрузить(ЗначенияРезультата);
КонецПроцедуры

#КонецОбласти
