
// Преобразует ставки НДС в число процентов для расчета суммы НДС
//
// Параметры:
//   Ставка - Строка - Ставка НДС как в документе.
//
// Возвращаемое значение:
//	Строка - представление данных строкой
//
//DynamicDirective
Функция СтавкиНДС_ПреобразоватьВЧисло(Ставка) Экспорт
	Результат = СтрЗаменить(Ставка, "%", "");
	Результат = СтрЗаменить(Результат, "без НДС", "0");
	Результат = СтрЗаменить(Результат, "НДС исчисляется налоговым агентом",	"0");
	Результат = СтрЗаменить(Результат, "5/105", 	"5"); 
	Результат = СтрЗаменить(Результат, "7/107", 	"7");
	Результат = СтрЗаменить(Результат, "10/110", 	"10");
	Результат = СтрЗаменить(Результат, "20/120", 	"20");
	Результат = СтрЗаменить(Результат, "22/122", 	"22");
	
	Возврат Результат;
КонецФункции 

Функция СтавкиНДС_Соответствие(Загрузка) Экспорт 
	РезультатФункции = Новый Соответствие;
	
	РезультатФункции.Вставить("1",  "0%");
	РезультатФункции.Вставить("2",  "5%");
	РезультатФункции.Вставить("3",  "7%");
	РезультатФункции.Вставить("4",  "9,09%");
	РезультатФункции.Вставить("5",  "10%");
	РезультатФункции.Вставить("6",  "16,67%");
	РезультатФункции.Вставить("7",  "18,03%");
	РезультатФункции.Вставить("8",  "20%");
	РезультатФункции.Вставить("9",  "22%");
	РезультатФункции.Вставить("10", "5/105");
	РезультатФункции.Вставить("11", "7/107");
	РезультатФункции.Вставить("12", "10/110");
	РезультатФункции.Вставить("13", "20/120");
	РезультатФункции.Вставить("14", "22/122");
	РезультатФункции.Вставить("15", "без НДС");
	РезультатФункции.Вставить("16", "НДС исчисляется налоговым агентом");
	
	Если Не Загрузка Тогда
		ПоЗначению_ = Новый Соответствие;
		Для Каждого КлючЗначение Из РезультатФункции Цикл
			ПоЗначению_.Вставить(КлючЗначение.Значение, КлючЗначение.Ключ);
		КонецЦикла;
		РезультатФункции = ПоЗначению_;
	КонецЕсли;

	Возврат РезультатФункции;
КонецФункции 

Функция СтавкиНДС_СписокВыбора() Экспорт
	СтавкиНДС_ = МодульКода("ESD_ТНОбщегоНазначенияКлиентСервер").СтавкиНДС_Соответствие(Истина);
	
	СортированныйСписокСтавок = Новый СписокЗначений;
	Для Каждого СтавкаНДС Из СтавкиНДС_ Цикл
		СортированныйСписокСтавок.Добавить(Число(СтавкаНДС.Ключ), СтавкаНДС.Значение);
	КонецЦикла;
	СортированныйСписокСтавок.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	Возврат СортированныйСписокСтавок;
КонецФункции

