
Процедура ДобавитьСсылочныеКолонкиТаблицыОпасныхГрузов(ТаблицаОпасныхГрузов)
	
	ОписаниеТипаСсылки         = Новый ОписаниеТипов("СправочникСсылка.Saby_ОпасныеГрузы");
	ОписаниеТипаКласса         = Новый ОписаниеТипов("ПеречислениеСсылка.Saby_КлассыОпасностиГрузов");
	ОписаниеТипаГруппыУпаковки = Новый ОписаниеТипов("ПеречислениеСсылка.Saby_ГруппыУпаковки");
	
	ТаблицаОпасныхГрузов.Колонки.Добавить("Ссылка",                 ОписаниеТипаСсылки);
	ТаблицаОпасныхГрузов.Колонки.Добавить("КлассСсылка",            ОписаниеТипаКласса);
	ТаблицаОпасныхГрузов.Колонки.Добавить("ГруппаУпаковкиЗначение", ОписаниеТипаГруппыУпаковки);
	
КонецПроцедуры

Процедура ПолучитьТаблицуСправочникОпасныхГрузов(МенеджерВременныхТаблиц)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	Saby_ОпасныеГрузы.Ссылка КАК Ссылка,
	|	Saby_ОпасныеГрузы.Наименование КАК Наименование,
	|	Saby_ОпасныеГрузы.ПолноеНаименование КАК ПолноеНаименование,
	|	Saby_ОпасныеГрузы.Идентификатор КАК Идентификатор,
	|	Saby_ОпасныеГрузы.ТехническоеНаименование КАК ТехническоеНаименование,
	|	Saby_ОпасныеГрузы.НомерООН КАК НомерООН,
	|	Saby_ОпасныеГрузы.Класс КАК Класс,
	|	Saby_ОпасныеГрузы.КлассификационныйКод КАК КлассификационныйКод,
	|	Saby_ОпасныеГрузы.ЗнакОпасности КАК ЗнакОпасности,
	|	Saby_ОпасныеГрузы.ГруппаУпаковки КАК ГруппаУпаковки,
	|	Saby_ОпасныеГрузы.ГруппаУпаковкиЗначение КАК ГруппаУпаковкиЗначение,
	|	Saby_ОпасныеГрузы.ТранспортныйИндекс КАК ТранспортныйИндекс
	|ПОМЕСТИТЬ СправочникОпасныхГрузов
	|ИЗ
	|	Справочник.Saby_ОпасныеГрузы КАК Saby_ОпасныеГрузы";
	
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

#Область include_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // include_etrn_base_CommonModule_ОпределениеМодуляКода

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

