
Процедура ДобавитьСсылочныеКолонкиТаблицыОпасныхГрузов(ТаблицаОпасныхГрузов)
	
	ОписаниеТипаСсылки         = Новый ОписаниеТипов("СправочникСсылка."   + ОпасныеГрузы());
	ОписаниеТипаГруппыУпаковки = Новый ОписаниеТипов("ПеречислениеСсылка." + ГруппыУпаковки());
	ОписаниеТипаКласс          = Новый ОписаниеТипов("ПеречислениеСсылка." + КлассыОпасностиГрузов());
	
	ТаблицаОпасныхГрузов.Колонки.Добавить("Ссылка",                 ОписаниеТипаСсылки);
	ТаблицаОпасныхГрузов.Колонки.Добавить("ГруппаУпаковкиЗначение", ОписаниеТипаГруппыУпаковки);
	ТаблицаОпасныхГрузов.Колонки.Добавить("Класс",                  ОписаниеТипаКласс);
	
КонецПроцедуры

Процедура ПолучитьТаблицуСправочникОпасныхГрузов(МенеджерВременныхТаблиц)
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ESD_ОпасныеГрузы.Ссылка КАК Ссылка,
	|	ESD_ОпасныеГрузы.Наименование КАК Наименование,
	|	ESD_ОпасныеГрузы.ПолноеНаименование КАК ПолноеНаименование,
	|	ESD_ОпасныеГрузы.Идентификатор КАК Идентификатор,
	|	ESD_ОпасныеГрузы.ТехническоеНаименование КАК ТехническоеНаименование,
	|	ESD_ОпасныеГрузы.НомерООН КАК НомерООН,
	|	ESD_ОпасныеГрузы.Класс КАК Класс,
	|	ESD_ОпасныеГрузы.КлассификационныйКод КАК КлассификационныйКод,
	|	ESD_ОпасныеГрузы.ЗнакОпасности КАК ЗнакОпасности,
	|	ESD_ОпасныеГрузы.ГруппаУпаковки КАК ГруппаУпаковки,
	|	ESD_ОпасныеГрузы.ГруппаУпаковкиЗначение КАК ГруппаУпаковкиЗначение,
	|	ESD_ОпасныеГрузы.ТранспортныйИндекс КАК ТранспортныйИндекс
	|ПОМЕСТИТЬ СправочникОпасныхГрузов
	|ИЗ
	|	Справочник.ESD_ОпасныеГрузы КАК ESD_ОпасныеГрузы";
	
	ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ESD_ОпасныеГрузы", ОпасныеГрузы());
	
	ЗапросДанных.Выполнить();
	
КонецПроцедуры

#Область includr_etrn_base_CommonModule_ОпределениеМодуляКода
#КонецОбласти // includr_etrn_base_CommonModule_ОпределениеМодуляКода

#Область includr_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // includr_etrn_base_CommonModule_ЗначениеМетаданных

#Область includr_etrn_base_CommonModule_Метаданные
#КонецОбласти // includr_etrn_base_CommonModule_Метаданные

