
&НаСервере
Процедура Подключаемый_ПриСозданииНаСервере()
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтраницыПриСменеСтраницы(ЭлементСтраниц, ТекущаяСтраница)
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриОткрытии()
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаОповещений_ОбновитьДокумент(Параметры)
	ЭтаФорма.ТаблицаОшибок.Очистить();
	ЭтаФорма.КоличествоОшибок = 0;
	ЭтаФорма.Ссылка = Параметры.Ссылка;
	ЭтаФорма.Ссылка.КоличествоОшибок = 0;
	ЭтаФорма.Ссылка.ТаблицаОшибок.Очистить();
	ЭтаФорма.Прочитать();
КонецПроцедуры

