
&НаКлиенте
Процедура ПутевыеЛистыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ПроверкаВозможностиВводаСтроки("Водители", Отказ);
	КопированиеСвязанныхДанныхДокументов(Копирование, Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПутевыеЛистыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	МодульКлиент = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент");
	
	Если Не Копирование Тогда
		ИмяТаблицы = "ДокументыЭПД";
		ПараметрыСвязи = МодульКлиент.ПараметрыКлючаСвязиСтрок(ИмяТаблицы, "Водители", Элемент.ТекущаяСтрока, НоваяСтрока);
		МодульКлиент.ДобавитьКлючСвязиСтроки(ЭтаФорма, ПараметрыСвязи);
	КонецЕсли;
	
	Если НоваяСтрока Тогда	
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекущиеДанные.Тип        = "ПутевойЛист";
		ТекущиеДанные.КлючСтроки = МодульКлиент.НовыйКлючСтроки(ЭтаФорма, "ДокументыЭПД");
		
		ПараметрыДокумента = МодульКодаКлиент("ЭтаФорма").ПараметрыДокументаЭПД("ПутевойЛист", "Путевой лист");
		
		ИндексЭПД = ЭтаФорма.ДокументыЭПД.Индекс(ТекущиеДанные);
		
		МодульКодаКлиент("ЭтаФорма").ОткрытьДокументЭПД(ПараметрыДокумента, Неопределено, ИндексЭПД);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутевыеЛистыПередУдалением(Элемент, Отказ)
	ЗапускУдаленияСвязанныхСтрок("ПутевыеЛисты", "ДокументыЭПД", Отказ)
КонецПроцедуры

&НаКлиенте
Процедура ПутевыеЛистыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПараметрыДокумента = МодульКодаКлиент("ЭтаФорма").ПараметрыДокументаЭПД("ПутевойЛист", "Путевой лист");
	ПараметрыДокумента.Вставить("ТолькоПросмотр", Элементы.Страница_Основное.ТолькоПросмотр);
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ИндексЭПД = ЭтаФорма.ДокументыЭПД.Индекс(ТекущиеДанные);
	
	МодульКодаКлиент("ЭтаФорма").ОткрытьДокументЭПД(ПараметрыДокумента, СтандартнаяОбработка, ИндексЭПД);
КонецПроцедуры

