
&НаКлиенте
Процедура СопроводительныеДокументыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда	
		ТекущиеДанные = Элементы.СопроводительныеДокументы.ТекущиеДанные;	
		ТекущиеДанные.ЭтоСопроводительныйДокумент = Истина;
		ТекущиеДанные.КлючСтроки = МодульКодаКлиент("ESD_ТНОбщегоНазначенияКлиент").НовыйКлючСтроки(ЭтаФорма, "ДокументыЭПД");	
	КонецЕсли;
		
	МодульКодаКлиент("ЭтаФорма").ДокументыЭПДОткрыть(
		Элемент.ТекущийЭлемент.Имя,
		"Сопроводительный документ",
		"СопроводительныйДокумент",
		Элементы.Страница_Груз.ТолькоПросмотр);
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныеДокументыНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	МодульКодаКлиент("ЭтаФорма").ДокументыЭПДОткрыть(
		Элемент.Имя,
		"Сопроводительный документ",
		"СопроводительныйДокумент",
		Элементы.Страница_Груз.ТолькоПросмотр);
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.Страница_Груз.ТолькоПросмотр Тогда
		МодульКодаКлиент("ЭтаФорма").ДокументыЭПДОткрыть(
			"СопроводительныеДокументыНаименование",
			"Сопроводительный документ",
			"СопроводительныйДокумент",
			Элементы.Страница_Груз.ТолькоПросмотр);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныеДокументыПередУдалением(Элемент, Отказ)
	ЗапускУдаленияСвязанныхСтрок("СопроводительныеДокументы", "ДокументыЭПД", Отказ);
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныеДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	КопированиеСвязанныхДанныхДокументов(Копирование, Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура КопированиеСвязанныхДанныхДокументов(Копирование, ТекущиеДанные)
	Если Не Копирование Или ТекущиеДанные = Неопределено Тогда
		Возврат;
    КонецЕсли;
	
	МодульКодаКлиент("ЭтаФорма").СкопироватьСвязанныеДанныеДокументаЭПД(ЭтаФорма, ТекущиеДанные);
КонецПроцедуры

