
#Область ПрограммныйИнтерфейс

// Возвращает соответствующее значение перечисления переданному коду.
//
// Параметры:
//  Код - Строка - строковый код значения. Данный код чаще всего передает онлайн.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.Saby_КлассыОпасностиГрузов - ссылка на перечисление.
//     Если по коду ссылка не найдена, то возвращается пустая ссылка.
//
Функция КлассОпасностиГрузаПоКоду(Код) Экспорт
	
	Если Код = "1" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс1");
	ИначеЕсли Код = "2" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс2");
	ИначеЕсли Код = "3" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс3");
	ИначеЕсли Код = "4.1" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс4_1");
	ИначеЕсли Код = "4.2" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс4_2");
	ИначеЕсли Код = "4.3" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс4_3");
	ИначеЕсли Код = "5.1" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс5_1");
	ИначеЕсли Код = "5.2" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс5_2");
	ИначеЕсли Код = "6.1" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс6_1");
	ИначеЕсли Код = "6.2" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс6_2");
	ИначеЕсли Код = "7" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс7");
	ИначеЕсли Код = "8" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс8");
	ИначеЕсли Код = "9" Тогда
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс9");
	Иначе
		Возврат ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

// Возвращает соответствующий код по указанному значению перечисления.
//
// Параметры:
//  Значение  - ПеречислениеСсылка.Saby_КлассыОпасностиГрузов - значение перечисления
//
// Возвращаемое значение:
//   Строка - Строковое представление кода.
//
Функция КодПоКлассуОпасностиГруза(Значение) Экспорт
	
	Если Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс1") Тогда
		Возврат "1";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс2") Тогда
		Возврат "2";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс3") Тогда
		Возврат "3";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс4_1") Тогда
		Возврат "4.1";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс4_2") Тогда
		Возврат "4.2";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс4_3") Тогда
		Возврат "4.3";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс5_1") Тогда
		Возврат "5.1";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс5_2") Тогда
		Возврат "5.2";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс6_1") Тогда
		Возврат "6.1";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс6_2") Тогда
		Возврат "6.2";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс7") Тогда
		Возврат "7";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс8") Тогда
		Возврат "8";
	ИначеЕсли Значение = ЗначениеМетаданных("Saby_КлассыОпасностиГрузов.Класс9") Тогда
		Возврат "9";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных

