
#Область ПрограммныйИнтерфейс

// Получает ссылку на перечисление по переданному имени.
//
// Параметры:
//  Имя - Строка - имя перечисления как оно задано в конфигураторе.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.Saby_Направление - найденное значение.
//       Если значение не удалось найти, то возвращается пустая ссылка.
//
Функция НаправлениеПоИмени(Имя) Экспорт
	
	Если Имя = "Исходящий" Тогда
		Возврат ЗначениеМетаданных("Saby_Направление.Исходящий");
	ИначеЕсли Имя = "Входящий" Тогда
		Возврат ЗначениеМетаданных("Saby_Направление.Входящий");
	Иначе
		Возврат ЗначениеМетаданных("Saby_Направление.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область include_etrn_base_CommonModule_ЗначениеМетаданных
#КонецОбласти // include_etrn_base_CommonModule_ЗначениеМетаданных
