#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ИмяОбъектаДействий = МодульКода("Справочники.АвтоматическиеСценарииДействия").ИмяОбъекта();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ESD_АктивностьИзменена" Тогда
		ПослеИзмененияАктивности();	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияКоманд

&НаКлиенте
Процедура ИзменитьАктивность(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИзменитьАктивностьНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	ПослеИзмененияАктивности();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ОткрытьФормуСпискаДействий(Команда)
	ОткрытьФорму("Справочник." + ЭтаФорма.ИмяОбъектаДействий + ".ФормаСписка"); 
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ФормаИзменитьАктивность_НастроитьПодВыбранныйЭлемент(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ФормаИзменитьАктивность_НастроитьПодВыбранныйЭлемент(ДанныеСтроки)
	СтруктураПроверки = Новый Структура("Активно");
	Если ДанныеСтроки <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПроверки, ДанныеСтроки);
	КонецЕсли;
	
	Если СтруктураПроверки.Активно = Неопределено Тогда
		Элементы.ФормаИзменитьАктивность.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаИзменитьАктивность.Видимость = Истина;	
	Если ДанныеСтроки.Активно Тогда
		Элементы.ФормаИзменитьАктивность.Заголовок = "Выключить";
		Элементы.ФормаИзменитьАктивность.Картинка = БиблиотекаКартинок.ESD_СостояниеЗавершеноОтрицательно;
	Иначе
		Элементы.ФормаИзменитьАктивность.Заголовок = "Включить";
		Элементы.ФормаИзменитьАктивность.Картинка = БиблиотекаКартинок.ESD_СостояниеЗавершеноПоложительно;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьАктивностьНаСервере(Знач СсылкаАС)
	Если Не ЗначениеЗаполнено(СсылкаАС) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектАС = СсылкаАС.ПолучитьОбъект(); 
	ОбъектАС.Активно = Не ОбъектАС.Активно;
	ОбъектАС.ДополнительныеСвойства.Вставить("ИзменениеАктивности", Истина);
	ОбъектАС.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияАктивности()
	Элементы.Список.Обновить();
	СписокПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область includr_etrn_base_Modules_АвтоматическиеСценарии_CommonModule_МодульКода
#КонецОбласти