
Функция ТекущаяПечатнаяФорма() Экспорт
	ТекущиеНастройки = ЗагрузитьНастройки();
	Если ТипЗнч(ТекущиеНастройки) <> Тип("Структура") Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Если ТекущиеНастройки.Свойство("ПечатнаяФорма") Тогда
		Возврат ТекущиеНастройки.ПечатнаяФорма;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#Область РаботаСХранилищемНастроек

Процедура СохранитьНастройки(СтруктураНастроек) Экспорт
	МодульКода("ESD_ТНОбщегоНазначенияСервер").ESD_СохранитьНастройкиОбъекта(КлючОбщихНастроек(), 
		СтруктураНастроек, , "", Истина); 	
КонецПроцедуры

Функция ЗагрузитьНастройки() Экспорт
	Возврат МодульКода("ESD_ТНОбщегоНазначенияСервер").ESD_ЗагрузитьНастройкиОбъекта(КлючОбщихНастроек(), , "");	
КонецФункции

#КонецОбласти

